[{"name":" Douse Mou Nigerarenai","avatar":"https://mangadex.org/covers/6f1ef076-5f01-4fe9-be9d-f47a43167551/497091b8-cd8d-4036-b5ec-51936d6d2098.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"I have always been trapped by you. I’m controlled by this emotion that I can’t fathom.\nInvited by a friend to a drinking party, Ryou reunites with Fujishiro, a man he’s hated since childhood. His ability to socialize with anyone remains unchanged. Remembering his irritation towards Fujishiro being liked by everyone surrounding him, he decides not to get involved, but…\nWhen they were left alone, Fujishiro poked at his true feelings saying “you hate me, don’t you?” And confessing he ‘likes’ Ryou, the only person who hates him. He pushed him down and came on to him.\nIs Fujishiro just playing with Ryou…?\nThe boundary of the ambiguous and impure love and hate."},{"name":" Shinigami Hime no Saikon","avatar":"https://mangadex.org/covers/6f21e01e-ceca-4799-9b7d-b370712102b8/6da38da0-1d30-49d1-955e-9aa2ff44e389.jpg.256.jpg","country":"Japanese","stat":"7.60","status":"Completed","tags":["Historical,Romance,Fantasy,Adaptation"],"nutshell":"Alicia Faitlin, daughter of an impoverished aristocratic family, was forced into an arranged marriage by her uncle, but the groom died suddenly in the middle of the ceremony.\nAlthough Alicia has been labeled \"The Princess of Death\" due to this incident, there's someone pursuing the matter of a second marriage with her. He is an upstart noble whose family was recently promoted to the ranks of the aristocracy, Kashburn Licen. This man is rumored to be a \"Tyrant\" but-?"},{"name":" Ramboo and Panboo","avatar":"https://mangadex.org/covers/6f2a2474-6b38-4e85-9efe-4a4a8ac50103/591a6c0e-8999-419d-83a3-19db34089252.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.76","status":"Ongoing","tags":["Animals,Long Strip,Comedy,Web Comic,Slice of Life,Full Color"],"nutshell":"The easy healing routine of the ramboo who is happy and the panboo who is worried~~\n(It's a cute manhua pls read it)"},{"name":" Tensei Oujo wa Kyou mo Hata wo Tatakioru","avatar":"https://mangadex.org/covers/6f3408d0-645d-4515-ade1-fccf4e2da04f/f941672f-12c0-4a8d-85b7-b845fc010b7d.png.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Reincarnation,Demons,Romance,Comedy,Reverse Harem,Adventure,Video Games,Magic,Isekai,Drama,Fantasy,Villainess,Slice of Life,Adaptation"],"nutshell":"I was reborn as a princess in the world of an otome game, with memories of my past life.\nWait, what? I'm the heroine's love rival? No way! I have zero intention of falling in love with any of those losers, because I've set my eye on a support character–the Commander of the Royal Knights!\nExcept the heroine–after being reincarnated in this shitty game where the support characters are way better than the love interests–is threatening to destroy my own life with flags, and I'm determined to strike them down!\n\nWho cares about being cute?! Rosemarie is a young girl who got reincarnated in the world of a dating sim. That game was famous for being a crappy game full of hopeless men! She has a bad feeling about it, but she has no time to waste getting upset about it! She's going to change the peculiar dateable character for the better and meet the man she really loves at all costs!\n\nOriginal Web Publication: Manga Format; Full-Colour, Long-Strip Format (Comico, Piccoma)\nOfficial Translations:\n\nEnglish\nFrench / Français: Piccoma, Pocket Comics\nGerman / Deutsch\nThai / ภาษาไทย"},{"name":" President Dad","avatar":"https://mangadex.org/covers/6f377198-1708-408f-bbf8-ca1caeec08ba/56905fc0-acfd-4330-83de-797ae5c5e29c.jpg.256.jpg","country":"Korean","stat":"8.00","status":"Completed","tags":["Genderswap,Comedy,Drama,Fantasy,Supernatural,Tragedy"],"nutshell":"When Ami Won’s mother was still alive, she always told her to grow up to be an exemplary woman. And the chance presents itself now that her dad has been elected President of Korea. Thus begins this klutzy girl’s transformation into the girl her mother had always hoped she’d become.\nHowever, in the spotlight and imbued with a kind of social power she never expected, Ami is now beset on all sides by the jealous and the dismayed. Her cousin Bi-Na leads this parade. Bi-Na considers herself naturally charismatic and infinitely more charming than Ami Won, so she feels she deserves the role as Korea’s First Lady."},{"name":" Ore to Atashi to Shinsekai","avatar":"https://mangadex.org/covers/6f37bd2e-4641-44d3-8215-6c2834eec076/76ee0199-397a-437f-a9c3-2fd04e4285de.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,Drama"],"nutshell":"One night, construction worker Makoto is dragged along to a gay bar after work and meets the effeminate bar worker, Shinobu. Shinobu, whose interests lie in foreign looking men, is immediately drawn to Makoto and thus a love and romance between these two polar opposites begin.\nOne day, Makoto comes to the bar dripping in blood…"},{"name":" Electric Bones","avatar":"https://mangadex.org/covers/6f3f33eb-4e2d-4639-917f-2a35aa0a5e9f/36e57f25-2807-4644-97f5-1c7a57ecb97e.png.256.jpg","country":"English","stat":"7.93","status":"Ongoing","tags":["Sci-Fi,Romance,Boys' Love,Web Comic,Full Color"],"nutshell":"Lucian has just been fired from his dream job. Irritated and aimless, he is invited by his friends to go on a cruise trip in deep space. Lucian plans on spending his time on board indulging in every illicit activity and substance in the galaxy, but his plans are cut short when he ends up crossing paths with a familiar face: A robot who has an uncanny resemblance to the co-worker who got Lucian fired.\nLinks:\nArtist's Twitter\nAuthor's Twitter\nOfficial Webtoon\nsupport them at Patreon"},{"name":" Your Romance","avatar":"https://mangadex.org/covers/6f4907be-a729-4121-a0ad-002bcb5e7d52/2cd9f879-7a0b-4854-90bb-64658e910316.jpg.256.jpg","country":"Korean","stat":"7.94","status":"Completed","tags":["Long Strip,Romance,Boys' Love,Drama,Web Comic,Full Color"],"nutshell":"As a closeted gay man, Gyulwoo is 28 and single. He has a decent job but he’s lacking in the love department, too terrified to come out and ruin his career or reputation. Ready to live the rest of his life hiding his feelings, Gyulwoo is shocked when Hojun, his old friend from high school, appears. In the past, Hojun had revealed he loved Gyulwoo but Gyulwoo wasn’t ready to accept his love. Decades later, will Gyulwoo keep their romance secret or will he finally share his heart with Hojun and the world?\n\nR15 version:\n\nOfficial English Translation\nOfficial Japanese Translation\n\n\n\nOriginal Webtoon <RidiBooks>\nOriginal Webtoon <Naver>\nOriginal Webtoon <Anytoon>\nOriginal Webtoon <kakao>\n\nR19 version:\n\nOriginal Webtoon <Mr.Blue>\nOriginal Webtoon <Lezhin>\nOriginal Webtoon <RidiBooks>\nOriginal Webtoon <Naver>\nOriginal Webtoon <Bomtoon>\nOriginal Webtoon <Comico>\nOriginal Webtoon <Peanutoon>\nOriginal Webtoon <BookCube>\nOriginal Webtoon <Anytoon>"},{"name":" Sundere!","avatar":"https://mangadex.org/covers/6f495fcf-9c03-4091-88cf-942749bc9178/dc5a8f58-1973-4a4e-93d7-c61593a47c14.jpg.256.jpg","country":"Japanese","stat":"6.92","status":"Completed","tags":["Comedy,Harem,School Life"],"nutshell":"Delinquent guy goes to ex-all-girls school and becomes a sex toy for a rich princess."},{"name":" Taimashin: Akamushi Masatsukou","avatar":"https://mangadex.org/covers/6f4c8989-37e7-478d-a9fc-523bb994e2bb/dee6bdf8-7293-4b82-936b-e4786afc442e.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":"Traveling in-between the world of the living and the twilight world of the dead, Akamushi, the shaman, priest, demon-hunter, or specifically, the Red Spider Exorcist, is one that’ll never refuse a request for help from lost souls falling prey to evil spirits and demons of the underworld. With the strength and regeneration powers of a giant spider, and the ability to command his swarm of arachnids to his will, he combats the malevolent supernatural and is a force to be reckoned with.\nWhen career woman Megumi is suddenly pursued and attacked by the unholy demons of the afterlife, she seeks the help from the phlegmatic shaman to eradicate the infestation of unholy beasts seeking to take her soul and turn her into a vindictive minion. But as it seems, these demons are more than persistent—everywhere Megumi tries to hide, they follow. With Megumi’s cry for help, is this more than what Akamushi can handle—as he too collapses to the will of their malicious powers?\nBut why are these creatures of twilight after her? What does she know, or doesn’t know, that’ll unravel the truths about her true self and everyone around her? And what of Akamushi—can he use his unique shamanic spider-like powers to cast out and purify himself from the demon scourge?"},{"name":" Tales of Seol Gongchan","avatar":"https://mangadex.org/covers/6f5086d1-1654-4cd4-8446-10d21d549f3b/e89d5dc8-20a2-4384-a30a-a1c8a75df44a.png.256.jpg","country":"Korean","stat":"7.96","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Drama,Web Comic,Supernatural,Full Color"],"nutshell":"This is the mysterious romance between horror novelist Seol Gongchan and his downstairs' neighbor."},{"name":" Touhou - Satoei Complex (Doujinshi)","avatar":"https://mangadex.org/covers/6f5516df-058e-4198-bdb3-12ae58e69ce5/47530b7b-e61e-4331-bb95-91a8f49962d5.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Oneshot"],"nutshell":""},{"name":" Nina Jalhae!","avatar":"https://mangadex.org/covers/6f563f31-5336-422d-ade8-5bb458b454e5/3a312094-9448-4ed1-9bd7-c3c4775d9aa3.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Action,Romance,Comedy,School Life"],"nutshell":"Choi \"Rotten Tooth\" Choong Chi just wants to be left alone so that he can study like his mommy told him too. His life-long ambition is to be ranked first academically in school. Unfortunately for him, he's also a brilliant fighter, coveted (or targeted) by every gang that crosses his path.\nAfter transferring to the prestigious Yong Yong High School from the delinquent-ridden 88 Academy, Rotten Tooth also makes a new discovery: girls, and to top it all off, the prettiest and smartest girl in the school, Yeon Doo. Too bad his main rival Jang Bogo is also after the same girl.\nCan our hero get the girl? Can he even survive high school with his life and limbs intact?"},{"name":" Boarding House of Hunks","avatar":"https://mangadex.org/covers/6f58aa9d-3a8f-439d-86c0-0d22d7db44b8/3fc8ed11-f3c4-4e1b-9ce8-3b3c9c4ffd17.jpg.256.jpg","country":"Korean","stat":"8.04","status":"Completed","tags":["Romance,Comedy,Harem,School Life"],"nutshell":"Boy-crazy Jae Yoo is willing to go through any underhanded means if it means living in the boarding house full of hot guys… Even if it’s going out on a blind date with the dorkiest boy in the school. When she dumps the guy immediately after, she pisses off his handsome best friend Ji Hu and from that point on, the two are constantly going at each other’s throats like cats and dogs. When Jae Yoo finally accomplishes her dream of entering the “boarding house of hunks,” she thinks that nothing could go wrong. An amazing house, a kind landlady, and even a cute guy who seems to be interested in her… What’s this?! Ji Hu is the landlady’s son?! And how is it that he knows about Jae Yoo’s most embarrassing moment in life? What kind of life will the two lead under the same roof? Will they be able to live together at all?!"},{"name":" The Star of the Sea - I'm Clever!","avatar":"https://mangadex.org/covers/6f5a0267-56eb-458d-9daf-f3315af47dae/7d6a92c6-39f9-496b-b330-cc1628600096.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.78","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Comedy,Adventure,Fantasy,Web Comic,Slice of Life,Full Color"],"nutshell":"\"You just use your mind to play games for learning.\" When this golden sentence used by parents all over the world to teach children became a reality to Rue Shane, a prodigy in a computer games was at the top of his gaming life suddenly struck by will to learn.. to learn it all! His enthusiasm on games was converted with an obsession to learn and study. A super learner who was extremely eager for knowledge to become stronger was born.\n“Do not love beautiful people, love learning. Don't play games, just brush questions! I love learning, learning makes me happy!” Rue says.. and his Adventure begins!"},{"name":" Doll & I","avatar":"https://mangadex.org/covers/6f5a2f93-f2bf-4f35-bb18-526c339dcc3d/ebd47973-5685-4957-ad70-011abb6f4780.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Long Strip,Drama,Web Comic,Music,Full Color"],"nutshell":"The girl group, 'Lily', who was selected by the Global Idol audition, fell into despair due to a voting manipulation scandal right before its debut. Cha Yoo-joo, Korea's best entertainment representative, who \"planned\" this, was framed and betrayed by her husband before bring sentenced to life in prison. Eunha-rin is a visual center and former gangster, who she met during her time in prison. Cha Yoo-joo thus convinces her and once again, makes her debut with Lily."},{"name":" Lady Mars","avatar":"https://mangadex.org/covers/6f5eb539-061c-4b13-af2b-e40fe221a23d/628ef7fd-189b-4ff7-b51d-edd459a99810.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Sci-Fi,Historical,Action,Psychological,Anthology,Survival,Adventure,Post-Apocalyptic,Military,Drama,Aliens,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nOn a devastated Earth, Fantom Moly, on his way to rescue his crash-landed friends, sees...\n\"The 3rd era of Zethrus. Xeno is a lone sniper with the fate of the solar system on his shoulders. While waiting for the enemy, who may come at any moment, he dreams of a Japanese sniper fighting alone and helpless.\nOn a dimly lit battlefield, men and women put their respective pride on the line and try to survive..."},{"name":" Zero Hunting","avatar":"https://mangadex.org/covers/6f68b525-7a26-414d-afdd-b28ea45aeb69/81d53354-36c8-443a-b6ae-0f7cabdc9c2d.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.82","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Magic,Vampires,Web Comic,Mystery,Full Color"],"nutshell":"A submissive, quick-tempered hunter and a sly, dominant vampire! The genius hunter, Bai Mu, a little-known celebrity, accidentally got captured. He soon realized the one who captured him was a young vampire, who also turned out to be his childhood best friend. Since then, he was unable to escape, nor hide away, since all the possessive vampire wanted was to make Bai Mu his. “Mu, I’ll give everything I have, just to make you mine again.”"},{"name":" Suna no Rasen","avatar":"https://mangadex.org/covers/6f6a8296-e324-4e6c-ba1d-2eb876efad8e/85e809c4-4794-4451-a5ed-08f001f410f1.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"Haruka is in love with his best-friend Ryou who marries his sister. The day of the marriage he drinks too much and ends up staying in one of the room of the hotel where the receivement is done. In the night he is attacked and raped by someone who claims to hate him and that he'll never forgive him. Few days later at work he meets a new colleague and soon recognize in him his attacker. What is he doing here? What does he wants from him?"},{"name":" Gekka Mugentan - Kaminashi Yoru no Otogibanashi","avatar":"https://mangadex.org/covers/6f6aa8d9-3f0c-435f-9405-ad90d75cb80d/d75263cc-607f-48c8-9c41-771a38f56eea.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Romance,Supernatural"],"nutshell":"Ever since the school entrance ceremony, Sayako, a high school student, has been wary of her classmate Rou who is in the same committee. However, Rou harbors the secret of his true identity. Sayako's body began to change, and she realizes that her peaceful days are over. As the gears quietly turn, the frightening door of fate opens!"},{"name":" Love Live! - cat's picking supposed  (Doujinshi)","avatar":"https://mangadex.org/covers/6f767d97-63a9-4bf3-b1f0-9c016bc1009d/9fcc5a35-0734-435a-8a09-993f03551d5e.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":[""],"nutshell":""},{"name":" Watashi ga Motenai no wa Dou Kangaetemo Omaera ga Warui! - Since I'm Not Popular, I'll Become a Hero (Doujinshi)","avatar":"https://mangadex.org/covers/6f76b81c-011f-42a3-a228-8f1c57784527/f5e81f5d-3637-4ae1-a2b8-e554d006f6b3.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Crime,Superhero,Slice of Life"],"nutshell":""},{"name":" Boku no Hero Academia (Fan Colored)","avatar":"https://mangadex.org/covers/6f79c90d-fa6d-4783-aba3-38144f951fa9/be81d190-e077-4f30-ad97-8151773af690.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Monsters,Action,Comedy,Superhero,Martial Arts,Fan Colored,Drama,School Life,Monster Girls"],"nutshell":"One day, a four-year-old boy came to a sudden realization: the world is not fair. Eighty percent of the world's population wield special abilities, known as \"quirks,\" which have given many the power to make their childhood dreams of becoming a superhero a reality. Unfortunately, Izuku Midoriya was one of the few born without a quirk, suffering from discrimination because of it. Yet, he refuses to give up on his dream of becoming a hero; determined to do the impossible, Izuku sets his sights on the elite hero training academy, UA High.\nHowever, everything changes after a chance meeting with the number one hero and Izuku's idol, All Might. Discovering that his dream is not a dead end, the powerless boy undergoes special training, working harder than ever before. Eventually, this leads to him inheriting All Might's power, and with his newfound abilities, gets into his school of choice, beginning his grueling journey to become the successor of the best hero on the planet."},{"name":" Endless Rebirth","avatar":"https://mangadex.org/covers/6f7b211d-6929-402d-af77-4ebc264ac4c6/4d721bbf-7553-40eb-a0e9-721ea7c9f091.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.07","status":"Ongoing","tags":["Romance,Drama,Fantasy"],"nutshell":"After a few rounds of reincarnation, she is now the daughter of a rich and influential family, yet she cannot have peace. She even met a guy that claims to be the “same kind” as her. Aside from her there are others who reincarnate in the world? -Come with me -To where? -Seek our origin? You think this about reincarnation and revenge? No this is a story about finding the meaning of life and eternal existence (Ohh… fine, it's actually a story about a bunch of old dudes who mess around)"},{"name":" Revenge H","avatar":"https://mangadex.org/covers/6f83332f-8caf-4261-ad96-3ab61cface74/668ec278-4bc1-4574-abd8-5cbbfc490e60.png.256.jpg","country":"Japanese","stat":"8.01","status":"Ongoing","tags":["Psychological,Girls' Love,Drama"],"nutshell":"Young woman decides to take revenge on the former schoolmates by destroying their lives. Her plan on how to do that involves sleeping with multiple girls and boys, among other things.\nBy a seasoned female author who's been in the business since 1996."},{"name":" Wonder Honey","avatar":"https://mangadex.org/covers/6f87bf86-41a7-45b2-a347-3880e60cc8f8/a0f3b5c2-f450-4b15-b9aa-5e4e8dce37d8.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Comedy,Slice of Life,Supernatural"],"nutshell":"The story is about a single father who is raising his only daughter, Akari. He is keeping a big secret that he doesn't want to reveal to his daughter, is it related to Akari's mother?"},{"name":" Kouhaku Kokushoku","avatar":"https://mangadex.org/covers/6f883cbc-a1f2-41c5-8b04-aedd37fb901f/e9880b0d-d69e-469a-9125-cb4f98f47a69.jpg.256.jpg","country":"Japanese","stat":"7.50","status":"Completed","tags":["Oneshot,Genderswap,Comedy"],"nutshell":"I received a help message from Benishiro, when I arrived I found him…\nNotes: Names will differ from original"},{"name":" The Universal Travels of the Prophet Geremias","avatar":"https://mangadex.org/covers/6f8855ea-61f4-4da8-9a76-046c536fcf72/635acd81-f6bd-4386-9b76-54b50d8ab432.png.256.jpg","country":"English","stat":"7.62","status":"Ongoing","tags":["Monsters,Action,Demons,Comedy,Adventure,Magic,Fantasy,Web Comic"],"nutshell":"[ENG] Geremias, self-titled Prophet is a genius of the sciences, whether human or exact, besides philosopher and sociologist still hold professions as mathematician, glass cleaner and cook, one day while doing his needs, decides to create the \"A-Universal Machine\" \"to travel between universes, but … he has not tested it!\n[PT-BR] Geremias, autointitulado Profeta é um gênio das ciências, seja ela humana ou exata, alem de filosofo e sociólogo ainda detêm profissões como matemático, limpador de vidros e cozinheiro, certo dia, enquanto estava fazendo suas necessidades, resolve criar a \"Maquina A-Universal\" para viajar entre universos, mas… ele não á testou!"},{"name":" Superintendent Akechi's Pretty Case Files","avatar":"https://mangadex.org/covers/6f8c9359-b282-45ad-9c98-48b43b01caf6/5668a6ee-2faf-4b7b-982a-5970938c6793.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Crime,Drama,Mystery,Tragedy"],"nutshell":"Side story of the Young Kindaichi Case Files. The cases in this series are:\n\n\"File 1 Testimony Puzzle/Alternative title: The Murder Train\" (FILE1 証言パズル, \"Fairu Ichi Shōgen Pazuru\"?)\n\"File 2 Killing Poker/Alternative title: Unlucky Men in the Rain\" (FILE2　殺人ポーカー, \"Fairu Ni Satsujin Pōkā\"?)\n\"File 3 Dead Person's Checkmate/Alternative title: The Great Chess Player, Akechi\" (FILE3 死者のチェックメイト, \"Fairu San Shisha no Chekkumeito\"?)\n\"File 4 Ghost Hotel Murder Case/Alternative title: The Encounter\" (FILE 4 幽霊ホテル殺人事件, \"Fairu Yon Yūrei Hoteru Satsujin Jiken\"?)\n\"Special Story Supt.Akechi Morning's Pretty Scenery\" (スペシャルストーリー明智警視　優雅なる朝の風景, \"Supesharu Sutōrī Akechi Keishi Yūga Naru Asa no Fūkei\"?)"},{"name":" Sora-sama Wants to be Satisfied!","avatar":"https://mangadex.org/covers/6f8cace1-fa23-4f97-9915-85a2f096b1e2/eec34421-3246-42a8-9b30-6e45d2ed51e1.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Ongoing","tags":["Sci-Fi,Animals,Comedy,Harem,School Life,Slice of Life,Aliens"],"nutshell":"Hoshi Hoshino, a male high school student who lives leisurely in the countryside, has a unique power—that is, being able to get along with any animal! Although Hoshi spends his days feeling supreme joy in interacting with animals, on the other hand, he also has a great dislike of humans. Kirari Yozora, a childhood friend who struggles with her extreme personality, suddenly thinks one day. ──What would Hoshi think if there were animals like humans?\nAt that time, a mysterious object comes flying with a roaring sound. Appearing from the other side of the dust cloud is the most terrifying and worst visitor with cute fur ears and a tail. A genius tamer VS greedy kemomimi unfolds in this relaxing erotic comedy!"},{"name":" Motohashi Kyoudai","avatar":"https://mangadex.org/covers/6f8e3bf7-d3aa-4b5d-9b82-cd2775602d76/f84ed8fc-e05e-475b-b470-9c5f2b467b8e.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Comedy,Web Comic,Slice of Life"],"nutshell":""},{"name":" Dormant Desires","avatar":"https://mangadex.org/covers/6f9ced73-2058-4022-8316-58fa56592f83/c036b3c6-7888-4d2a-811e-fd762dd5e273.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.62","status":"Completed","tags":["Long Strip,Romance,Girls' Love,Drama"],"nutshell":"A recurring dreams prelude to a destined encounter. A police officer Lou Ji has a hidden secretive BDSM sexual fantasy with some woman in her dreams….only if this would become a reality. Lou Ji finally met the girl from her dream at the police station. What will become of it?"}]