[{"name":" Ratakia no Majo","avatar":"https://mangadex.org/covers/74d3cfa8-b891-4d11-9a56-0796da8f30d0/f19dad7c-c35d-4631-8a19-0865483f92be.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Sci-Fi,Fantasy,Supernatural"],"nutshell":"A collection of widely varied short stories with tongue-in-cheek humor and irreverent social commentary.\nStory 1, A Lad's Christmas: A jaded Santa has to get through a particularly rough Christmas.\nStory 2, Travel Writer: A young couple on their first trip break rule number one: Never leave the tourist route.\nStory 3, TUDM.\nStory 4, Space War: A young platoon captain fighting on a distant planet has to keep her troops together in the face of unexpected alien developments.\nStory 5, Slavakia: A lonely woman meets someone new on a desert planet.\nStory 6, Greedy City and Konjac Rock: A backpacking kid comes across an easy way to get money.\nStory 7, Latakia the Witch: A boy winds up as a helper to a “witch”."},{"name":" Gakkou Youkai Kikou: You","avatar":"https://mangadex.org/covers/74dc13ca-e270-4339-a156-8842f9721894/24d4169a-cd5f-4ab8-96ea-26ba8957f987.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Oneshot,School Life,Supernatural,Mystery"],"nutshell":"The girl was like a jewel, like a doll. The eyes that seemed to see through everything, watching me. That girl was shining too brightly to be seen. Like something that doesn't belong in this world. This legend is a legend sealed within this \"school.\""},{"name":" Lock On!","avatar":"https://mangadex.org/covers/74dfbe87-ef41-4474-bb02-c18510c5d0a4/d5ff431b-bd40-4e82-82ff-517fe57d604c.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Action,Romance,Comedy,Martial Arts,School Life"],"nutshell":"Utsuru Sanada is a professional photographer at the age of 17, he can guess the exact 3 sizes of any girl, he can memorize anything he sees, and he can counterattack karate moves (most guys would want these abilities). Why? Because he has superb photographic memory called “Shutter Eye” (as in the shutter of a camera). He meets Niko Kurihara, the female protagonist, who dislikes men, is a master of martial arts, and is of course beautiful. Utsuru attempts to prove to Niko that he is not the guy she thinks he is so that he can take a picture of her. He starts by investigating Niko’s friend’s date, who appears to be a deceptive guy according to rumors…\nRan as a one-shot in 2009; started serialization in 2010."},{"name":" I Failed to Divorce My Husband (Promo)","avatar":"https://mangadex.org/covers/74e0feac-61f4-495b-8bd1-36fc5f2151d0/506a57ae-12c2-4f3b-8713-51d0292f0a38.jpg.256.jpg","country":"Korean","stat":"8.14","status":"Completed","tags":["Oneshot,Reincarnation,Historical,Long Strip,Romance,Comedy,Isekai,Fantasy,Villainess,Adaptation,Full Color"],"nutshell":"I've been reincarnated as the extra character who stalked her husband, the male lead, for 10 years and died. Of course, I tried to divorce him before the female lead appeared.\nBut, I found out that my young husband's household was secretly abusing him. At that moment, I immediately became overwhelmed with the responsibility and sense of duty a modern adult would have.\n\nAiden had his back turned away from her and suddenly grabbed her arm forcefully. The strength of his hands alone could have ripped her arms off. Erin timidly called his name and spoke.\n\"I already reminded you yesterday. We're a married couple, so I'm always on your side.\"\n\"...\"\n\"So, everything is alright.\"\nShe comforted him with these sweet words like it was a spell. And as if he was under her magic, Aiden stopped trembling.\n\nThe adult Erin requested to divorce her husband Aiden before the female lead appeared. As soon as those words left her lips, Aiden's smile disappeared.\n\"A divorce? Never.\"\nAiden tore the divorce papers into such thin sheets, the contents were no longer legible. Erin smiled at the sight."},{"name":" Hatsukoi Dance!","avatar":"https://mangadex.org/covers/74e44c42-2a0d-4654-a149-312d8af244e1/dadc85fc-81bc-4ce1-9f9e-cc805bc57b4d.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Ongoing","tags":["Romance,Sports,Slice of Life"],"nutshell":"A miraculous love story about the full bloom of adolescence!\n¡Una milagrosa historia de amor sobre la plena floración de la adolescencia!"},{"name":" Fuck Night Reversal","avatar":"https://mangadex.org/covers/74e8d701-bf76-4608-a852-935c3ea4c193/e85659ff-f64b-47f3-a6f0-e5fce163b978.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Boys' Love"],"nutshell":"【Pheromonal Older Yakuza × Beautiful Gambler】\n“I know many things about you, beside your name.”\nThe one who suddenly appeared in front of Aoba, who lost his job and earned money everyday through illegal gambling, was the owner of the casino behind the scenes and yakuza, Dangami!\nAlthough I know it's dangerous, I can't resist it… I’m attracted to the adult man’s sly invitation and his melting kiss.\nHowever, when I’m on stage, I get lucky!\nThe Aoba that I noticed, while being tossed about, let his beauty and talent bloom indecently…?!"},{"name":" Minna! Esper Dayo!","avatar":"https://mangadex.org/covers/74eb7e59-4ede-4b3e-8a7e-083d0d358329/13ddc295-f258-4ab0-a8c5-30264ba45166.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Comedy,School Life,Supernatural"],"nutshell":"The psychic comedy follows an ordinary (virgin) high school boy named Yoshirō \"Yocchan\" Kamogawa. His life changes overnight when he wakes up with the ability to read other people's minds. Yoshirō is not the only one to gain powers in his town. Teru-oichan, an (apparently virgin) worker at a café near Yoshirō's school, gains telekinesis — but he uses it for sex toys. Yōsuke Enomoto, a (probably virgin) senior and former basketball player at Yoshirō's high school, gains teleportation — but only while naked.\n[Source: ANN]"},{"name":" Fuhoni!","avatar":"https://mangadex.org/covers/74ec2b51-cba7-4a3c-ae1b-92e7a7dba252/2c6a9f35-8bca-41b6-a37e-c297c26f44a9.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"Hikawa Chihiro had always been a flirt until he met his match, Jyounouchi Haruhisa. As the older of the two, he wanted to change the fact that he was the one being held. While experiencing internal conflict, the appearance of a new younger rival, Koide, made Hikawa realize he had to be honest with himself – or risk losing Jyounouchi. What will he do?"},{"name":" YuruYuri - Anata no Soba ni Itai no (Doujinshi)","avatar":"https://mangadex.org/covers/74f02c45-c215-4430-a5d3-200e0d33b6a5/baf6cc2a-b076-4e8b-a18f-03fa45d2e0d5.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Comedy,Girls' Love,Slice of Life"],"nutshell":""},{"name":" Slayers - The Road of the Ring","avatar":"https://mangadex.org/covers/74f09180-ea04-4738-a7a8-f6e7c8c45f60/797f8a7a-9bce-4c50-9dbd-7af31a760bed.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Monsters,Comedy,Adventure,Magic,Fantasy,Supernatural"],"nutshell":"Absolutely no relation to the Tolkien franchise.\nNope. None at all. Just your imagination…"},{"name":" Kantai Collection -KanColle- Obedient Prinz Eugen Sauce (Doujinshi)","avatar":"https://mangadex.org/covers/74f6f385-4d69-416b-9f91-fc0f2caa49b5/5a18dbb2-9cc2-43a4-baec-586c0ef07e54.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Cooking"],"nutshell":"Comedy Doujinshi on Prinz Eugen's hilarious cooking experience."},{"name":" The Strongest God King","avatar":"https://mangadex.org/covers/74fdc170-f491-4921-b8de-54c026d68428/64e5817e-577b-4a09-9136-8d54e25c21b8.jpg.256.jpg","country":"Chinese (Simplified)","stat":"6.51","status":"Ongoing","tags":["Action,Long Strip,Martial Arts,Wuxia,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"This is an era full of aura, and a world where the immortals gather. The young Wu Fu returned after being reborn,and looking at his eyes, how calm he was. What I need to do is to raise the sword and clear all the enemies of the last"},{"name":" Cat Maid and Mistress","avatar":"https://mangadex.org/covers/750ae38c-9bc4-4a5d-9026-af1eea44ed3b/c1348904-9dfa-4a38-af28-01e0e4454ad4.jpg.256.jpg","country":"Japanese","stat":"8.77","status":"Ongoing","tags":["Romance,Girls' Love,Monster Girls,Slice of Life"],"nutshell":"A young lady employs the services of a feline maid, but they both come to realize that the lines dividing them between \"mistress\" and \"servant\" are becoming increasingly blurry.\n\nLinks:\n\n Mangaka’s Pixiv\n Mangaka’s Twitter"},{"name":" Demon God","avatar":"https://mangadex.org/covers/750c5807-41a0-4197-b01f-dac6967f8fa8/ed6017ab-2663-4525-a9c6-e7ea27e7f307.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.90","status":"Ongoing","tags":["Action,Long Strip,Comedy,Fantasy,Web Comic,Full Color"],"nutshell":"Thousands of years ago, the immortal clan and demon clan were battling for the universe. To defend the peace and justice, the immortal clan created a mysterious legendary fighter, who blew himself up into thousands of pieces, floating in the world. And Lu Xiaofei inherit a piece of the fighter."},{"name":" Kekkon Suru tte Itta Yone?","avatar":"https://mangadex.org/covers/750fbe9a-0619-4733-b06c-46e30ba89372/0e32858d-10a1-4f27-912a-1eb5333b6f8a.png.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Romance,Comedy,4-Koma,Web Comic,Slice of Life"],"nutshell":"The main character, who promised to get married when he turned 18, looked at his family and realized \"marriage is hell,\" but it was already too late. His childhood friend has grown up into a super duper nutjob woman he can't escape from?!"},{"name":" Sabaku no Yuuwaku","avatar":"https://mangadex.org/covers/75117541-1e73-4510-ad9e-8a0cb2c93159/25af61f1-e9bf-4fb0-92d1-c56c09eb8c2b.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Drama"],"nutshell":"Volume 1 ~ The Sheikh's Reluctant Bride (Damasareta Hanayome)\nAfter her mother's death, Jessica gows up in a foster care believing herself to be an orphan. The discovery of her mother's family in Bha'Khar, a desert kingdom far away from the States, fills her with much wonder and anxiety. As she leaves for Bha'Khar, she is surprised to find a royal jet as well as Sheikh Kardahl, second in line to the throne, waiting for her. To Jessica's amazement, he says, \"You are my betrothed, chosen by my family. You are my bride.\"\nVolume 2 ~ The Sheikh's Contract Bride (Ai o Suteta Sheikh)\nBeth would do anything for her twin sister, Addie, who has been betrothed to a sheikh from young age and has led a life of high expectation and heavy responsibility. Beth, unlike her sister, spent a lonesome childhood receiving little attention from her parents. The twins have grown up trusting and depending on each other. As the day of meeting the sheikh nears, Addie confides in Beth with her secret love for another man. To save her dearest Addie, Beth decides to go to the desert kingdom of Bha'Khar, pretending to be her twin sister!"},{"name":" Black Warriors","avatar":"https://mangadex.org/covers/7511b858-06e5-414d-b343-467ea468efdf/13ea9e35-71d7-45c2-8158-0c0360af69ec.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Action,Comedy,Supernatural"],"nutshell":"A story about two young demons who are always slacking off at work, a place that happens to be an organization that vows to keep the balance between the worlds of the living and dead by killing humans!\nVol 1&2 contain a small short story about a robot with a mission to 'save humans'"},{"name":" Idol Trainee","avatar":"https://mangadex.org/covers/7512f679-b7cd-4d2f-b28a-e9e54d09aff2/964f770c-464c-48df-a19e-69bc8bbc8b05.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.06","status":"Ongoing","tags":["Action,Long Strip,Comedy,Drama,Fantasy,Web Comic,Supernatural,Music,Full Color"],"nutshell":"Han Lan, a special soldier in his previous life, was sent to a parallel world by a cannonball, and was reborn as a trainee who was preparing to participate in the draft. However, the aesthetic standard for male idols in this world is to be white, thin, and whine! What? I'm dark and strong, can't I debut in the C position? A real man should chop bricks with his bare hands!"},{"name":" Princess Princess Premium","avatar":"https://mangadex.org/covers/751f20c9-0e86-4e68-85e3-3a0b14f5fa0e/aa3639a0-9ff4-4f7e-bbbd-cc04259d9a07.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":[""],"nutshell":"Artbook of the serie Princess Princess."},{"name":" Haunted (ホーンテッド)","avatar":"https://mangadex.org/covers/7526b6be-c579-4d59-9656-dddf4e31a603/72f70931-20ab-4453-af0b-f7a6d0ef7392.jpg.256.jpg","country":"English","stat":"7.14","status":"Ongoing","tags":["Thriller,Action,Demons,Ghosts,User Created,School Life,Horror,Vampires,Supernatural,Mystery"],"nutshell":"Suzuki Haruto, a 17 year old schoolboy investigates a haunted school. He finds himself being saved by a mysterious girl, however, there is more to this schoolboy than it seems…"},{"name":" Kimi Ga Eiyuu Ni Naru Monogatari","avatar":"https://mangadex.org/covers/75271cfe-9a55-46bd-9e1d-0d1aad1857d2/55342bff-4275-4bd6-bfc9-0a31d4483aae.png.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Action,Demons,Fantasy,Supernatural"],"nutshell":"Shudo Shrine in Osaka is a venerable shrine whose deity is \"Abe no Seimei\". The scroll \"Abe no Seimei no Sho\" is carefully enshrined in the shrine for generations. The eldest son of the shrine, Shudo Narumi, who signed a contract with this scroll, is the only man who can control \"Abe no Seimei\". In the wake of the incident that happened at Osaka Castle, a battle for scrolls broke out ... \"Hero\" battle fantasy begins in Osaka."},{"name":" M.F.C Mine Fujiko Company","avatar":"https://mangadex.org/covers/752d0e99-5d24-4344-94d8-3a6741448ebd/6767a5b0-b0c2-4074-8332-bcbab6d26c8f.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Comedy,Crime"],"nutshell":"Fujiko Mine is the president and founder of M.F.C, a \"thief company\", which she established for her own purposes. The story follows Sachiko Yamada, the 19 year old newcomer employee and her colleagues, Hiroko and Junko under the charge of Manager Eriko"},{"name":" I Love You Baby","avatar":"https://mangadex.org/covers/75338d9d-c6bb-4124-bddd-f16c5508a1ef/f6408f13-9937-41d1-be23-6f05d5414703.png.256.jpg","country":"Japanese","stat":"8.27","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"You are the \"first\" of everything for me who is afraid of guys.\nA 7th grade girl by the name of Mirei is not allowed to do anything after school due to her strict parents, but one day she goes out on her own after her mom has left for work. That day, she meets a boy that seems to be younger than her. What will become of this meeting?"},{"name":" Miraigata Renai Danshi 46","avatar":"https://mangadex.org/covers/7535a2d5-139a-4363-bf4c-f11ac3180175/291ca018-3e57-4814-8cd7-84294b109503.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sci-Fi,Romance,Comedy,Drama,School Life"],"nutshell":"Onodera Nanami, elated from her third date with her new boyfriend, arrives at her apartment to find an strange, but extremely handsome boy with big ears welcoming her home as \"Mistress!\" Bewildered, Nanami soon finds out her genius older sister decided to test her new companion robot prototype called \"D-46\" on her…who happens to be this cute, puppy-like boy at her doorstep. Will Nanami stay true to her boyfriend, or will this android steal her heart away?"},{"name":" Wild School","avatar":"https://mangadex.org/covers/75380235-3719-4ad8-9a5d-9937841efc38/0ad25f01-3d56-43f0-b2f9-4293e8788dd4.png.256.jpg","country":"Korean","stat":"8.06","status":"Completed","tags":["Action,Romance,Martial Arts,School Life"],"nutshell":"Summary: You-Geon, a high school student, is saved from drowning by a mysterious girl his own age. Indeed, this girl is a North Korean agent trained to kill. The encounter which will completely change You-Geon’s peaceful life means that this mysterious girl never leaves You-Geon alone for a second worried he might reveal her secret to someone. The atmosphere at the high school won’t ever be the same…\nTaken from Stand Alone Scans"},{"name":" Colorful Pallet","avatar":"https://mangadex.org/covers/753aa5b2-8a02-4d3a-a67a-ce3ca3cc6476/905bfd23-f7ba-4026-b157-24e945a73f26.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"Abe Makoto and Shibuya Masaru are in a loving relationship all their friends envy. However, even though Makoto falls further in love with Masaru every time she sees him, Masaru is, for some reason, calm…"},{"name":" Suddenly I'm a Noblewoman","avatar":"https://mangadex.org/covers/753f436f-c011-4dbf-b3a3-55c13fb9c73e/ba188bda-3129-41c7-9a59-ef8a32a43dcb.jpg.256.jpg","country":"Korean","stat":"8.18","status":"Ongoing","tags":["Official Colored,Historical,Long Strip,Romance,Web Comic,Full Color"],"nutshell":"\"I'd rather die than be married!\"\nDeok is a slave who is forced to marry by her parents, but she prefers to die rather than having to leave the life of slavery to her children later.\nWhen deciding to end her life, suddenly she gets a chance to change her destiny.."},{"name":" My Eunha","avatar":"https://mangadex.org/covers/75464315-af8a-432e-9406-4689ca0a4d8f/c78f7d12-c3ad-425c-8c69-307ceafd4b56.jpg.256.jpg","country":"Korean","stat":"8.00","status":"Hiatus","tags":["Long Strip,Romance,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"From Tapas (webtoon version):\nA devastating accident lands Eunha Seo in the hospital. Mysteriously, she wakes up 12 years younger in her 22-year-old body. Life has given Eunha a second chance, but this is not the life she remembers. Memories blur with reality as she navigates the unfamiliar friendships and romances of this parallel time. Like a surreal game of “what if?,” Eunha is torn between the excitement of a new past and a longing for the life and love she once had. Will Eunha ever find solace? Only time will tell."},{"name":" Doll Change","avatar":"https://mangadex.org/covers/754bbbde-5cfe-4f0f-936e-a250d8f384bc/fb827679-1bff-46ef-92b1-a8e90d8c4214.jpg.256.jpg","country":"Korean","stat":"7.93","status":"Ongoing","tags":["Sci-Fi,Action,Long Strip,Mecha,Martial Arts,Web Comic,Full Color"],"nutshell":"A tournament using DOLL (humanoid robot suit) to be the last standing person."},{"name":" Crows Like Shiny Things","avatar":"https://mangadex.org/covers/754bfe1a-bfd9-4190-b6ef-0fe20a6b4481/1667fe33-1bf6-4c18-a22a-0110fa27f496.jpg.256.jpg","country":"Korean","stat":"7.00","status":"Ongoing","tags":["Action,Long Strip,Romance,Fantasy,Web Comic,Full Color"],"nutshell":"The war is over. The one who cut the neck of the Norkans' leader, who antagonized the great empire for 37 years, was a young woman.\nHer name is Sahara Illaud, the captain of the 128th Knights' Division. She was summoned by the emperor and goes to the capital, where, for the first time in her life, she meets a man who catches her eye.\nCrown Prince Cheisha, who is handsome to the extent that there are sparkles around him.\nSahara, who is beautiful and knowledgeable but arrogant and insensitive.\nThe fresh and heart-warming story of their lives.\n\nIn the barren northern Snowlands of the empire, a war that has raged on for 37 years against the vicious Norcans is finally brought to an end by one Captain Sahara Ellawood of the 128th Order. When Crown Prince Cheshire Wi Solante goes to escort Captain Ellawood to the capital, he expects to find a savage who beheads and eats the eyes of her enemies. But to his surprise, Captain Ellawood is an incredibly strong, loyal, innocent, and most importantly, beautiful woman. Cheshire is instantly enamored with Sahara, and the two spend an intimate night together after the victory party. But things quickly turn sour when Sahara claims that the only feeling she harbors for the prince is devout loyalty. Will Cheshire be able to break down Sahara’s walls and captivate this charming knight’s heart?\n\nOriginal Webtoon: R15, R19\nOfficial Translations:\n\nEnglish: R15, R19\nIndonesian / Bahasa Indonesia: R15\nJapanese / 日本語: R15"},{"name":" Arknights - Five Star Shame (Doujinshi)","avatar":"https://mangadex.org/covers/755a9219-893f-46cf-a632-6be560c8466b/f7cf7b18-a42e-4057-8b9f-c242c1dd809b.png.256.jpg","country":"Chinese (Traditional)","stat":"7.98","status":"Completed","tags":["Oneshot,Sci-Fi,Comedy,Post-Apocalyptic"],"nutshell":"READ LEFT TO RIGHT.\nAn Arknights doujin. Hahaha.\nOriginal Post: https://twitter.com/YUYANSHU13/status/1163861919775649792\nArtist's Twitter: https://twitter.com/YUYANSHU13\nSmall Explanation Just In Case: ||Arknights is a mobile game with a range of characters from 2s-6s, with 6s being the best. The one with the rapier (Franka) and the one with the shield (Liskarm) are only 5s.||"},{"name":" Mahou Shoujo Lyrical Nanoha - I♥Nanoha (Doujinshi)","avatar":"https://mangadex.org/covers/755cff33-b3dc-47e0-9574-8e325ff909bb/8edf6a4a-b023-45f4-968e-09836740303c.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Girls' Love"],"nutshell":"A comedy about Fate getting very obsessed over Nanoha, to the point that she even gets jealous of their own daughter, Vivio, and gets involved in other bizarre acts. Guaranteed hilarity."}]