[{"name":" Night on the Galactic Railroad (Variety Art Works)","avatar":"https://mangadex.org/covers/72f1eb52-3613-4087-901a-47b866195c67/8353ae65-2beb-41da-a3f8-b1b2c5d3abba.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Sci-Fi,Psychological,Adventure,Drama,School Life,Slice of Life,Adaptation,Tragedy"],"nutshell":""},{"name":" The Misadventures of the Small Anime Club","avatar":"https://mangadex.org/covers/72f7bf23-01b2-4fa6-ad50-e1a233beb867/8a9682ed-dbe6-4c9e-a455-55e31d96b4aa.jpg.256.jpg","country":"Japanese","stat":"7.46","status":"Completed","tags":["Oneshot,School Life,Slice of Life"],"nutshell":""},{"name":" False Memories","avatar":"https://mangadex.org/covers/72f8e1d4-65bd-4f00-a804-4d1c8bbfc46a/73f7d2fe-e8b9-4eeb-94a6-2976c7d38c40.jpg.256.jpg","country":"Korean","stat":"8.05","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life,Web Comic,Full Color"],"nutshell":"Wan’s got a face that scares everyone away before he can really become friends with anyone. So when Ha-woon befriends Wan on his first day at his new school, Wan is elated. Ha-woon must be an angel! It doesn’t take long, though, for Ha-woon to betray him in a terrible way, and Wan discovers Ha-woon might be more devil than angel. But then an accident happens that gives Wan a second chance at friendship with his angel. And it all starts with one big, fat lie.\nFrench\nWan a un visage qui fait peur à tout le monde, avant de pouvoir vraiment devenir ami avec n'importe qui. Alors, quand Ha Woon se lie d'amitié avec Wan lors de son premier jour dans sa ouvelle école, Wan est ravi. Ha Woon doit être un ange ! Cela ne prend pas longtemps, cependant, pour que Ha Woon le trahisse d'une manière terrible, Wan découvre que Ha Woon pourrait être plus diabolique qu'un ange. Mais alors un accident se produit ce qui donne à Wan une seconde chance d'amitié avec son ange. Et tout commence par un très gros mensonge."},{"name":" Magnum Lily","avatar":"https://mangadex.org/covers/72ff7504-dd77-439c-bd5a-5c9da017e302/6b99f013-cc87-433f-bed6-aa0e79a29571.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Comedy,Sports,Slice of Life"],"nutshell":"“There isn’t anything I really want to do with my life…”\nYuri Higuchi is a middle school student, who’s graduation is fast approaching. However, unlike her classmates, Yuri hasn’t found a dream of her own.\nAfter a disappointing “date” with her senpai, Yuri decides to relieve her stress on a punching machine.\nHaving witnessed Yuri’s punching, a beautiful foreign girl, named Windy, suddenly invites Yuri to come watch a women’s boxing match…\nAnd so, Yuri’s journey to become a professional boxer begins! Witness as a 15 year old female, lights the passionate flames of her burning youth!!"},{"name":" Rec - Kimi ga Naita Hi","avatar":"https://mangadex.org/covers/72ffb261-a6a0-49e5-8fb5-ea9ecbdfa4f5/af17d34c-214d-4dae-a848-5173a40ea453.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Romance,Drama,Tragedy"],"nutshell":"Aizawa Minami is a girl who has never cried in her life. She's awkward with her feelings, and she carries a camcorder to film everything she likes. Because of her quirks, she's labeled as a freak and alienated by her classmates.\nSatoru is her classmate and a recently retired teen actor who understands her. They quickly become friends, but what Minami doesn't know is that Satoru is hiding his secret from the world…"},{"name":" Youkashou Kitan","avatar":"https://mangadex.org/covers/7302e613-74f5-45b8-9cfe-117294edb8c8/f9bd60d9-f37d-48a6-99c1-2716580e4f12.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Ongoing","tags":["Historical,Action,Romance,Military,Fantasy"],"nutshell":"After the death of her grandfather, Toba Rin moved to the city. Longing for Hokkaido, where she used to live with her grandfather, Rin struggles to find a place where she belongs. Unable to get used to her new school and returning home by herself with a sense of somberness, thunder struck and her surroundings were set ablaze. The one who saved her from the fire was the general, Yang Silang.*\n*A character from Chinese folklore.\n\nOriginal Web Publication: ComicWalker, NicoVideo, Pixiv"},{"name":" Reku-tan","avatar":"https://mangadex.org/covers/7305754a-897a-49ec-a341-882200574ee4/06c082b0-040f-43d9-829f-f502762975e2.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Oneshot,Comedy,Magical Girls,4-Koma"],"nutshell":"A fridge that's been illegally thrown away at the garbage dump was picked up by a girl called Natsumi-chan, as she finds it works fine despite its super old age. However, she didn't expect it to turn into a human one day in order to repay her…\nThis manga illustrates Hoshi-kun's original concept in Henjo - Hen na Jyoshi Kousei Amaguri Senko (Vol.6 Chapter 37)"},{"name":" My Unfriendly Manager","avatar":"https://mangadex.org/covers/73093a03-5429-45e2-b6db-1a27bd104fd4/f5866188-acbd-4318-99f6-4b4feb347b51.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Boys' Love"],"nutshell":"The handsome model Yura gets a new, stern manager. But his serious and strict character is the worst match for someone as sloppy as him! Plus, he even ends up moving into the same apartment building as his manager, Shiina, after making the decision to \"put serious effort into work\"...! Even though he thought he'd find this meticulous and diligent guy annoying, Shiina's sincere kindness and his brief smile makes Yura's heart race for some reason... They're so close to each other, but nothing's happening... a slow burn romance story."},{"name":" Experiment N 0","avatar":"https://mangadex.org/covers/730bcc10-7191-45d7-a027-52575eeb44cb/a1e5b32d-7cd9-4103-a7c4-c73ff82b0809.jpg.256.jpg","country":"English","stat":"7.97","status":"Ongoing","tags":["Monsters,Action,Comedy,Superhero,Adventure,User Created,Magic,Drama,Web Comic,Aliens,Supernatural,Tragedy"],"nutshell":"Zein Gospell is unlucky. Pursued by mysterious organizations and mercenaries, he lives on the run because they all have eyes only for his power … His immortality. However, is it possible that even a person fated for misery becomes a hero? Follow Zein in this abnormal world and find out.\nRead It on the official site because I'm dumb asf and can't manage to publish the chapters here: https://www.webtoons.com/en/challenge/experiment-n-0/list?title_no=605929"},{"name":" Koi wa Moudoku","avatar":"https://mangadex.org/covers/730dccc6-c3f0-47f5-8756-5b93b61fa8b3/30163faa-6017-4853-afa3-dff1d867d316.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance"],"nutshell":"Girl falls in love with a pervert. Somehow overcome by lust after hearing that he can only get it up to the murder\nof others, as if he had said something profound, she kisses him without thinking and he proceeds to get a raging boner."},{"name":" Ah knew in mah head, but...","avatar":"https://mangadex.org/covers/7312c0fa-2a2c-4333-b48f-c11ca7864177/c10b194d-4b40-4f4b-85c7-3f66ed783fbc.jpg.256.jpg","country":"Japanese","stat":"7.71","status":"Completed","tags":["Oneshot,Comedy,Web Comic"],"nutshell":"Kansai farmgirl gets spooked by a bee. Sequel to \"Inaka ni Sundeiru to Kou iu Koto Nai??\""},{"name":" Yuusei no Fool","avatar":"https://mangadex.org/covers/7314251c-a168-45e1-bda6-0f2f292eba18/5414f2a0-214f-41e1-a636-795c81540e9c.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"The story follows Sena, a girl who enrolled in a training school to become the queen as a substitute for her missing twin sister."},{"name":" Bokura no Ai wa Mada Aoku","avatar":"https://mangadex.org/covers/7315f721-7d82-4655-9810-692d39a9d86c/b1552042-04a3-4260-a381-209c88f06fbb.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":""},{"name":" Anten-sama no Hara no Uchi","avatar":"https://mangadex.org/covers/731d8500-d5c9-4c6c-b9e1-07ed746c2f3f/d865848c-73b0-44cd-bcd6-6c6bf818abfe.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Demons,Ghosts,Drama,Horror,Slice of Life,Supernatural,Mystery"],"nutshell":"If you give something important, your wish will come true according to the price. Instead, if you die, you lose everything, a god with such a mysterious power...Anten-sama. The fate of the \"wishes\" of the people you meet is…!?"},{"name":" Onward Towards Our Noble Deaths!","avatar":"https://mangadex.org/covers/7328c8ff-9c64-4b22-b2ca-e092f9b9c62f/a2f2ffbb-6060-4040-af4c-ea32841b5a77.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Thriller,Historical,Action,Psychological,Comedy,Survival,Military,Philosophical,Drama,Horror,Tragedy"],"nutshell":"(from ebookjapan):\nNow is the time to think about war. A masterpiece war manga that should be preserved for the future, based on the real experiences of Shigeru Mizuki, a Mangaka who served in the Pacific War. 20 historic chapters.\nThe Japanese officers decide to commit to using a banzai charge in the face of overwhelming defeat by the onslaught of the U.S. forces.\nWhat will be the fate of the 500 survivors?\nBased on the mangaka's own real-life experiences, this masterpiece war memoir manga depicts the horror, senselessness, and tragedy of war.\nIncludes a special collection of conception notes discovered after his death. A new and complete edition that resonates with the determination of the soul that went into the work!\nOfficial English"},{"name":" Switch","avatar":"https://mangadex.org/covers/7329d070-0e9f-483a-946b-fc579f70bb29/42ea0041-30b5-474a-8895-b6042e121d9a.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"Kei is a quiet student who doesn't really like adults or teachers too much. However, after getting to know her English teacher, she begins to fall for him."},{"name":" Electric Tale! Pikachu","avatar":"https://mangadex.org/covers/7330f20b-5cac-469b-a232-7dd002175f07/3ac9a7ac-7b7d-4922-8817-bf8bcfbdd0dc.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Sci-Fi,Monsters,Action,Ghosts,Animals,Comedy,Survival,Sports,Adventure,Video Games,Drama,Fantasy,Slice of Life,Adaptation"],"nutshell":"This series is loosely based on the anime: Ash aspires to be a Pokémon Master, and together with the various friends and Pokémon that travel with him, embark on many adventures.\nNote: The manga was edited and censored by VIZ in its English release, since its original content was found too \"offensive\" by the American public and was made more \"kid-friendly\"."},{"name":" Pandora's Heart","avatar":"https://mangadex.org/covers/7334af26-86c1-4469-86f1-26080f8a44c5/cf31143b-0deb-424c-8506-5af0cb3ebfaf.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.09","status":"Ongoing","tags":["Boys' Love,Drama,Fantasy"],"nutshell":"English :\nIn this world, demons threaten to emerge from corrupted hearts. To protect everyone, each person’s chest is installed with a Heartlock with varying degrees of security. But young Louis can afford only the simplest of Heartlock since he has no money or privilege. After his innermost desires are exposed by his closest friend, he is framed and sent away. Surrounded by the demons of other tormented inmates, can the innocent Louis and his delicate heart survive this new hell?\nIndonesia :\nDi dunia ini, iblis mengancam untuk muncul dari hati yang rusak. Untuk melindungi semua orang, hati setiap orang dipasang dengan Gembok Hati dengan berbagai tingkat keamanan. Tetapi Louis muda hanya dapat membeli Gembok Hati yang paling sederhana karena dia tidak memiliki uang atau hak istimewa. Setelah keinginan terdalamnya diungkapkan oleh teman terdekatnya, dia dijebak dan diusir. Dikelilingi oleh iblis dari narapidana lain yang tersiksa, dapatkah Louis yang tidak bersalah dan hatinya yang lembut selamat dari neraka baru ini?"},{"name":" Shounen Endless","avatar":"https://mangadex.org/covers/7336ba26-68f6-4b02-8b26-6199562f8033/28794e6e-dbb8-43d0-adf1-1715a5bfa78d.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Oneshot,Action,Romance,Comedy,Adventure,Fantasy"],"nutshell":"A boy with a special skill called invulnerability, or in other words, immortality. Hated by shinigami is visited by one! Now he and his research team have to find a way to stay \"alive\"."},{"name":" Please Forgive Me","avatar":"https://mangadex.org/covers/7336cf71-45bc-4476-ac07-9174de73e93a/d7177690-4d12-43de-9881-0abee665079a.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Psychological,Long Strip,Drama,School Life,Web Comic"],"nutshell":"Grace lost her best friend in an accident back in high school. Years have passed, but she still suffers from deep depression and insomnia. She finally decides to face her greatest pain…"},{"name":" Futari wa Pretty Cure","avatar":"https://mangadex.org/covers/73375bd1-e944-4edb-af01-5ce19e20c273/8c200f5e-b86b-45e1-b65d-999da2ae4541.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Action,Comedy,Martial Arts,Adventure,School Life,Fantasy,Slice of Life,Supernatural"],"nutshell":"Nagisa Misumi and Honoka Yukishiro couldn't be more different. Nagisa is sporty and Honoka bookish, and while they attend the same school, they have very little in common - until one day, a shower of shooting stars brings two very unlikely visitors into their lives: Mipple and Mepple, refugees from the Garden of Light, which has been conquered by Darkness. Endowed with new and startling powers, Nagisa and Honoka become Cure Black and Cure White, magical defenders of the light — together, they are Pretty Cure."},{"name":" Matome Groggy Heaven","avatar":"https://mangadex.org/covers/7339b9ec-a2a4-4151-851d-14aee35d84aa/acfe8d37-27ce-460f-bfb8-a019a3716896.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Comedy,Slice of Life"],"nutshell":"In a romantic comedy, two roles are ever-present: the lucky pervert boy and the violent tsundere girl.\nWhat if those roles were switched around?"},{"name":" Koi no Yami","avatar":"https://mangadex.org/covers/733b1024-f699-4f5f-ad9c-cd24277a25ad/0cf2518c-ab11-41e7-908f-29ec48a146e6.jpg.256.jpg","country":"Japanese","stat":"7.71","status":"Completed","tags":["Oneshot,Historical,Romance,Boys' Love,Samurai"],"nutshell":"Sequel to the story Motte Meisubeshi.\nCan love survive when the bonds that hold them together are severed? Harunobu wants only to forget about his affair with Yasuke and leaves him behind. Willing himself to forget the intimacy that they shared he throws away his former life and tries to reinvent himself. Will Yasuke do nothing to bring Harunobu back and can Harunobu live without him?"},{"name":" Kaze Hikaru","avatar":"https://mangadex.org/covers/733c0bcc-a499-47ce-b91b-87ebe88e5b3c/17792d98-c252-4c8d-8eaf-cfb74447e835.jpg.256.jpg","country":"Japanese","stat":"8.28","status":"Completed","tags":["Award Winning,Historical,Action,Psychological,Romance,Comedy,Survival,Samurai,Adventure,Military,Drama,Slice of Life"],"nutshell":"In the year 1863, a time fraught with violent social upheaval, samurai of all walks of life flock to Kyoto in the hope of joining the Mibu-Roshi–a band of warriors united around their undying loyalty to the Shogunate system. In time, this group would become one of the greatest (and most famous) movements in Japanese history… the Shinsengumi!\n\n\nWon the Shogakukan Manga Award for Shojo in 2003"},{"name":" Kemono Ni Botsuraku Ojousama","avatar":"https://mangadex.org/covers/734adb48-6ba2-45d4-9002-028f3c145f1a/fcd78c43-6593-45f0-9963-d3f93f87326f.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Ongoing","tags":["Oneshot,Romance,Comedy,Slice of Life"],"nutshell":"16-year-old Jounouchi Youko is a young girl who has just transferred to a new high school due to her family's recent financial losses. During her first week there, she is assigned to the weekly infirmary duty with a the most dangerous guy in school, Tsukina-kun! How will she deal with Tsukina-kun and her infirmary duties at the same time?"},{"name":" Hatsukoi Lovers","avatar":"https://mangadex.org/covers/735959e0-e896-4e80-a5f5-2888f4425aa9/2498efdc-d87e-462a-a7c4-c39145b19b98.png.256.jpg","country":"Japanese","stat":"7.57","status":"Completed","tags":["Oneshot,Comedy,Boys' Love,Crossdressing,School Life,Slice of Life"],"nutshell":"Mamori Kusunoki's childhood friend Wakaba Kisaki has been dressing and acting as a girl for years, stemming from a promise to get married when they were kids.\n(Source: MU)"},{"name":" Hetamen","avatar":"https://mangadex.org/covers/7359ef80-e29a-4a3e-af0a-cd2eacea22ea/f13c74f7-3b9f-4ca5-a3f1-12ea598d8555.jpg.256.jpg","country":"Japanese","stat":"7.58","status":"Completed","tags":["Romance,Comedy"],"nutshell":"Satoko has had enough – she’s not going to be a slave to her family and friends anymore! Determined, she leaves her house and demands her friend set up a couple’s mixer for her. But she still can’t break her habit of wanting to help everyone around her!Meeting the handsome, respectful Kenji and after an confession from him, they start dating… but somethings doesnt work out the way it is suppose to be.The disheveled genius scientist Shinguuji keeps attracting her in unusual ways…"},{"name":" Diamond no Ace - Translation Unruly Baby Story (Doujinshi)","avatar":"https://mangadex.org/covers/736be4d7-118c-4f86-895b-fa042dbd6990/e54549c6-302c-4dc4-a2d5-3cb21a9972d7.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Boys' Love"],"nutshell":"Scenes from Miyuki and Kuramochi's life raising their babies Eijun and Satoru."},{"name":" Ys vs. Sora no Kiseki - Alternative Saga: Game 4ko Maoh","avatar":"https://mangadex.org/covers/736c59fe-9c96-4544-a311-e842ab4f5c86/3de8d848-5646-4361-972e-414423e4f605.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Comedy,4-Koma"],"nutshell":"A 4koma based on the video game Ys vs. Sora no Kiseki - Alternative Saga."},{"name":" Treasure - Demon's Museum","avatar":"https://mangadex.org/covers/736ebd5a-3365-40d9-83ae-96c05d61448c/22b53c0a-831e-41d2-9614-347921583c22.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.40","status":"Completed","tags":["Long Strip,Romance,Comedy,Fantasy,Web Comic,Full Color"],"nutshell":"Luo Luo lost her memory in a car accident. She was rescued by something not human. Her journey into a fantasy world has just begun."},{"name":" Penguin Musume","avatar":"https://mangadex.org/covers/736f7c22-869c-4b99-9a8b-4c7dd9c8cac8/030cbace-ea4d-40b1-94fc-a29fe4a6b4ce.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Comedy,School Life"],"nutshell":"Follow the adventures of Nankyoku Sakura, who seems to be obsessed with anime and manga. She started her first day at school wearing a school swimsuit, cat ears, and a maid tiara and called it her “pajamas.” She’s also insanely rich, apparently."},{"name":" Four Fencers of the Forest","avatar":"https://mangadex.org/covers/73704e09-d15d-44a4-92fd-b9c2769da6bc/27a6fdf1-cbf4-433b-83bc-c502da4b1a4d.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Action,Comedy,Martial Arts,Adventure,Magic,Drama,Fantasy,Mystery"],"nutshell":"A pair of twin brothers were raised in poverty - but in reality, they're princes, being raised as such to protect them from a witch's curse...\nContains other gag one-shots in the second half.\n\nVolume 323 of the Osamu Tezuka Complete Works"}]