[{"name":" The Diary About Ayame's Easygoing and Aggressive Days","avatar":"https://mangadex.org/covers/f0e3166f-3aec-4762-9898-e74b696cfe11/c9d04e77-0e9b-4bf4-aa10-81ca4ee12361.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Romance,Comedy"],"nutshell":"The manga centers on Ayame and Tsubaki, who are researchers at a lab in the biology department of T University. Ayame is a \"returnee.\" He does things at his own pace and is a \"dinosaur otaku,\" and Tsubaki is his older colleague who is an enthusiast of studying the skeletons of birds and dinosaurs. The manga follows their slightly strange romantic relationship."},{"name":" Akaboshi – Ibun Suikoden","avatar":"https://mangadex.org/covers/f0e3275b-a321-449d-99ba-baa3244b71b5/0edc8b0d-3388-4fba-a770-f6416dd0eed8.png.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Historical,Action,Comedy,Adventure,Drama,Fantasy"],"nutshell":"Based on the Chinese novel Shui Hu Zhuan, this series is about the trials and tribulations of a band of outlaws during the mid Song dynasty.\nIt is 1112, China is in turmoil with the present Song dynasty's government and its inability to control its own provincial officials from preying on their people. However, tales of a band of outlaws punishing these abusive officers called \"Taiten Gyoudou\" is spreading. Their deeds are giving people hope. It begins with an encounter between Suiren, a young village girl believing in the bandits, and \"Falling Star\" Tai Sou, a traveling swordsman whose skill precedes him.\n\nSuikoden (水滸伝) is a Japanese translation for Shui Hu Zhuan."},{"name":" Inzak","avatar":"https://mangadex.org/covers/f0e7d0e7-9ad5-431e-8c80-45c35b0e7732/3af9df92-9a65-4440-a987-7f7797672355.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Action,Fantasy"],"nutshell":"A hidden war around the secret of Seoul, the 600 year old capital of Korea. Joo-hee never dreamed he would be investigated in the Presidential Residency by making emergency calls to see the flame from the city center though he felt wrong to know noone else witnessed the flame at school. People from National Fengshui Office said Seoul is in danger, for some people are breaking the seals on the places of bad chi. Indeed, people are killed by unearthly monsters, and not knowing what talent he has, Joo-hee's life is swept to this hidden war."},{"name":" Honeys","avatar":"https://mangadex.org/covers/f0ebaa11-2218-4ccb-b820-0b05f2a77618/ec681829-2b04-4ef8-b46f-1cf05f0f05a5.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life"],"nutshell":"\"Every day, I want to be held by a man!!\" – daydreams the kind-hearted and principled high school student, Mamoru. And finally, God has heard Mamoru's prayers! One day after school, he returns home to find three beautiful men waiting for him! The heavenly days are just beginning… he thinks, until something unbelievably twisted and perverted happens! What will happen from now on to both his lifestyle and his heart?"},{"name":" No. 6 - The You I Don't Know (Doujinshi)","avatar":"https://mangadex.org/covers/f0f0b1c7-7cb4-40ec-bbe1-cd88e2c058a3/5c8822c6-7137-4c07-8be9-a5e8bbe707b0.png.256.jpg","country":"Japanese","stat":"8.09","status":"Ongoing","tags":["Boys' Love"],"nutshell":""},{"name":" Chi's Sweet Home","avatar":"https://mangadex.org/covers/f0f4a17c-8ec7-4144-90d9-c119a7762ab4/048d2d13-fca7-4b0c-ab5c-3996433938cb.jpg.256.jpg","country":"Japanese","stat":"8.30","status":"Completed","tags":["Award Winning,Comedy,Slice of Life"],"nutshell":"The adventures of Chii, a lost kitten taken in by a young couple with a toddler. While the family never intended to keep the kitten, Chii slowly claws herself a niche in their family: winning over everyone with her kitten idiocy and charm.\nChi is a mischievous newborn kitten who, while on a leisurely stroll with her family, finds herself lost. Separated from the warmth and protection of her mother, feels distraught. Overcome with loneliness she breaks into tears in a large urban park meadow, when she is suddenly rescued by a young boy named Yohei and his mother. The kitty is then quickly and quietly whisked away into the warm and inviting Yamada family apartment… where pets are strictly not permitted.\nThe following are links to AnimeNewsNetwork for the animes:\nSeason 1\nSeason 2\nAdventure Season 1\nAdventure Season 2\nSide Story (OAV)\nWikipedia\nCantonese\nChinese (Traditional)\nEnglish\nFinnish\nFrench\nGerman\nItalian\nJapanese\nPersian\nPolish\nPortuguese\nRussian\nSpanish\nThai\nUkranian\nVietnamese"},{"name":" Hanazakari no Niwa","avatar":"https://mangadex.org/covers/f0f4c83e-0bc4-4211-94f3-e70f618ca6a3/79e495c5-3d29-456c-9865-6529fb16f8f6.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Drama"],"nutshell":"Masaki Tachibana leaves home in order to escape an oppressive existence with his father. He shows up at his grandfather's house, uninvited, and decides to live there. A garden that he saw in dream; his grandfather and his bodyguard, Harada; an old mansion inhabited by a beautiful, strong-willed girl…\nAt this point, the curtain rises on a mysterious drama of love and hate!\nAlso included in this volume is the story called Love Letter:\nKagawa recounts his meeting and becoming friends with Okada when he is introduced to Okada's fiancee. But can their incredibly complicated relationship really be summed up simply as friends?"},{"name":" A fox woman and a pig guy!!","avatar":"https://mangadex.org/covers/f0f6ca88-21ca-481e-ae80-95900ca7f216/a2178242-eeda-4620-a42a-9f7ff5fb8029.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Cancelled","tags":["Comedy,School Life,Fantasy,Monster Girls,Web Comic"],"nutshell":"A fox girl and a pig man! A fresh relaxing school comedy unfolds!"},{"name":" Memories from Afar","avatar":"https://mangadex.org/covers/f0f7c292-1401-46d6-9512-be551792970d/55565a59-69b6-4462-b4c9-ce9ce15b4740.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Oneshot,Post-Apocalyptic"],"nutshell":""},{"name":" World Destruction ~Futari no Tenshi~","avatar":"https://mangadex.org/covers/f0fd6310-7a39-4b9c-a62b-50777e460de6/3446f2ef-5e72-44fb-8e52-754fb992959f.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Action,Adventure,Fantasy,Supernatural"],"nutshell":"In a world ruled by anthropomorphic animals. Humans live as slaves, and a group of terrorists dubbed the \"World Destruction Committee\" intends to destroy the world in rebellion.\nA young man, Kyrie, who possesses the power to destroy the world, though he does not know why. Morte, a young woman with a tragic past and is the leader of a terrorist organization plotting to destroy the world. A demi-human named Naja, Morte's childhood friend Agan, a tough bear named Toppy, and a dragon girl named Lia. These beings will come together and journey to destroy the world!"},{"name":" Wild Arms - Misfit (Doujinshi)","avatar":"https://mangadex.org/covers/f0ff4248-f055-4e7f-aa66-6d64425a6dd6/6b3039f4-594e-4474-97d5-9ef9d53c77e3.png.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Drama"],"nutshell":"When Cecilia confronts Elizabeth to free Rudy from the Dream Demon’s thrall, she suddenly finds herself battling the demons inside herself, as well."},{"name":" Do You Like the Otaku School Nurse?","avatar":"https://mangadex.org/covers/f0ffdb18-0b99-45c7-95f9-d332660f74ff/07295f53-5326-4c9f-a214-8558de2e42fb.jpg.256.jpg","country":"Japanese","stat":"7.62","status":"Completed","tags":["Comedy,Video Games,School Life,Slice of Life"],"nutshell":"There’s a new school nurse at Mitsugi Middle School, and the students couldn’t be more ex­cited. To everyone else, Momoyama-sensei is an unmatched beauty, but second-year student Tamotsu Kurita sees something they don’t—that she’s also a massive nerd! Her love of 2D characters—and only 2D characters—knows no bounds, and try as she might, she just can’t hide it. To Kurita, being around a beautiful lady who shares his interests is a dream come true, but Momoyama-sensei’s more excited to talk about her favorite fictional idols than anything else…"},{"name":" Yasashiku Oshiete","avatar":"https://mangadex.org/covers/f10d572c-1f77-4708-a7e4-fd1dd8e528e4/52324db4-ca0d-4393-b1f1-b23c651738df.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"University student Hikaru is an egoist whose type is \"girls who tell me that they like me.\" One day, something changes after spotting his younger brother Hijiri on a date with a younger boy. The stage is set for Gihou Ido's first comic!"},{"name":" Odoru! Kremlin Kyuuden","avatar":"https://mangadex.org/covers/f10f57f6-6e07-47fa-834b-6af8cc8796e1/b630c23f-172e-49bf-9780-12cbee5740dc.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Historical,Comedy"],"nutshell":"A very surreal, episodic manga about Russia.\nThis entire manga is very NSFW, so beware. It contains nudity, violence, gore and bad taste. Read at your own risk."},{"name":" Kimi ni Ienai Koto ga Aru","avatar":"https://mangadex.org/covers/f113580e-2ba6-4c83-9b0c-2120e7e9632f/c2662580-3e3a-424e-b227-4e6ac871d55e.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"The reserved Kasumi and the lively, popular Kyousuke have been friends since elementary school. Kyousuke was Kasumi's hero, often saving him from bullies, and occasionally Kasumi fluked a return save. Now as working adults, they face feelings they can't begin to describe."},{"name":" A Story About Two Brats Stopping Time to Play a Prank","avatar":"https://mangadex.org/covers/f11a4d0f-d5f1-4c1f-acd2-4e2f34df9fb6/7d78315a-a3fe-42b8-ac3f-1c6860397bb6.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Completed","tags":["Romance,Comedy,Web Comic"],"nutshell":"Two brats planning on mischief with the power of time-stop\n\nAuthor's Twitter"},{"name":" Night Head","avatar":"https://mangadex.org/covers/f11bbcc9-4fd3-412e-92e5-ff3961589df9/18b5d7cb-0cb2-401e-a633-845ed137a4e3.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Action,Drama,Supernatural"],"nutshell":"It is said that 70% of human brain capacity is unused. If human posses incredible power, it is strongly believed to be lying dormant within this region. This unused 70% brain capacity is known as \"Night Head\".\nThe Kirihara brothers were abandoned by their parents because of their psychic powers. Since then they have lived in a laboratory within a barrier-protected forest. One day the barrier brakes and they manage to escape from the laboratory."},{"name":" Apex Future Martial Arts","avatar":"https://mangadex.org/covers/f11d9d5c-bc4c-4552-8ac1-33e158c5a2c2/5e019be0-7700-473b-8a1b-cf89b2f0d7e5.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.03","status":"Ongoing","tags":["Time Travel,Monsters,Action,Long Strip,Martial Arts,Wuxia,Fantasy,Web Comic,Full Color"],"nutshell":"At the beginning of the martial dao, abnormal beasts invaded the world. Humanity’s martials had to retreat in defeat time and time again. Lu Sheng transmigrates to that time, but in his dreams he enters a world 10 000 years later. The foundational body refining method from 10k years in the future is several thousand times more effective than the current one. Then there’s the breathing method, body refining pill formula, and sacred martial law from 10k years later… Despite developing martial arts for 10k years, humanity was annihilated! Their martial arts civilization reached the apex, and yet there was no one left to inherit it. Except Lu Sheng, he’s exactly that last spark of hope!"},{"name":" Toriko - Digital Colored Comics","avatar":"https://mangadex.org/covers/f11f219b-eb1c-46ab-99f9-47b887183ed5/ea77b373-5eb6-4220-9e91-823a4c82949f.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Ongoing","tags":["Official Colored,Action,Comedy,Martial Arts,Adventure,Drama,Fantasy,Cooking,Supernatural,Mystery,Full Color"],"nutshell":"Delicious Foods!! Bloody Battles!! Enter Bishokuya Toriko and Chef Komatsu's adventures to assemble the greatest full course the world has ever seen! Follow the adventures of the Gourmet Heavenly Kings and friends through the exotic Gourmet Universe in Full Color!!"},{"name":" Fate/Grand Order - A Familiar Spook (Doujinshi)","avatar":"https://mangadex.org/covers/f1256f05-3d40-478e-9a99-b089a59008bb/a4514f8f-4154-47c8-853d-e19e4872c21e.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.06","status":"Completed","tags":["Comedy"],"nutshell":"Everyone loves spooks right?\nOG Author's Pixiv: https://www.pixiv.net/en/users/3243355\nOG Manga@Pixiv: https://www.pixiv.net/en/artworks/82777089\n*Feel free to update the translations because I suck at Chinese. And If you're (the original author) not fine with me TL-ing it or have complaints, then please hit me up on them Mangadex DM."},{"name":" Neon Genesis Evangelion - Savage Dog Asuka and Grown-up Shin-chan (Doujinshi)","avatar":"https://mangadex.org/covers/f12e73c4-9f26-4523-9223-3abdf442749d/8928f005-1256-402c-a501-eb9e301eeac0.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Oneshot,Romance,School Life,Web Comic,Slice of Life"],"nutshell":""},{"name":" A Pet to My Bias","avatar":"https://mangadex.org/covers/f1341600-3e22-4fc8-afda-c81119a3f44a/76eb19da-e737-49a8-8864-9c3309032e0d.png.256.jpg","country":"Japanese","stat":"7.91","status":"Ongoing","tags":["Romance,Comedy,School Life"],"nutshell":"Natsukawa Runa, a college student, is shocked by the disbandment of a popular idol group which she loves. One day, while caring for a drunken guy at a college drinking party, she discovers he is Subaru, her bias, who has gone MIA after the announcement. When Subaru realizes that he has been exposed, he threatens her by taking her picture, saying: \"Should I expose you so you can't go against me?” What’ll happen to Runa now that she finds out the true nature of her bias?!"},{"name":" Tactics","avatar":"https://mangadex.org/covers/f135a7da-7ae1-4520-bd1f-d770e51acfac/44c4393b-b83e-43a8-b54a-8cc7ebab8d9e.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.05","status":"Ongoing","tags":["Comedy,Harem"],"nutshell":"Although I'm tall, handsome and rich, I don't want a girlfriend. Meanwhile, I'm being pursued by several extremely cute girls. Poor me. I don't want this, OK?! My body can't take being ravaged by several girls!"},{"name":" Gender Game","avatar":"https://mangadex.org/covers/f13968c2-4144-45ec-8660-978c9659032b/fb8d8a1b-1d83-4ebc-bdb9-0ca69f81fa68.jpg.256.jpg","country":"Japanese","stat":"7.56","status":"Completed","tags":["Oneshot,Romance,Girls' Love"],"nutshell":"Two women consider their roles in their relationship with each other."},{"name":" Mekakushi no Kuni","avatar":"https://mangadex.org/covers/f13c39ba-77f8-45c6-add7-573e52955814/f6bf19bc-79e8-469d-8d33-fe5f829daf5e.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Completed","tags":["Psychological,Romance,Comedy,Drama,School Life,Supernatural"],"nutshell":"Mekakushi no Kuni is the story of high school student Outsuka Kanade who can sometimes see a person's future with a touch, and transfer student Naitou Arou, whose ESP is limited to past events. When Kanade glimpses an unfortunate incident coming, can she change it? She soon befriends Arou, who's no novice. While Kanade's power is limited to the near future and is somewhat uncontrollable, Arou's is permanent and he can even use it to see an object's \"memories\". Are these teenaged seers of the past and future made for each other? And who's right: Arou with his \"hands off\" policy about meddling in people's lives, or Kanade whose more proactive stance has already had unhappy consequences?"},{"name":" Yuri Kuma Arashi","avatar":"https://mangadex.org/covers/f1432158-bb90-457e-a609-aafee951cac5/3b1f3f7b-1cf8-4be6-9ce5-2651ba4dee8e.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Comedy,Girls' Love,Drama,School Life,Fantasy"],"nutshell":"The \"intellectual fantasy\" follows Kureha, a \"transparent\" high school girl who is plain and is barely noticed by others. Seemingly every night, she has a \"dream about a bear and transparent storm.\" In this dream, her mysterious classmate Ginko Yurishiro appears in the form of a bear."},{"name":" To The Bottom of The Ego","avatar":"https://mangadex.org/covers/f14e01bc-2d4d-4585-9265-e8350b9cba2f/10a5f44f-7083-4d95-aee5-812138736a63.jpg.256.jpg","country":"Japanese","stat":"7.17","status":"Ongoing","tags":["Psychological,Girls' Love,Drama"],"nutshell":"An unhealthy relationship between two girls."},{"name":" Game of Doppelgänger","avatar":"https://mangadex.org/covers/f1517c9d-2191-4533-898a-e92618e88d2e/2b63756a-2f32-41b9-8da7-66f63b0a4751.jpg.256.jpg","country":"Korean","stat":"7.91","status":"Ongoing","tags":["Thriller,Monsters,Psychological,Long Strip,Survival,Drama,School Life,Horror,Web Comic,Supernatural,Mystery,Full Color,Tragedy"],"nutshell":"A time bomb-like game starts in a certain girls-only high school! Every time the final bell rings, one person's soul is stolen away."},{"name":" Bancho Planet","avatar":"https://mangadex.org/covers/f15e882f-a9e1-491b-8be2-017927f32016/a9a64e3a-0de4-435d-a520-96cc4a15f5ad.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Comedy,Mecha,Crime,Survival,Adventure,Military,Philosophical,Drama,School Life,Delinquents,Police,Slice of Life,Tragedy"],"nutshell":"(from ebookjapan):\nRyu Todoroki has never lost a fight. However, he was outnumbered and forced into hiding. He tried to hide in a hole in a large Inari tree, but the hole was unexpectedly deep. Ryu rushed to crawl up, but something was wrong outside.\nIt was daytime when he fell in, but when he crawled back up, it was nighttime. Ryu, feeling a sense of discomfort, decided to go home. However, on the way there, he witnesses a police officer shoot a drunk to death...!?\nThe Final part of the Ryu Trilogy."},{"name":" The Story of a Career Woman Who Goes to a Brothel to Seek Solace","avatar":"https://mangadex.org/covers/f15f1f03-b5ec-40aa-bd60-91333b55bb8a/d693e3c2-5f44-4692-9ddf-7b3195b2680a.jpg.256.jpg","country":"Japanese","stat":"7.65","status":"Completed","tags":["Oneshot,Office Workers,Girls' Love"],"nutshell":"A successful career woman has a particular way to fight stress…"},{"name":" \"Aruto\"'s \"A\"","avatar":"https://mangadex.org/covers/f15f3ff9-94e1-49dd-87e2-b1e100bc42ce/8f070196-5959-4bb7-9c2d-87f24b93bf31.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Drama,Music"],"nutshell":"Aruto Kashiwayama is a budding pianist. She lodges at a famous conductor's house. Aruto's relationships with the conductor's son Hokuto and her first love Masaru are revealed. (Source: MU)"},{"name":" A Yandere Yuri Manga","avatar":"https://mangadex.org/covers/f16063d1-dd87-4e81-9652-84d6a18966b2/990a0d51-9cdb-4485-918b-796adeed807e.jpg.256.jpg","country":"Japanese","stat":"7.44","status":"Completed","tags":["Romance,Girls' Love,Web Comic"],"nutshell":""}]