[{"name":" Centaur no Nayami","avatar":"https://mangadex.org/covers/8972b661-13b4-49da-a32b-1450cf9ac31d/fe7c5b2e-65cf-4c19-a65c-38f9e496e88a.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Ongoing","tags":["Historical,Psychological,Comedy,Girls' Love,Drama,School Life,Fantasy,Monster Girls,Slice of Life,Supernatural"],"nutshell":"Himeno is a sweet, shy little centaur girl. In her world, everyone seems to be a supernatural creature, and all her classmates have some kind of horns, wings, tails, halos, or other visible supernatural body part. Despite their supernatural elements, Himeno and her best friends, Nozomi and Kyoko, have a fun and mostly normal daily school life!\nSee AnimeNewsNetwork for the anime.\nWikipedia\nChinese (Traditional)\nEnglish\nFrench\nItalian\nJapanese\nRussian"},{"name":" I Won't Pick Up the Trash I Threw Away Again","avatar":"https://mangadex.org/covers/897806b2-a06d-4477-80b1-6c779caf9167/6e9bf7b2-9a83-45ee-aa8f-62ad4928bca0.jpg.256.jpg","country":"Korean","stat":"8.09","status":"Ongoing","tags":["Long Strip,Romance,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"After six years away at war my fiancé returned, with a woman carrying his child in his arms. The same irresponsible fiancé who forced on me the duties of a duchess for the past nine years. What should I do from now on?..."},{"name":" CLOSE PLAY","avatar":"https://mangadex.org/covers/8979aead-3271-471f-8947-4b134ae43bc1/112f565e-ad60-4732-8097-1adc601bac4d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Sports"],"nutshell":"【An idol and a baseball player, the crossing of 2 different lives...】\nThe 9 member idol group【Love Dogs】holds their first live in Tokyo Dome. But just as the show reaches its climax, a bolt of lightning sends the 9 of them to a parallel world. To return to their original world, they must play against a professional baseball player, and seize victory. So begins the girls' gruelling battle."},{"name":" Haruka, Sumiwataru!","avatar":"https://mangadex.org/covers/8981784c-6aa2-47ce-8028-a7b4f989b769/ffa47f84-8f8c-47e3-b9d0-3b162eddec8b.png.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Adventure,Drama,Slice of Life"],"nutshell":"\"From first glance, I couldn't help but love her so much-\". The main character, Seiichiro Satomi, is a high school student who likes traveling and walking around the city. On the final day of spring break, along the way to home he meet a girl in Japanese clothes who was drenched in rain and stood alone.\nThe next day at school, when Seiichiro saw her as a freshman, she had suddenly changed her appearance …A heartful youth story spelled out in a lush canal!"},{"name":" Anata no Shimobe","avatar":"https://mangadex.org/covers/8984e9b3-32eb-4fcc-89f5-c42e8dcec5b2/c1d3b057-7126-4116-84f3-39a94b98de82.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Psychological,Boys' Love,Drama"],"nutshell":"Naohira wants a cat of his own…"},{"name":" Platanus No Mi","avatar":"https://mangadex.org/covers/89855174-b5bd-4f4d-a1a8-585e0dc224ba/b6d45f05-9ccd-402f-b515-c7f27c7018c9.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Drama,Medical"],"nutshell":"The story of a paediatrician from the creator of Theseus no Fune.\nThe sound that connects life--\nA precious sound that resembles what only can be said to be a miracle--\nDeclining birth rates, monster parents, convenience store medical tests...\nIn a hostile environment where societal problems are stacked against the odds of paediatricians,\nthey spend their days tirelessly to ensure that their patients are receiving the best care available to prevent any missed sightings of any major illness that could be hidden in their patients.\nLiking your patients alone isn't enough to sustain the cost/effective ratio of one's passion in this field where mental health for paediatricians can succumb to despair; although, there seems to be one amidst this field who somehow retains his gentle smile throughout it all, and his name is Mako Suzukake.\nThis is the story of a warm, and sincere paediatrician who watches over his patients from the cradle until their first steps into adulthood, as well as the family who accompany their child throughout their journey of life."},{"name":" Sei Licence","avatar":"https://mangadex.org/covers/89953a6a-9982-4841-bee8-69ae7153bace/ebd7c423-e6bf-406e-a4e9-8cb4d553c559.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Reverse Harem,Fantasy"],"nutshell":"Connie, who lives in the Village of the Holy Maiden, went to the heavenly palace to practice and study in order to become a \"saint girl.\"\nThere, she met seven unicorns of different colors. These sacred beasts each represent a different \"sacred love\", and the practice of \"holy girl\" is to learn what is sacred love..."},{"name":" Aoiro Ping Pong","avatar":"https://mangadex.org/covers/89971818-cbf5-4a14-aa5f-c53c391b5caa/a960fc2a-6d5a-49d7-8838-079ae7450414.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Sports,School Life,Delinquents"],"nutshell":"Kugumori Akito is 15 years old, about to enter high school. One day he comes across a guy being bullied, and ends up following him to his school. Because of this, Akito becomes interesed in something he discovered by chance - table tennis. Akito begins the challenge to experience something he will never forget."},{"name":" Meteor Syndrome","avatar":"https://mangadex.org/covers/899ac405-c941-4333-83f6-48bc0193e516/f4504218-cadc-42ed-bcb6-2cfcc74099cb.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Fantasy,Supernatural"],"nutshell":"When people die, they become stars. Suzume, a star hunter, find a very particular star…"},{"name":" The Time of Cherry Blossoms","avatar":"https://mangadex.org/covers/899acb87-147f-44d8-ad17-699a64c0dd48/8789f258-9b58-4893-b152-bb4710375d84.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Psychological,Comedy,Drama,Slice of Life,Supernatural"],"nutshell":"Sakura no Hana Saku Koro\nFamily Plot\nLosing your memory is not only painful for themselves, but also for people who love you. Hideyuki, a photographer, tries to find the memories that bind him to his son and the woman he loved.\nTaxi Driver\nA story about a vampire who works as a night taxi driver. His victims are his clients…or so it should be, for his good heart often remains with dry mouth, and when a young girl asks for his help, the real trouble begins.\nShoujo no Kisetsu - Summer Dream\nMisako was always afraid of water, a distant memory that resurfaces in her dreams, until she finds herself trapped in a strange realm, somewhere between her dream and her past…."},{"name":" Sen no Kiseki Magazine 4koma","avatar":"https://mangadex.org/covers/89a59742-1821-4b9b-91a5-ba7b40784ec2/151e4d46-444a-45e6-b0fa-24284b43f7a6.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Action,Comedy,Adventure,Video Games,4-Koma,Fantasy"],"nutshell":"Sen no Kiseki III / Trails of Cold Steel 3 4koma collected from Sen no Kiseki Magazine."},{"name":" Black Crow","avatar":"https://mangadex.org/covers/89aba53f-145a-481d-9db6-51f0986d92f3/595b5a84-010d-45e0-bb9d-d8455bef22a0.png.256.jpg","country":"Indonesian","stat":"8.05","status":"Completed","tags":["Action,Long Strip,Martial Arts,Fantasy,Web Comic,Full Color"],"nutshell":"One day, Agni met a man named Angkasa who claimed to be a part of the Black Crow guild. The guild was supposed to be annihilated in The Great War, but Angkasa wants to revive it. Agni decides to join him, along with Bacira, one of the Four Beasts who created the world"},{"name":" Haikyuu!! - Early Morning Babysitters (Doujinshi)","avatar":"https://mangadex.org/covers/89ac8eef-9b11-4faf-beb6-40913b3f89fb/8d05c1bc-47c1-4c21-9b0e-4b63cc2063e1.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Boys' Love,Sports"],"nutshell":"Early in the morning, Kageyama and Hinata go to the gym and see mysterious children in front of them who somehow looked like them."},{"name":" Love Live! - rely on me (Doujinshi)","avatar":"https://mangadex.org/covers/89ad31fa-645b-49d5-a217-54e84ac026c7/4a847e48-158d-4c32-a25c-82c08b9d7b01.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Oneshot,Comedy,Girls' Love"],"nutshell":"A little light Maki/Nico shoujo-ai doujin."},{"name":" Dokebi Cafe","avatar":"https://mangadex.org/covers/89aebed8-f5a0-4f2c-85f8-55a18ca904f2/e647497e-f046-43b9-9612-669631be9779.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Demons,Ghosts,Romance,Comedy,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"Dokebi Cafe: Sacred Grounds for Those Who Wait\n\"I will only love you even if I were to be born a thousand times.\"\nGangeun is a poster girl for bad luck.\nShe's a magnet for accidents small and large.\nJust when she's getting used to her eventful high school life, she encounters a strange \"boy\" named Mooyoung in front of a new cafe.\nWhat is this curious place? Who is this mysterious creature in the form of a boy?\nBad luck seems to have left Gangeun but there's so much more that awaits her.\n\nOriginal (kakao)\nOriginal (Naver)"},{"name":" Little Sweet Delusion","avatar":"https://mangadex.org/covers/89b48b63-c41b-4ebb-87e3-a37f14843077/f00877dc-963c-429c-911f-437cbdf84c4b.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Oneshot,Horror,Fantasy"],"nutshell":"A four-page fairytale cross between Red Riding Hood and Snow White, with a surprisingly dark twist."},{"name":" Persona 3 4koma Gag Battle","avatar":"https://mangadex.org/covers/89b83f0a-e2d9-4fb5-9325-fcf8f2fdb4ab/a4205ce5-b0d5-40a7-8783-60dce207bfbf.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Thriller,Monsters,Demons,Psychological,Animals,Comedy,Anthology,Survival,Video Games,Magic,4-Koma,Philosophical,School Life,Delinquents,Slice of Life,Supernatural,Adaptation"],"nutshell":"Collection of 4koma manga based on the Persona 3 game, made by various mangaka.\nVol1: Persona 3 4koma Gag Battle Reverse Hen\nVol2: Persona 3 4koma Gag Battle Broken Hen\nPublisher: Kobunsha"},{"name":" Koisuru Daigo-sensei","avatar":"https://mangadex.org/covers/89baf443-8079-4350-8ab2-c7bdb463a037/fb33adb0-91bb-4985-9463-7e3fa9c9849e.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"Rintarou and Kiyo are childhood friends from kindergarten. Rintarou was initially troubled by Kiyo's sudden confession, but after Kiyo left to study abroad in England, Rintarou started to see him as a possible romantic partner. Now, four years have passed and Rintarou is a child-caretaker, while Kiyo has just returned as a new professional soccer player. Rintarou is uneasy about all the changes that have occurred to them both while separated, but Kiyo tells him that \"for this whole time, the only one I've liked is you\"…"},{"name":" Horobi no Kuni no Seifukusha: Maou wa Sekai wo Seifukusuru Youdesu","avatar":"https://mangadex.org/covers/89bcfe0b-caa3-4d1b-9679-139b44a0b505/7bcd3a6d-ffbc-403d-abe4-ca53fe874c50.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Ongoing","tags":["Reincarnation,Action,Isekai,Fantasy,Adaptation"],"nutshell":"Never having known the warmth of family, he was reborn in another world. Named Yuri, he is doted on by his parents and lives a new life in peace – as it should be. However, the country where Yuri and the others live is threatened by the “other humans” who dominate the vast expanse of the continent and is in danger of dying. Yuri and his family can’t stay out of it and are caught in the middle of the war… The Knights' House, the sword of the kingdom that wields a lance and kakedori birds. The death of his uncle, who was the leader of the Hovu family, brings Yuri’s father back to the world of knights, who had left the house to hate killing each other. Yuri is forced to attend the Knights’ Academy, where knights are trained, and the encounter there will drastically change the fate of Yuri and the kingdom. This is the story of a man who fights for the people he loves and later became known throughout the world as the “Demon King.”"},{"name":" Isekai De Uwamae Hanete Ikiteiku ~Saisei Mahotsukai No Yuru Fuwa Jinzai Haken Seikatsu~","avatar":"https://mangadex.org/covers/89bf0886-8596-4f49-a045-7415608661d9/592fabcd-1471-4695-9213-0a9b8834b8e5.jpg.256.jpg","country":"Japanese","stat":"7.62","status":"Ongoing","tags":["Reincarnation,Comedy,Isekai,Drama,Fantasy,Monster Girls,Slice of Life,Adaptation"],"nutshell":"A company drone who died from overworking was reincarnated as Sawadi, the third son of a merchant in a different world.\nHis cheat skill is restoration magic and support magic. With these cheat skills, he came up with a new business model where he used his restoration magic to cure cheap slaves and made them earn money for him.\nAlthough his earnings are steadily increasing, he also has to suffer the consequence of getting his workload also increased... Will Sawadi ever be able to live leisurely without working?\nThe beginning of this lazy and relaxing fantasy, is starting here!\n\n(JP) Web Novel  Light Novel"},{"name":" M Collection","avatar":"https://mangadex.org/covers/89c4d795-b5ec-481a-867c-efc8b7c8775c/94c8f8e9-fb61-4ef2-ae4c-3d19b71dd5f3.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Monsters,Ghosts,Comedy,Anthology,Zombies,Horror,Supernatural"],"nutshell":"This tongue-in-cheek semi-autobiography follows the absurdly gruesome adventures of a lonely boy and his singularly crazed family. His escape from the madness that surrounds him is his collection of pickled animal and human body parts, to which he adds as one family member after another meet with a grotesque and sometimes terrifyingly funny death... (Source: AniList)"},{"name":" Super Brain Silver Wolf","avatar":"https://mangadex.org/covers/89c8532a-a84c-4342-af91-c2d5171894a5/3f099e84-ab7c-4471-80db-ea2f2665ee7f.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Action,Animals,Adventure"],"nutshell":"Fuwa Kosuke is a very timid and unassuming junior high school student. His parents died when he was young so he lives with his father's friend Kobayakawa, a professor of archaeology, along with his daughter Saeko Kobayakawa, who is also Kosuke's homeroom teacher. One day Kosuke is critically injured when he is hit by a car and killed by a thief who breaks into the house. When everyone is convinced that he is dead, Kosuke's brainwaves begin to show signs of abnormality and his body shows an amazing and instantaneous recovery. While Kosuke's change was instantaneous, and all but his miraculous recovery seemed to be due to his imagination, the professor was the only one who couldn't help but worry about Kosuke. He had seen the 'silver-haired Kosuke' nine years ago. The silver-haired Kosuke has a super brain and senses that make it hard to believe that he is a child. He has discovered that his father was killed in a fake accident and that his assistant, Kuchisaki, was responsible for the accident, and he sentenced him to death by fire.\nKosuke and Saeko go to the ruins of a school event, and the professor, who has been accompanying them to the event, runs into a thief who has stolen the materials from their house, and is trapped in a trap that he has inadvertently set. He becomes the silver-haired Kosuke again and begins to solve the mystery of the ruins. From then on, the Kobayakawa family is caught up in a battle between many organizations that are trying to obtain the secrets of the ancient ruins. Silver-haired Kosuke' becomes known as 'Silver Wolf' in the midst of this battle, and this leads to a battle with the Lorenz Foundation, the child prodigy organization that killed Kosuke's father.\nAt the same time, Kosuke's own body is also affected by the imbalance between \"Silver Wolf\" and \"Ordinary Kosuke\". Kosuke's own body cannot keep up with the silver-haired Kosuke's abilities, and this ultimately results in the overworking of his body and brain, reducing his life span. The Lorenz Foundation then launches its final operation. They plan to revive the super-ancient final weapon and exterminate the human race. Kosuke rides to the Foundation's home base to save his friends and defeat the Lord of the Foundation, albeit at a cost. When all is said and done, the silver-haired Kosuke falls into an eternal sleep with no end in sight. But once again, when his loved ones are in danger, Kosuke's silver hair will shine again."},{"name":" Oku no Konna Tsuitachi","avatar":"https://mangadex.org/covers/89cac870-d139-4a9d-9f09-a24765552953/69dccfc2-0452-455a-9abf-d95333c9fc0c.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":"A forest orc… that wants to ger along with humans!?\nMeet Gordo, an orc that, dispite his race, struggles to correct the rep of his people and get along with the humans"},{"name":" Itoshi no Mirai-kun","avatar":"https://mangadex.org/covers/89cf905d-0359-4b3e-8410-603c906cb347/c716abe6-bbfc-457e-b5ad-9e236702d8d0.jpg.256.jpg","country":"Japanese","stat":"7.61","status":"Completed","tags":["Boys' Love,Drama,School Life"],"nutshell":"Shin Mirai, no matter how many people you have encountered, you will still end up with the one who, no matter what, will never betray you."},{"name":" Jojo's Bizarre Adventure - Pearls are born in the deep sea (doujinshi)","avatar":"https://mangadex.org/covers/89d646b3-aa8f-4ed1-a972-9f712f9134b9/175f3107-4de5-4f19-823e-5ab9e9fa4ad2.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Boys' Love,Drama,Fantasy"],"nutshell":"Jotaro Kujo x Noriaki Kakyoin"},{"name":" Wakeari Desuga Amasaha Gokujo Desu","avatar":"https://mangadex.org/covers/89da9f5b-1564-47d3-b8ab-aa3d2dcb085c/1ba45d78-8703-4c45-98f8-1f2b118994f4.png.256.jpg","country":"Japanese","stat":"8.09","status":"Ongoing","tags":["Romance"],"nutshell":"She's a farmer in the countryside. On top of that, being 175cm tall places her outside the standards of most boys. Although Koharu still hasn't experienced love at the age of twenty-eight, it's not something she regrets. The most important thing to her is the farm left over from her late grandfather. Yet... Sakuma-kun protects her, shields her, and gives her hugs when she needs them... But she's not used to being treated as a woman, so she doesn't know how to react.  However, his kindness is still endlessly sweet..."},{"name":" Koi wa Kakuzatou 5-tsu de Dekite Iru","avatar":"https://mangadex.org/covers/89dad8fc-dc58-4413-9d54-2f543e7360c0/d72212a9-9a9a-4aec-818e-7ee24380db4c.png.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Shimizu Kaname lost his parents and looked for a job, then was accepted in an accounting company. When the company manager, Kawakami Shinobu, offered him to live in his house, he agreed since he had nowhere else to go. Manager Shinobu was great at work but very bad around the house. Kaname didn't mind helping with house chores, but the main reason that Shinobu offered the place was because Kaname reminded him of his late brother, Makoto. Would Kaname be living under Makoto's shadow? And what happened between the brothers in the past?"},{"name":" Uso Tsurezure","avatar":"https://mangadex.org/covers/89db77e5-df02-4ae6-95fc-8fc37070072c/508c98a4-87b6-429e-95c1-df3df468dd99.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["School Life"],"nutshell":"Once upon a time, there was a boy who was bullied by his peers because of his honest, straightforward personality. This boy was befriended by a brother-and-sister duo who vowed to be his friends forever. Unfortunately, the boy's family moves away, leading to their fledgling bond being severed.\nYears later, the honest boy has found the perfect way to make 'friends,' be admired by students and teachers alike, and avoid being picked on: maintaining a false personality as the \"School Prince\" while carefully hiding his quarrelsome, devil-may-care attitude from the public eye. But his peaceful - albeit mind-numbingly boring and somewhat lonely - days are thrown completely out-of-whack when a pair of twins transfers into his school."},{"name":" Ekijin no Karte","avatar":"https://mangadex.org/covers/89df8f8c-3733-4e33-9abf-db3f8a87419f/2e380305-2589-4acd-83d2-6bcf37b212aa.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Sci-Fi,Action,Military,Medical,Web Comic"],"nutshell":"Ekijin (God of Pestilence) Syndrome is a disease that manifests paranormal abilities in an individual that eventually leads to death. The cause is completely unknown and the only remedy is symptomatic therapy. Your family, friends, or even you can be suddenly infected with that disease and become the grim reaper itself. However, there are people who resist and fight against that hopeless disease. They are the Treatment Execution Organization's specialty division, \"Ekijin Corps.\"\nThough those within the unit are infected by the disease themselves, they wield their paranormal abilities as weapons and put down their lives to rescue the infected. In order to protect the lives in front of them and to win against the disease that will undoubtedly take them in the future, the doctors will fight until the end."},{"name":" Sutemi no Koubousen","avatar":"https://mangadex.org/covers/89e1a95d-0082-45ad-ad5b-486c14c20200/16ce53b7-6c20-45b4-b83a-caa88cbe9f03.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Boys' Love,Military"],"nutshell":"A pure love story about a dependable senior self-defense officer and an obedient boy.\nMamoru, a young self-defense officer, has always been in love with his senior, Akutagawa, who helped him when he was in high school. Mamoru, who was assigned to the same base as Akutagawa, is in charge of his long-awaited flight. In high school, Mamoru regretted not being able to reveal his love, expressed his love for Akutagawa straightforwardly, saying, \"I’m a proper adult now, so wake up!\" Still, Mamoru keeps on attacking without mercy, but …?"},{"name":" Babylonia no Shishi","avatar":"https://mangadex.org/covers/89e35294-9601-4e4f-b8ac-3672818eaa7f/1a707fef-33f5-4d63-bf01-47b954d5de1b.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Romance,Adventure,Drama,Fantasy,Supernatural"],"nutshell":"Shin and Leona are childhood friends who are dating each other in high school. On a school field trip in France, they encounter a misadventure through a distortion in timespace bringing them back in time to the ancient city of Babylonia. Leona becomes the goddess Ishtar, and Shin becomes the beastmaster, Enkidu. In a story loosely based off \"The Epic Tale of Gilgamesh\", Shin (Enkidu) seeks to bring Leona (Ishtar) back to the normal world and in the process helps Gilgamesh in his quest towards immortality."},{"name":" Today I Become A Star","avatar":"https://mangadex.org/covers/89e90a95-f5e3-4cf2-8ccd-82fbdd91c9b1/3d124400-a34f-4ca4-8502-fabf0e2f6543.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.84","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Crossdressing,Web Comic,Slice of Life,Full Color"],"nutshell":"Taize only wants to live a quiet and peaceful life, but he has been forced to become his elder sister, Taiya, who has been a professional idol for several years. He originally thought that pretending to be his sister would be over quickly and he wouldn't have to think about it again, but who would predict his university life would be stirred up by this? how will his story layout?"}]