[{"name":" Monster Soul","avatar":"https://mangadex.org/covers/9f286c34-90aa-40fa-acaa-c45f75a8af07/798c9b93-d9c5-4788-ad1c-e0a2e65d1de8.jpg.256.jpg","country":"Japanese","stat":"7.58","status":"Completed","tags":["Action,Comedy,Fantasy"],"nutshell":"The tale of Monster Soul takes place in Elfenland, which is inhabited by both humans and monsters. The main characters are a group of monsters called the Black Airs. The Black Airs is recorded as the strongest group of the monster forces in the great war between the humans and monsters."},{"name":" Pantser Princess","avatar":"https://mangadex.org/covers/9f29e9ce-cb46-4ed6-8c7e-c01491362a9c/74b73c2c-6baa-4d49-9476-0fde495c3546.jpg.256.jpg","country":"Japanese","stat":"7.72","status":"Completed","tags":["Action,Comedy,Girls' Love,Fantasy"],"nutshell":"The Kingdom of Commons is a continent located in North Arcadia. Mitia Commons is the princess of the kingdom, and she is so extremely shy that she has barely ever ventured outside of the castle. Now, out of the blur, her mother, the queen, declares that she must go through a ritual in order to become qualified for the throne. The ritual requires that Mitia to collect four powerful stones to complete a magical staff. By doing so, she will overcome her extreme shyness. She embarks on an adventure with her friend and bodyguard, Atty and Sasha, in order to search for these four stones."},{"name":" Attack!!","avatar":"https://mangadex.org/covers/9f2b4670-18bb-4994-bcdb-4a62b29ddd09/7ca63c07-279b-4ae2-8157-531f8e92b26e.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Sports,School Life"],"nutshell":"Harutaka Kato, 1st grade students in Kakegawa high school with the extraordinary ability to jump. After look at his ability, Maiko the volleyball club manager's kept urging him to join as. Finally, Harutaka persuaded to enter the club. However, volleyball club had another star, Yuta Kaneko! Harutaka upset and trying to show off. But, all of his smash managed to block by Yuta!! So, what will Harutaka do!?"},{"name":" I Tried to Turn Down a Confession from a Beautiful Girl","avatar":"https://mangadex.org/covers/9f2e31b1-55d2-4d51-8e3d-92d3413a8071/f1b64329-d2e9-400e-853b-c7e891c817ef.jpg.256.jpg","country":"Japanese","stat":"7.36","status":"Completed","tags":["Oneshot,Comedy,School Life,Web Comic,Slice of Life"],"nutshell":""},{"name":" Model","avatar":"https://mangadex.org/covers/9f2e53be-6a29-459f-8a97-f0e945f1ab5a/d6aa0d75-553c-42c5-ab97-75bf806e962e.jpg.256.jpg","country":"Korean","stat":"8.02","status":"Completed","tags":["Romance,Drama,Vampires,Supernatural,Mystery"],"nutshell":"Jae is a Korean student who came to Europe to study art. Things aren't going her way, but she's determined to make it. One night, her friend Melissa brings a drunk guy to her apartment and asks if he can stay there for the night. Jae doesn't like it, but agrees. That night she has a dream that the drunk guy drinks her blood… which, of course, turns out NOT to be a dream.\nJae is surprisingly unafraid of the vampire, Michael, and starts to paint his portrait. The two strike an unusual deal: if Jae allows the vampire to feed on her, he will pose for her. His beauty and alluring preternatural energy could be exactly what Jae needs to finally succeed as a painter."},{"name":" December Rain","avatar":"https://mangadex.org/covers/9f2f5e03-8601-4683-b507-7635f58b6f66/c1f72e03-8fe8-45ac-a061-463a9f81f9cc.jpg.256.jpg","country":"Korean","stat":"8.14","status":"Completed","tags":["Long Strip,Romance,Boys' Love,Drama,Web Comic,Full Color,Tragedy"],"nutshell":"Fresh out of the army, Suchae decides to take some time off and travel around the country by himself. On the first day of his trip, he spots a guy who looks totally his type at a rundown bus terminal. The only problem is, it?s the same guy who was jerking off in the bathroom 5 minutes ago. Despite the possibility of him being a creep, however, Suchae is drawn to the mysterious stranger. He finds everything about him…arousing. Who is this stranger? And why is he on the road?"},{"name":" Go Nagai's Samurai World","avatar":"https://mangadex.org/covers/9f313df0-8582-4a9b-95cc-d86eac105068/18399a2e-e264-4827-ae16-02279bf20ae4.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sci-Fi,Action,Demons,Ninja,Sports,Martial Arts,Samurai,Magic,Military,Drama,Fantasy,Aliens,Supernatural"],"nutshell":"This is Nagai Go's period drama world, a total of 10 volumes of Science Fiction stories inspired mainly from the Tatsukawa Book Collection. Psychic wars unfold in the world of the Warring States period as the heroes of stories make full use of sorcery, ninjutsu, and supernatural powers!"},{"name":" My Broken Vampire","avatar":"https://mangadex.org/covers/9f341f3d-f8d2-4a95-ace6-82d69c2f4b49/d089cd5d-ecf1-4ffc-a7ba-065235f226e7.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Psychological,Romance,Drama,Vampires,Supernatural"],"nutshell":"Itsuki is a female college student who has lived desperately with her younger brother and sister after their parents abandoned them. It was Yo-chan, a young boy who first took care of her after she had been abused and abandoned.\"Itsuki-chan will be my princess.\" Wait a second!? The meal is mouth-to-mouth!? But I've never even had a lover..."},{"name":" Her","avatar":"https://mangadex.org/covers/9f3de5f1-3a4f-4608-9e3e-1d3979fcdee2/f792897f-7fc5-4e4d-9793-55f88309714a.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"HER is a series of character portraits, loosely strung together by everyday circumstances.\nThe story begins with a woman who wants to be loveable - and loved - and who has a fixation on shoes. Her hairdresser's fear of the future is the subject of the second chapter. A schoolgirl whose hair she cuts sees her older female neighbor kissing her female lover goodbye. In the past, the neighbor had a difficult relationship with her mother. The neighbor's lover was rejected by her first love. The couple sitting next to them at the cafe have their own issues."},{"name":" Ingress GO","avatar":"https://mangadex.org/covers/9f4a619a-9f5d-484b-93b4-d822a505c573/c8b2655c-ebce-4610-a8f1-2e0666594708.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Long Strip,Comedy,Drama,Fantasy,Slice of Life"],"nutshell":"A webcomic about Ingress players. Inspired by true stories. Full of XM, drama and smurf tears. <br />"},{"name":" Moichido Kare to","avatar":"https://mangadex.org/covers/9f4eda54-7505-4f0c-9761-90b8266443f0/54bdaee3-db1e-4b66-8b69-0791e4e5fbba.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Office Workers"],"nutshell":"Eight years after they suddenly broke up, Rise Higano ran into her first love Shizuki Tachibana once again. After saving her from a stalker, Shizuki confessed that he still has feelings for Rise. Now that they're both adults, can they make it work this time?"},{"name":" Hard & Loose: Shiritsu Tantei Toki Shouzou Trouble Note","avatar":"https://mangadex.org/covers/9f4f3861-9c2d-40ef-bfe3-8d5f02dba31d/5cbecaa9-f89f-4169-a9de-1b0ddce0c4c0.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Action,Drama,Mystery"],"nutshell":"A detective thriller in which former boxer Shozo is thrown into a web of intrigue when he picks up a ringing phone in a room whose occupant he is supposed to be following."},{"name":" Raising a Human cat","avatar":"https://mangadex.org/covers/9f51967a-8ca8-4382-88ac-1eadadf3642c/fd011c4b-3d5f-487b-bcca-2d8fc5fa4348.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.88","status":"Ongoing","tags":["Animals,Long Strip,Romance,Comedy,Boys' Love,Web Comic,Full Color"],"nutshell":"The story of how to raise a humat cat."},{"name":" Gao Chang and Rhubarb","avatar":"https://mangadex.org/covers/9f5b5ca6-4556-4114-ad23-e471e2491a08/afc84fb4-9ed1-4a05-bca6-d203d248ff86.png.256.jpg","country":"Chinese (Simplified)","stat":"7.61","status":"Ongoing","tags":["Official Colored,Long Strip,Boys' Love,Full Color"],"nutshell":"As Gao Chang was dying, he was full of guilt and regret for having abandoned his dog. After Gao Chang got the chance to relive his life, he decided that this time he would take care of his dog Rhubarb, only to then discover that Rhubarb was the descendant of celestial canines! What kind of perks come with being buddies with a divine dog? Cultivation, naturally. But Rhubarb says that his people's cultivation methods were not to be taught to outsiders, and if Gao Chang wanted to learn, then they would first have to get married."},{"name":" Tiananmen Square","avatar":"https://mangadex.org/covers/9f5cebe0-25c3-4f5f-a470-1aeb0266f74c/c65eef8b-8009-4f98-8607-c3cd9482c5fa.jpg.256.jpg","country":"Chinese (Traditional)","stat":"8.10","status":"Completed","tags":["Historical,Crime,Military,Police,Tragedy"],"nutshell":"The world's first comic masterpiece to fully illustrate the Tiananmen Square Incident! The intensity is comparable to that of \"The Silent Fleet\"! If you love military, history and care about the future, you can't miss it! In June 1989, Morrell, an American journalist, was in Tiananmen Square looking for subjects and mingling with the students in order to cover this once-in-a-lifetime student event in Chinese history. However, on June 4, the square, which was full of forward-looking energy, turned into a bloody and brutal killing field ……! Professors who were baptized by the Cultural Revolution, brothers who were guards at the square and protesting students, top Chinese officials such as Zhao Ziyang, Deng Xiaoping, Yao Yilin and Li Peng, as well as the U.S. government, Taiwan and the world, use a mixture of fiction and reality, together with rigorous historical evidence, to portray the premature arrival of the democratic wave in China from the perspective of all walks of life, the coldest summer of 1989. It has been 17 years since the Tiananmen Square Incident, which has had a huge impact on democratic thinking in modern China and which cannot be ignored in the analysis of the Chinese economy, took place in 1989. Although many written records have been published, no pictorial works have ever been created with this event as the main axis. Since the creators in Hong Kong, China, are unable to create such a theme due to political factors, and the creators in the United States and Japan are not clear about the circumstances, we are the only ones left in the world who can challenge the theme of \"Tiananmen Incident\". Therefore, we tried to reinterpret the \"Tiananmen Incident\", an event that brought a great impact to China and the world, by using the most easily understood and impressive comic book technique. The book is divided into four chapters, each presenting a comprehensive and objective analysis of the Tiananmen Incident in four directions: general, student, senior government, and world. The detailed and rigorous historical and military examinations, as well as the complete timeline of the June Fourth Incident in the appendix at the end of the book, make this book highly valuable as a source of information. It is a must-read for understanding modern China. (MTL'd description)\nRetail: Google Play"},{"name":" Kyou, Sekai Ichi no Kokuhaku wo.","avatar":"https://mangadex.org/covers/9f5d4d26-df56-4c79-ba90-a69338da4219/165049af-dd2a-478a-9cb0-0f100e91b005.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Anthology,School Life"],"nutshell":"From Batoto Scans :\nA ‘confession’ is that moment when you become special to the person you love...\n“It’s not a Special Confession” - Valentine's Day with a classmate.\n“Deciding not to Confess” - I decided not to confess because I want to be with you.\n“The End of Summer and the Missing Confession” - Reuniting with the person who confessed to me a long time ago.\n“The Confession was made after a Happy Ending” - I confessed my feelings for the third time, and we ended up going out, but...\nA collection of 4 short stories about pure confessions from each season!\nNote: The series was first published under the title \"Kimi ga Suki tte Iitai\" in Dessert Pink."},{"name":" Kowamochi-kun wa Neko ni Muchuu","avatar":"https://mangadex.org/covers/9f6bef38-6155-45ad-a36b-34a9c797f72b/0ca02a8a-2e0d-4b00-94de-b4c19ca7e12b.png.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Animals,Romance,Drama,Supernatural"],"nutshell":"Yuno Shiraishi was worried about her relationship with her senior who goes to the same university. He doesn't wear condom when they are having sex. She tried to talk about it with him at a pub, but he said, \"Then, do you want to break up?\" At that moment, a tough-looking handsome waiter who was watching the whole story throws beer on him, and the two of them are kicked out of the pub...\nYuno, who is at loss, meet a white cat when she goes to a shrine. \"If you want to get out of your situation, what about becoming a cat?\" Yuno, who has turned into a cat crying in surprise, appears in front of the pub waiter (Takashi). She was afraid that he might be a scary person, but he clumsily gently picks up Yuno (the cat) and takes her home..."},{"name":" 1925","avatar":"https://mangadex.org/covers/9f78ada7-5a87-48b9-b82e-7d625779c1da/1d1b6008-cd52-414d-86f3-d3e81ccb2ad6.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Hiatus","tags":["Historical"],"nutshell":"Tokyo in the Taisho Era, when Japan made a strong move towards modernization. Len, the eldest son of the Kagurazaka family, wants nothing more than to prevent his sister, Rin, from entering an arranged marriage. As a last resort, he goes in search of the urban legend of a ghost train that will grant any wish. Not only does he find it, but in order to grant his wish, the train's conductor, Miku, charges him an incredibly high amount of money…?! Chiho, the artist behind the original visuals, makes her manga debut in this manga adaptation of the song known for its mournful melody, atmosphere, and fun word-play!!"},{"name":" Jupiter","avatar":"https://mangadex.org/covers/9f78bbc6-381b-405d-84cb-1f384e10bd7a/e85136b6-f7d9-4d53-a97d-1c1432b9343c.jpg.256.jpg","country":"Indonesian","stat":"7.98","status":"Ongoing","tags":["Psychological,Drama,Slice of Life"],"nutshell":"It's been 11 years since Levan tried to ignore his alter ego. As time goes by, he then realizes that there are weird things that revolved around his alter ego. Will Levan be able to live like a normal person daily?"},{"name":" BaBaBylon","avatar":"https://mangadex.org/covers/9f7f5f46-ac4b-4db8-829f-2ffdc720453e/dadc1858-5fab-4c42-86c9-5186806c5353.jpg.256.jpg","country":"English","stat":"7.84","status":"Completed","tags":["Oneshot,Comedy,Martial Arts,Adventure,Fantasy"],"nutshell":"There was a time when the children of the God King walked upon this Earth. This ended after the events of the Great Flood, which banished the gods back into the heavens. However, their half-human descendants continued to live on the mortal plane.\nWe find ourselves in Ancient Mesopotamia. Ninutu, descendant of the god Ninurta, meets a girl from a faraway land, on her way to meet the legendary King Nimrod. She hopes to convince him to end his occupation of her homeland. Impelled by this, Ninutu goes to face her oldest royal nemesis once and for all."},{"name":" Katekyo Hitman Reborn! dj - Hokenshitsu de Jugyouchuu!","avatar":"https://mangadex.org/covers/9f82cc29-cf72-4f20-bf28-469a57a18067/11436c77-c233-44d3-8d62-21f194c01341.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Boys' Love"],"nutshell":"Pairing: Hibari x Tsuna"},{"name":" Stealth Symphony","avatar":"https://mangadex.org/covers/9f84e0a7-7bcb-4146-a595-280cb56e7eb3/343e12a7-868f-4cbb-b331-c63d7fa7a974.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Action,Comedy,Adventure,Drama,Fantasy,Supernatural,Mystery,Tragedy"],"nutshell":"In a world where elves, dwarves, and invisible dragons live in harmony inside a metropolitan city, Sieg sets out to find someone or something that can unleash the curse that he carries on his back. As he attempts to survive in the city of Jinbocho, a city filled with fantastic secrets and organizations, he encounters many powerful individuals who set out to either destroy him or save him. Will Sieg be able to discover the true secret of his curse, or will it lead him to his own demise?\nVolume 1 contains the original one-shot as a prologue chapter."},{"name":" Mage x Warrior","avatar":"https://mangadex.org/covers/9f86e83e-128f-4af7-8f98-ec715a9c7ae9/5f2316e8-75c6-411f-b899-32b6005c0386.png.256.jpg","country":"Japanese","stat":"7.28","status":"Completed","tags":["Oneshot,Comedy,Fantasy,Web Comic,Slice of Life,Full Color"],"nutshell":""},{"name":" Naruto: Road to Ninja","avatar":"https://mangadex.org/covers/9f9780ca-68e1-472b-a6c5-caa8156b5d41/d3615664-6731-4c7d-a8fa-9036adc0a3a3.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Oneshot,Action,Comedy,Adventure,Fantasy"],"nutshell":"ROAD TO NINJA NARUTO THE MOVIE The new shocking movie Naruto fans from all over the world have been waiting for. MOVIE 9: ROAD TO NARUTO THE MOVIE A special one-shot connected to the movie!? Read the manga, watch the movie and find the connections!!"},{"name":" Barairo Mitsubachi","avatar":"https://mangadex.org/covers/9f98be37-eb93-4f5f-a1b5-2f11c9b26f11/ff96507f-bd74-4e39-93ec-f370fb376053.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Romance,Boys' Love,School Life"],"nutshell":"After the untimely death of his parents, Tachibana Academy's chancellor takes Aoi under his wing. Though Aoi is now a student there, he still hasn't met the chancellor. Meanwhile, Aoi is being pursued by his bully teacher, Sakurai, and falls in love with him! Is Sakurai the chancellor? Aoi always wonders since Sakurai wears the same rose scent as the chancellor. Will this honeybee be able to resist such a sweet trap?"},{"name":" Six Paths Nightmare Palace","avatar":"https://mangadex.org/covers/9f9a2671-d407-4adb-94dc-73faf4d5cfce/f63afe37-2f62-477b-a642-901c064f5912.png.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Historical,Action,Martial Arts,Fantasy"],"nutshell":"Zhong Shen is a young member of the Zhong family tasked with subduing demons roaming the human realm. However, he is only an illegitimate disciple who can only cultivate at the lowest level. In a world on the brink of war, Shen must prepare himself to fulfill his mother's last wish"},{"name":" Lord of the Abyss","avatar":"https://mangadex.org/covers/9fa25c0d-487c-445e-8890-287871e47d04/cdc3c960-9f68-4a45-81db-aad72cc9804c.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Ongoing","tags":["Action,Long Strip,Fantasy,Supernatural"],"nutshell":"Jiang Mingyu obtained mysterious powers in an accident, and began his journey to level up his Abyss System by becoming a Player, hoping to make a better life for his family. As a new Player, he faced many challenges, and he found that it was no accident, but an arrangement ordained by fate...\n(Source: Tencent, translated)"},{"name":" Kagerou Days Official Anthology Comic -REMEMBER-","avatar":"https://mangadex.org/covers/9fa2978a-66be-41be-93c8-3f08ba6767d3/6c61787e-b6f0-4e94-b070-bd6975628b1e.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Ongoing","tags":["Comedy,Anthology,Drama"],"nutshell":"An anthology of Kagerou Daze remember themed stories by various authors."},{"name":" Gori to Naru no XO na Kankei","avatar":"https://mangadex.org/covers/9faedb6b-4a2c-4d8b-add6-dc21c3cc4bed/6da626fd-d789-4fc9-85ca-6356b0de0cfb.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"…who'd want to date a gorilla woman like you, huh?\nOnce again the strong Gouda Aya got rejected, but she still believes in a destined meeting… though her chance encounter with the handsome Ichinose Kouki turns out to be a sweet trap!?"},{"name":" Tsugumomo - Digital Colored Comics","avatar":"https://mangadex.org/covers/9fb4e274-ede7-4007-b975-51d26fe11f7e/32abc9c0-e6d0-4aaa-bc55-cc8358f17686.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Ongoing","tags":["Loli,Official Colored,Action,Demons,Romance,Comedy,Harem,School Life,Monster Girls,Shota,Supernatural,Full Color"],"nutshell":"Kazuya Kagami never goes anywhere without the precious “Sakura Obi” his mother gave him. One day a beautiful, kimono-clad girl named Kiriha appeared before him. Kiriha naturally began to live with Kazuya in his room. Then there’s Chisato, Kazuya’s childhood friend with glasses and a ponytail, who meddles in his affairs. Soon there’s also an overprotective older sister who seems to want to take baths with him. Jumble in a huge-chested priestess, a good-looking sorceress named Kokuyoura, beautiful women, and hot girls, and Kazuya’s happy, embarrassing, confusing life begins…"},{"name":" Say Hello to Black Jack","avatar":"https://mangadex.org/covers/9fca3c19-ac41-4ebf-8735-f4e3becc2b3e/1dfc144a-e0db-45d5-8be0-2cf0f5e199d2.jpg.256.jpg","country":"Japanese","stat":"8.48","status":"Completed","tags":["Psychological,Drama,Medical,Slice of Life"],"nutshell":"Saitou is a young doctor who just graduated. Starting his career as a doctor he finds there is a lot more to this profession than one would think. An intense drama about the dark side of the medical world.\nHas a continuation that was published by Shogakukan instead of Kodansha called Shin Black Jack ni Yoroshiku. In 2012, Shuho Sato declared this title free from copyright protection."},{"name":" You Ye Qi Tan","avatar":"https://mangadex.org/covers/9fd0a6ae-87af-4fc1-b828-01979edd7e9c/cc92bbfc-26c5-4032-9139-bb24b664007a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.91","status":"Ongoing","tags":["Comedy,Supernatural"],"nutshell":"Raws: http://ac.qq.com/Comic/comicInfo/id/529617"}]