[{"name":" Abashiri Family","avatar":"https://mangadex.org/covers/31d175c3-8bc4-4d5b-93b1-78c1763225c6/fa8be6ed-7ec1-4f8f-a795-5c9617f07c94.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Thriller,Sci-Fi,Action,Comedy,Crime,Samurai,Mafia,Adventure,Horror,Fantasy,Delinquents"],"nutshell":"The Abashiri family has just moved into town. And they're the meanest, toughest, roughest bunch you're ever going to meet. From the grandfather to the daughter to the smallest child. And they take true glee from what they do - from kicking the asses of the town toughs, to kicking a family out of their home, to engineering prison breaks, to maiming cops. No one comes tougher.\nAnd oh yes, it's a comedy. Half serious and half just total nonsense gag comedy."},{"name":" Shigoite! Gina-chan","avatar":"https://mangadex.org/covers/31d244a7-4e35-467d-b4d6-127f42142c7f/aa9aac5a-9ed5-440e-8237-a0985d899618.png.256.jpg","country":"Japanese","stat":"7.64","status":"Completed","tags":["Oneshot,Romance,Comedy,Magic,Monster Girls,Slice of Life,Supernatural"],"nutshell":"A loser buys a magic lamp."},{"name":" First Love Complex","avatar":"https://mangadex.org/covers/31d27eb8-2198-4ab0-9a74-0d71131e27af/ffef7b33-784c-43d7-8506-65f844fd9067.png.256.jpg","country":"Korean","stat":"8.06","status":"Ongoing","tags":["Romance,Boys' Love,Drama,School Life,Web Comic"],"nutshell":"Yoo-chan is a young man who can't get over his boyfriend from high school, who was his first love. Ever since Yoo-chan dated people that resembled his ex, but every time the relationship failed. When Yoo-chan spends a night with Namhyun, whom he thought opposite of his ex, he gets a surprise!\n(Source: INKR Comics)"},{"name":" Rebirth of the Urban Immortal Cultivator","avatar":"https://mangadex.org/covers/31d67518-dd05-46d2-9d59-4ba730a23a10/1f139562-1ad2-4004-8637-e52064f6204f.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.37","status":"Ongoing","tags":["Time Travel,Action,Martial Arts,Adventure,Wuxia,School Life,Web Comic,Supernatural,Full Color"],"nutshell":"Chen Fan died in the midst of divine tribulation, having reached the pinnacle of the cultivation world in less than 500 years. Somehow, despite the loss of his cultivation base, he was able to return to his youth as a high school student living on Earth. He decided to once again tread the path to immortality, armed with the knowledge he had gathered in his past life, to overwrite his past mistakes, remove his lingering regrets, and set a firm spiritual foundation that will guarantee success in his inevitable attempt to once again ascend to another plane of existence."},{"name":" Torikago Gakkyuu","avatar":"https://mangadex.org/covers/31db3ae1-3f3d-4127-a240-d560590f795b/35de6d32-ba22-4d17-9dc6-5bd5d1647c04.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Psychological,School Life,Supernatural,Mystery"],"nutshell":"Mikage has just arrived at his a new school. But why can't he remember anything about his life before the moment he set foot in the school grounds? His classmates, while appearing ordinary enough, all possess strange habits and weird personalities.\nSoon after, our bewildered protagonist is summoned by one of his teachers, who claims that Mikage has the power to influence a 'parallel universe' - and that his interactions with his classmates will decide the fates of the inhabitants of that universe. Though initially fascinated, he soon finds out that these 'powers' do not bode well for his new school life…\nNote: published in GFantasy, a shounen magazine."},{"name":" Kagekuri Kitan","avatar":"https://mangadex.org/covers/31e0ca21-7f54-4659-89bc-233d1dbd3474/87173e11-429e-4ee2-b840-cc4aeb55390a.jpg.256.jpg","country":"Japanese","stat":"7.41","status":"Completed","tags":["Loli,Action,Ninja,Comedy,Martial Arts,Drama,School Life,Supernatural"],"nutshell":"Hajime has lived in fear of the monsters lurking in the shadows that only he can see. But after meeting a mysterious shadow girl who pledges to help him face his fears, he's dragged into the secret world of ninjas."},{"name":" Tenbin wa Hana to Asobu","avatar":"https://mangadex.org/covers/31e6d892-a90b-415c-b7ff-18a30e5e4697/36cb96c9-2840-41dc-8cc6-030b5aca652a.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Comedy,Crossdressing,Girls' Love,School Life,Vampires,Supernatural"],"nutshell":"Lotus Girls' Academy. A school whose aim is to educate young girls to be pure and modest. Youko is a new transfer student here, and immediately takes a liking to Shuu, who shows her around the school. However, Youko discovers a big secret about Shuu… she's a vampire! Youko then does her best to be the best friend she can be and help Shuu protect her secret… whether Shuu likes it or not! But how does Shuu really feel about Youko… and why does her blood taste so different? And to what lengths will Youko go to help Shuu?"},{"name":" Torikae Fuukaden","avatar":"https://mangadex.org/covers/31eb7e0a-9cfc-441c-af9b-deda00f08046/9dea8257-fbb7-437c-8192-cf30e61926c3.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Genderswap,Historical,Romance,Fantasy"],"nutshell":"Fukka, the daughter of the Inuiyama's lord, is determinate to do everything to help her father win the war and get him home safely. Because she's a girl she's not allowed to go to the battle field with him, but she hears that a certain \"war ghost\" called Byakkimaru has been seen near her town. The legend says that if you get Byakkimaru to join your side you will win the war. The little princess starts a trip in search of this ghost determined to save her clan."},{"name":" The Lurking Spirit","avatar":"https://mangadex.org/covers/31f2449c-8be7-4991-b46e-5e9a5a96eed0/e2eb1fe5-d0aa-4961-8137-d47933442e18.png.256.jpg","country":"Japanese","stat":"8.55","status":"Completed","tags":["Ghosts,Romance,Comedy,Drama,Web Comic,Slice of Life,Supernatural"],"nutshell":"O que é esse fantasma?"},{"name":" Tensai Megane ni Kime!","avatar":"https://mangadex.org/covers/31faa46b-cfd9-4bc7-9a06-4000dc305acf/3d9cc4b8-628d-4f06-a88e-eb429c297e92.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"My name is Aya Hojo, and I am a little foolish high school student. My boyfriend, Kei Saeki, is the smartest and most handsome guy in school. A genius and a fool in love."},{"name":" Midnight Immortal","avatar":"https://mangadex.org/covers/31fab9fc-90f1-419c-a285-3f50d39871b1/7eb1c8eb-4403-4f68-8b22-446fb88c966f.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Action,Long Strip,Adventure"],"nutshell":""},{"name":" Ubawareta Kiss","avatar":"https://mangadex.org/covers/31fc5718-bbfe-43df-a793-c4d047ba6f34/58cd5132-22c7-45eb-a970-11a125cc9653.jpg.256.jpg","country":"Japanese","stat":"7.65","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"Riku likes her sensei but a mysterious young boy of her age who looks strikingly similar to him steals a kiss from her, how will the story of the \"Ubawareta Kiss\" unfold?"},{"name":" Children's Time","avatar":"https://mangadex.org/covers/31fcc71f-6e72-4f03-af8c-76ac2a5c6180/c198315b-50b6-4423-b291-5dbda0ea69f5.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"A continuation of Yuuta and Mayumi's story."},{"name":" Sore ga Kimi ni Naru","avatar":"https://mangadex.org/covers/320242ee-b9ef-4955-890b-7a2289663f6e/667c1da8-ead3-457f-935f-5194e1809595.png.256.jpg","country":"Japanese","stat":"7.42","status":"Completed","tags":["Romance,Girls' Love,Drama"],"nutshell":"Ch. 1-7 Main Story : All You -\n26 year old Amane is still getting over the bad breakup she had with a girl named Yuki back when she was in high school. One day, she bumps into a high school girl who looks exactly like Yuki and bursts out in tears. This high school girl, who is named You, takes Amane out for lunch to try and help her feel better. As the two grow closer to one another, feelings begin to stir in both of their hearts, but will they be able to overcome the burden Yuki has placed upon Amane?\nCh. 8 Extra : Black-Eyed Witch -\nAfter Satomi is confessed to by another girl, she rejects her because she's straight, and yet finds herself mesmerized by her eyes. When she gets too drunk at a party, the girl she rejected takes advantage of her…or does she?"},{"name":" Joifo","avatar":"https://mangadex.org/covers/3203975f-f8c9-4c37-801e-d8e3168f98c4/4ea704fe-33d5-4611-bfb4-ee47644bcc28.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"Yuu Iwabuchi has strict parents. She done everything they've asked of her including going to their preferred high school and giving up manga and cosplay. Iwabuchi meets a carefree young man named Yano who helps her rediscover her true self."},{"name":" I Refuse the Duke","avatar":"https://mangadex.org/covers/32041616-2588-41c3-a71c-831a961660fa/b6610777-ab99-4c6e-9e32-d9e1f77bdbe8.jpg.256.jpg","country":"Korean","stat":"7.10","status":"Hiatus","tags":["Reincarnation,Long Strip,Romance,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"I’ll accept your one condition.\nAidan Dalton worked hard, over the past seven years, to rise to the position of Head Servant under Duke Felix Berkeley. However, Aidan kept hidden the fact that she’s a woman and now finds it increasingly difficult to maintain her secret.\nJust when she's determined to quit her job a terrible incident occurs, and when she comes to, she sees the beautiful aristocrat Lady Gloria Middleton in the mirror?! Also, Gloria happens to be a marriage candidate for Felix but…\nBased on Original Webnovel by LEE Chae-yeong"},{"name":" Ojou-sama is Dead","avatar":"https://mangadex.org/covers/320cd1da-1426-4ac5-9259-07a8bcc4cdf6/e42edcc8-20bf-4731-92a2-8e25348d267f.png.256.jpg","country":"Japanese","stat":"7.42","status":"Completed","tags":["Oneshot,Comedy,Zombies,Drama,Slice of Life"],"nutshell":"A story set in the world of Stitch You Together by the author Kurihara Sakura"},{"name":" Blue Glass","avatar":"https://mangadex.org/covers/320f93d3-b3af-47f3-b0f6-43e88e26f613/3144b05a-a664-4ed2-8b36-92fc7f5deba1.jpg.256.jpg","country":"Korean","stat":"8.32","status":"Hiatus","tags":["Historical,Romance,Drama"],"nutshell":"You may know the story of Princess of Nakrang, but behind the scenes of the ancient Nakrang Kingdom's royal palace, unfolds the story of a different princess. The youngest princess of the Nakrang Kingdom, Seol is determined to pursue a different life from her sister Ran, who by unlucky fate, was persecuted by her father and brothers. The slave boy she rescued Miru, the odd-eyed Jamalta, and the one we know very well… The three men are in her fate."},{"name":" Locker de Oshioki H! ~ Do S na Senpai no Mitchaku Shido ~","avatar":"https://mangadex.org/covers/3210595b-348e-46bb-b739-2de0eaf8f3f5/675b613b-3a2e-4375-aad0-069668b458dc.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Romance,Comedy"],"nutshell":""},{"name":" Kakutou Bijin Wulong","avatar":"https://mangadex.org/covers/32137160-9af6-4645-8480-562e84f614c3/41d3451e-12ce-4647-a3ac-8fa39cb87eb1.png.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Action,Martial Arts"],"nutshell":"The lead character, Mao Ran, a person of Chinese origin born and raised in Japan, has been trained in the secret martial art of her family by her drunken lecherous grandfather. Her grandfather has promised her that he'll tell her what happened to her parents to encourage her to train and fight. Without her knowledge, her grandfather signs her up to participate in a televised martial arts competition between female martial artists known as \"Prime Mat\".\nSee AnimeNewsNetwork for the anime.\nWikipedia\nEnglish\nJapanese\nThe Doujinshi & Manga Lexicon\nVol. 0\nVol. 1\nVol. 2\nVol. 3\nVol. 4\nVol. 5\nVol. 6\nVol. 7\nVol. 8\nVol. 9\nVol. 10\nVol. 11\nVol. 12\nVol. 13\nVol. 14\nVol. 15\nVol. 16\nVol. 17\nVol. 18"},{"name":" Inarime","avatar":"https://mangadex.org/covers/32166dfb-c04a-44ab-884e-3cf13e5b7a67/491dfb4d-b90e-4413-a0fb-7093e1f7a2e2.jpg.256.jpg","country":"Italian","stat":"7.97","status":"Cancelled","tags":["Long Strip,Web Comic,Full Color"],"nutshell":"Ancient Gods and new battles; the unborn Typhon's seventh daughter and her incredible adventures trying to understand who she is and why the Gods of Olympus are so hostile toward human beings. Warn you to believe at who says that they're just \"myths\", they are more real than what you think, and they are among us."},{"name":" Celebrity Yuukoujouyaku","avatar":"https://mangadex.org/covers/3218d763-c906-4b12-b357-f440aab80a51/b96e2e11-a725-4be5-b3c8-cf2c4cb0506b.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Dumped after her high society boyfriend uses her, Chidori swears off rich boyfriends. One day, she was robbed, but the guys turned out to be none other than Yuu and Kikuya practicing their acting skills. Chidori is attracted to Kikuya, but a classmate tells her that Kikuya is very rich! Afraid of being hurt again, Chidori keeps a 'safe' distance from him…"},{"name":" Escape from High School Girls","avatar":"https://mangadex.org/covers/321c00bb-3522-4250-ab41-36cf9274c442/4f568f3d-f1c9-4ca8-9420-4ef496017982.jpg.256.jpg","country":"Japanese","stat":"7.64","status":"Completed","tags":["Oneshot,Comedy,Zombies,Drama,School Life,Horror,Slice of Life"],"nutshell":"What are a bunch of high school boys to do when their female classmates have turned into zombies? Hide? Run? Jump? Confess their love? See for yourself in Dowman Sayman's bizarre high school comedy!"},{"name":" Juuhan Shuttai!","avatar":"https://mangadex.org/covers/321c153e-3b39-4908-89d8-622fb6e8c813/c0fbccdb-f29a-4542-b412-eed3a278cf3c.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Ongoing","tags":["Award Winning,Comedy,Office Workers,Drama,Slice of Life"],"nutshell":"The manga focuses on the multiple branches of creating manga, and not just the creators. The editors, salesmen, advertisers, plate-makers, printers, distributors, and booksellers are all integral pieces to make a hit."},{"name":" Kimi wa, Nina Janai","avatar":"https://mangadex.org/covers/3225971b-272f-482f-9f8f-df2a4e466b27/726fe953-9f78-4d77-a1f0-9774a47205b5.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Ongoing","tags":["Romance,Slice of Life"],"nutshell":"The only solace for this young man, who has withdrawn into his own shell after a heartbreak, is watching his \"idol\" on stream. Then one day, he suddenly finds himself hiding from a girl who turns out to be his \"idol\"...? A life-changing romance between a heartbroken boy and a streamer begins!"},{"name":" Uchi no Pi-chan","avatar":"https://mangadex.org/covers/322773cb-d279-412c-82e1-708a4dfca6f8/fd2e2597-fdc9-43d7-ada1-8d6956304ced.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":"A one shot derived from http://seiga.nicovideo.jp/comic/35959 (Yoshimoto other manga)\nIt's not the raws for this, please stop changing the description and add misleading links"},{"name":" Kusuri no Mamono no Kaiko Riyuu","avatar":"https://mangadex.org/covers/3228f8b4-259b-4c53-8472-a461afe3a4b3/3b92a80d-1020-4d9d-bd3e-113c5d24c5ff.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Fantasy,Adaptation"],"nutshell":"人と人ならざる者達が共に暮らすウィーム領。\n雪深く魔術の潤沢なその地に迷い込んだ少女・ネアは託宣を受けた――命を削り契約した魔物から恩恵を得る才職「歌乞い」として。\n静かに暮らしたいネアは、低位の相手を求めて唱歌の儀式を行う。\nだが、夜の森より現れたのは、美しい魔物の王・ディノだった！\n「君の願いは全て叶えよう――どんな残酷なことも」\nとても手に負えない彼を「薬の魔物」と偽り、ネアは転職活動を始めるが、結んだ契約は解消できない。\nおまけに、目の前の万象を司る王から「君に叱られるの大好き」とやけに懐かれてしまい……？\n祝祭美食な日常の中、時に切なく、時に大惨事（？）が紡がれる異類婚姻ファンタジー！\n\nOriginal Web Publication: CORONA EX, Nico Video"},{"name":" Mobile Suit Gundam Silhouette Formula 91 in U.C. 0123","avatar":"https://mangadex.org/covers/322c4588-7f16-4439-9f9a-82866e089894/aaf251ed-b323-4bcb-a268-d1cbc35585a2.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Sci-Fi,Action,Psychological,Comedy,Mecha,Survival,Adventure,Military,Drama"],"nutshell":"Universal Century 0123. In the midst of doing simulations, pilots Tokio and Kevin Forrest encounter an XM-01 Den'an Zon Mobile Suit running tests for the nearby Crossbone Vanguard. In order to preserve their secrecy, the Crossbone forces attack the Anaheim test ship Bladewood. They expect an easy victory, but are repulsed by the Bladewood's mobile suits. In order to enact repairs from the damage they sustained at the hands of the Crossbone Vanguard, the Bladewood enters a nearby abandoned space colony in the Zebra Zone.\nInside the colony Iris, Tokio and Kevin are attacked by a Geara Doga. They successfully capture the machine and find the pilot to be a young girl by the name of Layla Lagiorr. After initially remaining silent she has an emotional outburst in which she explains that there are Zeon Remnants living in the colony and that six years ago the Federation came and slaughtered most of them.\nConfused by her story the Bladewood's crew decide to attempt to contact the Zeon Remnants and attempt to ascertain what is going on. They do so and discover the harsh reality of Federation forces that relishes killing the remnants of Zeon in a way similar to the Titans. Meanwhile the Ra Cailum class ESFS starship Ajax arrives at the colony in order to \"aid in repairs\" and transfer personnel under the command of Baz Galemson. Together the Zeon Remnants and the crew of the Bladewood realize that the situation surrounding them is not as it seems. Eventually, it is revealed that the crew of the Ajax knew of the existence of the Crossbone Vanguard and requested their help in \"killing 2 birds with 1 stone\", namely a group of Zeon refugees and the Bladewood crew. In desperation, Tokio steals the RX-99 Neo Gundam Unit 2 and joins forces with Layla to take down the corrupt Baz and the Ajax."},{"name":" Lion at Dawn","avatar":"https://mangadex.org/covers/322d01e4-15e9-461d-9ab6-c50c64f81cee/19cd7899-9c89-48a2-b8c6-0d35f8e369a1.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Adventure,Drama,Mystery"],"nutshell":"There's 2 versions, one tankoubon and one bunkoban.\nThe tankoubon (done by Midnight Scans) includes:\n「暁に立つライオン」 - Akatsuki ni Tatsu Lion (published in Betsucomi, 05-07/2003)\n「トルコ取材記」 - Turkey Shuzaizakki (Omake, 06/2003)\nThe bunkoban version also have the one-shots:\n「海に墜ちるツバメ」 -Umi ni Ochiru tsubame\n「記憶の足音」- Kioku no Ashioto\nBoth also present in Umi ni Ochiru Tsubame.\nResume from ShoujoMagic:\nIzumi Erina is a senior in high school. She only has one living relative - her older brother Takashi. However, Erina receives an arrest notice for Takashi one day, who is supposed to be in Turkey at the time!! In order to look for Takashi, a mysterious man Sinclair came to Japan and brought Erina along with him. What is the \"Black Trap\" that awaits Erina in a foreign country…?! A shocking romantic suspense work filled with waves of love and hate!!"},{"name":" Ugetsu Monogatari","avatar":"https://mangadex.org/covers/3231f4a7-e67d-4337-874c-a081d95fce8b/674f225f-d938-4880-8986-45e8feb81f58.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Historical,Anthology,Horror,Supernatural,Mystery"],"nutshell":"“Tales of Moonlight and Rain” is a collection of classical Japanese horror/suspense stories. The stories are simple, but abundant with traditional fictional Japanese characters, such as the half-man half-bird Tengu, white serpents, fantastic carps, goblins and restless ghosts, driven by love or hatred."},{"name":" Unhuman","avatar":"https://mangadex.org/covers/323424b8-e1a1-47c5-951a-8b61f8ce604e/3b156291-4cf5-4dec-99fa-23def95efc5d.jpg.256.jpg","country":"Chinese (Traditional)","stat":"8.01","status":"Completed","tags":["Historical,Action,Drama,Tragedy"],"nutshell":"It's divided to three arcs:\nArc 1: Unhuman (不是人)\nArc 2: Me Lowly Woman (賤妾)\nArc 3: The Final Keystone (終礎)"},{"name":" Isekai Tensei ni Kansha o","avatar":"https://mangadex.org/covers/3236afe9-0a54-4999-91ff-55b693274fbb/1d196216-7bd4-46a2-ba31-2c9f47d30d2b.jpg.256.jpg","country":"Japanese","stat":"7.60","status":"Cancelled","tags":["Reincarnation,Action,Adventure,Harem,Isekai,Drama,Fantasy,Adaptation"],"nutshell":"In the future, several decades from now, virtual reality (VR) gaming has been finally realized. An old man who has always dreamed of VR finally gets the chance to play. After finishing a fun tutorial, the old man indulges in deep emotions while looking back on life. While enjoying the depth of the game, he begins to notice something strange about the shop owners, and … he cannot log out? What is this, has he been hacked?"}]