[{"name":" Black Snow. White Moon. Eternal Blossom.","avatar":"https://mangadex.org/covers/637cd582-388e-44d1-833a-5045f1d33689/7f14fcb7-9f77-4fc9-95c3-6884856b3616.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Thriller,Sci-Fi,Monsters,Action,Demons,Psychological,Long Strip,Romance,Survival,Adventure,Post-Apocalyptic,Girls' Love,Drama,Fantasy,Villainess,Monster Girls,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"For what reason, do they continue to live? For what reason, do they continue to eat? They put on the most beautiful masks and commit the cruelest acts. White moon, Black snow, Withered maiden, Eternal blossom. Vicious X Evil, Tyrant X Unhinged, Maiden X Maiden, Hunter X Prey. This is a poem of self-reflection, or a stimulating speech for this numbing world..."},{"name":" Tirkom","avatar":"https://mangadex.org/covers/637e7d4e-adff-45e8-8980-5bbeb66918fc/60db4e1c-0267-42e5-9cc4-c8d1da841988.png.256.jpg","country":"English","stat":"7.82","status":"Ongoing","tags":["Action,Animals,Comedy,Crime,Martial Arts,Adventure,User Created,Fantasy,Web Comic,Mystery"],"nutshell":"[Reads left-to-right]\nDrithurs are a government-contracted group of individuals with unnatural abilities, tasked with the objective of keeping what is considered 'society' functioning. Karykom is a Drithur, but her true objective is fighting. Follow Karykom and her coworkers as they complete nonsensical tasks and battle strange foes in a wasteland.\nArtist's Twitter: @Hdittus13\nSeries Patreon: Patreon.com/Tirkom"},{"name":" A Rose-Colored Tomorrow","avatar":"https://mangadex.org/covers/6382e96a-2416-499c-8c05-48e123531afb/8a196593-463e-4c46-8108-caf50b25f750.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Award Winning,Romance,Drama,Slice of Life"],"nutshell":"I Can Hear the Ghostly Drum-Beating\nThe first guy Rika ever falls for turns out to be her older sister's fiancé. However, her sister's dream since she was a child was to be a bride, and ever since her engagement to another guy didn't work out a few years earlier due to her not being able to conceive, Rika swore to do everything in her power to help her sister fulfill her dream. Does that include helping her marry the guy that she's in love with?!\n\n\nLike Snow Falling on Harbor\nYori runs into Kurita, a girl he knew from basketball club back in high school. Back then, she was a quiet girl who had a quirky oddness to her. When he runs into her out of coincidence two years later, however, he finds that she's become an out-going (if not slightly high-strung) girl. A few weeks after their chance meeting, he receives a phone call from the hospital saying she had tried to kill herself, and he finds out the true reason for the drastic change.\n\n\nIncludes other stories.\nThis manga won the Shogakukan Manga Award for shoujo in 2000.\nRelated:\n\nOsusume Boyfriend\n(Contains a sequel to \"Like Snow Falling on Harbor\")"},{"name":" Suzumiya Haruhi - Kyon Haruhi Daughter and Son. (Doujinshi) ","avatar":"https://mangadex.org/covers/6385d9b8-119c-4978-9626-154354a2614d/b4043727-c51d-44a6-9ced-dfa1bcee7399.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Oneshot,4-Koma,Slice of Life"],"nutshell":""},{"name":" I'm Mediocre but I'm Loved in a Different World","avatar":"https://mangadex.org/covers/6388a3c0-fb56-4dd0-b4c8-6c6e4d88088d/9a2417d2-a519-47bc-acd7-d0e960256550.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Reincarnation,Romance,Anthology,Boys' Love,Magic,Isekai,School Life,Fantasy,Villainess"],"nutshell":"Gorgeous writing team comicalizes the popular short story from \"Moonlight Novels\" ♪ Includes five sweet and happy doting stories of ♂ × ♂ where a man who has reincarnated in another world and topped!"},{"name":" Suki ni Natte mo Ii no?","avatar":"https://mangadex.org/covers/6393f970-2edf-4c7b-902b-e98d36221b78/2304f92f-9412-4b74-a1f0-f9ca814b6f2d.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"When Yuuki first meets Akihisa she is less than impressed. Not only is he stalking her, but he also tries to seduce her knowing full well she's a high school student who already has a boyfriend. She can't stand him at all so why is she so drawn to him? On the surface Akihisa seems like the worst kind of man… Is he just toying with Yuuki or does he really care about her?"},{"name":" Tensei Reijou wa Goinkyo Seikatsu wo Okuritai! Outaishi Denka to no Konyaku wa Goenryosasete Itadakitaku","avatar":"https://mangadex.org/covers/63948376-b919-43b9-8d06-a7564e599104/af4afb14-11fd-47c5-9aa9-d207ece31bca.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Ongoing","tags":["Reincarnation,Romance,Adventure,Isekai,Fantasy"],"nutshell":"I was supposed to be reincarnated as a mob, but when I realized it, I was the daughter of a duke who was confirmed as a \"saint\"!? I'm so sorry to have to do that! Brush up on the \"Stealth\" skill you got from the Nyanko God -- Aim for a relaxed retirement life! I was going to do that, but the Crown Prince, who is known as the \"Noble Prince of Absolute Ice\", approached me with a passionate proposal! Please don't look at those melting eyes!?"},{"name":" Our First Day","avatar":"https://mangadex.org/covers/63984145-93b6-4236-b0c7-9bd427f7cc05/5be954fa-c40a-470c-be36-d6eff515aaa8.jpg.256.jpg","country":"Korean","stat":"7.86","status":"Completed","tags":["Long Strip,Romance,Boys' Love,Drama,Web Comic,Full Color"],"nutshell":"\"It'll be great if hyung can see me as an adult\", worried Sehyun. There was no progress in the relationship with his seven-years older lover, 'Gyeongwoo'. Following his sister's advice, though he made a plan to appeal maturely to Gyeongwoo, it had not worked out well… At last, can they spend a lovely first day together?"},{"name":" Mangaka Family - A Family of Four, All Mangaka","avatar":"https://mangadex.org/covers/639870f0-7b83-40a7-8844-c0881ed8b0e8/10610e7f-c0a8-42ed-8daa-860eae96c5fe.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Psychological,Romance,Comedy,Drama,Slice of Life"],"nutshell":"(from ebookjapan):\nThe family of mangaka Towa Oshima of \"Girl's High\" is a family of four members, all of whom are mangaka!\nThe father, Yasuichi Oshima (\"Batsu & Terry\"), the mother, Reiko Kawashima, a redikomi mangaka, the sister, Yayoi Mishima, a 4Koma mangaka, and Towa Oshima.\nThe story of the father who built a generation, the fierce battle between mother and daughter, the game war, and the unusual family of mangaka will make you laugh and cry!"},{"name":" Komori to Tenma","avatar":"https://mangadex.org/covers/639f50df-4f86-4195-ab34-cda3ec848c6b/bfa2b381-c3f4-4aba-9cbd-d133f0fd67b3.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance"],"nutshell":""},{"name":" 12-ji Kara Hajimaru","avatar":"https://mangadex.org/covers/63a15aa6-0eaf-40b3-a956-e417d68978f9/ef8f635b-92a7-4726-9525-39acd783a2fa.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Psychological,Romance,Boys' Love,Drama"],"nutshell":"Shoyu operates a cozy pub called \"Tamaya's\" in a sleepy part of town. In the evening, all kinds of tired office workers gather in his shop to drink away their daily worries. Shoyu has more or less settled down in his lifestyle as a gay bar owner, even though his love life has been rather lukewarm since the incident twelve years ago. What will happen when his past unexpectedly catches up with him?"},{"name":" Kiriko Kill","avatar":"https://mangadex.org/covers/63a331ae-80a2-4b75-ab22-d10380bdcf67/1d93004f-ec39-4d24-a9e5-15949c522e7d.jpg.256.jpg","country":"Japanese","stat":"6.85","status":"Completed","tags":["Psychological,Horror,Supernatural,Tragedy"],"nutshell":"Meet Minami Sakura, a girl who’s just started the life she’s always dreamed of with her new job in Tokyo. But it turns out that company’s clean image also has a dark underside… which bewilders Minami and causes her to struggle. And when one of the employees is found murdered, everything goes to hell. This is just the beginning of Kiriko’s party!"},{"name":" Renai Kurabu","avatar":"https://mangadex.org/covers/63af3627-7e3f-415b-b9bd-960c24b10201/91bf2633-a592-429b-8366-b5cf9e37d61e.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"By Covenant of Darkness & Fate\n\"Everytime he teases me, my body aches for him.\nWhy am I reacting to his touch?\nDon't tell me that I…\nWe realized our feelings when our bodies were one.\nI came to know what 'climax' is or the first time.\nWhen I had figured out that I'm falling for you, you had already joined the Renai Club.\""},{"name":" Minna Kyou mo Genki","avatar":"https://mangadex.org/covers/63b1dc85-d456-4bc1-8653-0d84a25ed889/4c84b8c5-e6fe-467f-bece-f6287bda6492.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Boys' Love"],"nutshell":"Includes shorts from Chinko no Tsubuyaki, Mukuchi na Koi no Tsutaekata, Saa Koi ni Ochitamae, and Benriya-san."},{"name":" Honto no Tokoro","avatar":"https://mangadex.org/covers/63b2f8d3-36c3-4d8a-9444-87430ca2b060/f70a187b-dcea-49da-bc1b-af2a3a7771b6.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Comedy,Boys' Love,Slice of Life"],"nutshell":"Saiki unexpectedly meets his senior high school rival, Satou. When Satou confesses, \"I've always liked you,\" Saiki's brain shuts down! Even so, Saiki has feelings he cannot express in words for Satou, who sweetly and forcefully pursues him. Then one day, after being kissed by Satou, Suzuki's body responds … !?"},{"name":" Migawari no Fiancée wa Koi ni Naku","avatar":"https://mangadex.org/covers/63b3ffb4-2f65-42d4-9b4b-ed297c996971/24f9afe7-d03b-4aa3-bf5e-7d1535c303d8.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Office Workers,Drama"],"nutshell":"Shiho grew up being compared to her wonderful twin sister, Miho, by her parents. One day, she loves her sister's fiancé, Fuuma. Shiho continued to hide her unforgivable thoughts, but suddenly her sister died in an accident and Shiho instead got engaged to Fuuma. \"I'm just a replacement for my sister\" - contrary to Shiho's wishes, Fuuma gently embraced Shiho like a true lover? A long-awaited manga with a wonderful and painful love story!"},{"name":" Yan Lu Guang Tao Pao","avatar":"https://mangadex.org/covers/63ccd3c5-d4c4-48d3-b2b5-c636e6b2fe43/0f55d7f8-5814-4199-91c4-23fda07da02e.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.03","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"A-chun and Xiaobo have always been friends. But…why are they just friends?\nNot rated for older shoujo readers."},{"name":" Ultra Battle Satellite","avatar":"https://mangadex.org/covers/63d1eb4f-92ce-41fa-b0d1-a3279005e951/c54be072-f08e-4607-ab7d-8b4bdd95f301.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Action,Comedy,Sports,Martial Arts,Adventure,School Life"],"nutshell":"Welcome to the world of street fighting!!\nSakura Momochi, a mysterious black-haired girl appears before teenage fighter, Jin Matsuriya.\n\"You'll get one soon… an invitation to real deadly fights with no rules… a tournament where blood is washed away with blood.\"\nHer mysterious words and an invitation arriving at the same time to the UBS (Ultra Battle Satellite) fighting tournament draws Jin into the world of street fighting!!\nA no rule head-on battle begins!!\nIncluded one-shots:\n\nVolume 2: Abare Mashira (Rampage Mashira / あばれ猿)\nVolume 3: Kyoufu! Seishin Shishikai no Yabou (恐怖! 清心志士会の野望, 2 Parts)\n\nAs a part of the JUMP START initiative, the first three chapters of Ultra Battle Satellite were published in English in VIZ Media's digital Weekly Shonen Jump.\nWikipedia\nItalian\nJapanese"},{"name":" Santa is Coming!","avatar":"https://mangadex.org/covers/63da1fdf-d284-4b55-aa92-1ac7e4241432/99c791b0-5867-4ebf-add7-3c6a5221d6c5.jpg.256.jpg","country":"Japanese","stat":"7.69","status":"Completed","tags":["Oneshot,Comedy,Mafia"],"nutshell":"Good boys and girls make Santa come."},{"name":" Koi no Hanashi ga Shitai","avatar":"https://mangadex.org/covers/63db0fb6-a8b7-4670-9285-bf7854c088dc/2ff88322-0d69-4295-8a52-d673a2034949.jpg.256.jpg","country":"Japanese","stat":"7.65","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"Before Minari knew he was gay, he convinced himself he was incapable of falling in love. Having spent the last five years settling for just sex with a friend from high school, he surprises himself by falling in love with and impetuously confessing to an acquaintance, Shinkawa. But will Minari's fragile ego be able to withstand the fear and uncertainty of a real love relationship?"},{"name":" Manga Wall","avatar":"https://mangadex.org/covers/63dbb59d-eddf-4694-a4ad-288b4588135b/1372aa91-668e-4bc7-af40-a511b1fb2d28.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":"Today, a wide variety of manga technical books are available. And with the spread of the Internet, the information you want is overflowing and easily available.\nHowever, overcoming technical problems does not mean that manga can be drawn. Many people must have experienced getting stuck.\nThere must have been something like a \"wall\" that made it impossible to draw even though I wanted to.\nBased on his own experiences, a professional manga artist will teach you how to smoothly overcome the \"wall of manga\" that you face in every situation."},{"name":" Otome Equation","avatar":"https://mangadex.org/covers/63dfa2de-8751-4a80-bd94-50c3971c72d1/e3641316-2f9f-4621-908a-b47f487ebe17.png.256.jpg","country":"Korean","stat":"6.73","status":"Completed","tags":["Long Strip,Comedy,Adventure,Video Games,Isekai,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"I'm an old single soul and currently working part time at a net café. I love gaming because it gives result to my efforts, unlike reality. One day, I came across a very interesting game called \"Daughter Cultivation\" during my part time. The graphics, picture quality, voice over… everything is just so realistic! But then I realized… I was actually in the game! I couldn't believe that 24 year-old me had turned into a 10 year-old doll-like-girl!!! What's more, a handsome butler is standing right in front of me. What the hell is going on…?!"},{"name":" Hantai no Koi","avatar":"https://mangadex.org/covers/63e3e612-d767-4cb1-9a25-a6159812199d/e9563258-1968-460c-a407-3c33772da789.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Ongoing","tags":["Long Strip,Romance,Girls' Love,Web Comic,Full Color"],"nutshell":""},{"name":" I've Reincarnated as a Villainess, However I Became a Teacher who Magically Punishes My Students who have Fallen Behind!","avatar":"https://mangadex.org/covers/63e52b6b-d6ac-4a68-b983-2e82754eef59/3c5d04db-a0de-419e-8f99-fc671d6cb519.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Historical,Magic,Isekai,Fantasy,Villainess"],"nutshell":"If you’re tricked by a guy and get reincarnated, would like to become a villainess?\nI didn’t know that I have to teach at a magic academy full of problem children and I even have a son?! Rokuka Shinozaki, a teacher chasing after her stealing boyfriend „I will definitely catch him and get my stuff back!“ was pushed off a bridge and died…\nShe was then reincarnated as the villainess ‚Rika Versin‘.\nI have never heard of a woman like her. Not only proficient in literary arts, but also martial arts. A beauty who's the best at punishment magic, a villainess lady who toyed with men only to have them- and the brilliant son who was birthed because of a mistake. In addition, the magic academy, after hearing about Rika's punishment magic, asked her to be a teacher in a class full of problem children.\nThe lethargic prince, the evil son of a genius warrior, the reclusive knight of duke's son, the apprentice of royal doctor who loves women, and the youngest prince who is a sweet little devil... How will Rika \"punish\" these problem children with such habits?!"},{"name":" Knights of Night","avatar":"https://mangadex.org/covers/63e55f35-b6ce-436c-99f8-a19ce71e4845/870e835d-6179-4826-ad4b-d2fd280836b9.png.256.jpg","country":"Chinese (Simplified)","stat":"8.05","status":"Ongoing","tags":["Thriller,Psychological,Long Strip,Adventure,Drama,Horror,Police,Full Color"],"nutshell":"Ye Chen, a second-year student at Shen Jiang University, lost his memory in a car accident and at the same time is suspected by the police of being a murderer in a new case.\nSurprisingly, the place where the murder took place is exactly the same as a scene that appeared in his dreams. As the investigation progresses, Ye Chen discovers that his life is shrouded in a fog, and that it all seems to be connected to his lost memories ..."},{"name":" My Ideal Type and I Are Dying!","avatar":"https://mangadex.org/covers/63f23cae-bdda-427e-b3e3-aea447aba7fc/cb59fd08-7abb-4b7b-bd25-aeffd28465b3.png.256.jpg","country":"Chinese (Simplified)","stat":"7.96","status":"Ongoing","tags":["Long Strip,Comedy,Drama"],"nutshell":"Ren Chuan, a company president, pretended to have stomach cancer to escape women wanting marriage. He hid in the hospital and there he encountered a patient named Jiang Huan who has liver cancer. Despite the little time that Jiang Huan has left, Ren Chuan continues to create memories with him"},{"name":" Hougen Danshi","avatar":"https://mangadex.org/covers/63f67e74-b3ba-4c7c-a53d-462d2bc36840/2754767a-1785-47a0-9951-ab7d5e50bacb.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Oneshot,Romance,Comedy,Slice of Life"],"nutshell":"A short story about a man and his new job."},{"name":" Hibike! Euphonium - Kitauji Suibu Katsudou Nisshi Sono (Doujinshi)","avatar":"https://mangadex.org/covers/63f6c939-452c-4757-884e-c3e75b29b0cc/4d28eebd-5b0f-495c-be50-40eecf9e4a37.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Ongoing","tags":["Girls' Love"],"nutshell":"Series of Hibike! Euphonium doujins. 10 Volumes released as of Comiket 94."},{"name":" After the Identity of the Big Shot was Exposed","avatar":"https://mangadex.org/covers/63fa4a80-ff32-4677-bbbc-b7a3366ef6b6/d1187498-5759-4e38-9860-0b949ff070d6.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Ongoing","tags":["Long Strip,Harem,School Life,Web Comic,Full Color"],"nutshell":"The strongest legendary king of the Sky Group, because of a secret, stealthy lurking in the noisy city. During the day, he is a sunshine top student, and at night he walks on the edge of darkness. At this time, the appearance of a young girl completely disrupts his seemingly peaceful life. One is cold on the surface and the other is gentle and considerate, and the shadow hidden behind the scenes begins to show its fangs......"},{"name":" Sennou Shitsuji","avatar":"https://mangadex.org/covers/63faa32e-3d40-4b58-bfe3-ec4dbfe93efb/c4a4e0b3-0514-4f05-9bb2-67269aae4bf6.jpg.256.jpg","country":"Japanese","stat":"7.32","status":"Completed","tags":["Psychological,Comedy,Drama,School Life,Slice of Life"],"nutshell":"When the daughter of the Takato family, Ichigo, returns from studying in the UK after a year, she notices a strange situation in her family. Apparently, they all seem to have been brainwashed by the butler, Seijuurou Kuki, who came while Ichigo was abroad. And so begins her efforts to return her family back to normal while desperately resisting Kuki's influence."},{"name":" Yureru Ruru","avatar":"https://mangadex.org/covers/63fb6181-9424-481c-813e-e8ecff4c4850/bcfee68a-5cb6-4961-aa7e-6e9764ac1e14.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Now that the last senpai has also graduated, only 3 members remain in the choir club. Probably the club will have to be dismantled but the president does her best to find new members, at least until she finds out that the guy she likes is engaged …"},{"name":" GIGANT","avatar":"https://mangadex.org/covers/6402465b-2562-427a-ab8f-05c13220ce8f/a471b1e7-21c2-4e58-a0e3-27b93360ef6d.jpg.256.jpg","country":"Japanese","stat":"6.68","status":"Completed","tags":["Sci-Fi,Action,Romance,Drama,School Life,Aliens,Mystery"],"nutshell":"Rei Yokoyamada, a high school boy who has a movie producer father. One day, while out with friends to shoot a film that he plans to enter into a film festival, a poster of Papiko, an adult video actress with big breasts, catches his eye."}]