[{"name":" Kimi ni Yori Nishi","avatar":"https://mangadex.org/covers/d11ceee3-f688-4814-9fbe-048b171c8127/4b306788-783b-4507-a7b4-3fad389d0470.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"\"Was I just a replacement from the beginning?\"\nOn the night of his father's funeral, a college student named Yamato meets a man who leaves a big impression on him. He doesn't give his name, but leaves behind some words that stick in Yamato's mind. \"Are you his son? You look much like him.\" Several days later, much to his surprise, Yamato meets the man again, and beneath the moonlight, their love secretly begins…"},{"name":" A Midnight Bellboy","avatar":"https://mangadex.org/covers/d11dd036-9e69-4c26-8844-1d0e53cdd801/48231b83-d643-4ea8-8872-811bfc45b798.png.256.jpg","country":"Japanese","stat":"7.34","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Collection of unrelated oneshots, and a continuation of Sensei's series \"Usotsuki wa Shinshi no Hajimari\" (Lies are a Gentleman's Manners)."},{"name":" Hataraku Saibou WHITE","avatar":"https://mangadex.org/covers/d11eeab6-9f5b-4e7f-ad78-51b352c4d06a/d22212f1-ccd9-4a7a-adbd-7d417226f59e.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Action,Comedy,Medical"],"nutshell":"Spin-off \"Cells at Work\" (Hataraku Saibou) on the activity of leukocytes."},{"name":" Samurai Spirits - Makai Bugeichou","avatar":"https://mangadex.org/covers/d125c2e9-6bec-4370-95c3-b16b0b823c61/6b7fced0-ed37-421d-b260-db8b7c1bc682.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Action,Survival,Martial Arts,Samurai,Adventure,Video Games,Military,Drama,Supernatural,Adaptation"],"nutshell":"The year is 1787, Tenmei Era, a time of plague and famine in Japan, When ordinary swordsman only add to the piles of corpses on the street. But Nakoruru, a nature-worshipping Ainu priestess; Haohmaru, a bold samurai with a death wish; Hanzo, a ninja loyal to the Shogun, are samurai spirits with a common destiny.\nWith Nakoruru's guidance, the trio battle the supernatural forces of the Dark Kingdom, led by the half-human wizard Madou Shiranui. If Shiranui's troops succeed in fomenting a war between Japan's warlords, the resulting devastation will clear the way for Dark Kingdom invasion of earth. Can the the brave samurai stave off an all-out attack by an entire legion of demons?"},{"name":" Tender Loving CEO","avatar":"https://mangadex.org/covers/d12a8311-879c-45af-a74d-ab6a4c2f8409/4293f4fa-cb3e-4a89-82b4-8efb686f1764.png.256.jpg","country":"Chinese (Simplified)","stat":"7.87","status":"Ongoing","tags":["Long Strip,Romance"],"nutshell":"【Translation provided by the copyright owner.】\nStepmother oppression, scumbag thin affection, Strict Reborn return to turn the tide! ...... Eh? Why did this Fu Dashao always follow me? ——Yan Seser's imaginary rebirth hanging script has become the infinite spoiled wife of the president of Gao Leng!"},{"name":" Kurenai no Ansatsusha","avatar":"https://mangadex.org/covers/d12ce7b4-515a-491a-90fd-015157a7a434/6e94934e-aa75-4f5c-9654-c88957a91162.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Oneshot,Genderswap,Action,Comedy,Adventure,Drama,Fantasy"],"nutshell":"Assassins–they are humans that have exceptional skills which they use in killing people. The most dangerous among them is the Assassin of Crimson–the former leader of the Assassin guild Yuuyami, and the one who killed the country's leader, King Mars. Due to this, the country's princess has declared that whoever captures her will obtain fortune and become the princess' husband, essentially becoming the next king. Virgil is a guy who has red hair and looks like a girl. He is travelling with a performing troupe while searching for his twin brother Serge. His peculiar features seem to have matched the known characteristics of the Assassin of Crimson. The following events will lead him to discover the mystery behind the death of the king–and the identity of the Assassin of Crimson.\n(Source: MangaIchi Scanlation Division)"},{"name":" Touhou - Saigo no Bansan (Doujinshi)","avatar":"https://mangadex.org/covers/d12e8575-3bf8-47a9-b388-f72e2e3415a3/330d4337-b14b-49e6-8b72-db3873c6e93f.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Oneshot,Action,Drama"],"nutshell":""},{"name":" Ai to Ao no Kyoukai","avatar":"https://mangadex.org/covers/d1346aa4-3193-4a9b-8ada-ebdf957e8919/1912b524-88dd-4480-9334-9ea6767907ad.png.256.jpg","country":"Japanese","stat":"7.91","status":"Hiatus","tags":["Romance,Comedy,Drama,Slice of Life"],"nutshell":"Uozumi Aiko, an employee at Rainwater bookstore, is 29 years old and single. Despite her family pressuring her to \"get married soon\", she lives life at her own pace. But one day, Aiko is frightened by a young man staring at her at work. However, it turns out that he's her cousin! Moreover, they're going to live together?!\nThis is the story of a clumsy woman and a clumsy man living together."},{"name":" Kisarazu-kun no xx ga Mitai","avatar":"https://mangadex.org/covers/d13b6b29-146d-47a2-b09c-9a852fd068b5/860be1a7-bee2-4e87-b5b1-664112152d87.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Romance,Comedy,Office Workers,Drama,Slice of Life"],"nutshell":"Finally a manager at age 35, Asahi Maebashi seems to have it all. People think she's gorgeous, and everyone knows how good she is at her job. Now if only she could have as much confidence in the bedroom... but is it any surprise she has given up on love and marriage after her husband divorced her for her lack of skills in the boudoir? Asahi is determined to be celibate, but now she has a new burning desire... to see a man touch himself while looking at her! As fate would have it, she meets 29-year-old Kouya Kisarazu, a hot, but the slightly narcissistic director, through work. He doesn't seem inexperienced with women, but after a traumatic past, he is so insecure in that arena, that he has already had enough! He would like a woman to watch him spank his monkey, though!! Realizing this is a win-win situation, the two release their inner freaks and help each other out..."},{"name":" Koi o Kataranai Kuchibiru","avatar":"https://mangadex.org/covers/d13bf71b-95a4-4e5b-8e05-c3ca5f4245d4/619db79b-469b-496a-80db-7ff5a01853e1.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Boys' Love,Drama,School Life,Slice of Life"],"nutshell":"\"Having sex without love. All gay men do this, right?\"\nUniversity student Kawamoto has had a string of one-night stands. One day, he meets a university employee called Kuroki, and tries to bed him. \"Do you always do stuff like this?\" Kuroki has been in love with one of the school professors for 7 years. \"I'm happy just being by his side.\" That unwavering dedication captures Kawamoto's heart… If love is solely loving someone, doesn't that just invite pain…?"},{"name":" Love Bullet","avatar":"https://mangadex.org/covers/d13c22d7-3399-4e55-9f7e-bb24daa2dcc2/4864e164-acf2-4f8a-94f8-fcfea9f23660.jpg.256.jpg","country":"Korean","stat":"8.03","status":"Ongoing","tags":["Romance"],"nutshell":"From Loyal Kiss:\nEvery time you sent me one of your fake smiles, my fists clench automatically.\nIf I had a gun in my pocket, I would have shot you.\nTied by a secret that keeps him from loving the one he loves, he is Choi EunJo.\nThe handsome and much beloved idol, he is Im Sol - no girl can resist his killer smile.\nBut for Narae, all she feels is disgust.\nBam!!\nWhere will Narae's Love Bullet fly?"},{"name":" Haru wa Mijikashi Koiseyo Danshi.","avatar":"https://mangadex.org/covers/d13c946e-3fb2-4388-8098-1dbcda772166/c69020e7-f6d3-449e-8642-7692236efa88.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,School Life"],"nutshell":"The manga follows the lives and romantic pursuits of four high school boys, who all have no experience with romance."},{"name":" Most Hunted Monster","avatar":"https://mangadex.org/covers/d13da0c9-e2c3-49da-bb65-24358e87377a/fa12cd79-fb32-4422-9c20-69688b62dbd4.jpg.256.jpg","country":"English","stat":"8.06","status":"Completed","tags":["Monsters,Action,Demons,Adventure,User Created,Magic,Fantasy,Mystery"],"nutshell":""},{"name":" [GwangGong Industrial Complex] Good Hunter & Bad Prey","avatar":"https://mangadex.org/covers/d13f85b6-6638-4fe9-a19e-2668e7da6085/012151b3-83fd-4e95-9d65-9987821b0913.jpg.256.jpg","country":"Korean","stat":"7.89","status":"Ongoing","tags":["Long Strip,Boys' Love,Drama"],"nutshell":"Everyday sleeping with a different man, and stealing their valuables, Jay, one day, by luck, manages to bag a one night stand with Eugene, who appears to be rich. After spending a passionate night together, Jay attempts to steal his valuables, but in the midst of it, someone calls out for him."},{"name":" Pechako-chan","avatar":"https://mangadex.org/covers/d1414ce2-313e-4a34-9978-54bc590b00bd/adc6810c-11f7-4e89-ad7f-7810ed67c21d.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Psychological,Romance,Comedy,Sports,Drama,School Life,Delinquents,Slice of Life,Music,Full Color"],"nutshell":"(from ebookjapan):\nThis is an ebook reprint of the fantastic masterpiece manga \"Pechako-chan,\" which was serialized in \" First Grader's Magazine\" (Shogakukan) from 1968 to 1977. The main character's name is Takako Hana-no-Takako, but her name is Hana-Pecha, so \"Pechako-chan\" is a bright, active, girl who's a bit chubby in the first grade of elementary school.\nThis is a heartwarming and relaxing work depicting the happy days of Pechako-chan, her cute little sister \"Mamitan,\" the people in Hana's family, her boyfriend \"Itchan\" who's slightly precocious, and their friends.\nThe mangaka is Yoko Imamura, a pioneer in shojo manga. Her works, which depicts children's daily life with a heartwarming and lively touch, have been serialized in \"Weekly Margaret\" (Shueisha) from 1964 to 1967, and gained immense popularity, winning the 6th Kodansha Children's Manga Award in 1965."},{"name":" Tenshi no Drop","avatar":"https://mangadex.org/covers/d143f45b-01d5-43dc-8882-bbee38118713/93c03404-032c-47aa-b9df-0c26f049f94d.jpg.256.jpg","country":"Japanese","stat":"6.85","status":"Completed","tags":["Loli,Comedy,Girls' Love,School Life,Fantasy"],"nutshell":"Botan Ichige has just enrolled in St. Asmaria All-Girl's School where angels are said to live. It turns out that angels do indeed live there, and after an accident, an angel named Un offers Botan her halo as a snack. After eating it, Botan discovers it had some bizarre side-effects, causing her to regularly \"give birth\" to colorful mushrooms. Is this the life of an angel!?"},{"name":" Moretones","avatar":"https://mangadex.org/covers/d14a86d6-73a6-443c-90c4-aa3e0c7a90c1/6aa7b994-bf8d-44d1-b514-7ca9143f8188.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.07","status":"Ongoing","tags":["Psychological,Long Strip,Boys' Love,Drama"],"nutshell":"Qun Qing no es bueno con los niños,un día en el funeral de su tío conoce por primera vez a Qun Mo y por simpatía se acerca poco a poco a el,pero después de un tiempo descubre la verdadera personalidad de Qun Mo ¿Qué les deparará el destino?"},{"name":" Dangerous 1969","avatar":"https://mangadex.org/covers/d1509dd2-887b-4601-8e8d-0a74d9bda1c6/669510a2-2f1e-4079-bab2-8e9ca2e134be.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Action,School Life,Supernatural"],"nutshell":"The supernatural action manga is set in 1969, in an alternate world where some people known as \"Majin\" live among normal humans despite having varying supernatural powers. The manga's story centers on a battle between Majin students and the Majin Public Safety Bureau in Tokyo University's Yasuda Auditorium."},{"name":" Fire!","avatar":"https://mangadex.org/covers/d15267de-2481-4a74-bb3c-7b7504f245d9/481283a8-0037-47c8-a048-fe6b879a78eb.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Award Winning,Romance,Comedy,Adventure,Drama,School Life,Delinquents,Slice of Life,Music,Tragedy"],"nutshell":"(from MangaUpdates): Young Aaron is unjustly sent to a reformatory, where he meets Fire Wolf--older, a born rebel, and a talented singer. After Wolf dies in a motorcycle crash, Aaron becomes a rock musician, thus beginning a frenzied odyssey through late 1960s America.\n\n\nWon the 1969 Shogakukan Manga Award"},{"name":" Second Life Producer","avatar":"https://mangadex.org/covers/d15c5412-dfb3-4e4e-bfcf-0f62ef7bc6c9/48aa2425-98c3-431c-b75f-fe7ca1381c8a.jpg.256.jpg","country":"Korean","stat":"8.02","status":"Ongoing","tags":["Reincarnation,Long Strip,Drama,Fantasy,Full Color"],"nutshell":"‘Whoops, sorry. But it’s first come first serve, right?\nThe broadcasting industry is like that.”\nJoon Soo joined a broadcasting company with a dream. But for 10 years he lost everything he’s worked for because of his trashy Sunbae.\nHe regretted it deeply and grinded his teeth, but nothing could be done to correct it.\nWhen he was about to give up everything in despair, the second opportunity in his life has come when he returned to the day he joined the company with all of his memories and know-how intact. In the second life, can his dreams be achieved without repeating the despair of the past? ~ Mangaupdates"},{"name":" Yubikiribako","avatar":"https://mangadex.org/covers/d15d77dd-df38-4448-a47d-30d45e8e62cc/2aea035d-8ecc-43ae-90e0-ca7fb1694170.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Horror,Mystery"],"nutshell":"One day, Mikage Akihito, an ordinary high schooler, finds the dead body of one of his classmates. From then on, other students started to die, one at a time… Is this chain of despair going to completely destroy their peaceful everyday?"},{"name":" Summer Blue","avatar":"https://mangadex.org/covers/d16af09c-4de8-4867-894a-8fa40d74facb/ee3d2a80-ce45-4ee6-9bb9-8a945975b899.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Oneshot,Romance,Drama"],"nutshell":"Third year student Aoi Shimizu plunges herself into the school swimming pool while still fully dressed. A male student, Oohashi, sees the incident from the school's archery range and comes running to her rescue. Why is Aoi so upset and will her chance meeting with Oohashi set her on the right path into the future?"},{"name":" Wild Child","avatar":"https://mangadex.org/covers/d16fa13e-fd88-4e80-a0e0-50775c46f03b/5f2f004f-07d0-4670-af88-d8b94460b31e.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.11","status":"Completed","tags":["Oneshot,Official Colored,Long Strip,Drama,Web Comic,Slice of Life,Full Color"],"nutshell":"Having dwelled in a city for long, the moist soil and various calls of different insects belonging to the forest of my hometown makes me incomparably wistful. So, I've taken up my pen and drew this comic to record these beautiful memories."},{"name":" Yuusha Densetsu no Uragawa de Ore wa Eiyuu Densetsu o Tsukurimasu: Oudou Goroshi no Eiyuutan~","avatar":"https://mangadex.org/covers/d1782475-2c3e-4deb-bc33-25a0ffbe3f18/fad3651b-b0bc-40bb-8cf4-01744ae5b29c.jpg.256.jpg","country":"Japanese","stat":"7.37","status":"Ongoing","tags":["Action,Romance,Comedy,Adventure,Fantasy,Adaptation"],"nutshell":"Yukina was a young man who hailed from the same village as the Yuusha who shouldered the fate of the world. Through a certain incident, he got ahold of the talking spear, Gram. It was a weapon that was on par with the legendary sword the Hero wielded. The first volume of an adventure fantasy of the youth with a realistic growth!"},{"name":" many","avatar":"https://mangadex.org/covers/d1791ad2-8b85-4d54-a6fb-bb870262d779/9be84a37-b6c5-43ff-93ee-2f29376e54f7.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"Kikuyo is really popular in school and is confessed to by a lot of boys, but she is unable of rejecting them clearly, so Ryuu, her childhood friend always prepared to protect her, make then got away. What would happen when Kikuyo decide to go out with one of them? Which are the real feelings of Ryuu?\n(The main story is finished, three separated oneshot are left)"},{"name":" Utsusemi ni Akari","avatar":"https://mangadex.org/covers/d17e8ee3-1e73-4627-ad65-aff5b88702aa/d48b77ab-21eb-41c2-b300-aa8da557b5e7.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Hiatus","tags":["Boys' Love,Drama,School Life,Slice of Life"],"nutshell":"Spin-off of Kurayami ni Strobe featuring Sawayama & Hase."},{"name":" Akuma no Ororon","avatar":"https://mangadex.org/covers/d1809203-f4b8-483b-b3a3-238f93d14566/2e651f0c-9eb7-47c4-a78f-0f6bc78d0d33.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Psychological,Romance,Fantasy,Supernatural,Tragedy"],"nutshell":"A lonely yet caring 15-year-old Chiaki, the half-angel daughter of the Archangel Michael and a human woman, welcomes into her home a dejected devil Ororon who pledges to stay at her side forever.\nBoth of them have been ostracized from their respective celestial realms–Chiaki because her origins are impure and Ororon because he is the youngest son of the Lord Devil and therefore a threat to his older brothers for leadership of the underworld.\nAs various agents of heaven come by to destroy the angel Chiaki, she learns that having the incredibly powerful Ororon by her side is useful. And as assassin after assassin comes to eliminate Ororon, he learns that Chiaki can teach him a valuable lesson about the sanctity of life."},{"name":" Kaoru-kun to Hana no Mori","avatar":"https://mangadex.org/covers/d186656d-1a6a-43ca-a609-073073055986/33e7e3fc-f67c-43cc-8de9-8497a99f5b71.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Romance,School Life"],"nutshell":"Kaworu is a young girl who looks like a prince.\nAnd she especially likes stronger men than her !\nThen one day, two mysterious boys will appear in her life …\nIncluded one-shot:\nVolume 2: Gyu…tte Shite Ii?: \"Become my pillow\" is what he suddenly ordered me to do…?!"},{"name":" Yu Jian 20 Sui","avatar":"https://mangadex.org/covers/d18e490e-14b6-44cd-96fe-76074a86f372/4ff2e7c7-51ee-4cc0-9e2c-126f142905a1.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"Le jeune Nathan devient un garçon retiré et asocial à cause des circonstances de son enfance. C'est alors qu'il rencontre Sherwin, et peu à peu, sa vie commence à changer… Se pourrait-il que Sherwin soit ce que Nathan attendait tant ?"},{"name":" Yami Abaki Kurau Miko","avatar":"https://mangadex.org/covers/d18f532a-28c1-45b7-8744-c57908125aca/02ab469f-29c2-4a69-bc06-6761003da91b.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Horror,Supernatural"],"nutshell":"When he was in elementary school, a boy experienced trauma while trying to protect a bullied girl. Years later he meets a transfer student, a beautiful girl in a black sailor suit, with whom he has a strange conversation."},{"name":" Super Mario Adventures","avatar":"https://mangadex.org/covers/d197aa6b-dc3f-47f8-8a8f-ff479174722b/5c6a5e33-8ef0-4e11-b656-9c9c1e4c1e48.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Thriller,Monsters,Action,Animals,Comedy,Survival,Adventure,Video Games,Drama,Fantasy,Adaptation"],"nutshell":"King Bowser, a nasty dragon-like creature, wants to marry the pretty Princess Toadstool of the Mushroom Kingdom, a fantasy world where such things like Kinopi (Mushroom) people live. Bowser then threatens the Princess into marriage with him by turning the residents of the Mushroom Kingdom into stone. As the Princess heads to get her revenge on the tyrant, the Mario brothers, two plumbers who've somehow winded up in the Mushroom Kingdom, venture out to stop Princess Toadstool before she creates even more trouble, all the while defeating Bowser in the process.\nNOTE: Chapter 13.5 was not included in Viz's Super Mario Adventures reprint."},{"name":" Mr. Devil Rejoiced When I Made Parfait","avatar":"https://mangadex.org/covers/d19b10f7-4dc5-47e7-9c06-29e1666aa07e/9de59ab2-78dc-403d-b0f9-9912d8a5b617.jpg.256.jpg","country":"Japanese","stat":"8.24","status":"Ongoing","tags":["Reincarnation,Monsters,Demons,Romance,Isekai,Fantasy,Cooking"],"nutshell":"Cruz was reincarnated as a low-class demon into Makai, the underworld. In her past life, she aimed to be an A-list pâtissière, so now she’s bewildered by the jet-black food of this world! However, she was touched by the kindness of the demons around her, declaring, “I wish to make the citizens of Makai happy with sweets!”\nThus, Cruz created Makai's first “parfait” with limited materials. When the demons first tasted her sweets, they became instantly captivated! Furthermore, even the most powerful Demon King of all time had heard of rumours of her and summoned Cruz to meet him…?!"}]