[{"name":" Tonari no Kire na Hito","avatar":"https://mangadex.org/covers/239b82d8-5efd-4fbf-bb5c-8e0b46bbf3ec/811f3a35-b5e0-41cd-acc1-0688b2b30027.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot,Romance,Office Workers,Drama"],"nutshell":"在遇见你的那个瞬间 我肯定就坠入爱河了\n谜之美人*平凡OL\n惊喜连连的 近邻恋爱"},{"name":" Love You as You Wish","avatar":"https://mangadex.org/covers/239db912-c3d5-402e-8300-239e21f5ceb0/8d62b54a-8985-4179-a25e-98e3119653a4.png.256.jpg","country":"Chinese (Simplified)","stat":"7.89","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Drama,Web Comic,Full Color"],"nutshell":"Ye Yu Xiao, a young master, who is a player, self proclaimed that he's a rich young master who will not get himself into trouble. He accidentally met Fan Jing, a new star who is well known for playing \"hard to get\". In order to make the the proud and stubborn beauty fall completely in love with him, Ye Yu Xiao made a bet with his friends that Fan Jing would fall in love with him within 3 months. However, 3 months later...the scenario of chasing the wife changed! Who will be the first to fall into the trap of this love match?"},{"name":" Senpai ga Ne Chatta","avatar":"https://mangadex.org/covers/239e89bc-5d0a-4f07-86df-ea09d04c0f60/d21fea3e-3224-436b-80cf-8efe8373504d.png.256.jpg","country":"Japanese","stat":"7.12","status":"Completed","tags":["Oneshot,Girls' Love,Full Color"],"nutshell":"Lewd Junior.\nAuthor's Twitter"},{"name":" ACCA - 13-ku Kansatsuka","avatar":"https://mangadex.org/covers/239fb962-e3a2-457e-9ff4-34f64c43f76e/b5241e6d-6d22-49c4-ab67-546df553b968.jpg.256.jpg","country":"Japanese","stat":"8.29","status":"Completed","tags":["Thriller,Psychological,Office Workers,Military,Fantasy,Mystery"],"nutshell":"The kingdom of Dowa, which is subdivided into 13 states, is celebrating its monarch's 99th birthday.\nThese thirteen states have many agencies that are controlled by the giant organization known as ACCA.\nWithin ACCA Jean Otus is the second-in-command of the inspection department, which has 10 people placed\nin each of the 13 states and a central office in the capital city; they have to keep track of all the activities of ACCA\nacross the kingdom and keep data on each state's ACCA office flowing towards the central office.\nJean also often makes business trips from the capital to the other districts to check on the situation and personnel there,\nwhich is why he's one of the first to inadvertently become involved when rumours of a coup d'etat begin to stir Dowa...\nSee AnimeNewsNetwork for the anime."},{"name":" Yome wa Hakoiri Musuko","avatar":"https://mangadex.org/covers/23a395f3-17d6-41f4-bae0-7216407b80ac/cf3613d5-56e5-484a-9f5a-2db9f081f10d.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Animals,Romance,Comedy,Boys' Love,Supernatural"],"nutshell":"Having lived as the second son of a temple, worshipped as a deity, and being a sheltered boy capable of transforming into a snake, Sei finally decides he's had enough of this life, and sets out to run away from home! Not being used to human society, Sei gets worn out and escapes to a grassy field where he meets and is helped by Murasaki, the reptile enthusiast college student. As the sheltered boy who longed to be \"normal\", Sei takes this chance to befriend the unfriendly and hard-to-read Murasaki, but their co-habitation life is riddled with misunderstandings…?! The two experience their first love together in a hot and cute love comedy!"},{"name":" Pokémon - Delibird's Present","avatar":"https://mangadex.org/covers/23a6c600-ee04-4836-8015-465f809ade19/12f4dd3b-9acb-4b43-a882-10c89c7f4656.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Oneshot,Monsters,Action,Animals,Comedy,Sports,Adventure,Video Games,Slice of Life"],"nutshell":""},{"name":" Alpha no Ie no Ko","avatar":"https://mangadex.org/covers/23b06dd1-e1e1-4660-b3ee-19bef381a916/5cf49d02-85fc-42c1-92bc-aba6f9af3069.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Boys' Love,Office Workers,Drama"],"nutshell":"Nishimiya Kouga is from a distinguished alpha family which puts severe importance on being purebred.\nAt work, the person he acknowledges as his rival in business performance is Houjou Misaki, who is also an alpha.\nKouga has been putting some distance from his alpha supremacist grandfather, the current head of the Nishimiya clan. But one day, on the latter's orders, the family butler, Harada, visited Kouga with a child.\nHaruto, the omega child, is a distant relative and Kouga has been ordered to care for him. Kouga, despite his disgust with how selfish alphas are, felt pity for the meek and frail-looking Haruto and reluctantly complied.\nNow, Kouga is struggling to take care of Haruto who to his surprise, turned out to be a really energetic boy. At the same time, Kouga found out that Houjou also sends his child to the same kindergarten that Haruto attends.\nAnd that's when he discovered a shocking truth about Houjou"},{"name":" The Golden Darkness is Watching","avatar":"https://mangadex.org/covers/23b3c98c-72b2-4d8a-8655-8c8c4bd79478/20f7190f-35a0-4c5b-9c68-b4818ef2ff87.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Monsters,Demons,Psychological,Animals,Comedy,Survival,Drama,Medical,Horror,Slice of Life,Supernatural,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nA young girl, Esther, is brought by car to live in a town called Windrow for her brother Samuel's medical treatment.\nIn Windrow, Esther sees a lot of cats, and she learns the reason for the increase in the number of cats due to the circumstances of the residents.\nSoon after, a big trouble breaks out between the residents and the many cats, which become ferocious because of their hunger, and Esther and the others get involved...."},{"name":" Hanashite Nante Agenai Yo","avatar":"https://mangadex.org/covers/23b3f852-2c0f-4324-b17d-c891c4d94ee6/10978ba3-497d-4842-b68e-13eac25a521f.png.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Romance,Comedy"],"nutshell":"Kyouka, a sixteen-year-old, will be a winner today, the first day at the new school to which she has just transferred! She will definitely get a great boyfriend and say her goodbyes to those lonely days!! Kyouka has two brothers who love her a lot. Every guy who comes close to Kyouka is kicked out by them, thus she has no boyfriend. But she finally found an ideal prince… or that's what she thought. This guy, Maki, is actually a perverted prince!?\n\nAlso includes two short stories in volume 2:\n\n\n\nNani-sama?! Oresama\nSatomi loves Yuuya a little too much and is totally wrapped around his little finger. But, if this continues, instead of becoming his girlfriend, she'll forever remain his gofer. Will Satomi do something to find out exactly where she stands with Yuuya?\n\n\nIjiwaru wa Kuchibiru\nDuring Shiori's fifteenth spring, she fell in love with the idol Shuu Kitamura. She was even lucky enough to get to meet him in person, but she realizes he's nothing but a fraud! However, due to certain circumstances, Shiori becomes Shuu's personal assistant!?"},{"name":" Harry Potter - A Map in Pocket (Doujinshi)","avatar":"https://mangadex.org/covers/23b45315-07f0-4af8-b227-400b3001d946/abb95b61-2b36-42fd-8f9e-8bf878e536f9.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,School Life,Fantasy"],"nutshell":"The first 3/4'ths of 'A Map In Pocket' is a basic recap of the first Harry Potter book, done in Senbei Oku's unique style and with a few twists thrown in. The last 1/4th is pretty much a Senbei Shop's own creation, and has the twins comforting Harry after he loses a Quiddittch match and the Gryffindor House 150 points."},{"name":" Tada Massugu ni Kimi o Omou","avatar":"https://mangadex.org/covers/23b560eb-b24a-4ca4-ae4c-2bad19326085/fcc3db30-7b6f-4aab-a051-33af54febccb.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life"],"nutshell":"\"Back then, I didn't even consider thinking that we would fall apart some day.\"\nKanade, Yuuji, and Souma are childhood friends. Yuuji can be rude at times, but has a strong sense of responsibility. Souma is the popular kid in class. Kanade is shy and always looks up to the other two. The three of them had promised to always be best friends, but things began to change when Souma started dating a girl in high school.\nEmotions waver and hearts are broken, as a love triangle between three childhood friends unfolds.\""},{"name":" Tensei Daiseijo No Isekai Nonbiri Kikou","avatar":"https://mangadex.org/covers/23b7ba06-696c-4b02-85e2-d32f8433df8c/2e5667d7-abeb-4883-9a4b-dc3ba3f1343b.jpg.256.jpg","country":"Japanese","stat":"8.19","status":"Ongoing","tags":["Reincarnation,Comedy,Isekai,Fantasy,Slice of Life,Adaptation"],"nutshell":"Hirune Hanamaki is a 22-year-old office worker who fits your common isekai tropes - overworked, underappreciated, and fated to kiss the front of a truck barreling towards her at 80 kilometers per hour. When she comes to, she meets a goddess who tells her of her passing, and offers to provide her another chance.\nBefore she knows it, Hirune is whisked off to another world, now with the body of a little girl. She is picked up by a passing priest, who is amazed by her innate magical powers and suggests that she become a saint. Hirune, who wants nothing more than to live a lazy, carefree life, immediately accepts… only to find out that a saint actually does a LOT of work.\nCan Hirune work her way to becoming the ultimate saint, so that she can obtain a less rigorous work schedule?"},{"name":" Usolily Out!","avatar":"https://mangadex.org/covers/23c74d18-3dca-4fe8-9e54-0cb55b7b0dcd/cd2f4135-864d-417a-8869-a09386ed391e.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Oneshot,Comedy,Crossdressing"],"nutshell":"Oneshot cross-over of Usotsuki Lily and Sold Out!."},{"name":" Kokoro ga Sakebitagatterunda.","avatar":"https://mangadex.org/covers/23ce7ffb-9b10-44f8-b1b4-64ad1ce663c1/eb29d065-a1bd-440e-9ee7-45cbeb2af4dd.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Romance,Drama,School Life,Supernatural"],"nutshell":"Jun is a girl whose words have been sealed away. She was once a very happy girl, but because of a certain thing she said when she was very young, her family was torn apart. One day, the egg fairy appeared in front of her and sealed away her ability to talk in order to stop her from hurting anybody else. Since this traumatic experience, Jun lives in the shadows away from the limelight. But, one day, she is nominated to become an executive member of the \"community outreach council.\" On top of that, Jun is also appointed to play the main lead in their musical.."},{"name":" Klan","avatar":"https://mangadex.org/covers/23d358e1-b3e6-4c66-95c1-dfb8e1f97c41/9200b5a5-ae1f-4867-b328-8d0009755db9.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Action,Romance,Drama,Fantasy,Supernatural"],"nutshell":"In ancient times, at a lake somewhere in the middle of Eurasia, lived people (ハムランムル) with the ability to transform into animals. But soon internal quarrels forced the population apart into four tribes, which then scattered all over the world. Their descendants prospered, including a certain Hidaka, a high school student who would be completely unremarkable if not for his unnatural appetite.\nHowever, a British aristocrat, Earl Linford, wishes to subjugate all the clans by establishing the supremacy of his own blood. For he can, after all, transform into a lion, the king of the beasts.\nThat is when Renée, a young woman who can turn into a beautiful wolf, enters the picture and endeavors to return Hidaka to his roots."},{"name":" Convenience Store Siren","avatar":"https://mangadex.org/covers/23d5471b-9408-425e-9f7a-dab2639bc3d3/69f6243d-d000-4749-964d-128363fc36ff.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":"Reiko is a descendant of sirens, monsters from ancient Greece. Despite this, she is terrified of men, so she gets a job at a convenience store to overcome her fears."},{"name":" Lost Kid","avatar":"https://mangadex.org/covers/23e7f88a-cd49-4e3c-98d2-7071c2aee2b2/52e5dcbb-a763-43ee-8fde-2ffa8a3adc28.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Oneshot,Horror"],"nutshell":""},{"name":" How About... Hatsune Miku?","avatar":"https://mangadex.org/covers/23f10779-468b-47bf-9940-c3bb95d63199/d19d87e0-3072-4de4-b240-9cbf1b9dbf7d.png.256.jpg","country":"Japanese","stat":"7.48","status":"Completed","tags":["Psychological,Comedy,Web Comic,Slice of Life,Music"],"nutshell":"An collection of stories about the slightly weird Miku-chan and her favorite master.\nSo it doesn't matter where you start, or if you don't read it at all.\n Artist’s Pixiv\n Artist’s Twitter\n Author’s FANBOX"},{"name":" Yume Kurai","avatar":"https://mangadex.org/covers/23f1d1b1-5828-472d-964d-6e55c528f74b/36c155e5-282a-4dcf-af3c-2dd2a27847d2.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Psychological,Romance,Drama,Tragedy"],"nutshell":"A nightmare-devouring tapir becomes stuck in Akane's dreams until she can feed him a proper nightmare."},{"name":" Heibon Ponch","avatar":"https://mangadex.org/covers/23f862c8-89dd-4e92-a5b9-84ee3877668f/9f2dae08-f393-410a-8720-91e2fe7e57a9.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Psychological,Romance,Comedy,Adventure,Drama"],"nutshell":"Aki Mashima is an overweight 30-year-old movie director with acne, who also happens to be a borderline lolicon with an irrational fear of large breasts. Mika Wanibuchi is an aggressively ambitious actress with an acute shortcoming in the mammary area, and an obsession with getting a pair of jugs that would make Pamela Anderson jealous. Shortly after their first meeting, Mika murders a famous busty idol, and Mashima decides to go on the run with her, filming their life on the lam."},{"name":" Totsugeki Doitsugurashi!","avatar":"https://mangadex.org/covers/24035bea-a875-4677-b6e4-9d6980cbcf00/b2ad0932-f6fd-4537-b67e-8ab49e864753.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,4-Koma,Slice of Life"],"nutshell":"Comical essay of Yuki Shirono living in Germany."},{"name":" Touhou - The Blue of the Sky and the True Feeling (Doujinshi)","avatar":"https://mangadex.org/covers/2403a212-df47-4ada-a84c-5766df762cea/6bde3327-5115-4739-93cb-7f2e221fe11c.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Fantasy"],"nutshell":"A supporting story for the TH10.5 scarlet weather rhapsody. It is an boring everyday life for Tenshi Hinanai, but not for long. she has obtained the sword of hisou."},{"name":" Lemon no Himegoto","avatar":"https://mangadex.org/covers/240985bd-71f5-436c-9791-08b8a8f353a7/37cf65ea-cc7e-46c3-811a-1bb5826a4161.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"How does love go to your side? Is it like sunlight shining, is it like petals falling, or is it a reply to my prayer– Love. While Happiness shines rays of light, it slowly leaves the sky, picking up huge feathers, shrouding the souls of my blossoming flowers.\nStory 1 - Hana always watches the boy at the library and has always wanted to speak to him, until\none day they are alone in the library together…\nStory 2 - A new boy enters school and is instantly paying a certain girl extra attention.\nStory 3 - ''He is my neighbor, you could call us childhood friends''\nStory 4 - A girl dumps her boyfriend because she is too shy and inexperienced, but he keeps on pur\nsuing her, what should she do?!\nStory 5 - sequel to Story 1, Hana catches her new boyfriend talking in his sleep, he mumbles her na\nme…"},{"name":" Please Teach Me, Senior","avatar":"https://mangadex.org/covers/240a8f75-a483-4ba4-838c-61fe70afc9bd/8cf14dc1-2fdb-4bfc-8687-6ed9c4925eec.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Romance,Drama,Web Comic"],"nutshell":""},{"name":" Loving You Loving Me","avatar":"https://mangadex.org/covers/240dc376-4653-4f0e-8b85-4002c269c0b4/9fce59f3-30a0-44d1-9ece-e61aea0a4190.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Drama,School Life,Slice of Life,Full Color"],"nutshell":"The love story between a female teacher and a 3rd year music major living together under the same roof."},{"name":" Mari Wa Happiendo de Onegaishimasu","avatar":"https://mangadex.org/covers/24107af1-92f2-45c7-8dc4-dc00eeb176c7/11bef6b1-22bb-4ef7-a3d9-af9c06d6c935.png.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"The dream of the sharp-tongued and mischievous schoolgirl Mari is to become a housewife by the age of 20. Pretending to be a lady, she is trying to find herself the perfect husband for this purpose. And then the super-popular musician Aoi unexpectedly proposes to her! \"Let's me marry you, and you, in return, become my vocalist.\" A calculating ulcer high school student and a genius musician-dunce: a love comedy about a completely incompatible couple begins!"},{"name":" My Girl","avatar":"https://mangadex.org/covers/24120692-5fa6-4905-b208-c967445cdbe5/7adc6981-8982-48b5-86d7-60de07e0297b.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,Drama"],"nutshell":"Jinny is a famous model with gorgeous long hair - but little does everyone know that she is in fact actually Ahjin, a high schooler who has short hair, wears glasses and only does modeling for the sake of her uncle! Ahjin has a crush on Dohoon, one of the coolest guys in school. When Ahjin, dressed as Jinny, finds out that she'll be living in the same apartment building as her crush, she's thrilled! But how can she keep her secret from Dohoon, when he himself adores the model Jinny?!"},{"name":" Midwinter Ice Cream","avatar":"https://mangadex.org/covers/241301d5-91aa-4a56-9606-395122e059ce/630a62ea-da2c-4d24-b9f7-31ad538ac090.png.256.jpg","country":"Japanese","stat":"8.33","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life"],"nutshell":"A oneshot by Kurachi Yone, who also made Mikansei demo koi ga ii."},{"name":" Mo'some Sting","avatar":"https://mangadex.org/covers/24133089-c106-490f-a60c-3c17e13ddb7f/c5b240ef-6320-42b5-8eb5-25bd7fe6ec20.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Action,Boys' Love,Drama"],"nutshell":"Tanuki, a suicidal law consultant, shares an unlikely friendship with Asagi, who is half-immersed in the underworld. But when Asagi's niece, Towako, has a hit put out on her by the yakuza, they get caught up in a game of life and death…! The world-weary men find redemption in their efforts to protect one girl…"},{"name":" Hana Haru","avatar":"https://mangadex.org/covers/2414cba6-3022-4d21-8268-836320ae622c/53b2f2eb-0a0e-4e36-a75f-7f3b16f2aabd.jpg.256.jpg","country":"Korean","stat":"8.22","status":"Completed","tags":["Romance,Drama,School Life,Supernatural,Tragedy"],"nutshell":"A werewolf love for a human girl In a cold winter, little girl Hana and her family found a boy covered in blood, the boy is a werewolf baby. They picked up the boy, named him Haru, treated him and accepted him as a family member. A human girl and a werewolf boy who grew up over time. From now on their story begins."},{"name":" Akazukin-chan ga Fushigi no Kuni ni Mayoikondayou Desu","avatar":"https://mangadex.org/covers/24150351-8162-4ed5-b330-890635d630b3/835e3bea-3152-48ac-9f1d-2b1afc6be9b2.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Comedy,Fantasy"],"nutshell":"This time Little Red meets the White Rabbit, who was incidentally halfway through a race with a turtle. Together they discover a mysterious hole in the ground which leads them to Wonderland. There she meets many delightful personalities like the Cheshire Cat, the Mad Hatter and the Queen of Hearts, in addition to characters from the first book. How exactly will the airheaded Little Red manage to get herself out of Wonderland?\nhttp://demiotaku.livejournal.com/11998.html\nhttp://akazukinchan.net/"},{"name":" otona♥pink","avatar":"https://mangadex.org/covers/24167382-cec7-47a7-8bce-192f0e93d57a/5630833f-1fa6-4a98-8cf7-b97b228a309f.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Sensei, please teach me about love.\nSenou Miku is a normal high school girl. On the day that she had her first boyfriend, her mother had a job transfer. And then, her guardian, who came to live with her, turned out to be her homeroom teacher, Nishizono-sensei…"}]