[{"name":" Ai ga Kami o Korosu Toki","avatar":"https://mangadex.org/covers/1742c945-ab1a-4fba-b65f-93240f234456/731ae78f-674d-4869-a7ed-5bae8bae81df.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"On his trip to New York City, college examination student Takeru gets lost in the wrong part of town. He gets attacked, but is rescued by a man named Ray. Touched by Ray's kindness, Takeru can't help being attracted to him. But then Takeru discovers that Ray is the second-highest-ranking mafia man in New York City. Can love overcome such odds?"},{"name":" Heng Sha Ji","avatar":"https://mangadex.org/covers/17439b58-8a28-4b15-88b2-562d53c74df2/a4a93c00-7974-4147-a85a-64430495c62c.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Official Colored,Monsters,Action,Fantasy,Web Comic,Full Color"],"nutshell":"According to legend, when the three ghosts coexisted in the world, the world would be in chaos, but now the two ghosts coexist, only the anger ghost has not yet appeared. The young monk possessed by the demon fox embarked on a journey to eradicate the evil spirits without cause, but his first mission destination... was actually in a brothel? !\n(MTL)"},{"name":" Million Doll","avatar":"https://mangadex.org/covers/1749dc3d-c0f1-4565-89fb-8c2461cfa799/abca6771-f831-4d81-8b61-6bdde31d8b8d.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Drama,Slice of Life"],"nutshell":"The manga revolves around Suuko, an idol-loving hikikomori (shut-in) who has one ability: To make any idol popular through the power of blogging. She puts her sights on the Fukuoka idol Itrio and tries to make them sell more, but she is impeded by the charismatic otaku Ryu-san and the underground idol Mariko.\nSee the original on: http://ganma.jp/mdoll !"},{"name":" Ayashibito","avatar":"https://mangadex.org/covers/174f8c57-3d2b-40f4-9f2e-1074a614384d/51118902-7f43-4440-9b3b-e2c5d9fc1d13.jpg.256.jpg","country":"Japanese","stat":"7.61","status":"Completed","tags":["Reincarnation,Girls' Love,Isekai,4-Koma,School Life,Monster Girls,Slice of Life"],"nutshell":"Aya Kotonoha, a high school girl, reincarnated into the world of Ayashibito, the monsters reformed into the shapes of humans. Being compelled to hide her identity as a human, Aya encountered various \"dangerous\" Ayashibito, including a snow woman and a zombie! Can she survive in this world and successfully find a way to return?"},{"name":" The Genderswapped Boy is Always Beside You","avatar":"https://mangadex.org/covers/1759443e-b341-49ec-9c10-46c2b6159720/f5c9ec00-8251-4800-b63b-768e51bc17ec.jpg.256.jpg","country":"Japanese","stat":"7.49","status":"Completed","tags":["Oneshot,Genderswap,Full Color"],"nutshell":""},{"name":" Mother Sarah","avatar":"https://mangadex.org/covers/1759e70e-c569-4f30-9ac5-30fd4c595768/af79fe6a-e2ed-4090-a930-14732fe9c7fd.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Sci-Fi,Action,Survival,Adventure,Post-Apocalyptic,Military,Drama,Tragedy"],"nutshell":"Orbiting serenely above a long-ago poisoned earth, the last bastion of human civilization is the space colonies. After a terrorist attack, the colonists are forced into exile on the blighted planet below. In the confusion, a young mother is separated from her family and is flung into a bleak, uncertain future… But Sarah will not rest until she finds her children."},{"name":" PQ Angels","avatar":"https://mangadex.org/covers/175ec735-d0f9-425b-ad4a-618a4263091a/04638de4-e850-468a-aae1-739b2b9f79e3.png.256.jpg","country":"Japanese","stat":"7.95","status":"Cancelled","tags":["Romance,Fantasy"],"nutshell":"Peanut and Kyuuri are aliens who have just arrived on planet earth. Their mission? Find their missing queen! However, this is not easy considering how they have some evil menace pursuing them and the fact that they turn into cockroaches and can’t turn back without kissing a human male! They also have a lot to learn about the new planet they’re on, so it’s a bit difficult when they have to fight evil…\nNote: There are only four chapters that were ever published in this series, as Naoko dropped this project due to Kodansha losing her original manuscript."},{"name":" Kimi o Suki na Riyuu","avatar":"https://mangadex.org/covers/175ffa26-df4b-4aa8-92d5-24e26237c176/ce25e8e1-1dd2-4f1a-ae13-5fe002b9021b.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance"],"nutshell":"Hinano, an ordinary girl, is in love with Katsu who dreams of becoming a scriptwriter despite the difficulties of the trade. They enjoy a perfect love until love rivals come to threaten their relationship! Sei, a beautiful boy and compulsive flirt, attempts to seduce Hinano and Juri, an intelligent woman, tries to her hand at getting close to Katsu! What will become of the couple's love?"},{"name":" B-men Kazoku","avatar":"https://mangadex.org/covers/176369d6-e7aa-4caf-a43b-e3aa8531e5d9/0c255e8c-ea63-40e1-948e-a417a3d30acf.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Romance,Comedy,Reverse Harem,Drama,Fantasy"],"nutshell":"Merumo has come to the human world from the Magic Village, and is an extremely pure hearted witch by nature. Her mission is to find a \"Bii Men\" (\"Bee-autiful Face\") gentleman… and make a baby with him?! Flying through the air on spinning wings, Merumo searches a school in the center of Megalopolis and causes an uproar. Amongst the gathered crowd, however, are four Bii Men! And so begins Merumo's life as a student…!!"},{"name":" After Man: SAM","avatar":"https://mangadex.org/covers/1766f1ef-89a7-4eb7-a18c-2256c337dbc0/3790a4ed-88a7-40cc-8d3b-9a13c49fd676.jpg.256.jpg","country":"English","stat":"7.97","status":"Ongoing","tags":["Sci-Fi,Survival,Adventure,Post-Apocalyptic,Fantasy"],"nutshell":"In a post-apocalyptic world where killer robots hunt humans, a group of children tries to survive.\nIn the grim future of our world, Earth has been ravaged by sentient machines, the human race all but exterminated. Only scattered groups of children have survived by hiding in tunnels to escape the murderous robots that still scour the surface. One day, a scavenging party for one such group happens upon a massive humanoid robot bearing the letters SAM on its armour. Caught by surprise, young Ian is about to be vaporised … but the machine doesn’t shoot…"},{"name":" Neo Romance of Three Kingdoms","avatar":"https://mangadex.org/covers/1769ea76-e2b5-4c8b-86db-5d1b42cab44a/70e1c7a7-b397-4f77-a9f1-c78dcd46b091.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Thriller,Historical,Action,Psychological,Survival,Martial Arts,Adventure,Military,Drama,Supernatural,Adaptation,Tragedy"],"nutshell":"China 2A.D.: the corrupted Han Dynasty has thrown the entire country into chaos. Peasants revolt against the government. Into such an age, the ruthless and infamous hero, Cao Cao Mengde is born. Destroying old customs and values, he tries to unite China, with a band of promising and intellectual followers, handpicked for their individual talents and potential. Generally thought a villain, Cao Cao Mengde is portrayed as a hero in this story, which focuses on what kind of person he actually was. There are two other protagonists: Liu Bei Xuande and Sun Quan Zhongmou. Liu is a man of high morals and infinite potential. His servant, Zhuge Kongming is a mysterious man, who helps Liu to become a king who is loved by millions. Sun is the third descendant of the Sun family. A young and immature king also comes into the picture, creating more chaos. This is a Tale of the Three Kingdoms (\"Sanguozhi\") in which these three men rage war throughout China.\nNote: Republished under Gokuatsu - \"Beyond the Heavens\" after the anime started airing. Every three volumes are combined into a single volume."},{"name":" Daughter of the General","avatar":"https://mangadex.org/covers/1772da10-bcb0-452a-a798-51f42d031dc6/caccde9d-d935-49c1-a06c-9c653e35a9ce.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Romance,Drama,School Life,Slice of Life"],"nutshell":"After witnessing her father dragged off by a loan shark and found dead, Da Ra Ji is determined to do justice to those people who killed her father."},{"name":" Rail of life","avatar":"https://mangadex.org/covers/177559e3-81eb-4d89-af7b-51f0604583d5/166a3d0d-0bcf-406d-a7f5-a9e2ee2bab87.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Slice of Life"],"nutshell":""},{"name":" Me2","avatar":"https://mangadex.org/covers/1780eb9d-b91b-4051-86b5-9bbe59f0de21/5fb76cd8-ac07-4c88-83fb-cb90a9de9e8c.jpg.256.jpg","country":"English","stat":"8.04","status":"Cancelled","tags":["Psychological,Romance,Drama,School Life,Slice of Life,Mystery,Tragedy"],"nutshell":"Aki is a shy, introverted teen trying to cope with the death of her older brother. Coupled with the daily pressures of being the most bullied kid in school, she keeps having mysterious blackouts. Entire days begin to be unaccounted for as Aki finds strange items in her closet. Adding to her bewilderment, the cutest boy in school is suddenly taking an interest in her. Aki wonders if her grip on reality is slowly slipping away, but something even more shocking might be behind this haunting tale..."},{"name":" Bokura ni Namae o Tsukeru Nara","avatar":"https://mangadex.org/covers/17859923-e2af-4c93-ab06-c8fa6ab6a2c2/cfb2884f-4ab2-4613-b73b-e21291f34899.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Boys' Love,Incest,Drama,School Life"],"nutshell":"In the third year of high school, Izumi Tohsaka reunited with his younger brother, Kaoru Yano. Seven years after my parents divorced, I decided to live together in a dormitory shared room again. Lower voice, red-dyed hair, mature look, unknown surname… Izumi is attracted to him who has changed everything and doesn't even realize he is his younger brother. Even though they are supposed to be siblings, this emotion in my heart…?"},{"name":" Himitsu no Kakera","avatar":"https://mangadex.org/covers/178887a5-3469-48d6-a448-f93af44f8086/bc5ee7ee-2173-4a01-ac01-3c625c7f3036.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Girls' Love,Supernatural"],"nutshell":"A collection of Fujisawa's doujinshi published by Yuri-Hime Comics.\n\nSore wa Omoi no Kakera (それは想いのカケラ)\nFuyu no Hanashi\nChiisana Kikkake Tsumikasanete\nMari-san to Aoi-chan\nHontou no Uso to Himitsu"},{"name":" Hawkwood","avatar":"https://mangadex.org/covers/178bd1bc-51cf-4d6f-96ac-63515df21ac1/0a8706a9-e30b-4974-bdcf-46a9ed25d290.jpg.256.jpg","country":"Japanese","stat":"8.29","status":"Completed","tags":["Historical,Action,Survival,Military,Philosophical,Drama,Tragedy"],"nutshell":"The story takes place in the 14th century during the 100 Years War between the Kingdoms of France and England.\nOfficial French"},{"name":" Kono Koi wa Kataranai","avatar":"https://mangadex.org/covers/1793cd2c-8d90-4f46-8e47-d478d2b6e6f0/b053bfa9-4891-482d-bb73-a7930696b60b.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Boys' Love,Office Workers"],"nutshell":"Kiyono-kun often gets confessed to by his co-worker, Aoyagi-kun. However, when they are alone, Aoyagi-kun acts coldly towards him, making their relationship awkward.\nOn a business trip - with just the two of them - will something change?"},{"name":" Hajimemashite no Koi","avatar":"https://mangadex.org/covers/179618f1-36dc-4144-88e0-c07323ac8264/548b6fb2-a1be-426d-8be0-c6804db34dcd.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Romance,Comedy,Boys' Love"],"nutshell":"On a fateful rainy day, Arata Shino'oka falls head over heels in love upon venturing into a quiet little tearoom. The one he falls for, Chihiro Kiritani, is a cheerful waiter like none other with a cute smile. Paying no heed to the tearoom's closing hours, Arata is invited to take shelter from the rain and is immediately taken in by both Chihiro's kindness and the tearoom's friendly atmosphere - so much so that he decides to work there part-time! After being there three months, Arata attempts to close the gap between him and Chihiro, but each time he approaches him, he's virtually paralyzed by his cuteness!"},{"name":" Return To The Hidden","avatar":"https://mangadex.org/covers/17a1fdb2-9249-4f1a-b853-a4980f1f5530/7117edcc-43fe-42a1-95e6-18537ce5a2b4.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.06","status":"Completed","tags":["Oneshot,Historical,Action,Psychological,Horror,Fantasy,Supernatural"],"nutshell":""},{"name":" Odu-kun no Vita Sexualis","avatar":"https://mangadex.org/covers/17a4c349-d83c-4493-a824-63aec042c05e/ca95dc37-9616-457b-9422-329db7270dba.jpg.256.jpg","country":"Japanese","stat":"7.68","status":"Completed","tags":["Boys' Love,School Life,Slice of Life"],"nutshell":"30 year-old Odu is feeling left out. His friends are slowly marrying off and with his tiny salary as a video store clerk, he can't afford to go on trips with them when they can all hang out. Oh, and just to top it all off, his popular friend Araragi just found out Odu's most embarrassing secret… Odu's still a virgin at 30, but maybe it's not so bad after all, because Araragi's never been with a girl either?"},{"name":" Harlem Beat wa Yoake Made","avatar":"https://mangadex.org/covers/17af1640-3219-47ff-b281-9576c6e06b3d/8b8c2f85-9f8b-412b-97f4-c090189b2b64.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Romance,Comedy,School Life,Fantasy,Supernatural"],"nutshell":"Meet Kujou Yamato, who on the outside is your average high school kid pursuing love and happiness. Except in truth he's the prince of hell, escaped to the human world to avoid a marriage he wants no part of. But hell wants him back, and picked a trio of their finest (?) to rope in him! Not to mention, his fiance isn't going to just wait around forever…"},{"name":" Tales of Graces f","avatar":"https://mangadex.org/covers/17b09e7b-bea6-429e-9bdb-061fedc40cc3/20888464-e1f3-4cce-b734-7c1683075e2f.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Adventure,Fantasy"],"nutshell":"Taking place on the planet Efinea, Asbel Lhant seeks the strength to protect those he holds dear. Along with his childhood friends and the mysterious and innocent Sophie, he must explore the bonds of friendship as they find themselves drawn into the conflict between three kingdoms competing for dominance of the planet.\nBased on the role-playing game of the same name by Namco Tales Studio."},{"name":" Ano Ko no Ie","avatar":"https://mangadex.org/covers/17b214b6-abbc-41ee-bd63-5a64636d7f10/981d4b4a-19ff-4aac-b9a6-32a26d393dcb.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Philosophical,Slice of Life"],"nutshell":"A slice-of-life manga running in Comic Ryuu that follows the life of a young girl and her neighbor."},{"name":" Ai  se eu pudesse voar","avatar":"https://mangadex.org/covers/17bce5f5-37ea-42f8-b2e6-2715f9cb87bf/f742f690-98b1-4af6-a237-f7be65f22d31.jpg.256.jpg","country":"Portuguese (Br)","stat":"7.97","status":"Ongoing","tags":[""],"nutshell":""},{"name":" Orokamono ga Koi o Shitara.","avatar":"https://mangadex.org/covers/17bf56bb-b6cd-4c8e-b202-6838a78fbdf6/0df473cf-c45c-447c-9ccc-512bb7486c28.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"After he wakes up in an unfamiliar room, Yuusei goes over his memories with an aching head. Being dumped by his girlfriend. Drinking in a bar. And meeting a mysterious beautiful man in said bar. He slowly remembers these things.\n\"Do you want to try it with an older man?\"\nAfter he was asked with those sweet words, Yuusei had agreed without hesitation, and the two spent a night together.\nThey will never meet again.\nOr so he thought – but then the two meet again in a very unexpected place…"},{"name":" 7's","avatar":"https://mangadex.org/covers/17c30fa1-f6cb-43c2-b22a-94e2befd5ebe/11d7a337-6a93-4912-b9b4-8e34983b5f6d.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Time Travel,Psychological,Horror"],"nutshell":"A pretty girl, Tamura Nagisaki, appears before an ordinary high school boy. When she says, \"Will you protect me?\", his ordinary life is thrown into a tailspin. The pleasure killer, Dimensional Rider, kills Nagisaki without a motive. With Nagisaki's death, time between the two loops back and forth. Can the two escape the carnage and infinite loops…?"},{"name":" Asanaga Ryuutarou no Midara na Nichijou","avatar":"https://mangadex.org/covers/17c938f1-cac7-4ce1-89af-81570bb4a7ca/7499b1a1-aefd-4434-a87a-54b0f111c3fe.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Boys' Love,Drama"],"nutshell":"Asanaga Ryuutarou, the successor to a floral arrangement family, has a severe but overly beautiful appearance. Despite this, he has two secrets which have not yet been let out into the world. Number one: he has a male lover. Number two: he is an extreme masochist. With those secrets noticed by the creepy and wild movie director Edagawa, will they be let out to Ryuutarou's beloved boyfriend, Maki…?"},{"name":" Tengu no Kuni","avatar":"https://mangadex.org/covers/17cf7dfd-761b-403f-b8d8-444f165c6db5/f1921208-7998-4366-ab33-1416ce9b1927.png.256.jpg","country":"Japanese","stat":"7.62","status":"Completed","tags":["Magic,Girls' Love,Monster Girls,Supernatural"],"nutshell":"Kureha, a Tengu girl, enters Amakake academy with the goal of becoming an imperial guard. However, she is shocked to find out that got second place on the entrance exam, beaten by a girl named Shizuki. Kureha soon finds out that Shizuki is \"special\"."},{"name":" Ohisama no Tamago","avatar":"https://mangadex.org/covers/17d0507b-c407-4581-a1e5-eb23c3fddedd/076f6db1-90cb-4efa-94c9-9839a67543fd.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Boys' Love,School Life"],"nutshell":"1-5) Ohisama no Tamago\nBizarre club for UFOers kidnaps new student to be a member.\n\n\nKimi no Tonari ni (By Your Side)\nIn boredom there isn't a single meaning that lies behind each passing day, but that is before two highschool-aged boys stumble upon eachother…. They discuss life and death, and happiness.\n\n\nRespective Feelings"},{"name":" Debu to Bijin","avatar":"https://mangadex.org/covers/17d363f8-ece3-434c-8dbd-0ad34330bc65/e2f72d74-7484-42f9-88b5-b12909d877a3.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Oneshot,Romance,Drama,Slice of Life"],"nutshell":"A realistic and heavy story about a fat loser and a beautiful slut."},{"name":" In The Cage","avatar":"https://mangadex.org/covers/17d6ae77-ac99-4551-b646-538628330c39/a8800a8e-210d-43cf-a32b-df852ebbb2f5.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"Haru, an Omega, is in relationship with Eiji, an Alpha and his childhood friend. But Eiji, who is from an elite family, already has a fiancé and Haru always comes in second. One day, Renji (Alpha), Eiji's older brother and Haru's first love, appears before him: \"I came to pick you up,\" Renji declares.\nWhere will this complicated love triangle lead?"}]