[{"name":" Aoi Yoru","avatar":"https://mangadex.org/covers/c1389cb1-a8fb-4e17-b411-b5cb7daf7d61/6eb19e67-6f5d-487a-b79c-371dd357c426.png.256.jpg","country":"Japanese","stat":"7.41","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life"],"nutshell":"Kuroda and Shimamura get trapped in a classroom and everything gets worse when they see two of their teachers are having sex."},{"name":" Bend Over, Darling!","avatar":"https://mangadex.org/covers/c13995b1-f73b-4f88-94f6-2404f54480fc/35066e99-a26c-4b4a-8ab2-ee655e0a9e3a.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Office Workers,Drama,Slice of Life"],"nutshell":"Office worker Takato Atsushi develops erectile dysfunction after discovering how sexually open his wife truly is.\nAfter months of being unable to satisfy each other, his wife decides they should try something new...\nBut can Atsushi stay satisfied with this...?"},{"name":" Tsukihime - Dakara Ore wa Ren wo Osou   (Doujinshi)","avatar":"https://mangadex.org/covers/c13b4714-2495-4ee1-b36a-726806c8db07/e6e904ee-6cdb-469a-8bb2-7388b13d277e.jpg.256.jpg","country":"Japanese","stat":"8.39","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":"\"Inhuman loli or my sister-in-law, which one should I choose?\"\nA story with surprise ending."},{"name":" Remon Wa Ama Noja Ku","avatar":"https://mangadex.org/covers/c13c100f-a3cd-4d84-a866-029e76d17871/809b03aa-1e6a-4a18-88f1-e7c54dee5e3c.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Oneshot,Romance"],"nutshell":""},{"name":" Shashin","avatar":"https://mangadex.org/covers/c13cb760-b00c-41a7-b17e-7aca5fe3e8b2/5a173a89-1473-4f90-bf4f-4f3f7c28515b.jpg.256.jpg","country":"Korean","stat":"8.11","status":"Ongoing","tags":["Historical,Action,Long Strip,Martial Arts,Drama,Web Comic,Full Color"],"nutshell":"Jongli Chu, a warrior of the Death Heavenly Sect who killed Hwang Jung to avenge his older brother. In order to avoid the pursuit of Death Heavenly Sect, he looked to an assassin of the Death Soul Agency, Crimson Assassin, for help and got swept into a huge mess known as the Obliteration. In order to escape the shadow of the Obliteration, he had no choice but to become a legendary Death God! Can Jong Lichu become a Death God and find freedom in the stifling rules created by the orthodox sects?"},{"name":" Rainbow Amber","avatar":"https://mangadex.org/covers/c14462b9-b47e-4082-bc9b-c3df33ce6304/1f285056-972a-43c9-b75c-4d96905d0ec1.png.256.jpg","country":"Chinese (Simplified)","stat":"7.86","status":"Completed","tags":["Long Strip,Romance,Boys' Love,Office Workers,Drama,Web Comic,Full Color"],"nutshell":"Because of his work as a banker, Zheng Yu An met Yan Shu Wang, the CFO of a partner company. In the process of talking about cooperation, Zheng Yu An slowly developed a good impression of Yan Shu Wang under the CFO's teasing. Zheng Yu An didn't know that, not only Shu Wang had deliberately flirted with him, but he also carefully planned it...\nAffectionate and patient/Long-haired beauty/CFO Yan Shu Wang (Gong) X Gentle/Charming/Bank Corporate Department Director Zheng Yu An (Shou)"},{"name":" I'm a Robot.","avatar":"https://mangadex.org/covers/c145b408-c654-43f9-96e7-1c5f98c6a11a/a52e4d6b-1893-46fa-8ff3-c085aa29bf27.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Ongoing","tags":["Sci-Fi,Long Strip,Romance,Comedy,School Life,Web Comic,Full Color"],"nutshell":"High-performance AI Ando Robowo will enter high school for a performance test! A school comedy about Robowo's love and friendship!"},{"name":" Shou-6 Nostalgia","avatar":"https://mangadex.org/covers/c1460b3f-8689-45df-bde8-7598332f7f1a/444d9ab2-0350-4df0-8e6b-65e96b9cd368.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,4-Koma,Slice of Life"],"nutshell":"この日があるから、今がある！！物語の舞台は1980年代――。主人公・小学6年生のスズは、郊外に住むごくごく普通の女の子。ノストラダムスの大予言に怯えたり、初めてのブラジャーにドキドキしたり、好きな男の子に告白できずにアレやコレやと悩んだり。。。新鋭・冬川智子が4コマでつづる、コドモでオトナな思春期ダイアリー。"},{"name":" Shadow Cross","avatar":"https://mangadex.org/covers/c14bc2f8-2e0a-44ee-80e0-937e71c9ba53/aa9a4e01-6448-4b85-91d7-9ac7cd9e50c1.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Sports,Slice of Life"],"nutshell":"The story is about Fumi Sekijyou, a well-meaning but very jittery and nervous girl. This is due to a past trauma that also makes she can't touch anyone, because she will get a nose bleed. One day the store she works for asks her to get rid of a customer that keeps occupying the roof. Once on the roof she sees the customer dancing by himself; the young man ends up introducing her to the world of ballroom dancing and awakens her passion for it. Will Fumi Sekijyou overcome her past trauma and advance in the world of ballroom dancing?"},{"name":" I'm Mortal","avatar":"https://mangadex.org/covers/c14d71a7-1181-4335-8671-b2075d4d3faa/f0e37eeb-86d6-47e2-97ff-462e15ecd54c.png.256.jpg","country":"English","stat":"7.97","status":"Ongoing","tags":["Demons,Ghosts,Comedy,Magic,Drama,Web Comic,Slice of Life,Supernatural"],"nutshell":"Morty is a reaper, but he wishes to befriend a human. It's not easy, since most humans see him as an intimidating skeleton, which makes it hard to start any friendship at all. However, one day Morty meets Lance who not only sees him as a regular person, but also believes that Morty is just a regular guy. Scared that Lance may reject him once he knows the truth, Morty decides to pretend to be a mortal himself."},{"name":" The Turning Point Of Shura- Birth Of Malice","avatar":"https://mangadex.org/covers/c1543fcc-1b07-4057-ace4-194885729205/4ab5d10e-db4d-45be-9b59-b2783f1f58bf.jpg.256.jpg","country":"Korean","stat":"7.99","status":"Ongoing","tags":["Action,Long Strip,Martial Arts,Drama,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"In the Early Era, the Creator gave man a mission to eliminate all the ‘unclean’ entities that existed in the world. The man confessed to the Creator that he couldn’t complete the mission on his own and asked for help. In response, the Creator sent 13 people, including ‘Ragnir’ to help. They were called ‘The First Shura’ and they would work to fulfill the Creator’s mission together. That is until a huge war breaks out between the ancient creatures and the Shura, whom they fear. Thus begins the ‘Discord’ and the ‘Birth of Malice’.\n\n\nOriginal Webtoon <kakao>"},{"name":" CinnamonRoll","avatar":"https://mangadex.org/covers/c15539d5-52f4-49f6-91cb-0cacf1edc4d6/730b080d-c03f-47b9-a775-f25bf6f15901.jpg.256.jpg","country":"English","stat":"8.04","status":"Ongoing","tags":["Long Strip,Comedy,School Life"],"nutshell":"Whether the most popular guy in school to melt heart of the Ice Princess?\nLe quotidien de Satu et de Rin en courtes scènes, pleines d'humour.\nSatu est crack-love de Rin et Rin….a besoin de persuasion…"},{"name":" Kecchin","avatar":"https://mangadex.org/covers/c158261d-fad9-45e8-a7c9-02c1e20e6792/d84fe79e-4efb-4eb7-b706-6a41ef12bf7c.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"Shu, Yu, and Mako have been friends since they were little, but after middle school graduation they begin to drift apart. Shu has become the rough kid of the three, with his motorbike, cigarettes and porn. He's going to follow his brother into carpentry. Yu is the smart kid, and he's developed a crush on Mako. They attempt to enter the same high school - one below his mental abilities, but unfortunately above hers. After Mako fails the entrance exam, she goes to another school and works part-time as a waitress.\nNow Yu is going to high school alone, but he soon makes friends with a pretty girl who encourages his newly-discovered tentative interest in motorcycles.\nWill Shu, Yu, and Mako be able to keep their friendship alive, despite the different paths their lives have taken? What will happen with Yu's crush on Mako, now that he's growing closer to another girl?"},{"name":" The Princess in the Attic","avatar":"https://mangadex.org/covers/c15b4cc8-92a5-4ac9-b2a6-389ebaad366b/08b82728-a2e4-44c1-8fa3-058b9fafffe6.jpg.256.jpg","country":"Korean","stat":"8.04","status":"Ongoing","tags":["Long Strip,Romance,Magic,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"I've lived in this little hell ever since I was born for being the daughter of a gypsy who carries misfortune. The Trump Empire killed my innocent mother. The emperor, the temple, and the whole empire locked me up, abused me, resented me, and abandon me. Their abandonment is an opportunity, Here in the kingdom of Jardine, I will begin my revenge. The Trump Empire, may it dry up a little more. The dryness will soon be a precious stream for me. …I will start my revenge.\n\nBranded as a cursed child, Princess Osiria spent most of her life locked in an attic. In actuality, Osiria is the divinely chosen, the one who could’ve saved the empire of Trionfo. Instead, she was sold to a neighboring kingdom and left in the care of Sir Fedelius, a handsome young knight. Although her heart beats faster when Fedelius is around, she doesn’t plan on staying for long. She wants only one thing… to get revenge on those who abused her and killed her mother. Will her heart soften with love or will she seek vengeance to the very end?\n\nOriginal Web Novel\nOriginal Webtoon: Daum, KakaoPage\nOfficial Translations:\n\nEnglish\nChinese (Simplified) / 汉语\nChinese (Traditional) / 漢語\nIndonesian / Bahasa Indonesia\nJapanese / 日本語\nThai / ภาษาไทย"},{"name":" Neko no Te datte Yaku ni Tatsu","avatar":"https://mangadex.org/covers/c15bcb19-8aa3-4fef-acaa-6d5b54ca90e7/f5b5b0b2-0299-41fe-8641-eeeabd343054.png.256.jpg","country":"Japanese","stat":"8.22","status":"Ongoing","tags":["Animals,Comedy,4-Koma,School Life,Web Comic,Slice of Life,Supernatural,Full Color"],"nutshell":""},{"name":" Musunde, Tsunaide","avatar":"https://mangadex.org/covers/c16289e7-eb1e-4c61-8ac4-7c53726feea9/5308ca57-9db4-4c16-99cc-9c2b444d06c7.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Comedy,4-Koma,Slice of Life,Mystery"],"nutshell":"The manga centers on Kanoko and her friend Tsunagu. Their personalities are completely opposite of each other, but they are still very close. But something happens one day while they're playing near a small mountain shrine that they call Nomiyama-sama."},{"name":" Araiso Private High School Student Council Executive Committee","avatar":"https://mangadex.org/covers/c167904f-3625-4d99-8341-d5bccdb6213b/d45cb5b6-5412-4a33-93ba-bac58492613a.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Action,Comedy,School Life"],"nutshell":"Meet the Executive Committee of Araiso Private High School: a group of five students whose motto is \"Ridiculing the weak and bullying the strong.\" At the heart of the committee are Kubota Makoto and Tokito Minoru, two bad boys who take care of any trouble at the school in unique (and often violent) ways.\nNote: Though this is considered an alternate story to Wild Adapter, with which it shares both protagonists' names and basic personality traits, there are little to no similarities in plot and Araiso has a far more upbeat tone."},{"name":" Biorg Trinity","avatar":"https://mangadex.org/covers/c178430f-2f26-4c22-bb02-a6b0196a17c3/77e96cfd-6394-4b16-88ea-63d3891f50ad.jpg.256.jpg","country":"Japanese","stat":"7.69","status":"Completed","tags":["Action,Romance,Comedy,Drama,Supernatural,Mystery"],"nutshell":"Opening holes in the palms of both hands, the “Bio Bug” disease enables people to absorb and then fuse with things they like. In a world made up of precarious balances, what will become of love, of youth? Here the curtain rises on a really incredible pair, delineated in a brand new youth-ensemble cast."},{"name":" Shirosugi! Akunontsuki","avatar":"https://mangadex.org/covers/c1802f22-22a3-426a-ac1d-56b7863b6161/e4eed300-8ff7-4c65-9854-34423d64be43.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Comedy,School Life,Slice of Life,Tragedy"],"nutshell":""},{"name":" Kuma-san to Issho","avatar":"https://mangadex.org/covers/c180dadf-469a-489d-8316-b7394f0a2f8b/beead64d-f67c-4c75-908b-d27cf168a18b.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Psychological,Horror,Supernatural,Tragedy"],"nutshell":"A little girl Rin and her bear protector happen upon Sayuri, a survivor of the zombie apocalypse. Rin seems to be living an idyllic life in her lone mountain home, but how is it that she and Mr. Bear have managed to go unnoticed by the zombie hordes?"},{"name":" Jumpaku Dress ni Akaiito Kiss kara Hajimaru Dekiaikon","avatar":"https://mangadex.org/covers/c181d2a4-2625-4d04-8a03-4fa2e0f71f6a/9bf60878-fae1-4cfe-b36c-89da749d7483.jpg.256.jpg","country":"Japanese","stat":"8.36","status":"Completed","tags":["Romance"],"nutshell":"Nozomi yearns to be a ‘bride in a beautiful dress’, she happens to meet her childhood friend, Kanata, who has become a popular designer. He is often busy and lacks life skills (as well as having an ulterior motive). In order to take care of him, Nozomi frequently visits his atelier but one day, after a year had passed without any progress, a sneaky move by Nozomi leads to a sexual encounter…?\nThe first short story collection contains the following: Nozomi meets the man of her dreams for the first time in 16 years, a first sexual experience with a devoted boyfriend, a summer with a young boy, and an indecent one-night stand."},{"name":" Boku to Boku","avatar":"https://mangadex.org/covers/c184e253-d966-4220-8b2c-a265ab8e1817/4b05d299-9e94-45b6-ab59-7de72b85a811.jpg.256.jpg","country":"Japanese","stat":"7.37","status":"Completed","tags":["Romance,Comedy,Crossdressing,School Life,Slice of Life"],"nutshell":"Junichirou Izumi is a trap who often wears the clothes designed by his mother, who runs her own clothing brand. Junichirou is saved from a train molester one day by Yuuki Kimino, a boyish girl. The two later discover that they go to the same school."},{"name":" Catch You Catch Me","avatar":"https://mangadex.org/covers/c189897c-22b1-4456-a904-aff03440bd16/169aef64-4282-4433-acfe-a94a8876bfca.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Oneshot,Girls' Love,School Life,Supernatural"],"nutshell":""},{"name":" Silent Manga Audition: Sekai kara Todoita Japanese Manga","avatar":"https://mangadex.org/covers/c18a867b-adbb-4aa9-a9c7-b9fe72979270/e07242d9-b882-48e2-97e9-d61c333a3c90.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Ongoing","tags":["Sci-Fi,Romance,Comedy,Drama,School Life,Slice of Life,Mystery,Tragedy"],"nutshell":"SMA 01 Theme: Love Letter\n||\nGRAND PRIX\nExcuse Me by Alex Irzaqi (Indonesia)\nskysky by Prema Ja (Thailand)\nGRAND PRIX RUNNER UP\nROACH STORY by Erwin Prasetya (Indonesia)\na Pure Love by dee Juusan (Jordan)\nBEGINNING AND ENDING by Vincent Lange (Germany)||"},{"name":" Gokicha!!","avatar":"https://mangadex.org/covers/c18b1027-3345-46df-b08d-1a45e606930c/8b4d2997-dead-4516-a16a-d8c4f09e732a.jpg.256.jpg","country":"Japanese","stat":"8.50","status":"Completed","tags":["Comedy,Adventure,4-Koma,Slice of Life"],"nutshell":"Behold the the struggle of the adorable little cockroach Gokicha-chan as she struggles to make friends with humans after moving to frigid Hokkaido to escape the unfortunate reputation her species enjoys in the Kanto region."},{"name":" A Midsummer Night's Dream (MIUCHI Suzue)","avatar":"https://mangadex.org/covers/c1942d50-e385-4209-bdb2-41a3b028c912/940573e8-7853-4d25-b324-419896454cc6.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Psychological,Romance,Comedy,Magic,Drama,Slice of Life,Supernatural,Mystery,Adaptation,Tragedy"],"nutshell":"(from ebookjapan):\nThe Rose King says he will grant any wish if you create the best rose worthy of being called Venus, the goddess of beauty. The Murray and Bodard families, both rose artisans, are at odds with each other in their attempt to cultivate a rose that will be favored by the king.\nThe daughter of the Murray family, Mylène, and the son of the Bodard family, Alain, fall in love as soon as they meet at a party.\nUndeterred by the opposition of others, Milène and Alain nurture their love and try to create the Venus rose.\nIn addition to \"A Tale of Roses\", \"A Midsummer Night's Dream\" and \"Marie in Light Blue\" are also included in this collection."},{"name":" Fate/Zero - Tateshi Gokko (Doujinshi)","avatar":"https://mangadex.org/covers/c19715ea-3cf1-4a34-bffc-3cc1d3fc99b3/ae54577a-d64e-460a-b35d-dbfd4c45c70c.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Comedy"],"nutshell":"Fate/Zero doujinshi from Comiket 81."},{"name":" Tentai Senshi Sanred","avatar":"https://mangadex.org/covers/c19b5ea9-78dc-4103-a3f3-8ae10f383471/030cc8a1-8943-4157-8c68-39cf09442b29.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Sci-Fi,Monsters,Action,Comedy,Crime,Superhero,Martial Arts,Office Workers,Delinquents,Police,Slice of Life"],"nutshell":"Tentai Senshi Sunred is a powerful, battle tested hero of many years. He has sold his super bike, which is seen in the opening credits. Now he smokes a lot, is effectively unemployed, and lives by the grace of his girlfriend, Kayoko Uchida. His arch enemies in the Evil Florsheim Army are still trying to take over the world. Under the direction of their local leader, Vamp, they help members of the community, run a cooking show, assist Kayoko Uchida whenever possible, and try to attack the ever powerful Sunred.\nAll in all, a light parody of the japanese Henshin Hero generation.\n\nLinks:\n\nAuthor's Twitter\nAnime Season 1 on ANN\nAnime Season 2 on ANN"},{"name":" I Was Reborn as the Villainess' Father and I Need XXX to Survive?!","avatar":"https://mangadex.org/covers/c19e7ff1-36c4-430a-a92a-884716963ea9/dfd607ac-b639-4573-9d45-17a52e999839.jpg.256.jpg","country":"English","stat":"8.11","status":"Ongoing","tags":["Reincarnation,Time Travel,Historical,Long Strip,Romance,Boys' Love,Magic,Isekai,Drama,Fantasy,Villainess,Web Comic,Full Color"],"nutshell":"We all know the isekai formula. The MC is always some nobody, they wake up in a perfect body, and they always end up dominating their new world. Sure, Satoru got the first two tropes, but he sure didn’t choose to be reborn as an evil king in his ex-girlfriend’s otome game. He’ll have to quickly figure things out before the hero slays him and his villainess daughter…. all while dealing with sexy magicians, handsy kings and a craving for men’s… ahem spiritual energy. Forty-five might be a bit late for a sexual awakening, but better late than never, right?\nNote: This is a all new original English comic."},{"name":" Meet me beneath the mask","avatar":"https://mangadex.org/covers/c1a69f9e-ce2b-44ca-8d9a-12896c9a5b2c/58edce9e-6fe3-4216-bc69-add00d5feeaf.jpg.256.jpg","country":"English","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,User Created"],"nutshell":"Jae-jin Yeon will always be remembered as the kid that was bullied in school, with an unremarkable personality and forgettable appearance he was doomed to be average his whole life.\nUntil he laid eyes on popular model/actor/idol superstar Lex.\nStaring at Lex's poster Jae-jin had a thought, 'if I can't be myself I should just be someone else'\nJae-jin knew the world was full of fake people, pretending to be someone else, someone popular was a surefire way to be liked and avoid his average future.\n5 years later, University student Jae-jin now known as 'Robin' online is a social media star and aspiring model, known by everyone for his style and cool personality.\nRobin is the character created in Lex's image, a perfect replica of Lex painstakingly crafted over the years by researching and practicing non-stop. The way Robin talks, the way he dresses, the pictures he posts online, even his favourite ice-cream flavour all come from Lex.\nBut as his popularity grows he may just catch the attention of Lex himself."},{"name":" Sophia no Enkan","avatar":"https://mangadex.org/covers/c1a7f94d-b342-4681-9795-5f9e2d547086/7559607a-ac6e-4b4c-8898-56c0a0f22e21.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Adventure,Fantasy"],"nutshell":"Arlus is a young boy scorned and cast out by society. Emilia, a girl in the same circumstances as him, had entrusted him with a ring and a promise.\nOne day, he encountered a gigantic doll in the shape of a girl named Sophia, who desired to return home, just like Emilia. When Arlus found hope in this shared desire, this \"girl\" was brought back to life once more. And so, the journey to bring salvation to this cursed connection now begins."},{"name":" Hidari Te","avatar":"https://mangadex.org/covers/c1aa560c-1d60-4c4b-b688-a3bdf8d84bd6/0086b2c3-69dc-485d-8090-5ae32dce320d.jpg.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Oneshot,Drama,Horror"],"nutshell":"About a little boy who fears the world around him and finds safety only when he is completely hidden under the covers of his futon. To him, a futon is a kekkai (spirit barrier) which can protect him from evil."}]