[{"name":" The Black Pig Prince Recalls His Previous Life and Becomes the Strongest","avatar":"https://mangadex.org/covers/1531650d-fb48-4e9f-bb98-180d3f4f3cfa/426ae11e-ac67-490a-ba17-3b20fda51895.jpg.256.jpg","country":"Japanese","stat":"7.63","status":"Ongoing","tags":["Reincarnation,Action,Adventure,Isekai,Fantasy,Adaptation"],"nutshell":"A black company’s ex salaryman, Kurokawa Isao, reincarnated as a villainous prince of a game he used to play on repeat during his past life. What awaits the fat and arrogant “Black Pig Prince”, Bratt, is a pitch-black fate in which he falls into darkness and gets killed. In order to avoid that tragic death ending, he endeavored in sword training, dieting and monster extermination. Even though he hadn’t expected much out of it, Bratt began to gain the respect of the people around him…"},{"name":" Ode to Humanity: Earthlings, Rise!","avatar":"https://mangadex.org/covers/15319114-712b-4645-a9df-4bbe7fb6ac06/2efbbee6-998b-4da8-b5ea-bf0e478e218d.png.256.jpg","country":"Chinese (Simplified)","stat":"8.01","status":"Ongoing","tags":["Reincarnation,Sci-Fi,Monsters,Action,Long Strip,Martial Arts,Adventure,Post-Apocalyptic,Isekai,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"Fifty years ago, Dracon City fell into another dimension. Despite having to fight and defend themselves alone, they held fast to the banner of Earth and stood tall against the terrifying Exbeasts found within the Altermension.\nFast forward to the present day, Meng Chao was reborn. Much to his surprise, he found out that he could become stronger by contributing to society. He then decided that he would become the most powerful of them all, wipe out every single Exbeast, and conquer the entire Altermension."},{"name":" Third Shift Society","avatar":"https://mangadex.org/covers/15353c07-e962-4d49-9093-b69c0068454a/97782f5c-34e4-46de-9a81-eafb3b7abfbb.jpg.256.jpg","country":"English","stat":"7.97","status":"Ongoing","tags":["Thriller,Monsters,Long Strip,Supernatural"],"nutshell":"Life’s funny. One minute you're jobless, deep in debt and on the verge of eviction; the next you’re in a fight with a monster and getting a job working for a Paranormal Detective with the head of a Jack-o-Lantern. It’s an age-old story. Now the financially-challenged Ellie (who’s just discovered she has strong psychic powers) and her Pumpkin-headed boss Ichabod have to team up and fight the things that go bump in the night."},{"name":" Renai Kanjouron","avatar":"https://mangadex.org/covers/1536b83c-4ec3-49f3-8355-eda5677ac063/496b5b33-32a0-42ca-bc6d-1b353763ea21.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Ryouma who works as a “boyfriend for rent” has a special constitution: He can see other people's emotions. One day, he meets a psychology student, Aoyama, who has a \"black haze” around him. Curious about this unknown emotion, Ryouma tries to get closer to Aoyama. But when Aoyama finds out about his ability, Ryouma is asked to be part of a psychology experiment?! Still curious about the \"black haze,\" Ryouma agrees to it for a while. What will happen in these 'experiments?' What is this \"black haze?\" Will Ryouma finally fall in love?"},{"name":" Fuzoroi no Renri - Side Stories","avatar":"https://mangadex.org/covers/153779b6-0d55-4681-99ba-f42ca58de385/7355c533-0e1f-407f-b100-5639eeef21f9.jpg.256.jpg","country":"Japanese","stat":"8.34","status":"Ongoing","tags":["Comedy,Office Workers,Girls' Love,Drama,School Life,Delinquents,Slice of Life"],"nutshell":"From Newtype site:\nOur ages are different, our ways of life are different, everything is different. But… I just want to be with you!\nBecause I've never been in a miserable, tragic romance, I can say that unrequited love is fine…\nI don't know why I fell in love with this person…it's a mystery!\nThey have different personalities, different ages, different ways of thinking, different looks, different everything.\nThis is the story of girls who clumsily make up for what's lacking in the other.\nT/N:\nThese are side stories. Not a rewrite of the original serialized twitter comic. It builds up on what happens in the main series in a longer format.\nThe kind of stories these are is all in the title!\n不揃 (fuzoroi) means uneven, irregular, but also incomplete. 連理 (renri) is \"entwined relationship\".\nSo, these are stories of intimate relationships between \"incomplete\" girls that somehow complete each other, against all odds."},{"name":" Shounen Maid","avatar":"https://mangadex.org/covers/1538e8ed-5765-4adf-b470-2e862ec139e5/8bb9e903-99a3-43cc-8a97-3095e01e8b0f.png.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Comedy,Slice of Life"],"nutshell":"Chihiro is left homeless with supposedly no relatives after his mom dies. As he worries about what to do next, his uncle shows up and plans to take care of him… Or is it the other way around?"},{"name":" Amairo Islenauts","avatar":"https://mangadex.org/covers/153cd1ac-3af6-4a29-a8e9-98aafcaa16a3/78d0b0db-20c8-45dc-9c5c-61f4944dde4d.jpg.256.jpg","country":"Japanese","stat":"7.40","status":"Completed","tags":["Romance,Comedy,Harem,School Life,Fantasy"],"nutshell":"A new teacher finds himself a newly appointed position as a teacher at an all girls school… on an island… in the sky! How will he make do in his new surroundings? Or the residents of this island who seem like they came from another world? And what's more, how will he fare at being a teacher?"},{"name":" Ryutai","avatar":"https://mangadex.org/covers/153ee977-0486-4889-adb6-ba1097520f08/14bc624b-476b-4505-b017-8c0ac5a57d83.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Fantasy,Supernatural"],"nutshell":"Eighteen pages of prettiness by the ever-yummy Yoshitoshi Abe.\nAn original doujinshi."},{"name":" The Splendid Job Of A Monster Maid","avatar":"https://mangadex.org/covers/1545011f-2288-47a9-845c-526068f4843a/beaec643-b92a-4425-a765-e6052b91b524.jpg.256.jpg","country":"Japanese","stat":"8.19","status":"Completed","tags":["Action,Demons,Zombies,Magic,Fantasy,Monster Girls,Slice of Life"],"nutshell":"A demon world maid's cute and spooky fantasy action!\nSumire, a nekomata, who lost her favorite master was wandering around, got lost, and arrived in a foreign country in the demon world?! With the android and undead maids, clean the demon's house brilliantly to take back \"that something!\"\nArtist's twitter"},{"name":" Hidden Best Love","avatar":"https://mangadex.org/covers/1545779f-bf17-4fea-b86f-c66ed9b69c03/a2deff28-75cc-4308-b553-6126ae686a50.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Long Strip,Romance"],"nutshell":"Three childhood friends, three different lives. They walk past each other's life, chasing and running, like a merry-go-round."},{"name":" Kisou Tensai Geniuz!","avatar":"https://mangadex.org/covers/1549271a-0df6-4e9d-9c43-4db09c951d71/70cc29aa-af67-41a3-aa1c-0f047fcd91ed.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,School Life"],"nutshell":"In the huge comprehensive middle and high school - the Kazamachi Gakuen - there was a mysterious council known only to insiders. The council protects, supports and exploits the sparklingly talented 'geniuses'. This collegial body is also known as the 'Committee for the Protection of Genes'!"},{"name":" 2D Partner","avatar":"https://mangadex.org/covers/154b12df-1669-4c0d-9f55-7c7eaa601744/887704ae-19fa-4c11-8f9a-cefe283b874b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.75","status":"Completed","tags":["Official Colored,Long Strip,Romance,Comedy,Web Comic,Supernatural,Full Color"],"nutshell":"Down on her luck having graduated from a scammy university with no job prospects Xiao Jun doesn't have a lot of hope for the future but everything changes when a strange creature slinks out of her air conditioner. Could this be the start of a beautiful relationship?"},{"name":" Yakitate!! Japan Super Real","avatar":"https://mangadex.org/covers/154d6685-ad34-4747-a5b6-f21f6f6848ab/828aa6a2-78f1-4b36-badb-97cc8243d0ea.png.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Action,Comedy,Drama,Cooking,Supernatural"],"nutshell":"There's English bread, German bread and French bread, but Japan's bread, Ja-pan, does not exist... In that case, there's no choice but to create it! This was story of the manga and anime named Yakitate!! Japan, a story that a young baker in real life named Daisaku Hiromi admires and aspires to do the same! But alas, to actually create Ja-pan is not simple as Daisaku believed, leaving him bitter at the reality itself. But Daisaku's pain-staking reality begins to change as a mysterious beauty approaches the front door of his bakery.\nThis is the story of a \"real-life\" serious boy who aims to bake what appears to be fiction into reality, and thus presented to the world proudly."},{"name":" Suzukaze no Hito","avatar":"https://mangadex.org/covers/15520360-ef96-4921-bfbe-7731f1ae7ecc/58565b8d-ce28-47d5-863e-8d355408e137.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Historical,Romance,Fantasy"],"nutshell":"Due to her uncle's debt, Mozu is forced to marry someone she hates. So before she has to marry him she runs away to see the world before she is locked away forever. While on her journey she sees a man who goes flying through the air, and then disappears. Left amazed she travels in to town and is pulled in to a mountain guide shop. To her surprise, the man she saw flying through the air is now her guide. To HIS surprise, she is the spitting image of his former lover, Suzume."},{"name":" Mezame no Mori","avatar":"https://mangadex.org/covers/15535428-d339-4361-a4c8-b45b8c0e07f5/fc050db1-cfb2-4ba5-b3d3-4bb6678c2d6e.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"From Fantasyshrine:\nCh. 1 & 2: Yoshimori, a rookie editor, first met the wheel-chaired writer, Orito, and his brother, Masato, at the publishing company’s party. Masato’s sad smile left a deep impression on Yoshimori. Later, due to work, Yoshimori had to stay with the brothers in their secluded home and discovered the shocking truth about their relationship. What’s the secret hidden behind the award-winning novel, “The Sealed Memories”?\nFollowing summaries by HoshiSama\nCh. 3: The Loose Shackle: Aki and Ren have been best friends since middle school. Aki is now engaged to Takako and they have already picked the wedding date. What will happen when Ren makes a startling confession? And how will Aki react to being confronted with his past when he sees his childhood bully, Shimizu?\nCh. 4: Together Until Dawn & Ch. 5 (Omake) Together into the Night: Robert, a playboy heir set to inherit his father's company suddenly enters into a physical relationship with the family servant, Yuri. What spurred this decision and what will unfold between these two? Will they be able to find love?"},{"name":" Tonimo Kakunimo","avatar":"https://mangadex.org/covers/1553d304-e19c-40d9-b55e-09f2ae3df9de/d15afdcc-9667-4256-8ed8-742b64a9e4d4.jpg.256.jpg","country":"Japanese","stat":"7.47","status":"Completed","tags":["Romance,Comedy,Harem,Slice of Life,Supernatural"],"nutshell":"Yamato Ashiwara has returned to the city he lived in with his family 10 years ago, but now living alone. He visits a shrine and is met by a maiden that reminds him of his childhood. A slightly naughty romcom begins.\nIndonesia ||Kehidupan masa muda seorang pemuda SMA perjaka bernama Yamato Ashiwara yang bermula saat ia kembali ke kota tempat dimana ia pertama kali tinggal bersama keluarganya sepuluh tahun yang lalu. Saat ia pergi mengunjungi kuil yang pernah ia kunjungi ketika masih kecil, ia bertemu dengan seorang gadis cantik yang bernama Mashiro Karaito.\nKisah Komedi Romantis yang dibumbui sedikit adegan Ecchi Dua kakak beradik cantik yang mengombang-ambingkan perasaan sang MC dimulai!||"},{"name":" Propose","avatar":"https://mangadex.org/covers/1555ebef-189e-4d12-b2fe-17d68195e01d/98315230-c09d-4475-87d2-819d1ba92997.jpg.256.jpg","country":"Japanese","stat":"8.32","status":"Completed","tags":["Oneshot,Romance,Web Comic"],"nutshell":"A short story about a boy and a girl that predicts the future."},{"name":" Disney Twisted Wonderland - The Way to Make a Body Erotic (Doujinshi)","avatar":"https://mangadex.org/covers/155bc723-560d-47e7-88c4-fb8c5aef3a07/5195dd93-2b45-4694-9e69-7de3601d02be.jpg.256.jpg","country":"Japanese","stat":"7.60","status":"Completed","tags":["Oneshot,Boys' Love"],"nutshell":"Kamil and Jamil finally started dating, but whenever they try to have sex. Kamil couldn't take having sex seriously, thinking of a way to fix this. Jamil started to train Kamil's body."},{"name":" Zui Qiang Ren Ge","avatar":"https://mangadex.org/covers/15623b24-0c74-4776-8a66-9396be22a0a8/8e82079f-b3a7-41c5-806e-a76a202217db.png.256.jpg","country":"Chinese (Simplified)","stat":"7.67","status":"Ongoing","tags":["Action,Martial Arts,School Life"],"nutshell":"Top student Wang Fei has always dreamt about becoming a Judge, a pillar of light and justice for the people! However fate isn't on his side and he ends up going to a high school for delinquents. How is he going to survive? Will he rise to the top or be gobbled up in the chaos of the hell that is Shiji High School?"},{"name":" Uruha no Sekai de Arisugawa","avatar":"https://mangadex.org/covers/1562997c-ae15-44e2-a8ad-3e4b4f699387/4f9bd721-482c-4699-b453-d85faae0082a.jpg.256.jpg","country":"Japanese","stat":"6.81","status":"Ongoing","tags":["Genderswap,Action,Ninja,Comedy,Adventure,Isekai,Fantasy"],"nutshell":"Arisugawa was raised by her father and brother without being treated as a woman. As a result she bears a hatred for all men, earning her the nickname \"Arisugawa the Man Hunter.\" After chasing after a peculiar man, she finds herself in a different world with a big change to her body."},{"name":" Wakasugita Hakushaku Fujin","avatar":"https://mangadex.org/covers/15654c77-7412-41f4-ac70-98d68be87010/4d2874a8-a64d-4c74-a419-d61732b9b8db.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Romance,Adaptation"],"nutshell":"When Emily Blake innocently kissed formidable Italian count Rafael Di Salis, she didn't know that she was bound by her late father's wishes to marry him. Emily agreed to be the count's wife until she reached twenty-one… Count Rafael has bided his time. He's kept his passions under iron control for two years–his bride was young and he did not want to claim her until she was woman enough to handle him. But now she has come of age, she will be his!"},{"name":" Osomatsu-san - Kodomo no kuni (Doujinshi)","avatar":"https://mangadex.org/covers/15655c6c-8804-4956-8e24-52cfd3d5c3c0/03f1849f-e049-485b-9ae2-034f679d9c0d.png.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Horror"],"nutshell":""},{"name":" Data","avatar":"https://mangadex.org/covers/1566ba0f-81bc-4428-ae03-d939d83951c0/fca503fe-d5de-45a6-a7e2-94af294d7862.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance,Boys' Love,Adventure,Fantasy,Supernatural"],"nutshell":"Data is a kind of Magical Boy series manga by Tachibana Kaimu. The two main characters, Sakura and Yuki, are on quests to gather stones with magical powers. In doing so they are also hoping to uncover the mystery as to why they both seem to have lost their memory. A lot of new characters who are also \"hosts\" for the stones join in the fun as the story progresses."},{"name":" Time and Circumstances","avatar":"https://mangadex.org/covers/1568737b-eae3-40e8-9729-22fb3727fbe9/bd438906-3b19-4335-a526-75d5a2f8454c.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Long Strip,Romance,Drama,Web Comic,Full Color"],"nutshell":"10년 전 우리 사이, 다시 되돌릴 수 있을까?\n과거 더할 나위 없이 행복한 시간을 함께 보냈던 사남매와 반지.\n앞으로도 영원할 거라 생각했던 시간은 갑작스럽게 끝이 났고, 백영은 반지와 멀어지게 된다.\n둘은 다시 직장에서 재회하게 되지만, 여전히 반지는 백영을 밀어내는데….\n이에 백영은 반지를 다시 놓치고 싶지 않아 끝까지 그녀에게 다가간다.\n과연 백영과 반지는 예전처럼 다시 함께 할 수 있을까?\n\n• Alternate Raws (Naver Series)"},{"name":" Southern Bird and Northern Bird","avatar":"https://mangadex.org/covers/156f0573-1ea4-4c3e-824f-25df6d2271ae/d41f02f2-2847-4466-ac02-aa0b96d47232.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.75","status":"Ongoing","tags":["Animals,Long Strip,Comedy,Drama,Web Comic,Slice of Life,Full Color"],"nutshell":"The story of a southern sparrow who befriends a northern duck."},{"name":" Hasutoo Hakase no Kawaii Akuma","avatar":"https://mangadex.org/covers/157055df-260f-4e64-a747-02e85e0b8907/a8edb436-9c59-47b0-88d7-d4bd37886062.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Fantasy"],"nutshell":"Dr. Yohane Hasuto, is a young and gifted physicist. Although he was born as an orphan, he has been known as extremely smart since he was young. The doctor, who has grown into a handsome young man with both intelligence and good looks, has a certain \"problem\" that he wants to solve. He spends days frustrated with difficult questions that seem to be unsolvable, but finally, a beautiful girl named \"Akuma\" appears who can answer them...!? A  pure romantic comedy story to begin!"},{"name":" The King of Gaming Bugs!","avatar":"https://mangadex.org/covers/15726085-b8c8-4578-9bd7-70ffd2a05963/8be2c31f-8def-4f06-b43f-05f577d5f22c.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.58","status":"Ongoing","tags":["Thriller,Sci-Fi,Action,Long Strip,Adventure,Video Games,Isekai,Drama,Fantasy,Full Color"],"nutshell":"Song An, the bottom social animal, is a down-and-out programmer. His daily work is responsible for fixing bugs in a game called [New World]. However, he is more keen to secretly add his own little easter eggs in the game. Turned into a real world, relying on the understanding of the bugs in the game and the easter eggs set by himself, can Song An successfully counterattack?"},{"name":" When I Faked Amnesia to Break off My Engagement, My Fiancé Casually Told Me a Ridiculous Lie - \"You Were in Love With Me Before You Lost Your Memory\"","avatar":"https://mangadex.org/covers/1573c9b0-22be-4efc-ac66-aca5383bd420/26179549-6fbb-49a9-8b51-4791f1504cb4.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Ongoing","tags":["Romance,Comedy,Fantasy,Adaptation"],"nutshell":"Viola, the daughter of a viscount, wanted to break her engagement with Philip, a duke, because it would only bring her disadvantages. So, in the wake of an accident, she decided to fake amnesia.\nHowever, Viola was suddenly overwhelmed by Philip when he uttered incomprehensible lies such as:\n“You and I were in love with each other.”\n“When we were alone, you used to call me Phil.”\nWhile pretending to have amnesia, she ended up caught in strange circumstances."},{"name":" A Toast to Ratafia","avatar":"https://mangadex.org/covers/15772569-609f-49e1-9d62-639e92f29190/b2242ad5-4612-42b2-ba54-a4084900e2b9.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Award Winning,Action,Romance,Comedy,Crime,Mafia,Drama,School Life"],"nutshell":"季節感ガン無視のハートフルなラブコメになります。"},{"name":" Kochira Uchuu Hito Chousa-tai","avatar":"https://mangadex.org/covers/1577d596-38c3-4af1-b5e9-63782f861bf5/eeca8f79-5677-4458-bda2-1a84eb62a7c0.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Sci-Fi,Comedy,Drama,Slice of Life"],"nutshell":"A heartwarming, slightly mysterious Sci-Fi adventure story.\nNote: published in Comic Spirits 2020 No. 50."},{"name":" Haikyuu!! - Rain and Later Sunny  (Doujinshi)","avatar":"https://mangadex.org/covers/157a68da-7be7-4d6a-b538-e0268d1eba42/6b805dc8-0871-4915-b1c7-7f2905014706.png.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Slice of Life"],"nutshell":"Iwaizumi Hajime x Oikawa Tooru"},{"name":" The Dragon Knight's Favorite","avatar":"https://mangadex.org/covers/157c43dd-0cb5-47da-a382-f04a6a5d3e2f/3a3e985b-fd19-4c9b-84f1-a634e06059b5.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Ongoing","tags":["Romance,Drama,Fantasy,Adaptation"],"nutshell":"Melissa, an attendant-in-training at the royal castle, wants to work besides the Dragon Knight's commanding officer Hubert, a man she admires, and the dragons which she loves. However, she suddenly finds out that he has retired and left the castle!\nIchijinsha Books Iris' incredibly popular work is finally out in comic form! The love fantasy of a straight-laced, stubborn knight and a dragon-loving attendant!!"}]