[{"name":" Ojou-sama wa Love Come no Shujinkou ni Naritai!","avatar":"https://mangadex.org/covers/eab47dd9-c5ad-4bf2-b3fe-8952689af299/ea165e06-9c95-4d6a-9234-bde23b8b459f.jpg.256.jpg","country":"Japanese","stat":"8.23","status":"Completed","tags":["Comedy,Girls' Love,Harem,School Life,Slice of Life"],"nutshell":"Tsubaki Saionji is a second-year high school girl. Despite her grace and elegance, she hides an embarrassing secret - she absolutely loves mindless ecchi harem love comedies, and always wants to be in the protagonist’s shoes.\nThe irony of it all? Without realizing it, she already is a harem protagonist…."},{"name":" More Than Friends","avatar":"https://mangadex.org/covers/eab653f3-be85-4022-8c99-04a126bd88ac/9f3096ec-19a9-4139-93a9-8990dfb4f822.png.256.jpg","country":"English","stat":"8.03","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Web Comic,Full Color"],"nutshell":"Author Instagram: _mq\nWhat happens when you fall in love with your best friend? This is what Jean and Mia are going through right now."},{"name":" Shigatsu wa Kimi no Uso","avatar":"https://mangadex.org/covers/eab876cc-a233-4d73-a6c3-a94e7baa70be/d3d6cdc0-c851-4ff0-b793-16e5c54de9f9.jpg.256.jpg","country":"Japanese","stat":"8.96","status":"Completed","tags":["Award Winning,Comedy,Drama,School Life,Slice of Life,Music,Tragedy"],"nutshell":"Piano prodigy Arima Kosei dominated the competition and all child musicians knew his name. But after his mother, who was also his instructor, passed away, he had a mental breakdown while performing at a recital that resulted in him no longer being able to hear the sound of his piano even though his hearing was perfectly fine. Even two years later, Kosei hasn’t touched the piano and views the world in monotone, and without any flair or color. He was content at living out his life with his good friends Tsubaki and Watari until, one day, a girl changed everything. Miyazono Kaori is a pretty, free spirited violinist whose playing style reflects her personality. Kaori helps Kosei return to the music world and show that it should be free and mold breaking unlike the structured and rigid style Kosei was used to.\nNominated for the 2012 Manga Taisho Award.\nWinner of the Kodansha Manga Award (2013)."},{"name":" Sora no Woto","avatar":"https://mangadex.org/covers/eaba3db8-598a-4e60-b3ed-c08cab2e22c7/0e3f5fb3-af84-4166-826b-504ef2331a78.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Slice of Life"],"nutshell":"The story takes place in an imaginary town Seize (the model cities are Cuenca and Alarcón Fortress in Spain). A long war brings a gradual decline to the world. People disappear from the town and fishes cease to exist in the sea. In this quiet world, five girls guard a fortress and play brass vividly."},{"name":" Shaman King & a garden","avatar":"https://mangadex.org/covers/eabe065f-5fe8-433f-b397-41d237f174e2/be7d8830-2672-4831-8e82-97a51fd56cbc.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Supernatural"],"nutshell":"Kanna, a young girl from a good family. Matilda, a witch. Marion, an orphan. All of these girls have special powers as shamans are marked and feared as “monsters” and are fighting loneliness in their small worlds. That is until they meet the overwhelmingly powerful shaman named Hao…\nLinks:\n\nKyo Nuesawa's Twitter"},{"name":" Dungeon no Maou wa Saijaku!?","avatar":"https://mangadex.org/covers/eabef43d-a3f2-46ab-8c68-12fe9469f55b/e878125d-6929-4586-82ef-1abf3a1aae8d.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Monsters,Demons,Isekai,Fantasy,Monster Girls"],"nutshell":"God left a dungeon in the hands of a boy known as the Demon Lord.\nAfter receiving multiple blessings from God, let’s start my life as a Demon Lord! …Or that’s how it was suppose to be, but God messed up and created the worlds’ weakest Demon Lord ever. To continue living, I have to continue making dungeons.\nThis story is about an idiotic protagonist, a lonely demons’ child, an Undine who lives in a bathtub, and a princess who fell in love with the Demon Lord, even though she was human. A story that all unfolded during a bath."},{"name":" Gate of Amitilicia Online - Burari Isekai Kui \"Taoshi\" Tabi","avatar":"https://mangadex.org/covers/eac114df-439f-47cc-a90d-37786e3a4c65/00be9115-84aa-4ffd-9bf1-48362a5f941e.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Adventure,Virtual Reality,Fantasy,Cooking,Adaptation"],"nutshell":"VRMMORPG \"Gate of Amitilicia online\" a fantasy-based virtual reality world that stimulates all 5 senses; our hero will participate in the search for an unknown taste that does not exist in real life.\nEating different ingredients of Amitilicia, his goal was to have a self-sufficient life, get a house...\nBut it's usual to come into conflict with players with bad manners, meet various NPCs, make friends with the best players, semi-humans and ghosts."},{"name":" Fake","avatar":"https://mangadex.org/covers/eac524a5-89ff-42ac-b032-a71803829a3a/37180ce7-90c1-456c-a803-ddd9579b7896.png.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Action,Comedy,Boys' Love,Drama,Police,Mystery"],"nutshell":"Meet Ryo and Dee, two New York City cops with an attraction for action, and for each other! When Ryo, a soft spoken officer, joins the NYPD's 27th precinct, he's soon partnered up with Dee's a cocky, confident cop with attitude to spare."},{"name":" Black Dog","avatar":"https://mangadex.org/covers/eac73a7e-5dc2-46d1-98aa-c8a398686fcf/f5d0b1f6-66d6-40f2-8ebf-b6194a003afc.jpg.256.jpg","country":"Chinese (Traditional)","stat":"8.03","status":"Completed","tags":["Action,Comedy,Martial Arts"],"nutshell":"One youngster, Hei XuYa, self-proclaiming to be history's strongest exorcist, uses his half-beast Black Dog blood to help people exorcise demons as a living. One secret academy isolated from the rest of the world, is a school that specializes in fostering professional exorcists. When Hei XuYa enters the BaCheng Dao Academy, a storm in the exorcising world will break out!"},{"name":" Komyushou VS Yuri","avatar":"https://mangadex.org/covers/eacdf7f2-71fa-4be0-9321-14cce9b964b4/740eb19f-6f27-47b7-9591-05e4521f3da9.jpg.256.jpg","country":"Japanese","stat":"8.28","status":"Ongoing","tags":["Romance,Comedy,Girls' Love,Harem,4-Koma,Slice of Life"],"nutshell":"Hikage Nemoto, a young, shy and mousey part-time teacher finds herself unwittingly awakening some rather… fundamental feelings from all the women she meets… Will she prevail?\nLinks:\n\nAuthor's Pixiv"},{"name":" Haru no Yokujitsu","avatar":"https://mangadex.org/covers/ead0bb10-2948-4ddc-b425-58b3493ced3b/ff9aab66-451c-4310-8312-0ee10fe77796.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Ongoing","tags":["Romance,Girls' Love,School Life,Slice of Life"],"nutshell":"Entry for the jump rookie award for serialization\nhttps://rookie.shonenjump.com/rensai_ranking/202201"},{"name":" BLT - Burning Love Twin","avatar":"https://mangadex.org/covers/ead14b58-1b85-4453-b6c8-86d6f27aa4dc/b58235c9-da44-4378-ae40-b10ed9dc1086.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Comedy,Boys' Love,School Life"],"nutshell":"Nozomu is on a secret mission! After convincing his identical twin brother, Saku, to switch places for a day, Nozomu goes to his brother's school and confronts his enemy in the classroom! Meanwhile, Saku must memorize everything about his brother's school life and classmates so he can fit in without drawing attention to himself. Everything appears to be going alright, until Nozomu's close friend, Yoji Osawa, starts making some more than friendly gestures toward Saku! Afraid of blowing his cover, Saku goes along with it… What could possibly go wrong?"},{"name":" Stop! Time!","avatar":"https://mangadex.org/covers/ead65c94-028a-44fb-87c6-b64c1b84b049/2af86a58-24c4-4736-b94d-720be0e122e7.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Psychological,Romance,Comedy,Drama,School Life,Web Comic,Supernatural,Tragedy"],"nutshell":"The third entry from the infamous God series of web manga. This is what happens when the creator of \"Umbrella Sword\" tries to make a love comedy."},{"name":" Touhou - Sakuya-san Shutsuen Kimarimashita!! (Doujinshi)","avatar":"https://mangadex.org/covers/ead96810-a9d3-4406-a6ab-146afb439e19/a621b521-22f8-4538-9f40-e69cbeeb2780.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Comedy,Girls' Love"],"nutshell":"The SDM is celebrating Sakuya finally becoming a PC again. But then things suddenly take a rather unexpected turn.\nPart of Touhou series."},{"name":" Chikyuu ni Umarechatta Hitobito","avatar":"https://mangadex.org/covers/eae53dfc-a90b-4628-8f56-179f1c8f186a/47b475c8-fd02-4d3a-b2fa-6eb2a8250211.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sci-Fi,Comedy,Anthology"],"nutshell":"Collection of short stories by author Nagasaki Lychee.\n\nPug-chan (パグちゃん)\nKiyoku Tadashiku Hamidashita Hito no Ohanashi (清く正しくはみだした人のお話)\n0.5-byou no Switch (0.5秒のスイッチ)\nMiruka-chan (みるかちゃん)\nCopy Ningen (コピー人間)\nKowai Mono nashi (恐いものなし)\nEVIL ANGELS\nUchuujin (宇宙人)\nZolmun Statue (ゾルムン像)\nKani no Ongaeshi (カニの恩返し)"},{"name":" [Aldnoah.Zero] Hakoniwa Life - M2GO (LOG)","avatar":"https://mangadex.org/covers/eae57134-70ac-45c4-81ad-4eb7a31c5840/4cca48a2-180c-4db3-aa29-50cda5f44064.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":""},{"name":" Yuri!!! on Ice - Tatoeba Sukoshi Dake Mirai no Hanashi (Doujinshi)","avatar":"https://mangadex.org/covers/eaea1f2b-9af4-4081-81cc-852bbfec2545/a132c710-04b9-41c2-9e43-7162650a3953.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Pairing: Otabek x Yuri\nV1: Tatoeba Sukoshi Dake Mirai no Hanashi (If, for Example, We Could Talk a Little about the Future)\nV2: Tatoeba Sukoshi Dake Mirai to Yoru no Hanashi (If, for Example, We Could Talk a Little about the Future and Tonight) - after 3 years"},{"name":" Keigo Shinzo Short Story Collection 2017-2021","avatar":"https://mangadex.org/covers/eaed4839-4aab-4928-9582-da1292f4daf6/3a58b045-f2f0-49eb-a2fc-4782a2f34db7.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Action,Psychological,Romance,Comedy,Anthology,Survival,Adventure,Military,Drama,School Life,Delinquents,Slice of Life,Aliens,Supernatural,Tragedy"],"nutshell":"(from ebookjapan):\nKeigo Shinzo's first ballerina-like short compilation in 6 years!\nLove, war, aliens, and disease. Wishing for the days that make you feel shy. The first short story collection in 6 years by Keigo Shazo of \"Hirayasumi\" which also won third place in the \"Manga Taisho 2022\"!\nThe collection includes 8 works that have not yet been collected into tankobon. This is a sentimental collection filled with sparkle, frustration, and hope!"},{"name":" Isshun no Jikan ga Tatsu Kounou ga Baguru Yatsu","avatar":"https://mangadex.org/covers/eaf87ded-4849-4cb9-a8ea-3a938a61d1b3/b01ec2a5-f651-45fe-9fbc-ee05d3a09a4e.jpg.256.jpg","country":"Japanese","stat":"7.54","status":"Completed","tags":["Oneshot,Comedy,Web Comic,Slice of Life"],"nutshell":"Note: The hindbrain aka rhombencephalon coordinates functions that are fundamental to survival, including respiratory rhythm, motor activity, sleep, and wakefulness."},{"name":" Monkey Peak the Rock","avatar":"https://mangadex.org/covers/eb02e6fa-2b2d-43b6-9805-928d533c34e9/4850b39f-862a-4ec4-9bbe-df2b87d55f6a.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Psychological,Adventure,Drama,Horror,Supernatural,Mystery"],"nutshell":""},{"name":" Usotsuki Lily","avatar":"https://mangadex.org/covers/eb0ac301-8dab-4bad-bccf-4abfb0efd5dd/177f1398-a81c-48e7-8639-2ab5a61de86f.png.256.jpg","country":"Japanese","stat":"7.55","status":"Completed","tags":["Oneshot,Comedy,Boys' Love,Crossdressing"],"nutshell":"In the evening, a rather familiar girl standing in front of a general store’s window… Just when he thought life isn’t a shoujo manga, our dear main character got dragged into an adventure of his lifetime, at least it would seem so…"},{"name":" The Internet Are Character Pairing Fans of the Movie God and Me","avatar":"https://mangadex.org/covers/eb0ae567-d1ca-4cb8-a7b2-92fd1a9c0b34/5b3c0fcf-cf6b-4979-afb0-c015dbddc15f.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.84","status":"Ongoing","tags":["Demons,Animals,Long Strip,Romance,Comedy,Fantasy,Web Comic,Supernatural,Adaptation,Full Color"],"nutshell":"(Note: CP = Character Pairing) Whaaa?! The demon spirit management just arranged a husband for me again?! This time, the guy's a movie god! OMG~ I'm only a recently matured small fox. Arranging such an old demon to me, what am I to do~"},{"name":" Boukyaku no Cradle","avatar":"https://mangadex.org/covers/eb1080e6-77cd-4e9f-90c6-9ee13179a88c/a8e3550b-3c8c-4df2-b23a-3c2856cbabd5.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Drama,Mystery"],"nutshell":"The world is in a tense political situation, and one country has instituted a new mandatory education program for all children fifteen and up. It's a half-year program that puts the children through military training. Kazuki has traveled to an installation on Yurikago (\"Cradle\") Island for his half-year of training along with many other boys. Kazuki has no special physical talent, but he has a remarkably good memory. His closest friend in the training, Sai, is top-notch at everything and not particularly liked by some in their class.\nOne day, their relatively ordinary life in training comes to an abrupt end. Kazuki awakes to find the island facility in ruins. He has no idea how much time has passed, or what has happened. Soon he meets up with Sai and a strange little girl with a cat, and they begin to try to figure out their situation. What has happened to the island, and to their country?"},{"name":" Drift","avatar":"https://mangadex.org/covers/eb10b29c-5489-48e0-abc2-080ea6c6ad25/34695559-ed80-4bc9-a58c-8886ec4a20cb.jpg.256.jpg","country":"Filipino","stat":"7.87","status":"Completed","tags":["Oneshot,Action,Comedy,Girls' Love"],"nutshell":"No one knows that Aira Hernandez is a secret agent. That's not all, she is also hiding her feelings for her boardmate, Lory. What will happen as she delves further in a murder case related to Lory's could-be boyfriend?"},{"name":" HIDAMARI Sketch : Private edition","avatar":"https://mangadex.org/covers/eb1240dc-7b93-442c-b1d6-bcc3f20f6dac/d281177c-9325-4f42-9600-191736fe90b2.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":"Hidamari Sketch meets GeGeGe no Kitarou."},{"name":" Doko ka Tooku no Hanashi wo Shiyou","avatar":"https://mangadex.org/covers/eb13c918-496e-4699-9c5b-306cdf1c921a/56123976-933a-4d92-b040-688c8f388829.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Fantasy,Slice of Life,Tragedy"],"nutshell":"There's a village atop a mountain in South America: a green place where the blue sky goes on and on. Chiro, a girl with strange abilities, lives there. This is the story of her experiences with the vast, deep and heartwarming world around her."},{"name":" Ouji-sama no Obenkyou","avatar":"https://mangadex.org/covers/eb146656-a11a-4515-9e42-c759604de380/cc24ad0b-0a9a-4106-b83a-3c4bf4b558e6.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Boys' Love,School Life"],"nutshell":"Prince's Lesson\nThe instructor of the prince tries to teach him how to have sex but the prince wants him to demonstrate…\n\n\nHow About a Wolf?\nThe cute childhood friend of the hero is two years younger than him. He was shorter than the hero and often followed him like a little dog, but now he has grown up so tall and turns out to be a very wild guy, like wolf.\n\n\nPlease Also Give me Your Feelings\nThe temporary workers of a video rental shop become sexual companions. The hero begins to love another worker but can not tell it…\n\n\n23cm Depression\nThe hero and his old friend were of the same height in their childhood but now the hero is shorter than his friend, so he feels complexed…\n\n\nMy Big Strategy\nA boy learns that his next-door neighbor will transfer to a far away place with his parents and confines the guy.\n\n\nElegant Body\nThe roommate persuades the hero every day to be his nude model. The hero accepts it but he is nearly raped by the roommate…"},{"name":" Fire Emblem Gaiden","avatar":"https://mangadex.org/covers/eb17cb9f-3b06-424a-a90c-6e978dda8bf9/3a886948-0ec9-45af-9248-8a14a8f00c3d.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Adventure"],"nutshell":"The Fire Emblem Gaiden manga is the manga adaption of a game of the same title. It takes place after Alm leaves the village and meets Cellica at the castle."},{"name":" Gonensei","avatar":"https://mangadex.org/covers/eb18cf71-d279-4b9a-93d9-3b5428be11c9/36349af7-c5f1-4442-a731-8786dfdb544f.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"Akio and Yoshino believed all there was left for them was to graduate. But life had different plans for them.\nYoshino moves on while Akio stays behind, and something between them begins to change.\nThe story of their youth continues."},{"name":" I Accidentally Saved the Male Lead's Brother","avatar":"https://mangadex.org/covers/eb19debb-37ef-4a20-8c55-5132e576048a/6baaae01-dd4b-4d60-86f1-cdfdd1c59645.jpg.256.jpg","country":"Korean","stat":"7.99","status":"Ongoing","tags":["Reincarnation,Long Strip,Romance,Isekai,Fantasy,Web Comic,Full Color"],"nutshell":"She possessed Charlotte Lania, an extra character that was not even mentioned much in the original.\nShe thought the bloody socialite world and politics were only stories from another world. That was until she accidentally met the male lead’s younger brother and saved him.\nTheodore Heinst.\nThe younger brother of the male lead, who was supposed to die at the age of three.\nIf I didn’t save him, I could be accused of an assassination attempt and accomplice to a crime.\nIn the end, Charlotte decided to take good care of the child and clear her name.\nHowever…\n“Theo wants to live with you!”\nThe little kid started to refuse to go back home and yet,\n“Can you be the Lady of the Heinst House?”\nCarlisle (Carcel) Heinst, the male lead, who was supposed to marry the original female lead, proposed to Charlotte a contract marriage.\nGoodbye, extra character’s peaceful life."},{"name":" Put it All in the Ring!","avatar":"https://mangadex.org/covers/eb1babe4-e69a-43f2-b0df-e46eef3ec206/0837ab2d-df0c-40f9-bc84-fa930bd3c2c7.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Action,Sports,Drama"],"nutshell":"Friendship. Effort. Victory!\nThe story centers around the life of a young boxer named Ryuji Takane and his sister Kiku, who is his coach. Ryuji and his sister both inherited their father's talent for boxing with Ryuji inheriting his strength and techniques while Kiku picked up his talent for analysis and strategy. In the past, their father was a famous boxer. Ryuji and Kiku went away from home to train and become famous in order to help their lonely mother. On the way to stardom, they have to defeat the strongest challengers all over the world.\nThe work that solidified the themes of Weekly Shonen Jump. Those themes being Friendship, Effort, and Victory!"},{"name":" The Free Shooter","avatar":"https://mangadex.org/covers/eb1bcf1a-2c5c-48af-81dc-6daef36ee2b6/52bafb01-7779-481c-81cd-86c3b8930f92.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Thriller,Historical,Action,Psychological,Adventure,Drama,Mystery"],"nutshell":"A hardboiled espionage action story featuring Major Eberbach. Can he elude the pursuit of the genius assassin from the KGB?"}]