[{"name":" Satsujin Purgatorium","avatar":"https://mangadex.org/covers/6294a2e4-315d-4258-bca5-b4f309827759/3ce7aee1-0a51-4999-b3e4-6244ca1a46cf.jpg.256.jpg","country":"Japanese","stat":"7.64","status":"Completed","tags":["Reincarnation,Action,Psychological,Drama,School Life,Supernatural,Mystery"],"nutshell":"Takasugi Haru deeply regrets the day he killed his adoptive father. He dies at the age of 46, only to find himself as a teenager trapped in a world between heaven and hell that nonetheless feels like paradise. Haru's fight to regain his family and friends begins!"},{"name":" Kingdom (fan-colored)","avatar":"https://mangadex.org/covers/62952d0b-52e5-4c5c-bb57-4bda60e27356/68ed2712-0ee7-4790-966f-7f80966d7bf6.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Award Winning,Historical,Action,Comedy,Fan Colored,Military,Drama"],"nutshell":"Millions of years have passed since the times of legends, when the worlds of man and gods were still the same. In these times it was the desires of man that moved the world. It is the era of the 500 year war: The warring states period. Kingdom is the story of a young boy named Shin who grew into a great general and all the trials and bloodshed that lead him there.\nNote: Kingdom won the grand prize for the Tezuka Osamu Cultural Prize in 2013.\nThe manga also earned a Guinness World Record on December 12, 2012 for Manga written by the most people. The record was due to its \"Social Kingdom\" campaign in which fans and other artists were given the task of redrawing the entire 26th volume."},{"name":" Shin Zetsumetsu Doubutsu Monogatari","avatar":"https://mangadex.org/covers/629e5470-137f-44b4-a576-a2c3f5bc591e/da2b7fa2-e091-4a19-b11c-98435151cf13.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Historical,Animals,Drama"],"nutshell":"This is the second series of the much-talked-about work that focuses on the animals exterminated by us \"humans.\"\nThis is a warning about the coming sixth great extinction, a story that leads to the present. Why do humans cause \"extinction\"? As a member of humanity, please consider the issue with us.\n(Source: Big Comics, translated)"},{"name":" Shin Seiki Evangelion - Happy End of Evangelion (Doujinshi)","avatar":"https://mangadex.org/covers/62a2fb1d-50eb-4365-ae90-58fec5fe049f/6f099efa-1ab0-48ce-a13f-2249c8a2a232.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Romance,Comedy,4-Koma,Slice of Life"],"nutshell":"An alternate story of what could have happened if the events in the second Evangelion movie ''The End of Evangelion'' unfolded differently."},{"name":" Hinata","avatar":"https://mangadex.org/covers/62a60edb-9493-48eb-bf70-12b4b7277607/5d226e46-558c-4183-96f1-4fa415d8c75e.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"A reprint collection containing various oneshots and an extra story:\n\nHinata\nMayonaka Taiyou\nMoment\nIku Michi, Yobu Tsuki\nKoibito no Kaikata\nHana mo Arashi mo\nYume ni Tobu Tori\nHohoemi Nichijou\nExtra\n\nAkamine Kakeru, who ran away from home after enduring abuse from his parents for some time, couldn’t find a reason to continue living and was contemplating dying, when a child suddenly appears in front of him. Konomi Shouichi, the father who came looking for the child, saw a bruise-covered Kakeru and took him home with him. Living together with Shouichi and Rurika has given Kakeru a lot of happiness he never felt before but..!!"},{"name":" I Want to Be a Big Baddie","avatar":"https://mangadex.org/covers/62a685a8-547c-45f0-bd7a-abe7ebe23cbd/ec8dd58c-43d8-4f71-bb24-b7dd9a611f52.png.256.jpg","country":"Chinese (Simplified)","stat":"8.06","status":"Ongoing","tags":["Long Strip,Boys' Love,Full Color"],"nutshell":"A true villain needs to be ruthless, evil, and self-destructive! After torturing the protagonist to hell and back, they will exit the scene fabulously with a bang as their work is done.Wang Yi was determined to act that kind of villain. Unfortunately… His male lead could read minds. (:з)∠*)“You mongrel!” Mr. Yi chuckled as he looked down on the novel’s male lead.Suddenly, a thought bubble filled with cute emojis (⁄ ⁄ ⁄ω⁄ ⁄ ⁄) with the words “You’re so cute…” appeared in front of Qin.Qin: ?"},{"name":" Grashros","avatar":"https://mangadex.org/covers/62a9a899-eb67-43da-a2f4-7e8c41e4c8ee/5e6c7103-39a6-430f-abcc-26675a8cff78.jpg.256.jpg","country":"Japanese","stat":"6.88","status":"Completed","tags":["Historical,Action,Animals,Comedy,Survival,Adventure,Drama,Tragedy"],"nutshell":"A story set 30,000 years ago, starring the Cro-Magnon, by the duo behind Kami-sama no Iu Toori.\nThe story follows Akuu, the Cursed Child, born during the night of a blood moon, said to bring calamity upon all and his attempt to fight destiny."},{"name":" Shivers: Prelude","avatar":"https://mangadex.org/covers/62b112ce-eb0b-4af7-8f0c-4deb63e2f310/278e278c-395c-4e13-a0e4-b1b394a4fd87.png.256.jpg","country":"English","stat":"7.97","status":"Completed","tags":["Thriller,Sci-Fi,Survival,Horror"],"nutshell":"Mysterious and horrifying creatures are lurking in our world, lingering beyond human perception. With each new person that encounters the paranormal, a tale of terror emerges. A compilation of horror stories focused on ghosts, the unknown, and beyond!"},{"name":" Relieved","avatar":"https://mangadex.org/covers/62b1d923-dd04-4a80-ac27-2a0af671fcbf/34326111-da09-4885-8675-ef900a3136a8.png.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Oneshot"],"nutshell":"Creator-approved translation by TheElusiveTaco.\nLinks:\n\nAuthor's Pixiv\nAuthor's Twitter\nAuthor's Fanbox"},{"name":" Haikyuu!! - Jigsaw Puzzle Love and Dreams (Doujinshi)","avatar":"https://mangadex.org/covers/62b62fd2-1ae0-4075-870c-60c74052792d/602dffc1-1ffc-4d76-ad20-f36fea0d4c2a.png.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Boys' Love,School Life"],"nutshell":"Kageyama Tobio x Hinata Shouyou"},{"name":" Three Realms","avatar":"https://mangadex.org/covers/62bd523f-ca30-403b-9731-fb531fe7a4b2/83a39046-7738-4381-ba79-7b6d431b948a.png.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Historical,Action,Long Strip,Fantasy,Supernatural,Mystery"],"nutshell":"Mythical Horror-Thriller Epic —— The Story behind the Journey to the West】There exists no immortality here. Whether you are a mortal, demon, evil spirit, or god, we are all but only living beings. We can’t escape from the tracks of history; we can’t avoid the cycles of life. Reality is inevitably bloody and cruel, that is why reality is also gentle and warm. The game of power and benefits, the choice between life and death, the overlapping of love and hatred. In this world, who is the chess player, who is the chess piece, and also, who is the chessboard?"},{"name":" Naska","avatar":"https://mangadex.org/covers/62c1ea13-1a1f-411a-ac27-e3e83732c2cb/d998c54f-693a-426c-be35-564856a36e47.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":""},{"name":" Angel Profile","avatar":"https://mangadex.org/covers/62c25c69-f62d-49df-9123-322fafe8f44c/da67cf0d-2eae-4fbc-ab85-7ff6a8e3fd57.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Fantasy"],"nutshell":"A legendary dragon once brought the land of Astoria to the brink of ruin. He was defeated by a man named Yurius, who was soon supposed to go to his princess and live happily ever after. However, with the last of his strength, the dragon placed a curse on Yurius: all his memories will be erased, and his body will turn back to a child. It is now the goal of a novelist, Elliot, to return Yurius to the courageous person he once was."},{"name":" Private Magician","avatar":"https://mangadex.org/covers/62c3eca7-84f1-4251-8b8b-be2c2f18d2e8/0432639e-8425-41ee-b572-ebcee6ac928c.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Cancelled","tags":["Comedy,Boys' Love,Magic,Supernatural"],"nutshell":"Kasumi's day just keeps getting worse and worse. First he's dumped by a classmate, and then a strange fortune-teller shakes his world as he reveals himself to be in search of a master. And who could the lucky boy be…?"},{"name":" The overtaking in height thing","avatar":"https://mangadex.org/covers/62c54433-4310-4f83-ba34-a1275f5ffeac/e41dcb90-fce5-4e5c-9014-f98ac704bf65.png.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Oneshot,Web Comic,Slice of Life,Full Color"],"nutshell":"Mangaka's Twitter\n Mangaka's Pixiv"},{"name":" The Shame of Miss Machiko","avatar":"https://mangadex.org/covers/62c7b450-e119-41b0-9001-f0a3ea52f2a5/d6e51201-04ba-4324-be3e-d7d958a91761.jpg.256.jpg","country":"Japanese","stat":"7.38","status":"Completed","tags":["Comedy,Slice of Life"],"nutshell":"The series revolves around Miss Machiko Mai, a new elementary school teacher who wears a revealing red mini-skirt, and regularly finding herself in accidental sexual situations. Machiko is very popular with her students, especially the boys, who take delight in lifting up her skirts and devising traps to catch her in various stages of undress. Rather than get angry, Machiko responds by laughing it off and uttering her trademark phrase, \"Maicchingu!\" (roughly meaning \"Embarrassing\").Mai is generally a very kind and patient woman who cares about her students and does her best to help them with their problems.\nSource: WikiPedia"},{"name":" Utskushii Inu","avatar":"https://mangadex.org/covers/62c8dc98-5cff-4e73-a8cc-17e4e4f65154/9f95cbba-443e-4828-917d-73379d2b5e70.png.256.jpg","country":"Japanese","stat":"5.76","status":"Completed","tags":["Animals,Romance,Drama,School Life,Supernatural,Mystery"],"nutshell":"The daily life of Fumio Morisawa, a second-year high school student, changes completely one day. His classmate's big breasts, his brothers success, an older woman's kinky behavior, a beautiful white dog... Adolescent sexuality quietly emerges with unpredictable outcomes...!"},{"name":" The Empire's Hidden Hope","avatar":"https://mangadex.org/covers/62c95681-e908-4698-832a-ac88ef51cc2c/2e08cfde-7698-4421-897e-b8d52cf6ebb3.png.256.jpg","country":"Korean","stat":"8.07","status":"Ongoing","tags":["Historical,Long Strip,Romance,Comedy,Martial Arts,Adventure,Crossdressing,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"Han Wol is known as one of the military’s finest young men, but… Wol is a woman! After her father was framed for the former emperor’s murder, she narrowly escaped execution by disguising herself and hiding in plain sight. Since then, the empire has been under the thumb of chief state councilor Shin, but the young emperor is hatching a plan to take back control. As the only one who holds the key to unlocking the mysteries of the past, it looks like Wol’s days of laying low are over…\n\nOriginal Webtoon: Daum, KakaoPage\nOfficial Translations:\n\nEnglish\nChinese (Simplified) / 汉语\nFrench / Français\nJapanese / 日本語"},{"name":" Shiroiro to Kuroiro Kagisora Tomiyaki Shoki Sakuhin","avatar":"https://mangadex.org/covers/62cb8c4c-6a16-4b4a-8075-1e88a7e59cbf/69bfbc90-a7f7-4003-8fdc-6794148661de.png.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Psychological,Fantasy,Tragedy"],"nutshell":"A chasing \"white child\", a fleeing \"black child\", that's their self-discovery, their searching for each other's happiness. It's Tomiyak's first work, charming as a picture book, subtle as poetry, drawn down, and released as a book with a cover."},{"name":" Dear Sailor","avatar":"https://mangadex.org/covers/62cdfe46-fb59-42a8-a95f-8053e457c5b3/5d628dd9-8f72-4c35-8360-1bb087555fa5.jpg.256.jpg","country":"English","stat":"7.97","status":"Completed","tags":[""],"nutshell":""},{"name":" Monsters on the 38th Parallel","avatar":"https://mangadex.org/covers/62d34aff-ca8d-4dc7-8419-4b3702104461/1929df56-7af6-4ca5-809c-c9f638b83818.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Thriller,Sci-Fi,Time Travel,Action,Psychological,Comedy,Anthology,Survival,Adventure,Military,Philosophical,Drama,Medical,Slice of Life,Aliens,Tragedy"],"nutshell":"A collection of stories by Osamu Tezuka, including:\n\nKenichi and Shunsaku find themselves shrunk to the size of dust particles and are absorbed into a human body. There they are caught in a battle between tuberculosis bacilli and white blood cell corpuscles.\nHariru, a vegetable man from Mars, is sent to Earth to obtain water. A boy and girl save him from starvation, but the Earth government assassinates him. Before he dies he gives them a golden seed that grows into his child and continues his mission.\nProfessor Hanamaru creates a time machine that revives a caveman in the present day. Hamegg and others learn of the machine and try to manipulate it, but end up reviving a titanosaur. The caveman defeats the Titanosaur and then lives with Professor Hanamaru.\nPrime Minister Marcus Nobemitch appoints the caveman Bugaboga director of the state-operated zoo.The vainglorious prime minister, however, collects so many animals in the zoo that he could not provide them with sufficient food due to lack of budget. Forced to cut down on food, the hungry animals, led by Bugaboga, revolt. Meanwhile, the vice prime minister Crodan attempts a coup d'etat by using bombs in the shape of animals.\n\n\nVolume 43 of the Osamu Tezuka Complete Works"},{"name":" Kimi ga Megami nara Ii no ni","avatar":"https://mangadex.org/covers/62e1d723-0731-4048-a7d7-d13969d288b7/877604ce-1dc3-4873-b232-881291d6714d.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Comedy,Harem,School Life"],"nutshell":"The general election of love begins with the seat of the No. 1 heroine! At this school, once a year, there is a so-called \"Goddess General Election\" that decides the school's No. 1 heroine \"Goddess (Muse)\". The childhood friend Tsugumi Aiba, whose main character, Shield, has a passion for, is the winner of the previous year. Her shadow classmate, Uzura Takahina, says, \"She wants to participate in the goddess general election,\" at her shield, which is trying to do something with her hunger that was shaken by the thrush ...?"},{"name":" Dolly Kill Kill","avatar":"https://mangadex.org/covers/62e3c3ef-7810-473a-97d3-47b397f7c7d7/43fa9ccf-7fcc-420f-abc3-c9d82f5a7356.jpg.256.jpg","country":"Japanese","stat":"7.60","status":"Completed","tags":["Thriller,Sci-Fi,Monsters,Action,Psychological,Survival,Post-Apocalyptic,Military,Drama,Horror,Aliens,Supernatural,Mystery"],"nutshell":"Humanity's peaceful days all at once transform into an unspeakably odious hell. The sudden invasion of wasp-like insects, along with gargantuan \"dolls\" wielding their enormous alien weapons, annihilating everyone in their path. In the middle of the chaos, high school first-year, Iruma Ikaruga, fights to save his best friend and his beloved senpai from the dolls' assault with an unyielding spirit. However, all that awaits him is despair. Just what are the enormous puppets known as \"Dolly\"after? What fate awaits Iruma? The curtain has risen on humanity's \"puppet show\" of unimaginable despair, and the battle for survival has begun."},{"name":" Mofutte ii no wa Omae dake","avatar":"https://mangadex.org/covers/62e65844-6a49-4133-be17-af95bc0c662f/b0e866cd-60d1-4bcc-8f63-ea5c4bccc5e6.png.256.jpg","country":"Japanese","stat":"7.41","status":"Completed","tags":["Boys' Love,Fantasy"],"nutshell":"Determined to defeat all canines, Shiro is a cute little white cat with a selfish attitude who’s unwillingly picked up off the streets by Kuro’s owner. Kuro is the large black dog who vows to protect Shiro, but one day after the two are all grown up, Shiro suddenly goes into heat!"},{"name":" The Ferryman","avatar":"https://mangadex.org/covers/62e92aae-c734-4727-9c81-61ce3b206699/b8cae891-2973-4dbe-9758-72421e8a050b.jpg.256.jpg","country":"French","stat":"7.97","status":"Ongoing","tags":["Monsters,Action,Ghosts,Adventure,Fantasy,Web Comic"],"nutshell":"Jero has just been chosen to be a Ferryman. For his first mission, he will have to lead the soul of Luna, an 8-year-old girl to Vessia, the world of the dead. They will then undertake a 5-day journey through Limbo, a completely illogical world populated by mystical beings and creatures."},{"name":" Desire","avatar":"https://mangadex.org/covers/62f7f73a-8ad0-45cc-9b21-12c0f751dbed/ca3be57e-a718-4a16-948f-664b3b10a457.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Harem,Drama"],"nutshell":"Takashi Fujii is an elite salaryman who had graduated from a high class university. One day he meets a mysterious lady by the name Rikaco, and his 'DESIRE' starts to silently, but intensely burn."},{"name":" Fist of Legend","avatar":"https://mangadex.org/covers/62fd5892-b6fc-480f-86e4-f7a5a9c66768/738cfb27-74f0-4b16-9f1e-f92acefd67ff.jpg.256.jpg","country":"Korean","stat":"8.04","status":"Ongoing","tags":["Action,Sports,Martial Arts,Drama"],"nutshell":"The greatest fighter in history who has become legend."},{"name":" Natsuyasumi no Tomo","avatar":"https://mangadex.org/covers/6300c65f-13c9-4a29-b62a-bf1444f9d2a3/450dc87c-879e-4809-b540-0e8b1e7d1685.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Time Travel,Romance,Drama,Slice of Life"],"nutshell":"Even if this love of mine isn’t allowed, I just love that person too deeply… in the midst of summer break, this unspeakable love comes to a close."},{"name":" Nioi.","avatar":"https://mangadex.org/covers/63049d2e-5d99-47e8-aa04-25ce159a692a/acc0b072-019b-4d64-9f5d-0ad433c154f8.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"This story is about a university student named Mikari who finds herself falling in love with the most unlikely of partners: Kaga-san, a 52 year old widower who lives in her apartment building. The scent of the incense sticks he burns in his deceased wife's honor clings to his body, drawing her in."},{"name":" Babel","avatar":"https://mangadex.org/covers/63053aa3-cb12-439a-954a-80f6fda34f84/06343e37-8e98-4cb2-bd38-3e091927dd16.jpg.256.jpg","country":"Spanish (LATAM)","stat":"7.97","status":"Ongoing","tags":["Oneshot,User Created,Drama,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"Español:\n¿Alguna vez te has preguntado qué habría sucedido de levantar la mano ante aquellos que te abusaron en el pasado?\nNo te preocupes. Babel explora ese concepto poniéndote en la piel de Johan, un joven recién transferido el cual desde pequeño fue obligado a luchar por su padre. Odiando desde el fondo de su corazón la violencia, su voluntad será puesta a prueba ante el lo inminente.\nIngles:\nHave you ever wondered what would have happened to raise your hand to those who abused you in the past?\nDo not worry. Babel explores this concept by putting you in the shoes of Johan, a recently transferred young man who since childhood was forced to fight for his father. Hating violence from the bottom of his heart, his will will be put to the test before the imminent.\nPortugués:\nVocê já se perguntou o que teria acontecido para levantar a mão para aqueles que abusaram de você no passado?\nNão te preocupes. Babel explora esse conceito colocando você no lugar de Johan, um jovem recém-transferido que desde a infância foi forçado a lutar por seu pai. Odiando a violência do fundo do coração, sua vontade será posta à prova diante do iminente."},{"name":" Touhou - Half-Beast Half-Ghost Strife Chronicle (Doujinshi)","avatar":"https://mangadex.org/covers/63076d96-3e76-4138-81f9-ef885fe3aed7/0d00f284-0b15-453e-93cc-ac9fe995d318.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Oneshot,Comedy,Girls' Love"],"nutshell":""},{"name":" Family Vacation","avatar":"https://mangadex.org/covers/6307e72d-736a-4983-a8d2-a02ac8bba111/e3fac225-f553-4460-9c62-b87ffaaa2c94.jpg.256.jpg","country":"Indonesian","stat":"6.78","status":"Completed","tags":["Oneshot"],"nutshell":""}]