[{"name":" Feng Shen Ji II","avatar":"https://mangadex.org/covers/25ea1233-217d-4d96-9fbd-f8b94a3f0506/607c0b52-270a-4e86-989a-780ee8f8c2b3.jpg.256.jpg","country":"Chinese (Traditional)","stat":"8.41","status":"Completed","tags":["Historical,Action,Romance,Martial Arts,Adventure,Drama,Horror,Fantasy,Supernatural,Tragedy"],"nutshell":"A sequel and continuation of Feng Shen Ji."},{"name":" Touhou - Amaranth (Doujinshi)","avatar":"https://mangadex.org/covers/25f36a5a-4b83-4c05-870a-bcc373f90907/94a17173-3ec3-4a97-a34b-e778367cdfc8.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Girls' Love"],"nutshell":"A Alice x Marisa & Reimu x Sanae doujin."},{"name":" The Girl with a Kansai Accent and the Pure Boy","avatar":"https://mangadex.org/covers/25f672c7-2ebe-494a-800a-9a8b2fb7cb98/01b06586-9122-4f89-a00f-ad4f3cbd1550.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,Comedy,Harem,Shota,Slice of Life,Gyaru"],"nutshell":"A boy moves town, a friend of his mother with a strong Kansaiben accent takes care of him."},{"name":" Bishoujo Sakka to Mezasu Million Selleeeeeeeeer!!","avatar":"https://mangadex.org/covers/25f6f666-0699-4ea0-add6-1ed3178c6ee7/ba14c3bb-785a-40b9-96f9-9bfbf909e07d.jpg.256.jpg","country":"Japanese","stat":"7.55","status":"Completed","tags":["Oneshot,Romance,Comedy"],"nutshell":"The story follows Kiyozumi Kurokawa, a novice editor who is assigned to the editorial department of S (\"Sandal\") Bunko, which publishes light novels. Kiyozumi is determined to publish a million-selling hit series, but this task is easier said than done when his writers include a genius high school girl and an office lady whose last two series tanked."},{"name":" King of Wolves","avatar":"https://mangadex.org/covers/25fdcd05-8b80-47cc-baf2-8459da263624/90472456-cea9-4d7b-bedb-d3d110a486e3.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Thriller,Time Travel,Historical,Action,Psychological,Animals,Survival,Samurai,Adventure,Drama,Fantasy,Supernatural,Tragedy"],"nutshell":"A bright-spirited young historical scholar, Iba, disappears while on a lone expedition to study the ancient Silk Road. A year later his girlfriend, Kyoko, sets out for the Silk Road in order to find clues that will help to unravel the mystery of Iba's disappearance. When she arrives, she finds the charm she gave Iba for protection and moments later she is sucked into a black vortex and loses consciousness. Kyoko awakes to find herself in a very different place and discovers that Iba is not only alive but is a warrior-slave under the reign of Genghis Khan in 13th century Mongolia! At last, when Iba and Kyoko reunite, they find that there are a series of events, crueler than the ones they have already endured, awaiting them…"},{"name":" Kurashi no Izumi","avatar":"https://mangadex.org/covers/25febdc9-da45-43c1-b347-70df711fc43b/97e42979-d470-4d24-b92e-22ce082d6646.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"Collection of short stories about married couples.\nHouse 1・ Somei Family\nDespite being friends since childhood, there are many things that the husband does not understand about his wife.\nHouse 2・ Kojima Family\nThe appearance of a prince in a swimsuit creates a whirlwind romance and the insecurities which go along with it.\nHouse 3・ Takahashi Family\nAn orphaned exam student is flabbergasted at his older sister's pregnancy and even more so when he learns who the father is.\nHouse 4・ Yano Family\nHouse 5・ Shimaoka Family\nHouse 6・ Fuyuki Family\nSigns of Early Spring"},{"name":" A Grandcross Story","avatar":"https://mangadex.org/covers/2602aef7-0019-4126-aa06-7eecad9e9fbc/269ebf11-d07f-41e5-bf59-e52e875496a4.jpg.256.jpg","country":"Korean","stat":"8.08","status":"Ongoing","tags":["Sci-Fi,Action,Psychological,Long Strip,Romance,Comedy,Adventure,Drama,Adaptation,Full Color"],"nutshell":"He’ll do anything for the number of likes and subscribers to increase, BJ Dosa Jeon Woo-chi is here to send a whirlwind through 21st century Korean Internet streaming! Jeon Woochi was a Taoist priest who once turned Joseon upside down. Since then, 500 years have passed, and he is now in the era of social media. He lives by attracting people’s attention through Internet broadcasting and social media. However, one day, Jinhee, the daughter of the family whose grandfather he helped in the past, comes with a mysterious scroll that belongs to Jeon Woochi’s object, to ask for help. However, an unidentified monster targeting the scroll attacks Jeon Woochi. With the advent of an unidentified monster, numerous events begin to take place around Jeon Woochi. At the same time, he is invited to the award-winning streaming tournament, Channel Exceed, and he notices the huge conspiracy behind it… #Smalltalk #TaoistMagic #Couldbemagic #Iwillshowyousomethinggood"},{"name":" Love Live! - Shin Honoka (Doujinshi)","avatar":"https://mangadex.org/covers/26043de6-7ebd-45f8-b58c-8ed9a69822f7/c2a7efff-e58c-47af-abee-29069e2dee07.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Comedy"],"nutshell":"Something arose from the ocean. Something gigantic, unstoppable and orange."},{"name":" Sita Wihayeo","avatar":"https://mangadex.org/covers/26057952-76f7-4365-a85a-0667cc58e87e/0f3f02b6-e460-44c4-b1d9-8c1548f55c3f.jpg.256.jpg","country":"Korean","stat":"8.08","status":"Completed","tags":["Long Strip,Romance,Drama,Fantasy"],"nutshell":"A medical student passionately falls in love with a fallen goddess during his volunteer abroad in Nepal, and he desperately tries to fight off destiny to save his love."},{"name":" Aoba-kun ni Kikitai Koto","avatar":"https://mangadex.org/covers/2608f409-21af-4b25-a1ef-7cf768b9e2f1/c1835c8f-15e4-4ed7-8929-e9e800329469.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Romance,School Life,Slice of Life"],"nutshell":"A love for a person she can't say 'I love you' to is about to start. Mayo is a very shy girl. She meets Aoba-kun in her weird part-time job, and they begin to spend their secret time alone, but…\nThe boy she meets is the one she is closest to but is also the one she can't love. A far too clumsy, secret, unrequited love."},{"name":" Boku no Hero Academia - Kanchigai da yo! Kirishima-kun! (Doujinshi)","avatar":"https://mangadex.org/covers/2609b2da-47c7-468e-8d4e-df85c850d868/948a6886-6eac-4f3a-92f9-2c226acba753.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Boys' Love"],"nutshell":"Boku no Hero Academia 【doujinshi】\nKirishima Eijirou x Bakugou Katsuki"},{"name":" Mao","avatar":"https://mangadex.org/covers/26102334-1f7b-4a5b-a64f-107c5c24a70f/6c0ec3a7-b54f-4d16-add4-f1eaea1af5ee.png.256.jpg","country":"Japanese","stat":"8.28","status":"Ongoing","tags":["Thriller,Time Travel,Historical,Monsters,Action,Demons,Psychological,Ghosts,Romance,Comedy,Survival,Martial Arts,Adventure,Magic,Military,Philosophical,Drama,Medical,School Life,Horror,Fantasy,Slice of Life,Supernatural,Mystery,Tragedy"],"nutshell":"The story is set in a \"land where two worlds intersect,\" and it centers on \"a strange romance between a boy and girl who meet by fate.\"\n(from ebookjapan):\nOnmyoji and Yokai? A girl's bizarre Taisho romance! When she was in the first grade of elementary school, her whole family was involved in an accident, but she is the only one who survived. In her third year of junior high school, she passes by the accident site again and is somehow transported back to the Taisho Era!\nThe next day, Nanoka's physical abilities are awakened when she is told by Mao, a boy she met there who is an Onmyoji, \"You are a demon, aren't you?\" The Taisho bizarre romance in which the two of them face their \"destiny\" that will come begins!\n\nOfficial Release:\n\nEnglish release by Viz Media\nIndonesian release by Elex Media (2021)"},{"name":" Dragon Ball Z dj - Let's hope for a sunny day","avatar":"https://mangadex.org/covers/261328fc-6071-4da8-9e4e-c1084e43a032/b74f88f2-0717-4bd2-b520-b7fdec443732.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance"],"nutshell":"Pairing: Vegeta x Bulma"},{"name":" ALPHA","avatar":"https://mangadex.org/covers/2615295b-f643-45b2-970f-443c9455918e/ec4fbebb-f82a-4489-85e9-97a09f2467a5.jpg.256.jpg","country":"Korean","stat":"7.75","status":"Completed","tags":["Thriller,Sci-Fi,Action,Long Strip,Mecha,Web Comic,Supernatural,Full Color,Tragedy"],"nutshell":"The emotionless agent Alpha was given a secret mission.\n\n\n\nOfficial Traditional Chinese Translation\n\n\nOfficial Indonesian Translation"},{"name":" Ariadone no kanmuri","avatar":"https://mangadex.org/covers/261c26fa-2a5a-4107-babd-c6159cc2fcce/c414bb39-e713-46dd-9ab4-1f73ec0072a5.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Drama"],"nutshell":"Set in 15th century Florence, Italy.After the removal of the Medici family, Lorenzo struggled every day to live. One day, he met a girl who seemed to embody freedom, and his gray days slowly began to color."},{"name":" Isekai Dungeon no Renai Jijou","avatar":"https://mangadex.org/covers/261f62d7-6a82-4215-a6b7-ffd19c937100/50d26c86-6c1c-4ad2-beee-dc677e29a40c.jpg.256.jpg","country":"Japanese","stat":"7.69","status":"Ongoing","tags":["Romance,Comedy,Adventure,Fantasy,Slice of Life"],"nutshell":"\"The dungeon is where people go to die from love\"\n(Excerpt from Zacharias' \"The search for the Philosopher's stone\")\nThis is the dungeon where it's rumored the philosopher's stone lies.\nWith magic, the warrior's feelings towards the mage are—?\nLizardmen and Elves are antagonistic against each other. The reality is—?\nThe party of four's dangerous relationship—?\nMeeting breath taking life threatening situations deep in the underground, today our delvers' adventures…. and their romance will play out!!\nPopular in the web, the wholesome romance omniverse set in a dungeon!!\nNote : Please don't add ISEKAI tag/genre. Also while it was canceled by the publisher, the author is continuing the series on twitter / amazon."},{"name":" Back To School","avatar":"https://mangadex.org/covers/2623b67d-2b35-446a-b532-8a95eb0877e4/e7189679-9534-4b6e-a0e8-924d524af9ab.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Long Strip,Boys' Love,Drama,School Life,Delinquents,Web Comic,Full Color"],"nutshell":"Chiwoo’s got issues. Upon returning to school after the “incident” last year, he vows to keep to himself and stay out of trouble until graduation. Easier said than done: his bad boy reputation has made him the talk of the school, and Kyujin - class president and model student - won’t stop being friendly. Trouble arrives soon enough in the shape of Jihyun, a tattooed hunk from Chiwoo’s dark past. It’s gonna be a tough year…"},{"name":" Five-Dimensional Zone","avatar":"https://mangadex.org/covers/26283eb3-8401-4c62-8310-76273c2e7061/091cfb9b-f3cd-410e-b2c1-42cedd8d0e46.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Action,Long Strip,Martial Arts,Adventure,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"남만의 정글과 돈황의 대사막에서 십 년을 낭인으로 살아온 이산.\n이제 구월영의 기연과 도 한 자루를 품고 강호의 복수에 발을 디뎠다.\n피에 젖은 강호를 독보강호하며 무신으로 일어선 풍운아.\n낭인도객 흑전랑 이산의 강호 일대기.\n\n\nOriginal Webtoon <Webtoon kakao>"},{"name":" The Cherry Project","avatar":"https://mangadex.org/covers/2628860c-5a21-4587-abe6-918758c59d9a/abfc26d8-8a57-4a99-a7fd-8f586be83b5a.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Sports,Drama"],"nutshell":"From StarryHeaven:\nThe story about a girl named Chieri (nicknamed “Cherry”) who began ice skating ever since she saw the handsome ice skating champion Tsuzuki Masanori skate. She pursues her dream of being Tsuzki’s partner, all the while facing her rival, ‘Princess’ Canty. With the help of her friends, and her own courage, can Cherry win the heart of the boy she loves so much…?"},{"name":" Ouji-sama to Haiiro no Hibi","avatar":"https://mangadex.org/covers/262cdc0f-574e-464a-8793-c1cba15936e9/22b9af42-209d-4bfc-b5d8-f338b2e6a6ca.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Crossdressing,Drama,School Life"],"nutshell":"Atsuko is a young high-school girl who leads a troublesome life. Working a scandalous job for the sake of survival, her reputation is in tatters and she is scorned by her peers. But one day she is noticed by one of three rich boys, Itaru, which she resembles in an uncanny way. Immediately she finds herself whisked away from her everyday life and into a new world where she is forced to take on the role as Itaru's double and replace him as the 'Prince'."},{"name":" The Struggle of Being Reincarnated as the Marquess's Daughter: I'll Deal with What’s Coming to Me!","avatar":"https://mangadex.org/covers/2632dd4b-4005-44f9-8a5f-5e1b752e3e42/4100ccb0-5745-47cd-a763-05893cd2e6ff.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Ongoing","tags":["Reincarnation,Historical,Romance,Comedy,Isekai,Fantasy,Villainess,Adaptation"],"nutshell":"One day, the Marquess’s daughter Julianne suddenly regained the memories of her previous life and reflected on her behavior up to this point. A life of luxury, bullying her siblings and stalking her fiancé…… A horrible personality and overweight appearance, devoted only to wrongdoings that belonged to the villainess of the novel she read in her past life. In any case if it is a \"serves you right\" fate from now on, then it will be after I get a beautiful body and soul! She, who thought this, started a diet together with showing a wholehearted devotion to her family —?!"},{"name":" Marionette Generation","avatar":"https://mangadex.org/covers/263a088d-fa5b-4e11-b029-debcbc34e534/9811267b-30c9-46ec-a0cf-85022076ba2d.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Sci-Fi,Action,Ghosts,Romance,Comedy,Virtual Reality,Magic,Harem,Drama,Slice of Life,Supernatural,Mystery"],"nutshell":"Despite the fact that lackadaisical illustrator Izumi Morino can't find work, his life is still very complicated.\nCute junior-high-school student Kinoko has become his de facto assistant and is attempting to run his life through means of whining and wheedling.\nOne morning, Kinoko catches him in bed with a doll - a cute rag doll. Embarassing to be sure, but even though Izumi had no idea where the doll came from, he could have handled the surprise… until the doll started to speak, walk, and call him nasty names!"},{"name":" Hello World","avatar":"https://mangadex.org/covers/263b6cb0-4d7b-4a34-bb0f-5282f8968095/afc04ac4-eaab-4eb0-a6a4-6dc470e1913b.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Sci-Fi,Time Travel,Romance,Drama,Supernatural,Adaptation"],"nutshell":"The \"sci-fi love story\" film is set in Kyoto in the year 2027, and will feature famous landmarks such as Fushimi Inari Taisha and Kamo Shrine. The film centers on Naomi Katagaki, a male high school student. One day, a person who calls himself Naomi 10 years from now appears in front of the young Naomi. Together, they must change the future and save a classmate, Ruri, whom the younger Naomi starts to date in three months."},{"name":" Touhou - Hare no Hi - A Fine Day (Doujinshi)","avatar":"https://mangadex.org/covers/26465a62-318d-4a32-9634-c2fb30995622/ba7b3b73-81d4-425c-95a1-bca4cec30adf.jpg.256.jpg","country":"Japanese","stat":"8.40","status":"Completed","tags":["Oneshot"],"nutshell":""},{"name":" Full Stealth Camouflage Little Matchstick Girl","avatar":"https://mangadex.org/covers/2647469c-137f-4a3f-9603-6a04bc582ec2/a2a3b2ca-c778-4a60-9a26-7e30e35fa4a3.jpg.256.jpg","country":"Japanese","stat":"7.42","status":"Completed","tags":["Oneshot,Action,Psychological,Comedy,Crime,Survival,Mafia,Tragedy"],"nutshell":"A riff on Hans Christian Andersen's classic fairytale \"Little Matchstick Girl\" done in the style of Jiro Matsumoto"},{"name":" Rure","avatar":"https://mangadex.org/covers/264b1025-f5f3-47ab-b2c7-64d7b7e2ee31/48757247-6566-4d76-8984-11df283d7b48.jpg.256.jpg","country":"Korean","stat":"8.02","status":"Ongoing","tags":["Survival,Adventure,Fantasy"],"nutshell":"Ha-Ru is the daughter of a family that rules a remote island–she is also the heiress to this secluded land, something that Ha-Ru's half sister, Mi-Ru, resents. When Mi-Ru becomes upset and runs away, Ha-Ru follows her–and magically they are ushered into a foreign desert! And in this land, it's survival of the fittest! Where become a slave is a easy thing!"},{"name":" Cross the Mountains, Yama wo Wataru: Santamadai Gakuburoku","avatar":"https://mangadex.org/covers/264b9c57-373b-48a6-9fc3-7f4e386ea8ca/fafca3a7-098f-4df9-885b-7bb3ecd69cc7.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Ongoing","tags":["Comedy,Sports,Adventure,School Life,Slice of Life"],"nutshell":"This manga follows the life of a mountaineering club that is going through difficult times due to the lack of members. However, the club is lucky - two undecided first years are ready to join. But what if neither of them had ever tried sports before?!\nFollow the adventures of Santama University Mountaineering Club in the new series of Cross the Mountains!\nAnyone can climb the mountains regardless of the humanities and sciences - Welcome to the mountain club of Santama University!\n[The Bread House]"},{"name":" Dominate the World Only by Defense","avatar":"https://mangadex.org/covers/264c700e-e6d6-48d2-a2cb-51e28fa4c6d1/fb82a7ac-9448-442d-8097-1ede98217858.png.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Time Travel,Action,Long Strip,Martial Arts,Drama,Web Comic,Full Color"],"nutshell":"Teenager Zhang Chen encounters an accident that brings him back to his life during high school times, the difference in his memory is that the world is now in a state of “spiritual revival”, everyone training martial arts, practising their qi and cultivation, all to prepare for the attack of extraterrestrial beings, another surprise is that a “beating system” was activated, getting beaten up strengthens him, being on defence provides power, status, riches, he must get beaten down to the core to be the saviour!"},{"name":" Mahou no Ouchi","avatar":"https://mangadex.org/covers/264d1b9b-1577-4669-9799-b5e6f3fb3ec3/054d0026-b422-4377-b642-0426d2db54d4.png.256.jpg","country":"Japanese","stat":"7.95","status":"Ongoing","tags":["Boys' Love,Magic,Fantasy,Slice of Life"],"nutshell":"This is the story of Hoshi Aoi and Machi Kohan, a male couple who live in an old detached house in Saitama.\nAfter his grandmother's death, Aoi inherited her house and he is now living a slow and peaceful life there with Kohan. However, the two are actually hiding a secret that they can't tell anyone about..."},{"name":" Cheerful Countess Sisters","avatar":"https://mangadex.org/covers/2650a5bf-4e89-4eb9-9a54-ec8fdeee5c2b/71fc9e4b-a33f-4336-86e0-e85e3f454318.jpg.256.jpg","country":"Korean","stat":"8.29","status":"Ongoing","tags":["Long Strip,Romance,Magic,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"Charlotte de Perol is a beautiful lady with a heartbreaking past. She has endured long years of abuse and threats from her mother while her father was busy chasing girls and wasting the family's fortune. But on the day of her grandfather's funeral, Charlotte becomes the countess instead of her father. Out of resentment, that cruel father locates his long forgotten daughter named Kara to steal the title back from her daughter Charlotte.\n\nThe heart-racing and hot-blooded romances for sisters between the Ice Princess Charlotte and the strongest knight Kara!\nThe Count's lovely yet unfortunate granddaughter, Young Miss Charlotte. After her grandfather passes away, she inherits his entire fortune and title instead of her worthless father. That's how she thought her life was going to be in full bloom, but her father wouldn't let go of the inheritance and brings forward Kara, a younger sister she's never seen or heard of before…\n\"It's good that you've become a lady of the Perol household, and that I am able to share the inheritance.\"\nAnd in the midst of it all, she also has to deal with their King who's targeting her fortune by trying to force her into marriage with his own vassal! To Charlotte, who has to stand against all of these stupid troubles, Kara extends a hand.\n\"In situations like these, you should say that they're 'crazy bastards!' You should curse them at least this much.\"\n\"Crazy bastards?\"\n\"Good.\"\n\nOriginal Web Novel\nOriginal Webtoon: Comico, KakaoPage, Naver Series\nOfficial Translations:\n\nEnglish\nChinese (Traditional) / 漢語\nFrench / Français\nGerman / Deutsch\nIndonesian / Bahasa Indonesia\nJapanese / 日本語\nVietnamese / Tiếng Việt (expired)"},{"name":" Rengoku Game","avatar":"https://mangadex.org/covers/2653546c-2c20-460f-9fba-afb6e8a7c027/05e13d75-bb23-4b4f-b30e-c6b667ae8658.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Psychological,Horror,Mystery"],"nutshell":"From MangaHelpers:\nA mysterious event causes a number of people in Ikebukuro to collapse, but after they gain consciousness they explode and die! Ryuji and his friend Taizou Miyauchi are determined to find the cause after their friend meets their explosive end in front of them. But instead of finding answers, they are given a death sentence and transported to a strange world by a mysterious child. To return home they must compete in, and survive, the Purgatory Games! [Niffer]"},{"name":" Acid Town","avatar":"https://mangadex.org/covers/2654d624-74b4-482c-94c9-f258f1045314/cb0abd92-570b-4d5f-9a6c-5dcf3bb32be8.jpg.256.jpg","country":"Japanese","stat":"8.42","status":"Ongoing","tags":["Action,Boys' Love,Crime,Mafia,Drama,Delinquents"],"nutshell":"In a city where the law has been rendered non-existent, Yuki and his best friend Tetsu break into the offices of the Seidoukai to steal, in a desperate attempt to finance his ailing brother's hospital bills. They ultimately fail but instead spark the interest of the mob's young leader, Kazutaka Hyodo, who offers Yuki a deal he can't refuse: pay him a visit at his office once a week and all hospital bills will be taken care of. Yuki accepts without hesitation and in order to keep his end of the deal, starts paying Hyodo the visits he asked for…\nNote: From volume 6 onward chapter numbering diverges from the magazine version."}]