[{"name":" Look at☆the Sky","avatar":"https://mangadex.org/covers/a603c0df-669f-47a2-81d5-0477b4bb5e7d/3d7feb5e-d4bd-4734-a057-bef4b16db0cd.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Comedy,School Life,Slice of Life"],"nutshell":"Mizutani Minato, a high school girl, has not fit in at her new school ever since she started attending a different school from her middle school friends. Her shy personality has kept her from making friends and engaging with her classmates. Through an unexpected turn of events, she joins the astronomy club in school, consisting of three students considered to be the weirdest and seen as outcasts in the entire campus. The club consists of Aida Souji, the smartest student in the entire freshman class, Kousaka Ranko, the second most brilliant and ridiculously strong, and Takigawa Youichi. They all have dreams of becoming members of NASA and studying the fascinating universe. The four kids of the astronomy club rename themselves “Soramiyo” a name made by taking the first letter from each of the members' name. Minato slowly learns through the Soramiyo club how to become confident in who she really is and the importance of having great friends."},{"name":" The Devil's Cure","avatar":"https://mangadex.org/covers/a604f709-7f0e-462b-afc8-c123bb187079/d9d68c36-b09d-4029-b06e-c9eca64736ca.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.06","status":"Completed","tags":["Comedy,Girls' Love,Fantasy"],"nutshell":"This story narrates how a trashy Divine-less Sect and a group of unreliable disciples under the leadership of an unreliable master bring the development of the sect to greater heights."},{"name":" Love or Die","avatar":"https://mangadex.org/covers/a6102956-324e-4bdd-8018-25f35c3e8450/53dbb648-e903-4f1c-b3bb-c3b7075316ff.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Being raised in a wealthy family, Gaoyin is a real upstart, although, wearing a special \"A\" collar at school, he is a thorn in the side of other male students. One day, his house unexpectedly declares bankruptcy. His elder sister and father disappear without a trace and his mother is arrested and interviewed by the Bureau of Investigation. He had been living like an idiot while he was wealthy and now with nothing left, he is forced to become a school worker. Even his longtime girlfriend, Alice, also starts to scout for a new boyfriend…"},{"name":" Super Darling is Dead","avatar":"https://mangadex.org/covers/a61653a5-40b3-4bf7-9131-26b45dd4fc79/c681b7b3-33f1-46d2-acff-92b0a207c95e.jpg.256.jpg","country":"Japanese","stat":"8.33","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"He was an elite from the big city who had status, money, and women. However, when an investment in a share-house fails, he loses everything! At his lowest point of despair, he meets Tao, a brazen, young gay man who runs a share-house. “If you pretend to be a couple with me, I can help you.” To take back his elite life and lost pride, as well as gain the know-how of running a share-house, he has to accept Tao’s insane conditions!?"},{"name":" Étoile - Sanjuushi Seira","avatar":"https://mangadex.org/covers/a61914e3-db9c-4dbd-835d-a4a1a1194c6b/5b2fcbf8-cf75-49ef-836a-826c22087a1e.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Historical,Action,Comedy,Adventure,Fantasy"],"nutshell":"France, 17th century:\nAfter the \"dishonorable\" death of his father and teacher, D'Artaignan vows to not become a warrior of justice anymore. The beautiful youth is more interested in the women around him. However, when a cute girl shows up in his town one day, being chased by a mysterious swordsman, accompanied by ravens, his past seems to shine in a different light. So the womanizer just can't ignore the call of his blood and of a great adventure."},{"name":" Honnou - Motto Midaretai","avatar":"https://mangadex.org/covers/a61973ab-e8e3-4525-96d2-a555b1e66c58/fdf32782-c550-4bc6-87fa-1dfb3aed42ae.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Romance,Anthology,School Life"],"nutshell":"From What Does This Lesson Lead To by Shigano Iori\nIt's about the relationship between a teacher and student. How will their love go and end?\n\n\nJunjou Bousou Honey by Kurumatani Haruko\nNot only does Suzuno have to go to high school, she also has to take on the role of dorm manager at a soon-to-be demolished dorm! This dorm is known as \"the city of crime,” an place with no order where trouble is always happening. When the leader of the troublemakers Kazuomi, kisses Suzuno, things start to get really chaotic!\n\n\nMy Boyfriend is an Alien by Amane Yuko\nA strange aircraft, a handsome alien who needs kisses for energy, a mysterious man in black and a naive schoolgirl.\n\n\nLove Love Dojo by Yuuhi Ryuu\nA student admires a classmate because of his fighting style and joins the karate club to train with him. But her admiration of him is misunderstood, and now they're going out?\n\n\nIt can't be Love by Aikawa Saki\nSeto Mizuha accidentally ran her bike into Souma's car. She cannot pay him, so Souma said he'll buy each kiss from Mizuha for 5,000.\n\n\nWild Night Stripper by Fukami Sakana"},{"name":" Uso Tsurezure","avatar":"https://mangadex.org/covers/89db77e5-df02-4ae6-95fc-8fc37070072c/508c98a4-87b6-429e-95c1-df3df468dd99.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["School Life"],"nutshell":"Once upon a time, there was a boy who was bullied by his peers because of his honest, straightforward personality. This boy was befriended by a brother-and-sister duo who vowed to be his friends forever. Unfortunately, the boy's family moves away, leading to their fledgling bond being severed.\nYears later, the honest boy has found the perfect way to make 'friends,' be admired by students and teachers alike, and avoid being picked on: maintaining a false personality as the \"School Prince\" while carefully hiding his quarrelsome, devil-may-care attitude from the public eye. But his peaceful - albeit mind-numbingly boring and somewhat lonely - days are thrown completely out-of-whack when a pair of twins transfers into his school."},{"name":" Ekijin no Karte","avatar":"https://mangadex.org/covers/89df8f8c-3733-4e33-9abf-db3f8a87419f/2e380305-2589-4acd-83d2-6bcf37b212aa.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Sci-Fi,Action,Military,Medical,Web Comic"],"nutshell":"Ekijin (God of Pestilence) Syndrome is a disease that manifests paranormal abilities in an individual that eventually leads to death. The cause is completely unknown and the only remedy is symptomatic therapy. Your family, friends, or even you can be suddenly infected with that disease and become the grim reaper itself. However, there are people who resist and fight against that hopeless disease. They are the Treatment Execution Organization's specialty division, \"Ekijin Corps.\"\nThough those within the unit are infected by the disease themselves, they wield their paranormal abilities as weapons and put down their lives to rescue the infected. In order to protect the lives in front of them and to win against the disease that will undoubtedly take them in the future, the doctors will fight until the end."},{"name":" Sutemi no Koubousen","avatar":"https://mangadex.org/covers/89e1a95d-0082-45ad-ad5b-486c14c20200/16ce53b7-6c20-45b4-b83a-caa88cbe9f03.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Boys' Love,Military"],"nutshell":"A pure love story about a dependable senior self-defense officer and an obedient boy.\nMamoru, a young self-defense officer, has always been in love with his senior, Akutagawa, who helped him when he was in high school. Mamoru, who was assigned to the same base as Akutagawa, is in charge of his long-awaited flight. In high school, Mamoru regretted not being able to reveal his love, expressed his love for Akutagawa straightforwardly, saying, \"I’m a proper adult now, so wake up!\" Still, Mamoru keeps on attacking without mercy, but …?"},{"name":" Mahou Shoujo Lyrical Nanoha - AGAIN & AGAIN (Doujinshi)","avatar":"https://mangadex.org/covers/a633184d-42bf-42ab-b719-2145b752e123/835ff7f1-f47f-4cf7-a507-72ecaf6a4a98.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":""},{"name":" Babylonia no Shishi","avatar":"https://mangadex.org/covers/89e35294-9601-4e4f-b8ac-3672818eaa7f/1a707fef-33f5-4d63-bf01-47b954d5de1b.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Romance,Adventure,Drama,Fantasy,Supernatural"],"nutshell":"Shin and Leona are childhood friends who are dating each other in high school. On a school field trip in France, they encounter a misadventure through a distortion in timespace bringing them back in time to the ancient city of Babylonia. Leona becomes the goddess Ishtar, and Shin becomes the beastmaster, Enkidu. In a story loosely based off \"The Epic Tale of Gilgamesh\", Shin (Enkidu) seeks to bring Leona (Ishtar) back to the normal world and in the process helps Gilgamesh in his quest towards immortality."},{"name":" Today I Become A Star","avatar":"https://mangadex.org/covers/89e90a95-f5e3-4cf2-8ccd-82fbdd91c9b1/3d124400-a34f-4ca4-8502-fabf0e2f6543.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.84","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Crossdressing,Web Comic,Slice of Life,Full Color"],"nutshell":"Taize only wants to live a quiet and peaceful life, but he has been forced to become his elder sister, Taiya, who has been a professional idol for several years. He originally thought that pretending to be his sister would be over quickly and he wouldn't have to think about it again, but who would predict his university life would be stirred up by this? how will his story layout?"},{"name":" Trigger","avatar":"https://mangadex.org/covers/a6376272-95ca-4fbb-bfa2-9b10ede476e2/6a69c8ad-4723-4640-82f3-9008a135337c.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama"],"nutshell":"Trigger\nSawada owes a lot to Kagami, the yakuza that picked him up off the street, but hearing a shocking secret about Kagami changes Sawada's feelings for him. He's also been given an important job involving Kagami…\n\n\nSteal Me\nA beautiful young thief stealing information finds himself at the mercy of the owner of the house.\n\n\n3-4) Risky Bet\nIwase is a gambler determined to get revenge for his uncle's death. But getting close to his uncle's employers is harder than he thought. Professional gambler Shidou offers to help Iwasse, but he won't do it for free…\n\n\nMe in the Palm of a Hand\nPure hearted Hinata loves sweet and gentle girls, but every one he's interested in is taken away by coworker and ladies man Fujimaki. Is Fujimaki deliberately bullying Hinata?\n\n\nThe Power of Glasses\nReporter Oota gets assigned to work with his friend from college Kaneko that he hasn't seen in four years. When his heart beats faster at seeing Kaneko wearing glasses, Oota knows he's in for trouble…\n\n\nMy Fair Prince\nWhen foreign prince Julius comes to Japan for a week to sight see, he wants to go incognito. Since his (sort-of) relative Doujima works at the embassy, Julius wants Doujima to escort him. By turns pouty and childish, commanding, and sweet, Julius begins to unconciously charm the older man. But when the week's up, will Doujima be able to give up his treasured prince?\n\n\nAs You Like It\nKobayashi Tomo is hopeless at job interviews so when he fails his sixth, he doesn't know how his day can get any worse. Running into a yakuza just might do it, and before he knows what's happening Tomo is being pulled along at Suga Mitsunari's pace. But spending a whole day together? And what's going to happen when night comes…\n\n\nFever\nContinuation of chapter 1."},{"name":" Tao Tie Jie","avatar":"https://mangadex.org/covers/89eb26f3-6236-4eec-aab1-d5edc8616741/f1dcbab2-6c73-4bb8-be11-d63913ff987b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.04","status":"Completed","tags":["Historical,Romance,Drama,Fantasy,Tragedy"],"nutshell":"Demon brothers Tao Tie and Kui Long arrive at a village to prepare to receive a ritual sacrifice that happens every 10 years. Kui Long introduces himself as Wu Chen to a girl named Tan Hua. Turns out Tan Hua actually died from an illness beforehand but her brother the doctor gave her a medicine that revived her so that she would be the sacrifice and not him. Neither Kui Long nor Tan Hua know of each others role in the approaching ritual…"},{"name":" A Manga Where Rapper Bites Turn You Into A Rapper","avatar":"https://mangadex.org/covers/89ec09d9-e132-4d1d-889d-3499a371c971/89ff33e3-f5e6-42e9-809e-43dde3e79ce3.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Thriller,Action,Comedy,Zombies,Adventure,Horror,Music"],"nutshell":"The rise of rappers due to a mysterious virus! Japan has turned into a hellish clubhouse! Holy shit! The rappers are gonna eat you!"},{"name":" Mangaka-san to Assistant-san to 2","avatar":"https://mangadex.org/covers/a65cdd66-cc22-448d-86cf-757f1a9ec82a/19bd1ccd-60c9-4e7c-b5e5-7a793bcc0ff8.jpg.256.jpg","country":"Japanese","stat":"7.52","status":"Completed","tags":["Romance,Comedy,Harem,Slice of Life"],"nutshell":"It starts where the last season ended, Aito and Ashisu meet their new assistant. The entry of a new member. What kind of story can she make out of Aito and Ashisu's life?"},{"name":" Possessed Girlfriend","avatar":"https://mangadex.org/covers/a65e8798-90e5-4a73-b260-1fda980a4e1e/f7161efb-c0c3-442d-b7fc-b3c40c157975.jpg.256.jpg","country":"Japanese","stat":"5.91","status":"Completed","tags":["Oneshot"],"nutshell":"A guy asks his girlfriend to act as if she was possessed.\nArtist's Twitter"},{"name":" Kaitou Saint Tail","avatar":"https://mangadex.org/covers/a6625c91-0476-4341-ac0e-03145a75e638/4a7698c7-ab23-4f52-8c3d-f9aab3e0a754.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Romance,Magical Girls,Magic,School Life,Police,Mystery"],"nutshell":"The story of Saint Tail follows a simple formula: middle school girl Meimi Haneoka transforms into the mysterious thief Saint Tail-(hence the series title), and steals back random belongings that where stolen or taken dishonestly using simple magic tricks (this is why many claim the show not to be a magical girl show). She's assisted by a classmate/best friend and sister-in-training, Seira Mimori, whose position in the church after school each day allows her to hear the troubles of those who have been wronged and have come to pray to God.\nWhile Saint Tail steals to right the wrongs done to innocent people, she's a thief to the police force. Her classmate Daiki Asuka Jr., called Asuka Jr., and son of Detective Asuka, is hot on her trail. Saint Tail delivers notices of her planned capers to Asuka Jr., to give him a fair chance to catch her.\nTaken from: Wikipedia"},{"name":" The Wolf Lord's Lady","avatar":"https://mangadex.org/covers/a6661f41-6d4e-4320-876a-bbd44d445627/f967f100-2a30-4075-ab4f-8a46ddbe8394.jpg.256.jpg","country":"Japanese","stat":"8.46","status":"Ongoing","tags":["Reincarnation,Romance,Drama,Villainess,Adaptation,Tragedy"],"nutshell":"The previous lords have committed as many atrocities as possible to fill their bellies. I, the only daughter of that house, had discovered that my servant and lover was a spy.\nAnd as the people wanted, my life ended with my execution.\nHowever, with the memory of getting beheaded intact, I began a new life. I was planning to shoulder the sins of my past life and become a nun, but by some trick of fate, I came to work as a maid for the current lord.\nUnder my former lover, whose name, age and even hair colour were all lies."},{"name":" Mousou Fragments","avatar":"https://mangadex.org/covers/a66647d8-8549-4354-9f3e-a5c8389ebf1c/da88d3a7-9622-4ec3-9de3-44f177e97082.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Ongoing","tags":["Genderswap,Romance,Anthology,Magical Girls,Virtual Reality,School Life,Slice of Life"],"nutshell":"An anthology collection of small stories from this Twitter author's mind."},{"name":" Your Highness, Please!","avatar":"https://mangadex.org/covers/a66af403-b159-4eb6-823b-b67eb2733896/03f3dfd5-bb99-427a-9b2a-20e7cb300fa9.jpg.256.jpg","country":"Korean","stat":"7.91","status":"Ongoing","tags":["Comedy,Boys' Love"],"nutshell":"¡¿Qué diablos pasó anoche ?! Apresurándose por la vida con tres trabajos, el extremadamente promedio Sunwoo conoce a Zeus, el príncipe secreto de Zerdel, una fatídica noche. La improbable pareja se vuelve más cercana a medida que vuelven sobre sus recuerdos, ¡pero su relación se ve sacudida por el pasado oculto y el Primer Ministro que tiene la clave del secreto …!"},{"name":" Anata no Jinsei Hikiukemasu!","avatar":"https://mangadex.org/covers/89f65dbe-4cc5-4b5e-b339-ee317aba3ca3/90f21824-2e67-4900-a0a9-07b2bc96aee0.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Comedy,Boys' Love,Slice of Life"],"nutshell":"An elite businessman exerting himself at a publishing company is demoted to the manga editorial department, which is out of his field of experience. Moreover, his first charge is a comic artist that no one can handle…"},{"name":" Kimi no Tame nara Shineru","avatar":"https://mangadex.org/covers/89fc8249-939e-4b37-b1a3-8a7d1a9288e8/8d6bee1e-5519-493b-9bd7-a7cc808baa1b.jpg.256.jpg","country":"Japanese","stat":"7.51","status":"Ongoing","tags":["Comedy,Girls' Love,4-Koma"],"nutshell":"The 27-year-old Shonagon, depicted here as a sort of medieval NEET, manages to land a job as the private tutor of a beautiful and refined 13-year-old, Princess Teishi. There are also a number of other quirky court ladies, some of whom have their eyes on Shonagon."},{"name":" Hantsu x Trash——Colourful collection of short sexy stories","avatar":"https://mangadex.org/covers/89fe9820-c2e4-4866-9b84-e068c5dee3f5/d1c5f26b-bbb6-488c-a9b3-9710c9098f5b.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Official Colored,Romance,Comedy,Harem,Drama,School Life"],"nutshell":"《青春水球社》是由日本漫画家小林雏作画的漫画。主要讲述了滨路好不容易考上高中，但是每天却都无所事事，对什么都不感兴趣只幻想着跟女孩子亲热。\n某天2年级学长中岛突然邀请他加入社团，还夸口说社团里的女孩子都随他摸任他揉，这番话让滨路完全无法招架而决定加入，结果才发现是“水球社” 。第一天前往社团，他所展现的过人弹跳能力就让2年级的萩原学姊相当惊讶，她的鼓励让原本有些失望的滨路打算试试看。"},{"name":" Lunar Lover","avatar":"https://mangadex.org/covers/a681d521-e26d-460a-aa60-71e0a9151e24/e4a2eeda-1edb-4fb5-ad5e-43950ef726aa.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Historical,Long Strip,Romance,Magic,Drama,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"About to die, a mysterious man grants Yunho immortality. Well, with a catch. During the night, he suffers no injury. During the day, his body burns alive. No, he’s not a vampire. At least that’s what Ui, his young, beautiful, new next-door neighbor wants to believe. Who is the man with the power to defy death? What is the significance of the hair ornament he’s chasing? And why are people dying to find it…"},{"name":" Suki na Hito no Suki na Hito","avatar":"https://mangadex.org/covers/8a00670d-e9cd-4b53-a318-c81a2ddfa719/4b3ce256-6f85-4215-b632-c43048d71ad6.jpg.256.jpg","country":"Japanese","stat":"7.60","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"The top most popular boy and girl in the grade: Hashida-kun and Kaneishi-san. No one knows if they are dating but, they look good together and rumours never cease to follow them. Chiyo recklessly harbours an unrequited love for this Hashida. She becomes acquainted with Hashida as their seats are next to each other and she also discovers that Hashida harbours an unrequited love for Kaneishi. However, Kaneishi also harbours an unrequited love for someone else――"},{"name":" Ginyuu Gikyoku Black Bard","avatar":"https://mangadex.org/covers/a68b40e1-0f72-4bc9-87da-279bb14c89f2/455981d1-e42e-44ba-8e4e-f19a1edfd25e.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Supernatural"],"nutshell":"The Black Bard, a lonely bard who travels around the perverse and charming world. Who will be delighted by his voice? What is the mystery surrounding this bard? This fantastic adventure told in the way of the bards, filled with mystery and intense drama, begins now!"},{"name":" Tonari no Kare","avatar":"https://mangadex.org/covers/a68b87ba-2e16-4c97-9e2e-b0319874c868/cbf67080-6aeb-4574-a88f-49bb803350a1.jpg.256.jpg","country":"Japanese","stat":"7.52","status":"Completed","tags":["Boys' Love,Slice of Life"],"nutshell":"Matsuda has just begun his life as a University student and is starting to experience the Tokyo life he's always dreamed of. Soon enough, he acquaints himself with his next door neighbor: Yaotome, a shabby-looking fellow that's tough on the outside, but soft on the inside.\nOr is it the other way around…?\nMatsuda can't seem to figure Yaotome out at first, but soon enough, their acquaintance evolves into friendship, and the two begin to uncover new sides of each other."},{"name":" The cat and I","avatar":"https://mangadex.org/covers/a68e9253-66e9-4eba-a958-2e3620adbeff/943f025e-f380-41ea-9297-1728939a0389.jpg.256.jpg","country":"Japanese","stat":"7.68","status":"Completed","tags":["Oneshot,Monsters,Psychological,Long Strip,Horror,Mystery,Full Color"],"nutshell":"A girl who has accepted her misfortune, Sachi, discovers a mysterious creature one day that looked like a cat to her."},{"name":" Senki Zesshou Symphogear - Tsubamari Manga  (Doujinshi)","avatar":"https://mangadex.org/covers/8a0bdf75-1f04-4218-b34d-59733d00ac8e/36a73d23-fdb4-4f8e-8e38-d184bf386eae.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Comedy,Girls' Love"],"nutshell":""},{"name":" Showa Era Gag Manga","avatar":"https://mangadex.org/covers/8a1165ee-e104-4f1c-965e-4ccffd4d7fcb/58168cd1-6673-48d3-b540-3624a0df66c6.png.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Romance,Comedy,Web Comic,Slice of Life"],"nutshell":""},{"name":" The Story About A Boy Forced to Cross-dress for A Punishment Game","avatar":"https://mangadex.org/covers/a6902378-ba40-482d-8ea3-ad1bf626a0cb/8a89cb6f-9777-4bb8-9c3e-dbee220aa6d5.png.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Oneshot,Boys' Love,Crossdressing,Web Comic"],"nutshell":"Creator-approved translations by Hachirumi Scans"}]