[{"name":" Shinkonsan!","avatar":"https://mangadex.org/covers/f1d98939-0e9a-477d-91bd-09d9f5b20d7b/524b799a-7348-4e91-84f4-4cc56abb2793.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"They were 6 yrs. old when they met. The one who would break Takara’s peaceful days to pieces was a transfer student from the city. Despite constantly fighting, twenty years later, they ended up getting married?!\nHis partner, Saionji Kyousuke, is a stubborn, self-confident man who hates people. He says ‘hate’ a lot even though he is a handsome man, but Takara can’t leave him alone and knows that deep inside, he has a pure heart."},{"name":" Kimijima Kyoudai no Honkai","avatar":"https://mangadex.org/covers/f1dd5eb7-0c4a-41b1-baa6-9a5a2b4895fa/15722b85-0d86-4f0b-8a34-97603ac8afac.jpg.256.jpg","country":"Japanese","stat":"7.47","status":"Completed","tags":["Boys' Love,Incest"],"nutshell":"The Kimishima brothers each have a secret: Takumi wants to embrace his older brother, while Hikaru is surrounded by women, changing partners every few days. But what Hikaru truly wants is to be embraced and messed up by someone…"},{"name":" Seishun Runaway","avatar":"https://mangadex.org/covers/f1e02be8-ec68-4732-8e3b-75b81978d914/566d16df-3441-4ac5-83bf-990a92ed4cd5.png.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Boys' Love,School Life,Slice of Life"],"nutshell":""},{"name":" The Godsend","avatar":"https://mangadex.org/covers/f1e9a634-f768-4b45-a1ca-1631eff9f257/731ae852-3e0b-435b-b370-bde0f07bd193.jpg.256.jpg","country":"Japanese","stat":"8.47","status":"Completed","tags":["Oneshot,Magic,Drama,Slice of Life,Supernatural"],"nutshell":"Is this world really all about money? What if one day, an innocent fairy shows up and gives you not money… but something more important that will last a life time?"},{"name":" Cardcaptor Sakura - Delicious Way (Doujinshi)","avatar":"https://mangadex.org/covers/f1ea15af-32b5-460e-a971-1bfd9c002eaa/00b2c611-5006-4bfe-90d9-bc61deb6d05a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance"],"nutshell":"Cute story about Sakura after the manga ends.\nCharacters/Pairing: Syaoran x Sakura.\nRating: PG-13."},{"name":" Pure and Innocent Young Master Lu","avatar":"https://mangadex.org/covers/f1ec0e33-186b-48e9-a677-b37ea8c0ef8d/4410eb82-944e-44be-a93a-68b638149159.png.256.jpg","country":"Chinese (Simplified)","stat":"7.99","status":"Ongoing","tags":["Official Colored,Long Strip,Full Color"],"nutshell":"Dressed as a man, she was a lady killer with a perfect smile, and gentleness. Her motto was, “Both women and men will fall for you as long as you work hard.” Women liked her. Men were so obsessed with her that they were willing to be gay for her. The uncrowned king Zong Jize saw her as his bro, but tricked her onto his bed!"},{"name":" Zombie Land Saga Gaiden","avatar":"https://mangadex.org/covers/f1f2ce4e-5470-4f16-b814-a147ee4f4491/f4b8b714-2e83-47a2-b07e-00fcde2166e1.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Zombies,School Life,Supernatural,Music"],"nutshell":"Eikichi Hyodo is a second-year high school student, and the eldest son of an onion-growing family. Eikichi withdrew from the Baseball Club due to injury, so he now considers his life mediocre and has no encouragement. On the other hand, his mother and his twin sister Yuko are in perfect condition and have the opportunity to take over the family business. However, one day the older sister disappears without a trace..."},{"name":" Dinghai Fusheng Records","avatar":"https://mangadex.org/covers/f1f81962-b988-4531-9c08-0a3ec7fb9d92/c90fe62e-af36-4408-8269-acc73ea85e4a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Historical,Action,Long Strip,Romance,Comedy,Boys' Love"],"nutshell":"Amidst the Silence of All Magic in the Divine Land, Mara is about to descend.\nIn order to prevent the destruction of the Divine Land and save all the people, Chen Xing, the last exorcist, embarks on a journey to release the sealed spiritual qi of heaven and earth — only four years remain.\nThe road ahead is full of thorns. Watch this cute little koi Chen Xing and the moody and grumpy Protector Xiang Shu, together with numerous people with distinct personalities in their group, working together to turn the tide again and again!\n\nArtist's Twitter"},{"name":" Kantai Collection -KanColle- AKKG (Doujinshi)","avatar":"https://mangadex.org/covers/f1fc2090-212f-4645-ba73-08b5193b3f3b/ac76761b-1297-4bd8-8e86-c3f0ca6bbcc5.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Girls' Love,4-Koma"],"nutshell":""},{"name":" An Always-Available Man","avatar":"https://mangadex.org/covers/f1fca608-baf7-41c5-80b0-3041029f0240/2edaac42-8904-4dc8-b9a8-d2a79a9d82ae.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot,Fantasy"],"nutshell":"Sponsored by Funwari Liquor."},{"name":" Ringo Hoppe no Koi","avatar":"https://mangadex.org/covers/f1fe6280-7df6-4cc4-9b83-afcefea1d68c/e80dbe5b-391e-4793-aa24-91e88eaccac6.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Anthology,Drama"],"nutshell":"A collection of short stories:\n#1: Ringo Hoppe no Koi\nTakami has a HUGE problem! She blushes at the drop of a hat, so everyone knows what she is thinking! She finally makes a decision to stop letting her fear of embarrassment control her – she gets a job where her crush is working so that she can confess her feelings to him… but then things go awry in an unexpected way!\n#2: Hinatabokko no Heya\nTomo and Daisuke have been childhood friends for ten years. Whenever something goes wrong with Daisuke, he finds refuge in Tomo's sunshine-abundant room. When Tomo asks Daisuke for a 'date' with him as her birthday present, will the equations of their relationship change?\n#3: 24 Ko no Kurisumasu (24 Pieces of Christmas)\nRio met Ian, the son of her father's friend, during Christmas when she was in the third grade. Ian turned out to be a devil with an angelic smile. That Christmas remains as an irritating memory for Rio, considering how Ian played multiple pranks on her and bullied her throughout the day. After that Christmas, Ian's family moved away to England and she didn't get to see him since then. But Ian sends Christmas cards for her every year. Years later, during Rio's 17th Christmas, Ian is back in Japan……planning some new pranks?"},{"name":" Osusume Boyfriend","avatar":"https://mangadex.org/covers/f201268f-fdbd-4dd3-9725-d15a56f894ed/19503315-4f9d-4bc7-ab76-2269c63e980e.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"At the start of high school, Takae fell in love with Araki. However, Araki just happens to be indifferent to love. Against her better judgement, she begins dating someone else, but that relationship turned out to be a big mistake…What will become of Takae's love!?\nIncludes an extra story:\n\"Yori-chan has a Love That'll Never be Requited\"\n(Sequel to \"Like Snow Falling on Harbor\" from A Rose-Colored Tomorrow )\nIt's been over five years since Yori watched the car that his best friend and Kurita, the girl he was in love with, were riding crash into another car, leaving Kurita in a coma that she hasn't come out of since. His best friend, who had also been in love with Kurita then, has already moved on and found himself a new girlfriend.\nFor Yori though, time stopped that horrific day many years ago. Can his distant cousin, a spunky teenage girl who harbors a huge crush towards him, make him realize that it's time to let go?"},{"name":" AAA","avatar":"https://mangadex.org/covers/f20144da-4965-409e-ac25-c836793fb86a/5d2c2ed9-fb91-4a23-89cf-8a90ddfb37a4.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Comedy,Crossdressing,School Life"],"nutshell":"Ogata Aoi is in her second year of middle school and is the president of the student council. The middle school she attends is one of the best in the country and is called \"AAA.\" Aoi goes there to meet her first love, but after a surprising meeting, she's finding out that her first love is a gang leader in the neighbor school, called \"CCC\" (lowest level). Maybe it's only a coincidence, and that gang leader and her first love just happen to have the same name. After all, they look completely different from each other. But now, Aoi wants to find more about this person…"},{"name":" Abenobashi Magical Shopping Arcade","avatar":"https://mangadex.org/covers/f20282e5-c54c-441b-a5f2-a5ae5da3df81/c9603885-8b7d-4063-a0c6-9d4d3cba34eb.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Comedy,Adventure,Fantasy"],"nutshell":"Sasshi's world is in disarray. His best gal pal, Arumi, is about to move away, and his Osaka neighborhood is being demolished in the name of urban renewal.\nHowever, this little neighborhood has some surprises under its concrete – it's actually a portal to parallel universes. And when this section of the city is leveled, the portal is cracked wide open. Sasshi and Arumi soon find themselves being hurtled from one strange world to the next! Making matters even more surreal, is the fact that these worlds seem to spoof and mock popular movies, video games, manga and anime!\nSee AnimeNewsNetwork for the anime."},{"name":" From friendship comes love","avatar":"https://mangadex.org/covers/f207bd7e-2268-4188-92c6-aa53bdbdd622/5d9a5b72-3de0-4336-b82d-fbe10faecff7.jpg.256.jpg","country":"English","stat":"7.97","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,School Life,Slice of Life"],"nutshell":"A história começa com Alex, nosso protagonista que retorna à sua cidade natal depois de 6 anos morando fora do país. Quando ele estava na Escola primária, havia um cara que costumava incomodá-lo, por causa de sua aparência delicada,\nEstar de volta para onde ele tem tantas lembranças ruins, não é algo que o alegre.\nFrom friendship comes love trata-se de uma webcomic postada originalmente no Tapastic e traduzida com a permissão da autora."},{"name":" Asobi ni Iku yo!","avatar":"https://mangadex.org/covers/f2080de4-f335-4680-a16c-4ed10cde514d/c577bf2d-71fc-4c78-b22f-0f77c81b51ac.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Action,Romance,Comedy,Mecha,Harem,Drama,Mystery"],"nutshell":"Okinawa. An ordinary senior high school student, Kio, meets an alien girl who has cat ears and a tail who came to Earth so that she could learn more about it. In the end, he decides to bring her home, however, living with such a person might not be as easy as it seems for Kio!\nSee AnimeNewsNetwork for the anime.\nSee AnimeNewsNetwork for the OAV.\nWikipedia"},{"name":" Otoko ni Dakareru Tameni Umarete Kita","avatar":"https://mangadex.org/covers/f20b33a9-20d1-4b90-8224-7e11cadef35c/4c060267-6ca9-4862-94b9-2d22ed34d673.jpg.256.jpg","country":"Japanese","stat":"7.43","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"\"Pleasure Mansion\" is a paradise for the monks to release their sexual urges. Employed to comfort the monks, Shion is the partner of a large crowd of men night after night. \"As long as I can be useful to everyone…\" said Shion, while smiling innocently. Seeing that, Munemitsu feels sympathy while also having desires for him; he's falling for the beautiful Shion. Shion also begins to be attracted to Munemitsu, who's the only person being kind to him. However, Shion's master will never overlook this…"},{"name":" Melo Neko: Cat Manga Anthology","avatar":"https://mangadex.org/covers/f2179c28-37d9-48bb-ae0e-91a7ae44d4de/2fedbf60-a0ea-40b6-b9f4-9c49cd2be51c.png.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Animals,Comedy,Anthology,Slice of Life"],"nutshell":"Collection of one-shots by various authors."},{"name":" Boku no Sex Star","avatar":"https://mangadex.org/covers/f217ca88-3f13-4c6b-9a50-a3356b131207/7b2f60a3-326d-469b-a7d6-d889185f95c4.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life"],"nutshell":"Collection of short stories:\n1-2) You're My Sex Star\n3) Cryptic White\n4) Tonari Awase\n5) Loose Socks Boy\n6) Lipstick Boy\n7) Haru wo Uru\n8) Hitori Asobi\n9) Please Don't Touch Bunny Boys\n10) You're my Sex Star Extra"},{"name":" Infinite Stratos 2 - Official Anthology Comic","avatar":"https://mangadex.org/covers/f219c8ad-d368-46e7-a20b-16c6f238cbd2/a0a2e797-3f4a-411c-a455-68679c74a46e.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Action,Romance,Comedy,Mecha,Anthology,Martial Arts,Harem,School Life"],"nutshell":"An anthology comic of Infinite Stratos by various mangaka.\nCover: Nekonyan\nIllustrations: Kekocha, Ichiri, Sasamori Tomoe, 108 Gou\nChapters:\n\nBeautiful Girl's Epic Battle by Mitsu King\nDrugs Rolling by Mimi Mimizu\nDo You Like Bunny Ears? by Suihi\nThe Case of Orimura Ichika's Murder by Peke\nMy Chest is Rin-rin by RoGa\nMelting Alcott by Asagawa Keiji\nIS Master Cinderella Girls by Hitsuji Hako\nKittens Tea Party - Midnight Edition by Shiina Yuuki\nCharlotte Attack by Yaya Hinata\n\"Just A Little More\" Battle by Hisama Kumako\nMemory Ball by Mori Airi\nHouki's Confession by Macchi\nIS \"Immoral Students\" by Tsutsumi Akari\nTo Make A Blockhead Like You Notice by chany\nPleasant Life At IS Academy by Futaba Masumi"},{"name":" Pokémon Sun and Moon - C92 Bonus Swimsuit Book (Doujinshi)","avatar":"https://mangadex.org/covers/f21a8988-5ef7-41e4-8543-a145f497c13f/b6a7bbb8-c7a8-42e1-94b2-251978a8d156.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Oneshot"],"nutshell":""},{"name":" Be a Master!! Pokémon BW","avatar":"https://mangadex.org/covers/f21e24b8-e73e-42a2-a317-cf687b671b6e/34c1371c-4671-444a-b258-dd4f97f3f59a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":""},{"name":" Tokushu Seiheki Kyoushitsu e Youkoso","avatar":"https://mangadex.org/covers/f21f62e2-7d0e-4cfa-b194-c24222191d19/72b4129c-15d4-4e61-8bbd-77aff0c9956f.jpg.256.jpg","country":"Japanese","stat":"6.69","status":"Hiatus","tags":["Psychological,Romance,Video Games,Harem,School Life,Mystery"],"nutshell":"The geniuses and eminent figures that have left their names across history tend to have special fetishes. By taking this anecdotal evidence and turning it around, a class of students with special fetishes was created with the purpose of raising geniuses. Seijun Private Academy class 2-9, also known as the Special Idiosyncrasy Class. White bitch gals, peeping toms, perverted inventors, extreme masochists, exhibitionists…… Itou Manami, a fledgling virgin teacher has been put in charge of this class. Will he be able to fulfill his responsibilities as a teacher against these students and their special interests!?"},{"name":" Tsundere Prince's Unruly Princess","avatar":"https://mangadex.org/covers/f2201332-7433-444b-b4ee-c62c1fc11aff/a0c7e2de-91ea-4b25-bff6-cb5893bcb3f4.png.256.jpg","country":"Chinese (Simplified)","stat":"8.01","status":"Completed","tags":["Historical,Long Strip,Romance,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"“It's commonly believed that I'm arrogant and aggressive. Let's teach them what arrogance really is! Anyone who dares to provoke me is doomed!”\nFormerly a professional bodyguard in the modern era, Xue Moyun dies while on the clock. When she wakes up, she finds she's inhabited the body of the Prime Minister's eldest daughter, a long long time ago. And as it turns out, this girl has just had two engagements annulled one right after the other—one to the crown prince, and then one to his younger brother after that! What's an arrogant girl to do?!"},{"name":" Angel's Smile, Devil's Tears","avatar":"https://mangadex.org/covers/f220f234-c416-4ce2-8d9d-f94caa184ea0/90ee13b3-1f99-4c9b-a671-a47f100a0ee2.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Historical,Romance,Drama,Supernatural"],"nutshell":"Three manga adaptations of Takarazuka Revue productions:\nTurandot: Loosely based on Puccini's opera of the same name. After Prince Calaf's homeland is destroyed by war, he flees and lives the life of a vagabond. After hearing rumors that his long lost father has been spotted in Beijing, Calaf makes his way there.\nAngel's Smile, Devil's Tears: Loosely based on Goethe's Faust. The fallen angel Mephistopheles resents humans, believing them to be unworthy of God's love. Determined to prove himself right, Mephistopheles sets out to corrupt humans and drag their souls to hell, starting with Dr. Faust.\nHot Flowers of Valencia: After Napoleon's invasion of Spain, three rebels don masks and rise in revolt against French rule."},{"name":" Hipira-kun","avatar":"https://mangadex.org/covers/f2248537-62b7-45d2-a439-b1904e92c060/0a11a8ca-68db-43b4-87a7-b6abeea4758f.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Comedy,Adventure,Fantasy,Vampires,Supernatural"],"nutshell":"Welcome to the vampire city of Saruta, where the sun never rises, and all the vampire children love trying to stay up late. Hipira is a precocious young vampire whose best friend is a fairy named Soul. Hipira and Soul are an odd couple to say the least, and their games, pranks, and adventures are extraordinary even for dwellers of this supernatural city.\nHipira is a delightfully bright twist to traditionally dark subject matter. Filled with fun, wonder, and heart, the illustrations look like they have been pulled off the screen of a top-flight animated feature. Hipira is a children's book like no other, one that will appeal to readers of all ages."},{"name":" You're No Good","avatar":"https://mangadex.org/covers/f228f3be-58a6-412f-b20e-207895c45659/e366853c-9ea4-4638-ad41-cc28facdbe85.jpg.256.jpg","country":"Korean","stat":"8.01","status":"Completed","tags":["Long Strip,Romance,School Life,Web Comic,Full Color"],"nutshell":"Why does Alfred insist on living as an outcast?\nAnd why does Hollie try so hard to keep him company?\nIs there something going on between the two?"},{"name":" Hamster Research Report","avatar":"https://mangadex.org/covers/f2338473-8d9b-432b-9d21-410838847b6c/1da27231-eb97-4523-9f9d-f0e84f73a9be.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Animals,Comedy,4-Koma,Slice of Life"],"nutshell":"Humorous observations and stories about the author and her hamsters."},{"name":" Kobayashi-san Chi no Maid Dragon Anthology","avatar":"https://mangadex.org/covers/f2343565-30fc-4a47-bf48-3a99019a0cf4/cf765e6d-6337-486b-bf00-3afe86c44812.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Loli,Comedy,Anthology,Office Workers,School Life,Fantasy,Monster Girls,Slice of Life"],"nutshell":"An official anthology of Miss Kobayashi's Dragon Maid side-stories."},{"name":" The Game Invades the Earth","avatar":"https://mangadex.org/covers/f23e936f-a0c2-4e7c-9a3c-c14e6e3ffe01/9c7237a3-24a4-4bfc-8fe0-9e5300d44612.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.00","status":"Ongoing","tags":["Sci-Fi,Action,Adventure,Drama,Fantasy,Web Comic"],"nutshell":"The earth is overtaken by a game called “Fantasy New World” , and the ecology has undergone tremendous changes.\nA 10,000-meter-high sky tree appeared on the coast, and a huge 50-kilometer-wide pit appeared in the center of the world.\nVarious monsters appeared.\nHumankind suffered tremendously in this disaster.\nAfter this occurred, a large number of gamers popped up.\nThey could not only fight monsters and upgrade, but also had different abilities. Mankind had just began to fight back."},{"name":" Lucid Dream","avatar":"https://mangadex.org/covers/f247b9b8-dd68-490d-bb38-acd773009b45/88598e37-b858-46e3-a76e-d21f04729c81.jpg.256.jpg","country":"Korean","stat":"8.17","status":"Completed","tags":["Psychological,Long Strip,Drama,Supernatural,Mystery"],"nutshell":"Yi Raeeum, a boy who is always conscious in dreams. A spectacle in a dream… a street in a dream… a life and death drama where the secrets of dreams and a fate following a young time intertwine."},{"name":" The Three Realms Online Shop","avatar":"https://mangadex.org/covers/f24c57a1-f198-4e01-aab1-e45a852bb025/0c48d75b-63e2-4c13-a7c0-73481d4fa5a8.png.256.jpg","country":"Chinese (Simplified)","stat":"7.91","status":"Ongoing","tags":["Action,Long Strip,Comedy,Martial Arts,Harem,Drama,School Life,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Ning Xiaofan was an unremarkable teenager from a poor family who was often bullied by his classmates, until one day, when a magical app called the \"Three Realms Online Shop\" suddenly appeared on his phone. Ever since then, Ning Xiaofan's life has been thrust onto a completely different path, taking him from zero to hero."}]