[{"name":" Nekogamisama","avatar":"https://mangadex.org/covers/6c2f09b7-ff98-4c7c-857d-3a8800b3b1e7/f6b77b95-add1-4ab7-8008-d920b8edd953.png.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Psychological,Comedy,Tragedy"],"nutshell":"Short stories about God's two cat disciples."},{"name":" Kikoku no Doujo - Ibun Ooeyama Oni Taiji","avatar":"https://mangadex.org/covers/6c319f8d-b711-4369-a39a-411bb681dd51/bddeebd7-1cb3-42a4-b8d0-33126c9ded60.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Historical,Action,Supernatural"],"nutshell":""},{"name":" I become Immortal","avatar":"https://mangadex.org/covers/6c356ba6-c1d8-4f0d-a636-ea87922ba040/a9022a13-bdb2-44fa-90f4-5258119a5a74.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Historical,Action,Martial Arts,Drama,Fantasy"],"nutshell":"The bizarre and terrestrial world has bred a variety of amazing species. A noble son of a family who has come to the great world overcomes numerous obstacles, competes with the proud sons of the heavens who come to all the worlds, and knocks down the high saints. In the quagmire, he will witness this magical universe and realize his desire to become immortal in this life!"},{"name":" Healer Girl Espressivo","avatar":"https://mangadex.org/covers/6c3a3c2f-4c89-47b9-afbd-c9f5e8f4ad56/d43f513f-4c91-4085-b8fc-b635b3e7f1a7.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Ongoing","tags":["Medical,Supernatural,Music"],"nutshell":"An established discipline on par with conventional medical approaches, \"vocal medicine\" is the practice of using songs to treat health conditions and injuries. Young people around the world strive to master the art and become \"healers\" to help people through the power of their voices.\nThis series is a spin-off of the original anime."},{"name":" Bad Moon","avatar":"https://mangadex.org/covers/6c3beb3a-7990-473f-9cdd-1179f55b3ed6/6bc3c438-e538-45d8-9e5b-4beee8efd946.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Animals,Comedy,Boys' Love,Adventure,Fantasy,Supernatural,Mystery"],"nutshell":"Kazuki's had a 16 year grace-period of peace and relative normalcy; smuggled to Japan and raised by a kindly old woman he's grown up to be a bright and friendly boy. His childhood friendship to the girl next door is just beginning to blossom into romance and the death of his ward leaves him with enough character-building angst to set him up for just about any cliche shoujo adventure Yukari Ito has in mind. Unfortunately, Yukari Ito is TOTALLY insane and has decided to make him a vampiric kitten engaged from birth to a Nightmare."},{"name":" A Girl Sleeping at School","avatar":"https://mangadex.org/covers/6c3dbb52-9363-483a-a0c6-7c37457ed494/3a61f8a2-f4c6-4750-8178-067ffa6894fc.png.256.jpg","country":"Japanese","stat":"7.41","status":"Completed","tags":["Oneshot,School Life,Web Comic,Slice of Life"],"nutshell":""},{"name":" Otona na Kodomo","avatar":"https://mangadex.org/covers/6c3f8392-c076-4eee-b1a9-8c5828f75a54/1d25ebdd-a498-418e-9b3a-22b2fe72b39c.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Oneshot,Office Workers,Web Comic,Slice of Life"],"nutshell":""},{"name":" Change, Shitenai.","avatar":"https://mangadex.org/covers/6c428d1d-6d6c-4922-92db-9ae18e50ade4/61b7b7f8-869d-4509-8c34-11e8ceb4b73f.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,School Life"],"nutshell":"What if Yuuta and Yui were in middle school without having swapped bodies? Based on Shishunki Bitter Change/Change, a doujinshi from the original author, Masayoshi."},{"name":" Koukyuu no Renkinjutsuhi - Aku no Hana wa Ougon no Koi wo Yumemiru","avatar":"https://mangadex.org/covers/6c4ba5c9-5296-4dd2-a8ae-a1911d01f371/4ce70b61-066b-4bb2-b4a3-0492c180acb2.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Ongoing","tags":["Historical,Romance,Fantasy,Mystery,Adaptation"],"nutshell":"Is she a villainous woman, or something more? Facing perilous situations with the use of alchemy, a suspense story set in the Chinese imperial harem.\nByakuren (Bai Lian) is the Ryuu (Liu) family's eldest daughter. Feared by even the maids for her arrogant and cold demeanor, rumors of her bullying her half-sister Mokuran drift about the household. However, everything was an act to protect Mokuran. Though Byakuren enters into the inner palace as a concubine candidate and begins to move towards fulfilling her goal, the machinations of those around her immediately break apart Byakuren's written scenarios one after the other..."},{"name":" Gensou Suikoden V - 4koma Anthology Comic","avatar":"https://mangadex.org/covers/6c565627-35ab-460a-9b83-22d1fa5d9475/704b6382-cab4-45af-a833-265e1b34dc96.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Anthology,4-Koma,Fantasy"],"nutshell":""},{"name":" Weiss Kreuz","avatar":"https://mangadex.org/covers/6c56ecf3-3256-4ada-9ed4-1271f961a155/5be49990-3210-4704-8cfc-87840857a081.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Action,Drama"],"nutshell":"Weiss - an underground group of assassins composed of four men torn by their pasts; Omi Tsukiyono, Aya Fujimiya, Ken Hidaka and Youji Kudo. Each carrying the scars of their memories, they skillfully purge the city of criminals who have either evaded the law or are out of its reach. One by one, they begin to discover the relations of the crimes to something much more sinister, reaching out to their pasts. But each of them must decide if fighting for what they believe in and for the ones they love is worth it when it might come at the expense of their humanity…"},{"name":" Tokyo Depato Sensou Taikenki","avatar":"https://mangadex.org/covers/6c583845-8276-4f80-b90b-902959b5d240/55d979d3-a02c-4b26-a626-eb7abc2a7e6d.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Action,Comedy"],"nutshell":"A girl named Yuzuko, wanted to buy a new wristwatch for her father in the department store that pierces through the heaven. On her way, she got attacked by an one piece dress. A mysterious dude came out and helped her. Just what is the 'desire' that he's talking about? And just what kind the department store it is?"},{"name":" BABY","avatar":"https://mangadex.org/covers/6c594c52-9678-4d7b-8255-d9522173abd0/19c29b93-511e-414a-bc01-b2162ab85665.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.90","status":"Completed","tags":["Award Winning,Sci-Fi,Action,Mecha,Martial Arts,Adventure,Supernatural,Mystery"],"nutshell":"December 1, 2043 AD. The mysterious lifeform BABY invades Earth and takes control of a number of human hosts, parasitising them. The possessed bodies metamorphise into monsters called ‘Organos,’ which slaughter a great mass of humanity in a series of bloody massacres, bringing mankind to the brink of extinction. Thereafter, December 1 comes to be known as ‘Extinction Day.’ While battling an Organo, Elettra, the protagonist of the story, finds that her left hand has been infected by BABY. However, aside from a throbbing pain in her hand, nothing about the rest of her body changes. Elettra begins to search for other survivors, hoping to solve the mystery of BABY…"},{"name":" Himitsu no Recipe - Unique Worries (Doujinshi)","avatar":"https://mangadex.org/covers/6c5f7766-1e3a-4a3e-a245-b4847ca87d2c/2e0a4f62-35c0-494c-8d52-6d9cac9f0229.jpg.256.jpg","country":"Japanese","stat":"7.55","status":"Completed","tags":["Comedy,Girls' Love"],"nutshell":""},{"name":" Shin Demon Lord Dante","avatar":"https://mangadex.org/covers/6c619969-b204-49d1-a624-834493fcce81/3f0f2863-05d7-4425-9dd7-270b20170268.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Reincarnation,Sci-Fi,Monsters,Action,Demons,Boys' Love,Magic,Horror,Supernatural,Tragedy"],"nutshell":"A shojo remake of Go Nagai's Demon Lord Dante, but with boy's love and new characters. Not to be confused with Nagai's own \"Shin Demon Lord Dante\" which is a reboot of the original."},{"name":" Boukoku no Siegfried","avatar":"https://mangadex.org/covers/6c639797-b149-452f-894d-eeb552fc8018/5c024421-a71f-4146-b175-069f7d7a934f.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Adventure"],"nutshell":"Based off of The Song of the Nibelungs comes a manga about bravery, honor, and heroism. As the last of his people, Siegfried will stop at nothing until he becomes a legendary knight whose story will last eternity. If his legend lives on forever, then so will the memory of his people…and that is his sole reason for going on."},{"name":" Little Busters! The 4-koma","avatar":"https://mangadex.org/covers/6c6642fa-343d-4d14-ae31-e636303760ca/b3ea6bd1-09da-490b-a939-9870b27bcd9b.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Comedy,4-Koma,School Life,Slice of Life"],"nutshell":"Little Busters!' story revolves around the main protagonist Riki Naoe, a young male high school student. When Riki was a child, his parents died, leaving him hopeless and depressed. What saved him was a group of his friends who referred to themselves as the Little Busters; they took Riki out and played together with him during his time of need. He really enjoyed playing with them, and his grief gradually faded away. When the story begins, they are in their second year of the high school they attend. They still hang out together, and enjoy their school life.\nPart of Little Busters! series."},{"name":" Shiki Seiichi's Short Manga","avatar":"https://mangadex.org/covers/6c69132a-8367-43e8-a153-6237a8832b72/6581be93-1706-4f14-b6b0-3cf8d636a220.jpg.256.jpg","country":"Japanese","stat":"8.50","status":"Ongoing","tags":["Comedy,School Life,Web Comic,Slice of Life"],"nutshell":"A collection of short manga from Shiki Seiichi's Twitter.\nHe's the mangaka behind Fujimura-kun Mates and Aizawa-san Zoushoku."},{"name":" Little Skeleton","avatar":"https://mangadex.org/covers/6c6b3269-f481-4d0a-a499-20873d52381a/1f45ac1f-fa93-4922-a215-d3075d977f96.jpg.256.jpg","country":"Chinese (Simplified)","stat":"6.64","status":"Completed","tags":["Monsters,Long Strip,Comedy,Adventure,Magic,Web Comic,Adaptation,Full Color"],"nutshell":"I was just an ordinary skeleton, until one day I met a wizard and a devil dog… my bones changed…"},{"name":" Lament of the Lamb","avatar":"https://mangadex.org/covers/6c6c738c-6927-450b-a307-710d01abbd93/fcb08e36-8222-4d2b-9401-62080568c704.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Psychological,Romance,Drama,School Life,Slice of Life,Mystery,Tragedy"],"nutshell":"The members of the Takashiro family share a terrible curse: only human blood can slake their thirst. Sent away after the death of his mother, Kuzuna Takashiro remained blissfully unaware of his 'condition.' When Kazuna's teenage hormones begin to rage, his uncontrollable bloodlust suddenly rears its head…"},{"name":" Yu-Gi-Oh! - Saigo no Kajitsu (Doujinshi)","avatar":"https://mangadex.org/covers/6c743221-b3e6-4065-9006-cd46a6449a82/273e2ee4-35a5-48c0-b94d-f3a28272b6b9.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Boys' Love"],"nutshell":"Pairing: Yami Yuugi x Jounouchi"},{"name":" The Side Character's Cheating System","avatar":"https://mangadex.org/covers/6c74d572-f4c4-4353-8f73-17af3abd51f5/7db70718-1aa6-430d-bc91-6c2b53d52b3a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Long Strip,Romance,Isekai,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"Masa was playing a game while crossing the street and got hit by a car. The game system dragged her into the game before she died and luckily survived. The catch is, she can’t return back to the real world unless she beats the game as the evil lady villain!"},{"name":" Noirstorborg","avatar":"https://mangadex.org/covers/6c75ccd7-687c-4c3d-8635-085d4f4e3077/8e6f0364-dcd7-473a-935e-397d8f4d9510.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Horror,Fantasy,Supernatural"],"nutshell":"Where is the purpose of being? Being alive? Existence… When every living life form stays alive by the binding cycle of feeding on another. When the earth stays alive by feeding on the cycle's balance. What exactly is sacred about life? Why do humans celebrate and treasure life so much when it is only theirs which they value and not others?"},{"name":" Miracle Wanda","avatar":"https://mangadex.org/covers/6c782a87-bdac-4810-a43a-f3112ef78491/72fe5ec6-89f2-4393-817b-3afb88b436bf.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sci-Fi,Comedy,Mecha,Adventure,Fantasy,Adaptation"],"nutshell":"In a world where every event was computer programs, mysterious monsters known as \"Promin\" maintain the world. However, many Promins have corrupted into bugs known as \"Bugmin\" like real-life viruses and bugs. Left alone, they may eventually turn into a big problem. The boy Yuuto, with Wanda, and the pair use a camera-like device and essential items to capture Bugmin. Promin themselves can do things like \"accelerate,\" \"spew fire,\" or \"create,\" through an ability known as \"Kamiwaza\" (miracle), and can fend off Bugmin with it. At first, the Bugmin only cause little, bothersome things, but it will soon elevate into a global scale threat. Can one boy and one dog save the world?"},{"name":" Near Equal","avatar":"https://mangadex.org/covers/6c7833c5-beb1-4801-9de4-ee60adeb52d1/22c7170b-3122-4b2c-a88c-aa7ef16b46ab.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Comedy,4-Koma,Slice of Life,Supernatural"],"nutshell":"Tsubaki is her school's most proficient student, is polite, and is absolutely good at everything, and little by little, people are hailing her to be the school's queen…. And she absolutely despises that. She quietly admits to herself that being a \"perfect student\" is not her real personality, but a clever ruse to become a more likable person.\nShe is, however, still not able to interact normally with students and thus is dissatisfied–a fact that prompts her to follow the advice of a magazine on finding happiness: the magazine states that by meeting your doppelganger, you will achieve long-lasting happiness. Determined, Tsubaki follows the instructions in the magazine and opens up a door that will allow her to meet her doppelganger….\n…And the one she meets at the other side of the world is not who she was expecting…. Well, it is someone who is strangely identical to her when it comes down to it, but it is also essentially different."},{"name":" Your Turn to Die: Death Game by Majority","avatar":"https://mangadex.org/covers/6c7d3ff8-fef3-42af-a033-d82de930fca3/28456295-8bb1-48ca-bd4d-16f05572753b.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Ongoing","tags":["Survival,Horror,Adaptation"],"nutshell":"Based on a popular game from Niconico.\nSara Chidouin returns home from school late one night to discover that something's gone terribly wrong.\nWhen she comes to, she finds herself, her friend Joe, and 9 other people trapped in a mysterious place.\nPlaced in life-and-death situations, they must come to an agreement about what they should do - and who should die.\nLink to the original game. (Free, translated to english, and can be played in browser)\n\nYour Turn to Die (English Translation)"},{"name":" Wakabaka-sama","avatar":"https://mangadex.org/covers/6c7df5df-8be7-482b-aed9-7ea8a48bf7b8/41363a68-1900-4965-9675-5c8503e9e7c6.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Comedy"],"nutshell":"A fool may be a fool, but this idiot is different from other idiots. After all, this fool is the sergeant of the Great Phoenix Castle and its large castle town, and his legitimate name is Wakabaka-sama (Young stupid lord)! With the involvement of Grandpa, Grandma, Grandpa's father, Grandma's mother, and even Kurihime-chan from the castle next door, the Phoenix castle is in full clamor even today!"},{"name":" The Winning Actor Wants Divorce","avatar":"https://mangadex.org/covers/6c860005-a870-4d3e-a065-2d09e45a485a/297affd1-4675-4c37-b3c6-585ed2fe8aa0.png.256.jpg","country":"Chinese (Simplified)","stat":"7.95","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Web Comic,Slice of Life,Full Color"],"nutshell":"[ Phoebe Scans ]\nI thought that losing your memory was bad enough.\nDidn’t think that after 7 years of marriage, my husband wants to divorce me.\nGu Qingyang states \" If you want to, then do it.\" I forgot everything anyway, I can always find another one if you leave.\nHe’s just a wild horse on an open field, loose with endless freedom.\nJiang Zhong was invited by the media to attend a meeting. The reporter asked, \" if you don’t want to start a company, what is it that you want to do?\"\nJiang Yizhen replied, \"A horse tamer.\""},{"name":" Satsuma Gishiden: The Legend Of The Satsuma Samurai","avatar":"https://mangadex.org/covers/6c885c78-e282-4392-965b-58231809a29d/0809be13-51b4-459e-9f29-0a3fb9d900c9.png.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Historical,Action,Martial Arts,Samurai,Drama"],"nutshell":"Japan's samurai past is riddled with stories of great fighting prowess and deeply ingrained systems of honor and discipline. But behind the stern demeanor was a society coming apart at the seams. Clashes in class systems and the need for a nation to come together threaten to break up the old ways of warring samurai–these are tales of such struggles. This is the story of Japan's history, and the beginning of the end of the samurai era."},{"name":" 5 Cats","avatar":"https://mangadex.org/covers/6c894f65-57eb-4ea0-9aeb-eda31322238d/eae011c8-1b30-4c3c-b4c4-2f380596e3a1.png.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Fantasy"],"nutshell":"In the space between the magical world and the human world, there is a cafe called 5 CATS, which is a meeting place for the residents of the magical world. After a series of events which lead to him helping out at the cafe, ordinary high school student Kei is inspired to become an apprentice magician himself."},{"name":" Ni Ming Shi","avatar":"https://mangadex.org/covers/6c8f73ff-330b-4202-ac6d-75736131e2af/d4bde280-0dfe-4816-a9df-d8af1b1b9718.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.99","status":"Hiatus","tags":["Historical,Action,Martial Arts,Adventure,Fantasy"],"nutshell":"A blind person known as Ni Ming Shi was ambushed by Imperial Guards while traveling through the Bamboo Forest. While they almost managed to fool the Imperial Guards their identity was unfortunately exposed by the commander. Now with their life on the line, what kind of fate awaits Ni Ming Shi?\n(Credit: OSTNT)"},{"name":" Love Live! - Little By Little (Doujinshi)","avatar":"https://mangadex.org/covers/6c925eeb-3580-4413-a9a3-acefaf4a414a/1831c2d6-97aa-42c6-a67f-4dfe79c297a3.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":""}]