[{"name":" The Fist that Calls the Rainbow","avatar":"https://mangadex.org/covers/882fc7b4-ca4d-4098-b82a-7ce78015f424/2a5c888b-e1e9-437c-a99d-fd485116f7c4.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Thriller,Action,Psychological,Comedy,Survival,Sports,Martial Arts,Adventure,Drama,School Life,Delinquents,Slice of Life,Tragedy"],"nutshell":"(from amazon.jp and wikipedia.ja):\nVolume 1: A karate manga made by Ikki Kajiwara and Jiro Tsunoda, just before \"Karate Master\" (空手バカ一代, Karate Baka Ichidai). It was serialized in the \"Adventure King\" (Boken-oh) magazine. Kajiwara chose Tsunoda because he wanted to shine a light on him. Tsunoda was known to be in a slump at the time.\nMakihiko Kasuga has transferred to a junior high school in a newly developed residential area in the Tokyo metropolitan region, and although his studies are the best in his class, he is very poor in athletics.\nOn the other hand, his classmate Ryuhei Akagaki is an all-around sportsman, but he is not very good at studying. Kasuga was envious of Akagaki.\nWhen Kasuga hears that Akagaki's athletic prowess is the result of his karate training, he decides to join the same dojo as Akagaki. However, he is not a good athlete by nature, so his training does not go very well."},{"name":" Tengu to Warashi","avatar":"https://mangadex.org/covers/883172fb-2a88-48f7-b2b4-4dd8cf8dd454/930e4031-c692-4246-8c96-a77110ae3708.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Monsters,Action,Demons,Ghosts,Comedy,Web Comic,Slice of Life,Supernatural,Mystery"],"nutshell":"The tengu named Kongo, who single-handedly defeated Hyakki-yako, is trying to live a normal life. But instead, he gets on his head a little warashi, whose mischief brings only trouble, which is why she constantly has to protect. But how long will the big Congo's patience last ...?"},{"name":" Xuan Yuan-Sword Legend: The Gate of Firmament","avatar":"https://mangadex.org/covers/88335056-3725-420c-a1b1-c30888fabc31/a1036d09-1457-4922-895f-fd35fa88e2e0.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.67","status":"Completed","tags":["Historical,Action,Romance,Martial Arts,Adventure,Fantasy"],"nutshell":"In ancient times, the Heavenly Emperor opened the Gate of Firmament, connecting the Heavens and Earth. Even mortals could learn to ascend to the Gate to meet with the Emperor and to obtain divine powers in order to aid the mortal realm. Unscrupulous individuals took advantage of the Emperor's gesture, and plunged the human realm into chaos, filling the lives of the common folk with anxiety and weariness. At this time, the sibling gods Fuxi and Nüwa took pity on the people and convinced the Queen of Huaxu to close the Gate forcibly with the help of Emperor Zhuanxu. From then on, no one could reach the Heavens with impunity, and no god could travel to the mortal realm freely. This incident came to be known as the Isolation of the Heavens and Earth.\nSpin-off of the game 軒轅劍外傳穹之扉(The Gate of Firmament)"},{"name":" Would you? Could you?","avatar":"https://mangadex.org/covers/88411e0c-865b-43d4-b001-f3ddffea47af/b2d39865-fb6a-4c46-b8ae-7e93f07308d5.jpg.256.jpg","country":"Korean","stat":"7.69","status":"Ongoing","tags":["Long Strip,Romance,Girls' Love,Drama,Web Comic,Slice of Life"],"nutshell":"Why didn't you accept my bouquet? She asked, years later like it was the simplest thing. Chance brought Juna back into Yunseo's life but things were much more complicated now. They were no longer in college where the only obstacle between them were the truth yet spoken. Luna was married with a child, what could Yunseo do? As Saeha chases after Yunseo, Yunseo discovers even after all these years she'd still love Juna at the drop of a hat. The three women navigate through their feelings for another, each desperate and yearning for a chance to be accepted."},{"name":" Matantei Loki - Matantei no Jijou (Doujinshi)","avatar":"https://mangadex.org/covers/8841922f-eef7-4c33-87e6-73552b1a9e15/e2251f8e-8339-4eb8-b064-a725b5f37b03.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot"],"nutshell":""},{"name":" Phoenix Against the World","avatar":"https://mangadex.org/covers/88419821-eeb9-4c82-88a9-28dfef4e659d/661bbacb-6017-485f-bd93-619e79457494.png.256.jpg","country":"Chinese (Simplified)","stat":"7.88","status":"Ongoing","tags":["Reincarnation,Historical,Action,Long Strip,Romance,Martial Arts,Isekai,Fantasy,Web Comic,Full Color"],"nutshell":"Huang Bei Yue is an assassin that gets transported to another world thanks to a mysterious jade, boundless beast!\nNow she resides in the body of a 12 year old, who happens to be the king's sister, who is constantly bullied!\n\"Now how shall i take my revenge?\""},{"name":" Aitte Yatsu wo Utatte Miyouka","avatar":"https://mangadex.org/covers/8848b779-9079-452e-9d41-957c701bfb75/18c3e9c3-7a4c-4310-aed9-c9de1625e54f.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,School Life"],"nutshell":"Ari is a brand new first-year high school student. Shortly before school starts, she sees a band holding a mini outdoor concert. She is struck by how great the music is. That band, Sunnyside, is currently the hottest indie group. AND, the really cute lead singer, Youta-kun, is a student at Ari’s new school! Even better, he is in her grade, and they will be in the same class! However, Youta-kun is really popular with the girls, and he happily lets them hang all over him, like he’s dating them all! Youta-kun becomes really interested in Ari’s piano playing and makes an instant decision – Ari must be Sunnyside’s new keyboardist!"},{"name":" Picture of Tears","avatar":"https://mangadex.org/covers/88491914-610c-46df-84a4-116ebba883d4/f417fe4c-762e-4f67-982e-053cf460d61d.jpg.256.jpg","country":"Japanese","stat":"7.68","status":"Completed","tags":["Psychological,Romance,Drama,School Life"],"nutshell":"Sae and Riko have been best friends since childhood. But as they grow up, Sae notices more and more the differences between them, and starts to have doubt about whether their friendship is going to last…"},{"name":" How to Raise A Human","avatar":"https://mangadex.org/covers/88606dab-60ac-4b7b-a9ef-4ad785e93c94/7049881d-3a02-4e4e-9907-a1aa8c123302.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.70","status":"Ongoing","tags":["Long Strip,Comedy,Fantasy"],"nutshell":"What if humans no longer dominate the earth. What if humans are no longer on the top of the food chain. What would the world be like if cats became the masters of the world and humans became their pets….."},{"name":" The Hunter Games","avatar":"https://mangadex.org/covers/8862c53c-a763-42c7-ac58-a2ec805b9a91/eb42835d-ca21-4a69-b1e0-e8676dab2f79.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Drama,School Life,Web Comic,Full Color"],"nutshell":"What? On my first day as transfer student, I got a forced kiss by the top student!? I, who has a special ability and identity, enrolled into a prestigious school with the only purpose of searching the person that framed my family, but isn’t this picture is a little wrong!? A violin prince? A handsome drama club boy? Please stop pestering me! I won’t pay any attention to you!"},{"name":" Oni no Hana Sagashi","avatar":"https://mangadex.org/covers/88633561-9b0d-4e00-8117-734f3bdcf9eb/2f0a045c-ccb0-4ea7-9d5e-c97cac03f89e.jpg.256.jpg","country":"Japanese","stat":"7.65","status":"Completed","tags":["Demons,Romance,Comedy,Fantasy,Supernatural"],"nutshell":"A world where five races of demons, wolves, foxes, crows, and humans live. One day, a gentle flower with a sense of justice meets Kouki, a large conglomerate in the demon clan who suddenly proposes to her.\n\"It's my\" flower of fate \"! I want you to marry me!\""},{"name":" Claw","avatar":"https://mangadex.org/covers/886bd074-70aa-4931-a8b8-5679c78d9fe5/0f105bce-ea71-47a5-b03b-1b3ec25ff428.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.99","status":"Ongoing","tags":["Long Strip,Romance,Comedy"],"nutshell":"Once upon a time there was an innocent and straightforward little Aries girl.\nAfter being targeted by a black-bellied Leo boy and by using food to lure her to him, she couldn't resist the Leo boy at all!\nThe boy said : \"I'm determined to be there whenever you need me, I'll accompany you wherever, eat, drink, and even finish up all the vegetables that you hate. I'll do my best to make you happy, so just be with me.\"\nThe girl said : \"It always has been you who came for me.\""},{"name":" Tiger & Bunny - Happy White Day (Doujinshi)","avatar":"https://mangadex.org/covers/886fe3cd-199d-49cc-aaac-46c9c447b391/f669de43-75a8-4a2f-ba17-a2db9a823a0c.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Pairing: Barnaby x Kotetsu"},{"name":" If we would determine our relationship, XOXO","avatar":"https://mangadex.org/covers/88703327-b3ef-45ad-b5a2-efbd3fa7c270/2c97231a-bd58-4fc3-bb9c-625f201a81b6.png.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Slice of Life,Full Color"],"nutshell":"Woojeong who was once loved as a child actor retired due to malicious rumors.\nThen one day in front of Woojeong, appears a handsome boy like a hero in a game.\nHow strange… Why does he keep staring at me?"},{"name":" Futon","avatar":"https://mangadex.org/covers/b5a9ecc1-dcb5-4ffe-b742-283d40ecab11/7c6a311e-ad1e-4280-9c4b-19b6ddf70a7d.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Romance,Web Comic,Slice of Life"],"nutshell":"A two-part oneshot about an overworked guy getting stuck to a futon.\nPart 1 - Ore in Futon (俺in布団) / Futon in Ore (布団in俺) is about the guy meeting his love.\nPart 2 - Watashi in Futon (私in布団) is the girl's part of the story.\nPixiv series link\nAuthor's twitter - @sakana32929"},{"name":" Touhou - Scarlet Devil Mansion Ghost Riot (Doujinshi)","avatar":"https://mangadex.org/covers/b5b1e0da-763a-465a-85e8-d2e4a213ebac/6f0aae39-3c0a-4e1e-a942-1d83576cf7b4.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Comedy,Drama,Fantasy"],"nutshell":""},{"name":" Personal secrets","avatar":"https://mangadex.org/covers/b5b2ee55-fae4-4ab3-82cc-72ffbac6dc92/09fa399e-c02a-40bd-8ece-71db861a37ed.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Action,Comedy,Boys' Love,Fan Colored,Web Comic,Slice of Life"],"nutshell":"تيك سان رجل فحل يساعد قريبه ذو القضيب الثخين في الحصول على أول علاقة مضاجعة له معه، فما الذي سيحصل حينها ليحصل هذا  الأخير على مبتغاه الذي لم يجد شخصاً لإحتوائه ؟"},{"name":" Ginga Densetsu Weed Gaiden","avatar":"https://mangadex.org/covers/b5b2f23f-a2d0-4a8e-ab32-08ce209b881c/fe81550d-a3ee-438f-a724-2b7f29103d3d.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Action,Adventure"],"nutshell":"A spin-off of the series Ginga Densetsu Weed, Weed Gaiden is a collection of stories about multiple dogs and the trials they face. One story focuses on a character from the main series–Mel–and his journey to reunite with Weed at Ohu after his mother dies."},{"name":" Crazy About","avatar":"https://mangadex.org/covers/b5b44e94-62a4-4e5f-80e7-4c1c2ed10143/62cef16f-1590-4e88-8e82-e83dac8a92b8.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Time Travel,Historical,Boys' Love,Drama,Fantasy"],"nutshell":"Welcome to Seoul, 2022. Woo San is an orphaned gangster who makes a living by stealing and selling artifacts. Following the orders of his gang superiors, he steals an ancient relic that once belonged to Yeong Jong, the 26th king of the Hwa-yeon Kingdom. Meanwhile, back in the year 1852 during the Hwa-yeon Kingdom’s reign, Heo Myeon is trying to retrieve a precious family heirloom that his father gave away to a disgruntled customer. Something unexplainable happens and San is transported back 170 years in the past and comes across a captured Myeon. As the two tussle over this incredibly valuable object, it is clear that whatever happens from now on, history as it was known has been altered and their destinies are now forever intertwined."},{"name":" The Narrow Road to the Deep North (Variety Art Works)","avatar":"https://mangadex.org/covers/b5c06843-832c-4402-94cd-46ac9868bfb6/151b0f42-889a-4704-b4c8-cf6f81097f86.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Historical,Drama,Slice of Life,Adaptation"],"nutshell":"Manga adaptation of Oku no Hosomichi, a poetic work of classical Japanese literature written by Matsuo Bashou as a sort of travel diary, as he journeyed on foot across Japan in the late 1600s."},{"name":" 2ban-me no Alpha","avatar":"https://mangadex.org/covers/b5c22433-7175-48b1-b049-3ed845947eb2/b6c2d044-ea2b-4ba1-8b6b-916b2e4278b4.jpg.256.jpg","country":"Japanese","stat":"8.23","status":"Completed","tags":["Romance,Boys' Love,Office Workers"],"nutshell":"My fated pair is married.\nAs Morita was going to his new workplace, he met Matsumoto, a senior employee who picked him up. The moment they locked eyes, he was convinced that Matsumoto was his fated pair, but he had a ring on his ring finger. However, that night, as Matsumoto went into heat, Morita got tempted by his smell and embraced Matsumoto. The men who get toyed around by fate, experience a sweet, painful love."},{"name":" Tasogare Schrödinger","avatar":"https://mangadex.org/covers/b5c35cb9-e7f0-42c4-acd5-2ea5e6e4fabf/7a8047a5-4971-4270-ae56-cb5e3e87f386.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Action,Comedy,Drama,Supernatural"],"nutshell":"Two childhood friends Beckman Jouji and Kuranosuke reunite after not having seen each other for a while. Kuranosuke has the power to fly, but only when his best friend is by his side. Unfortunately, Miss Schrodinger has other plans for these two friends… A one-shot that shows the bond between two best friends!"},{"name":" Nanika Mochigatte Masuka","avatar":"https://mangadex.org/covers/b5c7d6e0-1ab4-4658-ba31-034c5b987c21/5e781c4c-b657-4ac4-8467-db097846af7d.jpg.256.jpg","country":"Japanese","stat":"7.71","status":"Completed","tags":["Psychological,Comedy,Drama,School Life,Slice of Life,Supernatural"],"nutshell":"In the casual days of the spring of his third year in middle school, Mitsuru Hibino meets transfer student Kouzou Issha, who develops his special power. Issha commands Hibino to use his lethal “power” to “correct the errors of this world”.\nTheir first step is to “kill those who drive while using their cell phones”.\nWhile getting their hands dirty with what society considers “crime”, these boys use their “power” for their “ideal justice”!\nSpelling mistakes in alt title and chapter titles are intentional"},{"name":" Furachi na Yuuwaku","avatar":"https://mangadex.org/covers/b5c843ee-ae77-41ea-9de7-985b1740bc9f/37e2efe9-149c-4c6e-a9a9-362e1427925f.jpg.256.jpg","country":"Japanese","stat":"7.65","status":"Completed","tags":["Oneshot,Romance,Slice of Life"],"nutshell":"Koharu is a 35-year-old woman who is looking for a stable relationship, but after a night of drinks, she ends up interacting with a sweet and innocent boy who is totally out of her expectations."},{"name":" Adivina el secreto","avatar":"https://mangadex.org/covers/b5c8d867-a495-45cf-831d-69871f0f59a0/80722e0c-d548-4b85-b328-6f6854c5090c.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Romance,Comedy,Boys' Love,Music"],"nutshell":"•Sailor BL x M&M Mangas•\nNanase dibuja doujinshis de su idol favorito, Mei-san. Un día, se encuentra en un stand de doujinshis uno de sus trabajos más populares, en ese momento recuerda que no tiene ni una sola copia de dicho trabajo, dispuesto a comprarla, su mano choca suavemente con otra persona interesada en su publicación, pero sólo queda una copia... \"¡¡¿Nanase-sensei, eres tú?!! Soy tu fan\"."},{"name":" My Brother Is From Deep Mountain","avatar":"https://mangadex.org/covers/b5cbb4a7-e6b0-496b-8afc-e8e5a6b59782/0605b8ec-cd7c-4519-a931-be83edbdef7a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.91","status":"Ongoing","tags":["Long Strip,Comedy,Magic,Fantasy,Web Comic,Slice of Life,Full Color"],"nutshell":"Molly always thought that she was an only child, when suddenly she learned of an older brother who was practicing in the deep mountains. Is this fate ?! Her brother is also very mysterious, right? In unfamiliar event, the two siblings but totally strangers, started their chaotic yet hilarious daily activities."},{"name":" 15 Years Old: Starting Today We'll Be Living Together","avatar":"https://mangadex.org/covers/b5cc3cd2-ae51-472f-9893-33044a3e6746/c3f42934-9a48-4929-ab4b-231cdba11c09.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Romance,Drama,Web Comic,Full Color"],"nutshell":"I was planning for us to stay just friends… but I'm not holding back anymore.\" I'm living with my childhood friend turned savage! My heart won't stop throbbing as each day passes and he just won't give up…!! After entering high school, Hiyori is finally able to fulfill her dream of living alone. Or so she thought… Her childhood friend Soushi is there waiting for her at her new apartment. He suddenly kisses her and Hiyori is unable to hide her confusion. Is he teasing her? Or is this for real…? For the first time, she begins to see Soushi, who she'd never paid too much attention to before, as a man. At the age of 15, Hiyori begins her radical, new life living with Soushi!\n\nOfficial English Translation: Coolmic, Renta!, Pocket Comics"},{"name":" Mr. He","avatar":"https://mangadex.org/covers/b5cd42ab-7590-4c05-9ff3-6d630070dcba/6b8cfa04-5c38-4820-a58f-c01f9d825103.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.21","status":"Ongoing","tags":["Official Colored,Comedy,Boys' Love,Web Comic,Slice of Life,Full Color"],"nutshell":"Originally, I just wanted to draw a story about a gentleman's boyfriend, but in the end it turned out to be a weird everyday story. (Author's Note)\n[PT-BR]\nOriginalmente, eu só queria desenhar uma história sobre o namorado de um cavalheiro, mas no final acabou sendo uma estranha história cotidiana. (Nota do autor)"},{"name":" Trump (Best Challenge version)","avatar":"https://mangadex.org/covers/b5d0ce5e-23a3-47a7-b507-6991ea7b0629/b4a12e77-9cfc-4757-88e4-855b5c4f22df.jpg.256.jpg","country":"Korean","stat":"7.96","status":"Completed","tags":["Action,Long Strip,Adventure,Fantasy,Supernatural"],"nutshell":"A breathtaking action fantasy of Gods walking a treacherous tightrope across the undefined border between Good and Evil!! Or, put simply, just NONSENSE.\nNote: This project was begun by an amateur manhwaga on Naver who decided to restart Trump from the beginning because of it failing to receive attention by the Naver publishers. Then when it was picked up by Naver, Trump was once again republished and the author changed her professional name from sinceby1991 to Lee Chae Eun. Both previous versions were discontinued. The \"official\" Trump being published is linked below as a related series. This version had 36 chapters."},{"name":" M. M. G.","avatar":"https://mangadex.org/covers/b5d1d117-8ffd-4c10-922d-466debfe63a9/9e97c6f5-79ec-428c-8d2e-a27de86befa8.jpg.256.jpg","country":"Korean","stat":"7.76","status":"Ongoing","tags":["Action,Long Strip,Fantasy"],"nutshell":"A real magician has appeared in the virtual reality game, the ‘another world!’ will a MAGICIAN still be a MAGICIAN within a game?"},{"name":" RPG","avatar":"https://mangadex.org/covers/b5d219e8-f8eb-4300-9c76-c12d04f9e64d/5258fdac-6b33-4533-b73e-0ba9f3d6f46a.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Ongoing","tags":[""],"nutshell":""},{"name":" The Draw of Cambyses","avatar":"https://mangadex.org/covers/b5d3fc5f-569b-4f7d-8024-4801ace5bb9f/86ba5f09-8f12-462c-9dff-4a084b42b7ad.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Oneshot,Sci-Fi,Historical"],"nutshell":"In this 1977 science fiction short story, a soldier in the army of Cambyses II is wandering an endless desert, lost from his company. Just as he is about to accept death, he sees a glimmer of light in the distance — and when he follows it, he finds himself in a large building full of strange machines he has never seen before, and occupied by one young girl. They cannot communicate; her words are as gibberish to him as his are to her. The girl nurses him back to health, treating his wounds and feeding him. But when Sark attempts to leave, bringing provisions with him, the girl turns on him violently…"}]