[{"name":" Koukou Debut shita Juumai ga Mount Tottekuru","avatar":"https://mangadex.org/covers/230b49d7-d393-49bd-84ef-05985e37bf09/ef92332f-af8d-4932-a374-c59fe5e16917.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,Comedy,Incest,Slice of Life,Gyaru"],"nutshell":"I have a cousin who’s 3 years younger than me. Before, she was just a generic girl, but ever since getting into high school, she’s become a wonderful gal. Going through our everyday life, she would mount me, or so I thought, but there were tears, and believing lies, huh? It’s only her look that’s changed!? Dominating and getting dominated! A pure older brother and a bad and easy going cousin, 1 on 1 love comedy, begins!!"},{"name":" Digimon Tamers","avatar":"https://mangadex.org/covers/230c038a-9195-425a-8c00-9125fa5c7b26/c8f2206f-2b82-44a6-a23a-e7273b09903a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.99","status":"Completed","tags":["Sci-Fi,Monsters,Action,Adventure,Video Games,Fantasy,Supernatural"],"nutshell":"When three Digimon fans – Rika, Henry, and our lead Takato – suddenly find themselves with \"real\" Digimon, they discover a living creature under your care is far harder to deal with than a few pixels on your TV screen. The kids try to be Digimon 'Tamers,' aka Digimon caretakers, but they all seem to have different opinions on what that should entail. Rika thinks Digimon should fight, Henry thinks they should never fight, and Takato … seems to be somewhere in the middle.\nBeing a Tamer isn't just about believing one thing or another. It's about learning and adjusting for the good of everyone else. But they have a long way to go, and their problems are just beginning.\n(The English translation is based off the script from the FoxKids version of the anime.)"},{"name":" A Happy Ending for Villains","avatar":"https://mangadex.org/covers/230f5fcc-6b5c-479e-b061-6e5e1e88f8a5/079fcf5d-9e84-48f7-a71d-b48e46f66229.jpg.256.jpg","country":"Korean","stat":"8.10","status":"Ongoing","tags":["Reincarnation,Historical,Psychological,Long Strip,Romance,Isekai,Drama,Fantasy,Villainess,Adaptation,Full Color,Tragedy"],"nutshell":"I was reborn into a romance fiction novel. I am lowborn, but there are plenty of boys here, and I get to work for the nobles.\nBut there’s a tiny problem. This noble family happens to be a family of villains, and I’m supposed to lead these serpents and throw the empire into chaos. Apparently, I am the greatest villain in this novel!\nThe deaths, the chaos in the empire, and the matters of inheritance locked the duke’s children and me into a corner of the manor. But the novel never mentioned anything about being locked away. So here, I must survive and grow… for a villainous happily ever."},{"name":" Ai no Koe","avatar":"https://mangadex.org/covers/23184b92-10cf-4be7-aa6d-a6e1650d9935/81ad31bc-f19c-4397-883a-f358056e2f8d.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"Five romantic, passionate, sexy stories about modern women and the men they love.\nVoices of Love\nThe title story follows a relationship between young teacher Mika Tsukahara and Naokazu Kuga, an 18-year old student at her school. They're neighbors too, and can't control their attraction to each other!\nOne Summer's Day\nAt a high school reunion, a girl sees a close guy friend that she hasn't seen for a long time. He tells her about his girlfriend who hasn't done it with him yet and asks the girl if she will instead. She agrees. This reminds her of their high school days, when she comforted the guy and became sex friends from that day on. Is high school going to repeat itself all over again?\nRainbow Smile\nA girl has a boyfriend who lives with her in her apartment. However, he hits her and mistreats her. And she just takes it. She also know he cheats on her, but she fools herself into thinking he isn't. Will she just take it forever?\nPictures of Us\nA business office man hasn't had a relationship in a long time, and he's lonely. He joins an online dating service and meets with a girl one night. She looks really young, but she says that she's in her 20s. A few days later, she somehow ends up staying with him. Can he open his heart to her? And what is her real age?\nTeach Me Love\nA young guy is university art student. He lends his guy friend a CD, and his friend breaks it. In repayment, his friend brings him a girl, and he tells the art student guy he can do whatever he wants with her for a night. The art student notices she does whatever his friend tells her to. And he also notices his friend also let's other guys 'borrow' her. Why does she let him do this to her?"},{"name":" Bakemonotachi wa Yoake wo Kou","avatar":"https://mangadex.org/covers/2318e589-0c41-4f6b-b6f1-b6d468f38552/65af5368-15f4-43d3-9366-84f06c83795f.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Supernatural,Mystery"],"nutshell":"\"The Inawa fox carries a fire. \" The Kitakami family runs a fox ranch in the countryside where such rumors are said. The eldest son, Akari picks up a single \"stray fox.\" It was a lovely lamp named Kiichi, but one night a fire involving two people broke out."},{"name":" Love Live! - Okaimono nya! (Doujinshi)","avatar":"https://mangadex.org/covers/231a21bb-a61a-4d4a-9d1c-2500c8ed5712/5dc7c326-7389-4b5f-81da-6f3a254643a6.png.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Romance,Comedy,Girls' Love,4-Koma,Slice of Life"],"nutshell":"Cute Rin x Hanayo doujin."},{"name":" Oyaji to Nyankichi","avatar":"https://mangadex.org/covers/231a5d96-583b-4c58-97fd-5ac1396be737/41d7789b-3fd3-4a47-b360-b301ab5909b2.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Comedy,Slice of Life"],"nutshell":"Hisahide Matsukata, ex-leader of the Yakuza's Onikaku clan, resigned his position to live alone for the rest of his life...  Until a stray cat showed up at his house! His daily life, which was completely peaceful, turned completely upside down and he was completely at the mercy of the cat's unpredictable behavior! Now, every day is as noisy as it was when he was in the yakuza!!!"},{"name":" The Devil in the Suit","avatar":"https://mangadex.org/covers/233b56fe-0669-4fe5-ba4d-fa93e81fff9d/9ef6251a-8ed3-419a-8078-2d8c33a6765b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.74","status":"Ongoing","tags":["Long Strip,Romance,Crossdressing,Web Comic,Full Color"],"nutshell":"A second-rate novelist Shao Xin Yu who always can't write good novels, cross-dressed under the alias \"Shao Xin Yu\", and risks it all by sneaking into the legendary men idol company, the Rong Guang Group- with the plan of writing a popular novel based on CEO Wen Qi Jing. Wen Qi Jing is cold and arrogant. He has frightened away numerous personal assistants. Even so, the carefree and careless \"young man\", Shao Xin Yu, makes his heart beat fast when \"he\" appears in front of him."},{"name":" Kyuutei Mahou-shi Kubi ni Nattande, Inaka ni Kaette Mahou-ka no Sensei ni Narimasu","avatar":"https://mangadex.org/covers/233c84de-8b65-4b1e-af45-6860e5304141/463effb0-781a-4d8f-9045-b6e9a77274ab.jpg.256.jpg","country":"Japanese","stat":"7.46","status":"Ongoing","tags":["Romance,Comedy,Magic,Fantasy,Adaptation"],"nutshell":"Jade was one of the strongest mages in the world, boasting the coveted post of Court Wizard thanks to his standout abilities. Unfortunately, mysterious events got him fired from that gig, and now he’s the newest teacher at a magic school way out in the boonies. Worse yet, he’s in charge of a class of losers and misfits who’ve earned the scorn of the academy’s elite. Channeling both his skill as a royal magician and his earnest desire to help his students achieve their dreams, can Jade turn this class of rejects into a force to be reckoned with?"},{"name":" A Story with Happy Ending","avatar":"https://mangadex.org/covers/233d148f-cb4a-4fee-97b5-02ffa3900005/44384762-b4cf-4f9a-885a-22fefdf7e87f.png.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Romance,Web Comic,Supernatural,Tragedy"],"nutshell":""},{"name":" Adou","avatar":"https://mangadex.org/covers/233f8e31-ef4f-48d8-8fa5-7338ea96ae86/0c7719d9-d7c0-47b3-904d-8395f86f79fc.jpg.256.jpg","country":"Japanese","stat":"8.36","status":"Ongoing","tags":["Thriller,Sci-Fi,Action,Military,Drama"],"nutshell":"Developed as instruments of war, the existence of the young Adou's have yet to be known by the residents of a futuristic globalised Japan. Join Riko as she spirals into a government conspiracy.\n\nLinks:\n\nAuthor's Twitter"},{"name":" Niji, Amaete yo.","avatar":"https://mangadex.org/covers/23415120-8825-4d3e-9fd8-2b3dff2d5d17/4802a090-6d4e-49cd-b5a5-b9d332ce64b9.jpg.256.jpg","country":"Japanese","stat":"7.66","status":"Ongoing","tags":["Romance,Comedy,Drama,School Life,Tragedy"],"nutshell":"You like that person right? And that’s how it started. A shuttering, saddening, deep pure love story will start."},{"name":" RoomXMate","avatar":"https://mangadex.org/covers/234816da-ddc0-482f-ab89-c946325ec76d/49a922a5-6ba7-4ece-8ee8-f241666367f2.jpg.256.jpg","country":"English","stat":"7.19","status":"Ongoing","tags":["Long Strip,Boys' Love,Web Comic,Full Color"],"nutshell":"Dongmi Lin—Nickname “Control Freak”, a college student who likes to control other people. One day he moves into a new dorm and meets an uncontrollable dorm mate, and f****d with him. His brain starts to uncontrollably generate fantasies…"},{"name":" Zui Liao Zai","avatar":"https://mangadex.org/covers/23488e8f-0ab6-412f-a93d-c6056af2042d/1fb826cd-de0e-4371-8e23-b39cc199ee33.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.07","status":"Ongoing","tags":["Monsters,Demons,Long Strip,Adventure,Magic,Fantasy,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"French:\nLe manuscrit des \"Contes étranges de Liao Zhai\" a été détruit.\nTous les sorts s'en sont échappés, des personnes extraordinaires en sont sorties tandis que les gens ont commencé à mourir.\nNing Ze se voit forcé d'embarquer dans un voyage épique pour sceller à nouveau tous les sorts, tout en découvrant la vérité sur le mystère de sa propre vie.\n||Pu Songling's manuscript of <<Strange Stories from a Chinese Studio>> unsealed, demons and monsters roam free, countless beauties appear and people start dying. Ning Ze is forced to embark on the road of sealing them, while slowly solving the mystery of his own life…||"},{"name":" Sousei no Aquarion - Mirai Shinwa","avatar":"https://mangadex.org/covers/235005f1-1975-4634-a472-29c82dd02cb1/61fe4ae1-13d4-468f-a4c6-ff61e032ad65.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Action,Mecha,Adventure,Supernatural"],"nutshell":"11 years ago, a disaster occurred on Earth. This awakened The Wings of the Fallen Angel Clan, which preys for humans and reduced the population of the world to a mere 2 billion inhabitants. They’re not hurt by human weaponry. The only things that are able to combat The Wings of the Fallen Angel Clan are the man-shaped soldiers - Aquarion. And now, Kamishiro, a young man with mysterious \"Elemental Powers\" stood up to oppose The Wings of the Fallen Angel Clan. Do lives of billions of people on Earth rest in the hands of one person?"},{"name":" Thus Spoke Rohan Kishibe (Fan-Coloured)","avatar":"https://mangadex.org/covers/2351f309-7c00-48a0-844c-1d40296df334/97389fc3-664f-4388-a3db-aa8f4e0440b9.png.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Thriller,Reincarnation,Monsters,Action,Demons,Psychological,Ghosts,Animals,Comedy,Crime,Survival,Martial Arts,Fan Colored,Adventure,Magic,Drama,School Life,Horror,Fantasy,Delinquents,Slice of Life,Supernatural,Mystery,Tragedy"],"nutshell":""},{"name":" Delinquent and Cooking Club","avatar":"https://mangadex.org/covers/2353a4a2-c23d-49ef-88fb-811a83e26c7b/d7f7126f-12b6-470b-8ea5-d647c7f68faf.png.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Oneshot,Romance,Comedy,Girls' Love,School Life,Slice of Life,Cooking"],"nutshell":"A delinquent asks the head of the cooking club to teach her how to make something as a present for the person she likes."},{"name":" Omae wa Hitsuji","avatar":"https://mangadex.org/covers/2354fb6b-b896-4271-968a-bff98c223af8/74f58e26-e253-4ecf-9f90-cf9664b8aadb.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Comedy,Boys' Love,School Life"],"nutshell":"University student Sahara, with his horrible luck, loses his home when his entire apartment goes up in flames. Luckily, he is able to stay at a friend's place – but he is suddenly mistaken as a suspicious person by his friend's younger brother, Masaki. They manage to dispel the misunderstanding, but he is pressured into doing an unimaginable job…"},{"name":" Princess Agent","avatar":"https://mangadex.org/covers/2355e85c-c819-4e65-ad7b-5a8646349461/033a9798-7bd7-419f-ad84-f73d063452e4.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.87","status":"Ongoing","tags":["Official Colored,Historical,Action,Long Strip,Martial Arts,Fantasy,Web Comic,Full Color"],"nutshell":"Chu Qiao was once agent 005 for the the military unit 11. After being framed and thrown into prison, she successfully escaped but then had sacrificed her life to protect the special agent unit from being bombed. When she woke up, Chu Qiao had traveled to the Xia Dynasty as an 8-year-old slave girl. Due to receiving help from Yan Xun during their escape, there fate was bound together, as Chu Qiao would then spend years helping him rebel and reconquer his land.\nHowever, as they walked further and further down the path to their dream, they grew further apart. One reason was because of the way they dealt with things, the other was because of a rather meddlesome Zhuge Yue, who never stopped loving Chu Qiao, despite having their loyalties lie on opposite ends.\nThe old regime will crumble and wither away, letting the new Xia Dynasty be reborn from the ashes."},{"name":" Slit-Mouth Woman","avatar":"https://mangadex.org/covers/23575d0d-35ee-4fe4-a6b7-f9918a054302/8d9d24eb-9de3-4251-8158-b8d9655945c5.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Oneshot,Comedy,Horror,Monster Girls"],"nutshell":"Author's Twitter: https://twitter.com/cheesesama24"},{"name":" Kimi wa Kawaii Koi no Dorei","avatar":"https://mangadex.org/covers/235806b0-0678-47c5-8c0e-bb19c7b8628b/59285679-d45d-40ca-a51e-331a3c287f57.png.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Boys' Love,Drama,School Life"],"nutshell":"It's weird for brothers to do this…!!\nTenya and Yamato Hagiwara were raised as twin brothers, but then they found out the truth. Ever since then, the younger of the two - Yamato - started skipping class and hanging out with the delinquents at school. Tenya takes it upon himself to fix Yamato and make sure he ends up on the right track again, but it's proving to be difficult. One day, Yamato's friend Tatsumi tells Tenya where he can find his brother, but it ends up being a trap as he walks in on his brother going at it! Afterwards, Yamato tells Tenya that he will have to make up for his interruption by being a replacement for the girl who ran off…!!\nFrom Renta!"},{"name":" As The Richest man, I Really Don’t Want To Be Reborn","avatar":"https://mangadex.org/covers/2363db38-ffd7-4895-bdcc-c860f64cdf2d/2687aa80-db07-42ca-84c9-08b4bdd190fb.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.82","status":"Ongoing","tags":["Time Travel,Action,Long Strip,Comedy,Fantasy,Web Comic,Full Color"],"nutshell":"Humans that wear clothing with ancient elements, knights that use elemental magic, cultivators that soar through the sky on their swords, a loli squad who fights using nanomachines, undeads who came from a door to another world, Super Saiyans… These all aren't important, what's important is: \"Do you want to become rich\"? Top of the realms! Strongest in the universe! Earning the name of the richest man alive in Forbes! Taking you on journeys around the realms! Teach you how to be the richest! Teaching you how to achieve financial freedom! Earn an astronomically large sum of money!!"},{"name":" Kurofuku Monogatari","avatar":"https://mangadex.org/covers/2365c364-276b-4b08-bd9c-192f8473f5eb/fc384e37-a5da-482c-97de-540de2b199fd.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"Twenty year old Ogawa Akira is taking the medical school entrance exam for the third time when he is overwhelmed by anxiety and flees the testing room. He soon finds himself wandering the streets of Tokyo lost and exhausted. Then by chance a woman drops her earring, and he picks it up and returns it to her. He is dumbstruck by her beauty. Overhearing that her name is Kyoko and that she works at the nearby cabaret club, he promptly decides to get a job at the club, with the hope of a getting closer to her and maybe finding his place in the world.\nAdapted into a TV mini-series in 2014"},{"name":" Mata Kimi ni Koi o Suru","avatar":"https://mangadex.org/covers/2366f42d-7be3-437a-b7b7-c2452c886ad3/43417f7f-14c3-492f-bc4e-809bdfb0b01f.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"One time during his high school years, Hosho impulsively dry-humped Saotome, his soccer club senpai whom he admired. After the incident, they didn?t speak of it again and their relationship became strained. It?s been eight years since? Hosho is now a #1 host and has recently moved. However, the landlord living in the apartment next to his is none other than Saotome! Hosho is engulfed in complicated memories, but he is wary of Saotome?s unchanging kindness and the reasons behind his own impulsiveness eight years ago! This is the heart-jerkingly pure love story of Saotome, the too-cute-to-be-true landlord and Hosho, the host whose talents are wasted on him."},{"name":" Butter Neko no Paradox","avatar":"https://mangadex.org/covers/236781ac-3250-48d4-b48b-9a04b7d2e084/d0a0b296-ed22-4afe-b59b-7f14214b667b.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"From MangaHelpers:\nOwada Wakame is innocent and inexperienced in relationships, and she sometimes fears she will end up all alone. She and her friend Ari notice a new employee at their company, who seems pretty attractive to both of them! Unfortunately, the man in question, Kanesue, has his own hangups about the opposite sex, based on some less than pleasant experiences he's been through. Both Kanesue and Wakame see each other as someone different than how they really are, and their assumptions keep getting in the way. Will Kanesue and Wakame be able to find what they need in love?"},{"name":" Diana & Artemis","avatar":"https://mangadex.org/covers/236aa3e1-19be-4a5d-939d-b3ecb42d5685/d8c4a38f-ec68-4a58-a7a4-2e5e3159de51.png.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Sci-Fi,Action,Comedy,Crime,Adventure,Police"],"nutshell":"Lunanexus is a city on the surface of the Moon. A city with population of 2 million people,\nwhere the class divide is huge and increasing shortage of water appears at the forefront.\nPeople from the lower class are forced to live on a limited water ration.\nIn the underground world, water is more expensive than drugs."},{"name":" Inside Full Bloom","avatar":"https://mangadex.org/covers/2371fd04-98a7-4389-a28f-1d4d320c29ba/c82ae86a-a2ba-4850-a530-d60e8fd64626.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Boys' Love,Drama,School Life,Slice of Life"],"nutshell":"Debuted on Qpa Vol.72"},{"name":" Flying Free","avatar":"https://mangadex.org/covers/2379e944-c9c6-4581-b3ea-b782af4da317/cf011da9-4e8c-42ee-996c-c432bd3512e3.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Completed","tags":["Romance,Drama"],"nutshell":"Chapter 01 - Aiqing Wasaibi (Side Story/Oneshot)\nChapter 02-04 Flying Free\nA story about a girl who has always studied hard in school and has never broken rules. However, she has never tasted what true freedom is.\nChapter 05 - Another side story/oneshot."},{"name":" Free! - Daigakusei ni Narimashita. (Doujinshi)","avatar":"https://mangadex.org/covers/2383bb7e-7b1c-4ec7-ab67-4f8c67067333/6234c6c9-fdd3-47ff-b71d-30eb3bdf4e28.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Oneshot,Romance,Boys' Love"],"nutshell":"Pairing: Rei x Nagisa"},{"name":" Seishun Catharsis","avatar":"https://mangadex.org/covers/2384995f-3ea1-4a2e-9c51-44791ced18ac/7832abe1-e386-4617-a182-8888b0a5015a.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"After graduating from high school, Masami, an office clerk at a law office, ended up raising his niece Akira due to his sister suddenly running away from home. When taking Akira to kindergarten one day, Masami discovers that his high school ex, Kei, is working there. It was their first time seeing each other in five years…"},{"name":" Birdman Anthology","avatar":"https://mangadex.org/covers/238cac1c-e6ea-4fd6-b508-b476dbb421fc/860e553a-5a37-418f-a213-91bbf8272e0b.png.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Thriller,Sci-Fi,Monsters,Action,Psychological,Animals,Comedy,Anthology,Survival,Adventure,Office Workers,Military,Philosophical,Drama,Horror,Slice of Life,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nHighly intelligent birds have exterminated humans and become the rulers of the earth!\nHowever, the bird society that was born to correct the evolutionary distortion on the earth is not an ideal world, and it soon begins follow the same path as human society.\nWhat will become of the decadent avian society...?!\nAlso contains the Otona Manga (Adult Manga) \"The Story of Fumbling Animals\".\n\nVolumes 94 and 95 of the Osamu Tezuka Complete Works"},{"name":" On Your Hands and Knees, Begging Your Femboy Friend to Crossdress","avatar":"https://mangadex.org/covers/238d617c-46d0-4358-b5e3-0eee7adde221/d480d798-0347-414c-9899-3c8fa052b04f.jpg.256.jpg","country":"Japanese","stat":"7.41","status":"Completed","tags":["Oneshot,Crossdressing,Full Color"],"nutshell":""}]