[{"name":" Taimashin - Masatsu Note","avatar":"https://mangadex.org/covers/05a1b71e-d7f5-4776-9ceb-13e7aebf208b/fb2d1e07-65e5-423e-9fbe-25f269e3560c.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Action,Horror,Supernatural"],"nutshell":"Dr. Taima is not your average doctor: a skilled acupuncturist with the ability to wield the taimashin (needles that control the flow of chi in things and are used to banish demons). He is often called upon to drive demons out of possessed persons that devour anything within their grasp - dogs, cats…even other people! Accompanied by his charming assistant, Togetsu Maki, Dr. Taima travels near and far to deal with these other-word maladies–often at the risk of his own life.\nTaima's investigation leads him to Dunwich, Massachusetts, where he meets another needle wielder, Kyogo Ayakashi. As they encounter ancient evils that are best kept secret, how will these taimashin masters bait their prey?"},{"name":" Ashita no Koto wa Wakaranai","avatar":"https://mangadex.org/covers/05ae4813-8f49-4e0f-acf4-2f163b843dc0/6f345e69-ed18-436b-83ba-d8f5ae131a90.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Romance,School Life,Supernatural"],"nutshell":"Ten has the ability to see into people's futures for a limited time, even if he does not want to. Due to this ability, he is very popular with girls and often come to him for consultations, with an exception to Tsumugi. She seems to not be at all interested in fortune telling. This intrigues Ten, and before he knows it his eyes seems to always follow her. Can he predict a happy future with Tsumugi?"},{"name":" Koishite Hoshii","avatar":"https://mangadex.org/covers/05b16175-c7f7-4a7c-85d5-fa45702bb2ca/09527b0f-6c46-48de-9377-c465feb900af.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Rei, a host, is suddenly reunited with his childhood friend, Makoto, after 7 years. Was their encounter only a coincidence or…?"},{"name":" Ken-chan","avatar":"https://mangadex.org/covers/05b8157f-b9fb-4919-8b29-4582c0736ef6/cc91cab7-1144-4b4f-a7ae-fd3be45b6545.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Comedy,Slice of Life"],"nutshell":"Centers around the titular character, a small boy who gets into different situations with those around him. Each strip is done in four vertical panels in two rows (eight panels in all), read from right to left. The presence of Akatsuka's \"Star System\" concept is prominent especially in the later strips, as some notable characters are added into Ken-chan's supporting cast. The work proved to be a challenge for Akatsuka, who was restricted from depicting children committing bad acts that wouldn't be punished, or having them be rude or fight in general."},{"name":" Kojiin Tamer","avatar":"https://mangadex.org/covers/05c2917a-e0a4-4c55-abac-8be0f8b213e4/3b19737c-bed2-4c9f-bf65-4e6cdd103954.jpg.256.jpg","country":"Japanese","stat":"7.69","status":"Ongoing","tags":["Reincarnation,Monsters,Action,Comedy,Adventure,Magic,Isekai"],"nutshell":"Shu, who died of old age, reincarnated as a baby in a different world where he was picked up by a poor orphanage. He quickly grows up under the watchful eye of the gentle director and staff. With skills received from God, he starts to exert talent…\nHe now lives at his own pace, adventuring with cute monsters and good friends ♪\nweb novel (jp)"},{"name":" Worst Gaiden Mr. Zetton","avatar":"https://mangadex.org/covers/05c29e85-71c1-4f78-95cd-a03e68d9523c/e41ea374-6377-46db-bdd8-2551fed5cadb.jpg.256.jpg","country":"Japanese","stat":"8.62","status":"Ongoing","tags":["Action,Comedy,School Life,Delinquents"],"nutshell":"After years of studying, Hanazawa Saburou, AKA Suzuran's legendary Zetton, has finally become a high school teacher. But on his first day at work, the principal tells him he was actually hired not to teach, but to make the students of his homeroom class drop out of school?!"},{"name":" Dainippon Samurai Girl","avatar":"https://mangadex.org/covers/05c8656f-cb87-4545-83e9-c9810f86eeee/6d237f81-d6f8-4855-bf2d-75aa1bbed261.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":""},{"name":" Cultivating With Big Sister In The City","avatar":"https://mangadex.org/covers/05d2b5db-0eb5-4f70-9f35-f0239e3042aa/b5b4f1fa-4f5d-464e-8d73-97ad92c58e34.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Adventure,Web Comic,Full Color"],"nutshell":"What is the experience of carrying a big demon with a girl's appearance…yes, teaming up with the big demon to cultivate immortals is such a bug!"},{"name":" JoJo's Bizarre Adventure - Cost of information (Doujinshi)","avatar":"https://mangadex.org/covers/05d3d865-85fd-42db-8fa9-530c1db83fb6/87268a7c-8120-475c-82da-abe1dfcc51e1.png.256.jpg","country":"English","stat":"7.70","status":"Ongoing","tags":["Action,Comedy,Crime,Martial Arts,Mafia,Adventure,User Created,Drama,Fantasy,Web Comic,Supernatural,Mystery"],"nutshell":"The story of JJBA: Cost of information begins in Italia in 2008, where Jarold Jamiroquai, 23-year old man who is living with parents and goes to work every day, is secretly working on mafia. His job is to spy for people possessed by the stands with supernatural powers to discover the bizarre abilities they have.\nEverything goes fine, he is living quiet live, until one day his friend got a lot of problems…\nFollow the story of Jarold and his faithful friends, full of bizarre battles and clever enemies, find out the mystery of underground casino, reach the Nirvana and discover who is standing behind strange murders all over the world."},{"name":" Koipon! ~Inochi Mijikashi Koi seyo Ponpoko~","avatar":"https://mangadex.org/covers/05d75d73-afc8-4751-9e48-85cc7526904c/200b9e43-c5fe-4bae-85a6-148dc3102eae.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Supernatural"],"nutshell":"Fukuko has a normal, boring life, until she turns fourteen and finds out she's actually been a tanuki this whole time! But shape-shifting human is hard work, and she's not very good at it – especially when romance makes a tanuki's heart race and ears pop out. Does Fukuko have a chance with Kiyohara, the nicest guy she's ever met? Good thing he loves animals! But wait, Kiyohara's friend Konno is actually a shape-shifting fox…? Fukuko's normal life has turned into a huge mess!!"},{"name":" Love Live! - A-RISE no Tsubasa-sama wa Honoka-chan to Danshin Danshin Shitai Rashii (Doujinshi)","avatar":"https://mangadex.org/covers/05da0eda-2103-4d2b-b85f-f98ec844b266/2ad500fa-db5b-4923-90bf-780d7f6a0108.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":""},{"name":" Madness Combat x Ninja Slayer","avatar":"https://mangadex.org/covers/05dcdc0c-7b79-49c9-b67a-f3a132ac6055/a643e63e-22e3-4fb9-b106-3cde34caaab7.png.256.jpg","country":"English","stat":"7.96","status":"Completed","tags":["Action,Ninja,User Created,Web Comic"],"nutshell":"Ninja Slayer meets a gun ninja."},{"name":" Himegami no Miko","avatar":"https://mangadex.org/covers/05e20804-3b41-4830-a1d3-a8a553a8be5a/721878eb-dbfb-43af-8ced-a14c8a79da64.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Romance,Girls' Love,Drama,Supernatural"],"nutshell":"Himeko Kurusugawa and Chikane Himemiya are two high-school girls at the prestigious Ototachibana Academy in the fictional Japanese village of Mahoroba. They are also the reincarnations of the solar and lunar mikos. When their ancient enemy the Orochi (the eight-headed Yamata no Orochi of Japanese folklore) rises once more the girls’ long-sealed personas awaken to defend the world!\n'Kannazuki no Miko' Spin-off Manga and 4th alternate reincarnation of Himeko and Chikane.\nKannazuki No Miko - 1st alternate reincarnation\nKyoushiro To Towa No Sora - 2nd alternate reincarnation\nZettai Shoujo Seiiki Amnesian - 3rd alternate reincarnation"},{"name":" Unspeakable Contact","avatar":"https://mangadex.org/covers/05e57c5e-8653-4f69-9b72-72fc2067cac7/e4b0f870-4233-4dfd-bd89-23f377ed2cab.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Ongoing","tags":["Long Strip,Boys' Love,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"How important is reincarnation? Do souls actually exist after death? How will meeting Shi Chenhua change Xia Ke's misfortune? An unspeakable and thrilling part-time job, exorcisms that embrace the soul, another fateful encounter…and a pair of hands hidden in the dark.\nA guarded young man with psychic abilities who lacks love asks an extremely lucky and bright college student: \"Will you become my lucky charm?\""},{"name":" Taiyou wa Kimi ni Kagayaku","avatar":"https://mangadex.org/covers/05e9b6ba-be2f-4974-b15d-29ca3cdb5d87/1ce91a0c-bb9b-4fd4-9be0-263705cb6c8a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Sports,Drama,School Life"],"nutshell":"“I must get into that school!”\nThat was the sudden thought Chinatsu had during the summer of her third year in middle school. Chinatsu never really thought about her goals and dreams in life, but after seeing a match in the Japan National High School Baseball Tournament (or Koushien), she suddenly had a goal to achieve! She worked extra hard, and finally got into the school, but on the first day, she meets a fierce looking senpai who is actually the baseball team’s ace player! Once again, Chinatsu did her best and managed to be the baseball team’s manager, yet the most important player is…?!\nITALIANO:||\nTaiyou wa kimi ni kagayaku: Hinatsu, dopo aver visto una partita di baseball in TV, decide di entrare nella scuola Tsubakawa. In questo modo spera di stare vicino alla squadra di baseball che ammira tanto, diventando anche la loro manager!\nHe has a girlfriend: Hiro lavora in un negozio di calzature e il suo desiderio è quello di conoscere meglio Terada-kun, un cliente abituale del negozio di cui si è innamorata! Sfortunatamente ha una ragazza, ma un giorno Hiro la vede con un altro! Nello stesso tempo, un piccolo incidente in negozio, fa si che Hiro e Terada si conoscano meglio e…||"},{"name":" Honto no Kanojo","avatar":"https://mangadex.org/covers/05ec0988-dae8-4acf-928b-43c5f7209098/1812c06c-21c9-4971-8cc1-f8e13dca9f96.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Romance,Comedy,Girls' Love,School Life,Slice of Life"],"nutshell":"Moe confesses to Yuuka who rejects her harshly in a haughty manner different from her usual \"good girl\" personality… but Moe seemed to enjoy it?"},{"name":" Dark Star Emperor","avatar":"https://mangadex.org/covers/05f0c39f-1ae0-403c-b521-85122d4db458/ef96d7a6-ba5f-4128-aab6-2ab899ebe13c.png.256.jpg","country":"Chinese (Simplified)","stat":"6.87","status":"Ongoing","tags":["Monsters,Action,Long Strip,Harem,Isekai,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Su Xiaobai was on the brink of death, he was brought into a new world. The soul of the strongest evolver \"King of Stars\" Long Ming now inhabits his body. Therefore, he has acquired an extremely powerful ability : \"The Endlessness of Dim\". The only drawback is that if Xiaobai ever gets a boner, he will experience severe pain. However, when he will have found the murderer of Long Ming and ascended the throne of Protoss Palace, this weakness will disappear…"},{"name":" Moonlight","avatar":"https://mangadex.org/covers/05f1196e-c551-4c85-9a25-b600ab58b457/610bd879-88d3-45b7-bd7c-0c42f7b24786.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Romance,Adventure,Isekai,Drama,Fantasy"],"nutshell":"Everything begins with an odd looking amulet lost by a stranger and picked up by ordinary high school girl Fujimi. Wrong. Actually, it begins with a new, haunting song, and goes on with a monster chase into the night.\nWhat is the secret behind all this?"},{"name":" Mamahaha no Tsurego ga Moto Kanodatta","avatar":"https://mangadex.org/covers/05f282b4-5010-48ff-8729-90059e90de57/93103a86-5acc-4a24-aef7-181847042c0d.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Ongoing","tags":["Romance,Comedy,Incest,School Life,Adaptation"],"nutshell":"A certain boy and girl in middle school became lovers, flirted with each other, disagreed on trivial things, became more frequently irritated with each other rather than excited… and ended up breaking up on graduation.\nAnd so, the two of them, Irido Mizuto and Ayai Yume, wound up meeting each other in the most unexpected fashion.\n“Isn’t it obvious that I’m the elder brother.” “Isn’t it obvious that I’m the elder sister.”\nThe children of the partner of their parent’s remarriage was their ex-lover!?\nThe former couple, mindful of their parent’s feelings, decided on a ‘sibling rule’ where the one takes conscious of the other as the opposite sex loses, but—\nWhen they encounter each other in the bathroom, commute to and from school together… along with the memories of the past and living under the same roof, just how do they disregard each other!?\n\n\nOfficial Twitter"},{"name":" Seishun Kouryakuhon","avatar":"https://mangadex.org/covers/05f3f58b-efd2-4d6d-bdf6-efd991fe5495/bd1989e5-c4a4-4d19-ba1c-b4d2158bc2f8.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"What’s a guy to do when he attends an all boys’ school that’s next to an all girls’ school? Especially when the girl he likes attends that same all girls’ school? Form a strategy, make friends in high places, and concentrate on running."},{"name":" Incredible Big Shot","avatar":"https://mangadex.org/covers/05f5ef66-2a1c-4d44-8e90-a89854758429/81e6f7c6-17d3-4467-a5b2-270c89d9ebeb.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Comedy,Martial Arts,Adventure,Web Comic,Full Color"],"nutshell":""},{"name":" Touhou - I'll Just Give You Some Medicine (Doujinshi)","avatar":"https://mangadex.org/covers/05fe75c8-69c8-4711-a1a3-a1ed47ef81c7/67b0491c-ac62-4551-a569-233a1056e93d.png.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Oneshot,Comedy,Drama,Tragedy"],"nutshell":""},{"name":" Mogusa-san wa Shokuyoku to Tatakau","avatar":"https://mangadex.org/covers/06045bd7-1aee-4044-b08a-87a9cfd6234d/c15b6bcb-cfab-400e-91b6-2e227e82b321.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Comedy"],"nutshell":""},{"name":" Maison De Beauties","avatar":"https://mangadex.org/covers/0604f907-17ea-40f5-bd44-05ec1ea23030/5198336e-e9ce-4038-aaf0-360d19111101.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life"],"nutshell":"A low-price, high-quality apartment in the metropolitan area of Tokyo is nothing short of a miracle! It exists, but there's a catch – tenants must be good-looking and pass an interview by the landlord!? This is a love comedy about what happens when the beautiful people are all gathered under one roof!"},{"name":" Deor","avatar":"https://mangadex.org/covers/0608d5ad-2b6f-46d3-b9a1-d4978d9df0b8/96f007c6-8760-401e-879b-be294d4fc92f.jpg.256.jpg","country":"English","stat":"7.98","status":"Ongoing","tags":["Action,Adventure,Fantasy"],"nutshell":"The young prince, Deor, is an outcast in his own land. Born without the ability to use magius – a rare condition that marks him as an incompetent – he relies on his intelligence and tenacity to prove wrong those who believe he is not fit for the crown. However, with deadly demons and conspiracies threatening the very existence of humanity, Deor must protect the very kingdom which ridiculed him. Will he be able to defeat the demons and secure his position as king?"},{"name":" Petit Fleur","avatar":"https://mangadex.org/covers/060a5bed-c225-4a75-914e-65bd0ffe76c7/39cc0b47-12c1-4e13-b019-a740b41b0fdb.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"Google Translate: I'm curious about the small heart flower, Katagiri-kun, who is tall and mature, who I often meet on the train. I want to make some progress during the summer vacation, but in reality, they are misunderstanding each other …?\nA collection of gems filled with warm and gentle \"love\" drawn by a master of Ubukan!"},{"name":" Shachiku Kishi ga S Rank Boukensha ni Hirowarete Himo ni Naru Hanashi","avatar":"https://mangadex.org/covers/060be26c-faea-4975-b4d2-3b1457cbcb57/4629e7d3-72a5-4647-a019-a9f38569e268.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Hiatus","tags":["Fantasy,Adaptation"],"nutshell":"Theo who was tormented by his boss and received no help from his peers, and was a lowly knight throughout his lifetime. However one day, a strong beautiful girl with no life skills appeared before him.\nWN Raw"},{"name":" Yuusha Mushoku","avatar":"https://mangadex.org/covers/0618e9e1-06c1-4d28-8c10-1f3f92b64875/fecb0aa5-13f9-4434-8ebf-b661f47d71fd.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Comedy,Fantasy,Slice of Life"],"nutshell":"Original douijinshi about the unemployed female Hero, Mahiro, and the three girls around her.\nDone by Harada Takehito, famous for being the artist for several games made by Nippon Ichi. Published under the circle, Haradaya."},{"name":" Force Field Girl","avatar":"https://mangadex.org/covers/06245f10-e8ca-4a25-a869-ca5a4e0f0159/53fca0d4-20ca-4421-ba70-c3dda6d2c2bb.jpg.256.jpg","country":"Korean","stat":"8.03","status":"Completed","tags":["Long Strip,Romance,Comedy,School Life"],"nutshell":"A boy who is bullied gets saved by his…Force Field Girl!"},{"name":" Hensoku-kei Quadrangle","avatar":"https://mangadex.org/covers/062c517b-9dc2-470a-a50c-e9cc8b8adadf/58b02653-8f69-465a-a5db-b654827d9d7d.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Time Travel,Romance,Drama,School Life,Supernatural,Tragedy"],"nutshell":"In high school, Maki Eiji was a delinquent, often skipping class and getting into fights. One girl, Chino Kotoha, was kind to him, until she was targeted by delinquents due to their apparent relationship. Suffering their attack seemed to have permanently changed her for the worse.\nYears later, when Eiji sees her again, he is overcome with guilt and regret. To his surprise, a mysterious scantily-clad woman suddenly appears, claiming she can send him back in time to make everything right! He takes her up on the offer, but things are not as simple as they may have seemed back then. It turns out that Kotoha had her own painful secrets in those days, and Eiji may not be the only one traveling in time to change the past!"},{"name":" Koe no Chiisai Komori-san to Kusodeka Oogoe no Oobayashi-kun","avatar":"https://mangadex.org/covers/06323c7e-60cd-4759-80bd-4f2a2737174d/a4cffa5a-ec34-45d3-bd94-867d0e9b22f8.jpg.256.jpg","country":"Japanese","stat":"8.45","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"Komori-san has a complex about her soft voice, compared to the loud and brash Ohayashi-kun. Their vocal volume may be opposites, but their feelings for each other are mutual. Will they ever be able to properly communicate?"},{"name":" Hajimete no Honeytrap","avatar":"https://mangadex.org/covers/06338760-26e5-4416-aceb-77da4aa37683/66a56b1a-c2b4-4352-9229-56b5b1c71671.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Action,Demons,Romance,Comedy,School Life"],"nutshell":"this one shot is from ジャンプGIGA 2020 SUMMER"}]