[{"name":" Revenge Queen","avatar":"https://mangadex.org/covers/265703b2-3704-4f3d-b4cb-6cbfadc26a1c/8aa526c9-daf2-4699-bb33-0e5c3eeb6fd5.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.10","status":"Ongoing","tags":["Time Travel,Long Strip,Romance,Isekai,Drama,Web Comic,Full Color"],"nutshell":"Abandoned, framed, tragic ending... A quick-transmigration female supporting lead has had enough! Why must a supporting character have to be a contrast to the main lead?! From this world onwards, she has decided to take fate into her own hands, no longer listening to the system's plans! Pushing aside all obstacles and difficulties, she fulfils her own dreams, whilst using all sorts of methods to get back at those who harmed her previously..."},{"name":" Tokyo Tarareba Girls","avatar":"https://mangadex.org/covers/26592343-744e-4049-a8e8-1ae15b363747/e6e2873e-ff44-4c31-be0a-a0d95b200371.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life"],"nutshell":"\"I always just worried about what could have been, and I'm already this age!\" That isn't how it's supposed to go, but somehow I'm already thirty-ish! That's how it is for Rinko. It's six years until the 2020 Tokyo Olympics and she's been thinking about marriage but…\nNote: Nominated for the 9th Manga Taisho Award and the 40th Kodansha Manga Awards in 2016.\nOfficial English"},{"name":" I Have 999 Abilities","avatar":"https://mangadex.org/covers/265da069-ca97-434a-ba54-d118ed9b6e7f/1c3fbb90-a764-4157-a0b3-e930f0b744c5.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.75","status":"Ongoing","tags":["Action,Long Strip,Superhero,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"In a world where superpowers are commonplace, Yang Xifa swore bloody revenge on those who harmed his dear sister. He will use his ability to take away other's powers to build himself up from an innocent bystander to become the leader of a powerful organization. Combining his strength and smarts to defeat the evil-doers, he will collect 999 abilities and become the most powerful hero in the world!\n(Source: Anilist (Bilibili, translated))"},{"name":" THE iDOLM@STER - Forbidden Fruit (Doujinshi)","avatar":"https://mangadex.org/covers/265e3709-351b-493b-bdd2-a7b68d6b164f/41a0dad7-27ff-4009-8b07-e9974249c9d0.png.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Oneshot,Girls' Love,Drama"],"nutshell":"A Chihaya x Yukiho doujin."},{"name":" Boys of Summer","avatar":"https://mangadex.org/covers/2664650e-23ec-4aaf-a80b-5f2a89c142ab/777e724a-c267-498d-aa3e-fc833a9df340.jpg.256.jpg","country":"English","stat":"7.93","status":"Completed","tags":["Romance,Sports,School Life"],"nutshell":"Bud Waterson comes to college with raging hormones, and he has to compete with post-teens like him. All the odds seem to be against Bud when his roommate turns out gay and girls he likes don't reply!. When the girl of his dream also turns away from him, Bud joins the baseball team to prove himself"},{"name":" Classic BL Theatre","avatar":"https://mangadex.org/covers/266bb97f-42e6-4075-afef-8a01db6ec815/ad9231d2-d744-4ade-bab7-dcc9ae99e8e0.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Long Strip,Comedy,Boys' Love,Fantasy,Full Color"],"nutshell":"INGLESE:\nEver wondered what popular folktales would be like if more men were involved?! The answer is: perfectly queer! Classic folktales from around the world take on a whole new hunky spin when boy loves boy. From Korean fables like \"The Tale of Chunhyang\" to more well-known fairy tales like \"Snow White,\" you'll never read the originals the same way again.\nITALIANO:\nVi siete mai chiesti come sarebbero stati i più famosi racconti popolari se ci fossero stati più uomini coinvolti?! La risposta è: perfettamente gay! Storie classiche da tutto il mondo da un nuovo punto di vista quando un ragazzo ama un ragazzo.\nDalle fiabe coreane come \"Il racconto di Chunyang\" a molte altre favole note come \"Biancaneve\", non leggerete mai più le originali nello stesso modo."},{"name":" Klonoa of the Wind: Door To Phantomile 4Koma Manga Theater","avatar":"https://mangadex.org/covers/26700f33-7eb5-4008-9086-addb2314eae0/88fb86ce-b657-447f-8fd3-9f6582262d82.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Animals,Comedy,Adventure,Video Games,4-Koma,Fantasy"],"nutshell":"4-panel gag manga strips based on the classic video game series, \"Klonoa.\" Based on the first video game in the series.\nKlonoa lives in Breezegale and suddenly wakes up after hearing a big crash in a distant area. He embarks towards the location to see what the loud noise was all about. Together with his companion, Huepow, which is also a ring spirit and works as a weapon for Klonoa, he gets ready to save the world from evil."},{"name":" Kingyoya-san no Karisome Fuufu","avatar":"https://mangadex.org/covers/267501f5-bcea-47b1-8206-a304cc6fff0f/32329b20-ad57-4447-a190-937bdc213605.png.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Animals,Romance,Slice of Life"],"nutshell":"A married couple  who are actually strangers run a goldfish shop together and slowly grow closer to each other."},{"name":" Peace Maker","avatar":"https://mangadex.org/covers/2679b5bc-63de-4009-a273-08ccdea73d38/4d47c2dd-7866-4aaa-a67c-90b41426356a.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Historical,Action,Comedy,Adventure"],"nutshell":"Tells the story of a lone gunman named Hope Emerson, the son of legendary gunfighter Peace Emerson. Known for the Spot Burst Shot, a technique that involves the firing of multiple bullets at a rapid pace while fanning the revolver’s hammer. Emerson gets drawn into a mysterious conflict when he defeats a gunslinger named Hans “Grim Reaper” Giles in a duel after surviving a gunshot due to his bulletproof jacket. Hans had been part of a private mercenary force known as the Crimson Executioners, raised by millionaire Phillip Crimson."},{"name":" Fujiko Fujio's Shonen SF Short Story Collection","avatar":"https://mangadex.org/covers/267a7410-341f-4886-96e8-6e395ac0ec2c/15f63cdc-dea1-45e5-bec2-cac0298e1e84.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Ghosts,Romance,Comedy,Anthology,Survival,Adventure,Philosophical,Drama,School Life,Horror,Fantasy,Vampires,Aliens,Supernatural,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nEnjoy the real thrill of the mysterious universe to the fullest!\nAll of the works depicting the SF world with exquisite development are well worth reading. Includes works published in magazines such as \"Manga Shonen,\" \"Kodomo no Hikari,\" \"Starlog,\" \"Shogakusei Shonen,\" \"Shogakusei Gosei,\" \"Bessatsu Korokoro Comic,\" and \"Shoujo Comic. In particular, \"Extinction Island\" (first published in \"Starlog\" silent issue) is included in both editions so that readers can compare them with the final edition with dialogue, which was revised when it was collected into tankobon.\nWe hope you will enjoy reading and comparing the two works.\nVol 1:\n||\n\nSolitary Space War: A boy is picked as Earth's champion to fight in a proxy war, with the fate of his planet at stake.\nCommerce Monkey\nThe Good-Natured Ghost\nFuture Thief: Dissatisfied with his current life, a boy agree to exchange his youth for a large fortune.\nMiraculous Belief: Lost in his own world, a boy breaks the barrier between the real and the imaginary.\nKoibito Seizouhou: Thanks to an alien's help, a boy makes a clone of his crush and raises her in his room.\n||\n\nVol 2:\n||\n\nIn Tomorrow's Newspaper: A boy gains the uncanny ability to read newspaper the day before it is published.\nI, Yuuko: After visiting the home of his female classmates who dies recently, strange things happen to a boy's body\nNew Year's Star Expedition: A group of scientists goes on an expedition to find the origin of all civilizations in the Galaxy.\nWorld Classic Fairytales.\nVampire: A wooden stake to the heart is what you give to vampires, even if they used to be your loved ones.\nThe Two of Me: A boy finds the access to a parallel world almost identical to his own - and strikes up a strange partnership with his counterpart.\n||\n\nVol 3:\n||\n\nUchu Kara no Otoshi-dama\nAnko oini kokoru\nIsland of Extinction: One day a fleet of UFOs suddenly appears and lays waste to the Earth, almost wiping out humanity overnight. A couple of student stranded on an island is among the last survivors.\nYamadera Gurafiti: A man catches a glimpse of a girl who looks just like his childhood sweetheart, who is no longer in this world.\nUchusen Seizouhou: A group of people stranded on an isolated planet has to decide if they want to risk their lives using a damaged spacecraft to return home.\n||"},{"name":" Will These Words Reach You","avatar":"https://mangadex.org/covers/267c7be2-88f8-4e5a-b8c6-6058a127b267/f3d1d1ee-e2b5-4746-b42f-ba8a7e09550b.jpg.256.jpg","country":"Japanese","stat":"8.82","status":"Completed","tags":["Oneshot,Romance,Girls' Love"],"nutshell":"A Yuri love story surrounded by waves and very broken languages.\n\n Artist's Pixiv\n Artist's Twitter"},{"name":" Patience, My Lady!","avatar":"https://mangadex.org/covers/2683410b-8e2c-4f84-bd1d-16f448d4c062/a1acdb28-551b-468b-a817-72645f9ecfc7.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Ongoing","tags":["Monsters,Long Strip,Romance,Adventure,Magic,Isekai,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"Rose is the ruler of the dominion of ‘White’, a small and poor land. She was getting along with her citizens and living a quaint, favorable life until foreign migrants kept increasing and she got involved in some odd situations?! The lively, entertaining, romance, fantasy story of a super OP ruler Rose and Yggdrasil, the grand sorcerer who wants to hide her away and protect her!\n\nWhen the Kingdom of White was conquered 500 years ago, the king and his subjects were exiled to a small tract of wasteland covered in ice. There they endured cold and hunger, relying on the magic of Archmage Yggdrasil to build the world’s smallest self-governing territory. As the last heir to her family, Rose now rules over this land as its lord. Rescuing former citizens who have fallen prey to trafficking abroad, she pours her heart and soul into making them thrive at home. But first things first, she must fill up the treasury to fund this mission! The business-savvy lord invites dragons, dwarfs, and elves to join in the effort, turning White into a haven for all races. Yggdrasil couldn’t be prouder of this utopia in the making, but will Lord Rose ever get to leave her money troubles behind?\n\nOfficial Translations:\n\nEnglish\nChinese (Simplified) / 汉语\nChinese (Traditional) / 漢語\nJapanese / 日本語"},{"name":" Cultivation Through Science","avatar":"https://mangadex.org/covers/268cbb27-282b-4020-8f4a-cdb1e0638d25/095e47e6-e476-4270-961d-b64063f0e0d1.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.72","status":"Hiatus","tags":["Sci-Fi,Long Strip,Martial Arts,Wuxia,Isekai,Full Color"],"nutshell":"After traveling to the world of Xianxia, ​​Qin Yun became a peak master of a sect, with the \"Super Master System\".\nQin Yun always said, \"Learn mathematics, physics, and chemistry, and you can travel the world without any fear\".\nNow, the master is an exam madman, and in Qin Yun's view, Immortal Cultivation is also a subject.\nIt is like a nine-year compulsory education, and only through scientific cultivation can there be a way out…\n\nReleases of this series stopped with chapter #22 on June 2021."},{"name":" Bye Bye Regret","avatar":"https://mangadex.org/covers/268f19b4-5b6a-4ebf-893f-e2737b4891eb/75ccfc81-f0e7-4872-b778-f1ce314786f8.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,School Life,Supernatural"],"nutshell":"Saaya has always been in love with Yuuki since high school, but she has never dared to tell him this, and when she tried to do it, she found herself doing something that she will regret for several years. One day, when she visited her grandfather, he gives her a small box of music with certain powers … Will she be able to make amends for his mistake or will her love for Yuuki lead her to make more nonsense?"},{"name":" Narukami Shizuma won't settle down!","avatar":"https://mangadex.org/covers/268fa29f-31ef-4377-81ec-e3fa6d76c571/3ae8c86f-3070-4c38-97c2-f31dcfde72aa.png.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Oneshot,Romance,Supernatural"],"nutshell":"Oneshot\nNarukami has problems with his 'urges'. Hoping a certain shrine might be the solution to his problems he visits and is surprised when…"},{"name":" I Want Ganyu To Take A Break From Work","avatar":"https://mangadex.org/covers/26a90282-3955-4aa4-bebd-9744d953bd97/0360d2b0-563e-4ce8-8f11-c18ecdf6221c.png.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Video Games,Drama,Web Comic"],"nutshell":""},{"name":" I Became a Girl So I Had to Break up With My Girlfriend","avatar":"https://mangadex.org/covers/26aa73bb-0f0f-4ffd-be6d-82fdd3975099/08682a42-968b-4129-8fe7-f6084a1451fc.jpg.256.jpg","country":"Japanese","stat":"7.49","status":"Completed","tags":["Genderswap,Romance,Girls' Love,Web Comic"],"nutshell":""},{"name":" Namameku Yami to Oboreru Hikari","avatar":"https://mangadex.org/covers/26ade0ec-6912-4dd4-9b7a-b4eab5978bfd/4d474bd8-66ff-442f-96f3-29eca63654fc.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Boys' Love,Mystery"],"nutshell":"The story of a detective attempting to solve a mystery and a man who doesn't know himself."},{"name":" My Sky - Detective Arc","avatar":"https://mangadex.org/covers/26b2c531-0560-4ffb-8073-d5ce2e3c2c14/08038b1c-b2cc-4bd9-a4e0-b61e50803ff4.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Action,Psychological,Romance,Comedy,Crime,Survival,Sports,Mafia,Adventure,Office Workers,Drama,Delinquents,Police,Slice of Life,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nIppei Yasuda, heir to the Yasuda Zaibatsu, is back as a detective! Despite being a rookie, Ippei takes on cases head-on, but is confronted by the unreasonable crimes of those in power.\nWill Ippei be able to maintain his manly justice?"},{"name":" BanG Dream! - Mattari Shita Ako Rin desu (Doujinshi)","avatar":"https://mangadex.org/covers/26b75e1d-6c22-4ca5-9cc7-1345d960702c/84879209-08c5-40a6-b841-cccae396ff0a.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Girls' Love"],"nutshell":"Raw Links:\n\nChapter 1\nChapter 2\nChapter 3\nChapter 4"},{"name":" 78 Days on the Street of Hate","avatar":"https://mangadex.org/covers/26c145b9-c02f-45b9-ac51-2afd64b60543/ae4558fb-a194-4446-9bb7-a49035b7bb20.jpg.256.jpg","country":"German","stat":"7.98","status":"Completed","tags":["Action,Zombies"],"nutshell":""},{"name":" Ultra Maniac","avatar":"https://mangadex.org/covers/26c56454-5aca-43e7-bfcc-ae539cdd871d/728bafa1-092d-46e0-aebf-7083387aadf3.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Comedy,Magic,School Life,Fantasy,Supernatural"],"nutshell":"At first glance, Nina Sakura seems like a typical teenage girl. However, she's actually a transfer student from a witch school! Now enrolled in a Japanese middle school, Nina is hoping to improve her grades, make some friends, and practice love spells on her unsuspecting new classmates. Shy Ayu Tateishi has just made a new friend at school. But this new friend, much to her surprise, is no ordinary classmate. Nina Sakura may look like a normal middle school girl, but she's got a big secret. She's a witch. Or, rather, she's studying to be a witch. And apparently, she's not doing her homework. Her spells are devastating in their ineffectiveness and often result in the most embarrassing situations for poor Ayu. But things wouldn't be so bad if Nina's sorcery didn't make Ayu look silly in front of the one boy she secretly adores. All she wants is a simple love potion. What she gets, however, is a new best friend who almost flunked out of witch school!"},{"name":" Kageroi","avatar":"https://mangadex.org/covers/26c65400-1912-4162-89ab-d08dd7b32623/e9d99184-34a8-4e28-b0b2-ee1f63548a98.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Historical,Action,Slice of Life"],"nutshell":"In the year 1587, the Tokugawa clan is vigilantly looking for a way to destroy Toyotomi Hideyoshi. Hideyoshi depends on the resourceful, intelligent samurai Sanada Yukimura to help him protect his people and foil the plots of his enemies. He has also assigned the loud-mouthed, impetuous shinobi Sarutobi Sasuke to work with Sanada, to their mutual annoyance. Though they may hate each other, they're going to have to work together for Hideyoshi's sake!"},{"name":" Kyoukoku no Recuerdo","avatar":"https://mangadex.org/covers/26c6bf0d-036e-4bf8-b336-edf13f93dd1d/c323cab0-71cf-4197-b785-af5c066d3e10.jpg.256.jpg","country":"Japanese","stat":"8.50","status":"Completed","tags":["Monsters,Action,Magic,Drama,Fantasy,Tragedy"],"nutshell":"The story of the friendship between Arsenio, a young man who wants to become an armsmith, and Sauro, a young soldier who wants to become a knight, and its subsequent ruin.\nLa historia sobre la amistad entre Arsenio, el hijo de un herrero que anhela convertirse en Artímago; y Sauro, un joven aspirante a caballero; y la desgracia que les prosigue…"},{"name":" Mahou Shoujo Madoka★Magica - You can't catch me Like a Star Blooming in Darkness (Doujinshi)","avatar":"https://mangadex.org/covers/26c9d18c-7061-4871-8649-6e2acef609b6/fa944937-f695-4828-86cd-8a3e5fe77ff5.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Oneshot,Girls' Love,Drama,Supernatural"],"nutshell":""},{"name":" Mahou Shoujo Lyrical Nanoha Movie 1st the Comics","avatar":"https://mangadex.org/covers/26cc27fa-b394-4ac1-86d8-df9a675de2fb/cae710d5-23d6-4c09-8cba-8ca72517e93d.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Action,Drama,Fantasy"],"nutshell":"Manga adaptation of Magical Girl Lyrical Nanoha MOVIE 1st."},{"name":" Smash Bomber","avatar":"https://mangadex.org/covers/26d4abc7-8fb6-4b38-b7d7-b2e148800d2a/add0dee7-38ec-4746-b06e-8929bcb2cbea.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Action,Comedy,Adventure,Fantasy"],"nutshell":"Binta Yugawara is a \"Bodz\" or Bomber Kid, in the city of Atamu, who dreams of defeating his hero, Smash Kintaro. While in the city, he battles using a pog like game system, against several other Bodz, including Banji Chihara, BJ, and a man by the code name, \"X.\"\nHiroyuki Takei (of Shaman King fame), is the supervisor for this series. All artwork is officially drawn by Kato Gaito, who later helped assist Takei with \"Jyuki Ningen Jumbor.\"\nThe series was canceled after 3 chapters and never met the intended 197 pages announced in the first chapter. Neither Shueisha nor Takei have ever officially mentioned this series since it was canceled."},{"name":" Veins","avatar":"https://mangadex.org/covers/26d87c5e-18fc-4240-932a-33c6485222f1/fe8391c7-0221-4654-8807-2937d8142540.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Psychological,Romance,Comedy,Drama"],"nutshell":"This is a strange love story about a genius who is unable to erase his memories and an average girl.\nMika, an average female high-school student, falls head over heels for her beautiful violin teacher, Akizuki, who has the uncanny ability of \"never forgetting something he's remembered once.\"\nIncludes other works:\n\nLion\nRoom 1/4 - Penniless Cinderella"},{"name":" Uta no☆Prince-sama♪ - Answer Me This (Doujinshi)","avatar":"https://mangadex.org/covers/26dbe106-7dd2-48f5-abc4-56ead53ba42b/9a37d8a6-82af-45da-bd50-877c29aee32f.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":"Pairing: Tokiya x Otoya"},{"name":" Touhou - Amaoto ni Majiru, (Doujinshi)","avatar":"https://mangadex.org/covers/26dc9a88-6584-4154-9772-5b2587c5dcb1/68b998aa-5a4f-4098-a098-119ef27ce1ab.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Oneshot,Girls' Love,Drama"],"nutshell":"A Marisa x Reimu doujin."},{"name":" Ouji-sama wa Kudokibeta","avatar":"https://mangadex.org/covers/26dcdbe4-0442-40a6-aa4e-08218fe7459c/6d792142-cb87-43d1-8be4-0f8a09c2d0ae.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Boys' Love,School Life"],"nutshell":""},{"name":" Vampire Doll: Guilt-na-Zan","avatar":"https://mangadex.org/covers/26e0dfa5-2754-4ce0-9e1e-e5a5bb115d78/3108fbbd-9ad4-4cc3-b02e-b95a5d07a29e.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Ongoing","tags":["Reincarnation,Genderswap,Comedy,Vampires,Supernatural"],"nutshell":"Guilt-Na-Zan is a vampire aristocrat who was sealed into a cross by Kyouji's ancestor more than 100 years ago. Now Kyouji has revived him–although his soul was resurrected into a cute female doll and can only transform into his real figure when he sucks blood from Kyouji's sister Tonae. But when you combine Goth clothes and hot vampires, slowly but surely everyone will start to feel like one big family!"}]