[{"name":" Shanimuni Go","avatar":"https://mangadex.org/covers/0a734397-0776-4b20-a88d-ffea98b7a010/5bbdbe20-5493-4d87-b193-c494077e5965.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Romance,Comedy,Sports,Drama,School Life"],"nutshell":"Ide Nobuhisa has always been a boy full of vitality and a young promise in the field of track running. However one day after a competition, he stumbled over the prettiest pair of legs he had ever seen! Their owner, a young girl practicing tennis makes a promise with Ide that she will teach him how to play. After seeing the name tag on her racket bag, Ide puts all his efforts into passing the test for accessing the same high school she goes to, Makunogama.\nIn his first days in his new high school, Ide discovers two things: an old friend of his is also attending, and nobody knows of a girl with the name he saw on the tag! He and his friend join the school tennis club, where they meet another first year, Takita Louis (Ruui), a very good tennis player with a little of an attitude problem.\nHowever things start to look better for Ide when his dear missing girl appears in the school! As it happens, he misread her name on the tag… Takada Hinako was well known as one of the members of the tennis club, but some time after meeting Ide for the first time she suffered an accident and has now lost the use of her left leg. Hinako is no longer a happy spirited girl and tells Ide she can't fullfill her promise.\nEventually the opposite characters of Louis and Ide end up confronting each other in a tennis match. Ide is an incredible fast learner, but he is no match… until Hinako decides to give him advice. Things only get worse, however, when their club president decides to put Louis and Ide as a doubles pair for the upcoming inter-high-school tournament!"},{"name":" A Contract Marriage Our Bodies Love ~ No Divorcing Tonight ~","avatar":"https://mangadex.org/covers/0a81fd13-e501-4945-8c88-d10d9d2525b2/8057f2e4-67c6-4e48-8792-af461e20b1b1.png.256.jpg","country":"Japanese","stat":"7.91","status":"Ongoing","tags":["Long Strip"],"nutshell":"\"We're still married tonight though?\" It's the night before our divorce, but he fills me up completely... Could it be that we're the most physically compatible...!?"},{"name":" King's Favor","avatar":"https://mangadex.org/covers/0a82f99a-9f55-4f51-b8a4-4960fe4ee98f/889ead93-e5b5-47c0-8882-142b618e2a0c.jpg.256.jpg","country":"Korean","stat":"7.95","status":"Completed","tags":["Historical,Long Strip,Romance,Isekai,Drama,Web Comic,Supernatural,Full Color"],"nutshell":"After getting into a car accident, Seungeun gets transported into another world. An empress from that world asks of him, “Won’t you be my concubine?” Seungeun bewilderingly replies, \"… Huh? But I’m a man?” Who is this mysterious woman, why are emoticons popping up on her head? Will he be able to return home safely?\n\nOfficial French Translation / Français"},{"name":" When You Are Asleep","avatar":"https://mangadex.org/covers/0a8e780c-f02e-4646-a29f-d25bbaeaa4d9/4cff68a7-5f9a-49c9-83ad-8d3ee666e4bb.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.88","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Drama,Fantasy,Full Color"],"nutshell":"The people you want to meet are only found in dreams. Cen Lin, who was plagued by nightmares, met the mysterious \"him\" in a dream by chance and started a wonderful journey of dream exploration. However, the person in the dream only exists in the dream, and after waking up, Cen Lin can't help but fall into confusion..."},{"name":" Lader Tournament","avatar":"https://mangadex.org/covers/0a8f7394-7754-4a29-a75f-b26fb324c4c6/8143afba-2cbe-4117-a31d-0bb86eb5d3ba.jpg.256.jpg","country":"Korean","stat":"7.80","status":"Ongoing","tags":["Sci-Fi,Action,Drama,Fantasy,Full Color"],"nutshell":"Myeong –Woo, also known as Caesar or Reaper, is the top dog on a VR game called Ladder Tournament. Never beaten before, we is defeated, by Park JunHee nicknamed Brutus, at the Final battle and accused of a crime that destroys his gaming carrier. He is up to regain his post as the top ranking and his reputation!"},{"name":" One Strike God-Annihilating Holy Maiden ~The Holy Maiden continues her legend after 5000 Years of sleep~","avatar":"https://mangadex.org/covers/0a9a6c88-ec3f-40c4-8472-962ee5ce9694/b50ee8b9-2554-4c59-866d-2ea87d96cbb9.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Ongoing","tags":["Comedy,Post-Apocalyptic,Isekai,Fantasy,Adaptation"],"nutshell":"Saint Nilma. The hero who butt into the Great God Annihilation War between the gods and slayed all opposition. However, due to the Great War, humanity is all but extinct, and so she chose to sleep in the hopes that humanity will be able to rebuild in the future. Fast-forward 5000 years later: Nilma has awoken but the world is a very different place! Aggressors are invading from Another World, \"adventurer\" is now a job, and clergy-people are ridiculed for only being able to use shobby Recovery Magic. This story is about how the strongest, invincible Holy Maiden makes her name known as the strongest once again in this world that has changed so much it might as well be another world!\n(source: https://futabanet.jp/list/monster/work/5e046f657765615b0e000000)"},{"name":" The Undetectable Strongest Job: Rule Breaker","avatar":"https://mangadex.org/covers/0a9b4835-032a-472b-b807-7e0950056536/152e94ba-c9e1-4937-9cbc-7c263f4bf3fe.jpg.256.jpg","country":"Japanese","stat":"7.48","status":"Ongoing","tags":["Action,Romance,Adventure,Harem,Isekai,Fantasy"],"nutshell":"By some ill fortune, Hikaru died in a traffic accident. He was in heaven standing in line, waiting to be judged, when he took an unexpected request to transfer his soul to a person in another world. He received an ability called Soul Board which he could use to allocate points to Skills to make himself more powerful. But there was a catch…「I want you to kill someone for me within an hour. If you don’t, I’ll destroy your soul.」To pull off the task assigned to him, he poured all his available points to the Stealth skill tree.\nThis is a story of a boy who specialized in Stealth. With his skill trees as weapons, he would demonstrate his unrivaled strength in another world."},{"name":" Kaitou Joker","avatar":"https://mangadex.org/covers/0a9d24be-7f8f-4238-adb6-8bd0a89c064c/42b995dd-059b-46fe-b8be-c2ff9b6a279b.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Award Winning,Sci-Fi,Action,Comedy,Adventure"],"nutshell":"Traveling all over the world seeking treasure and attention, there's nothing that the flashy phantom thief Joker can't steal! Using his incredible ability to predict and calculate, as well as a few gadgets, Joker always makes a miraculous escape, no matter how dire the pinch he finds himself in.\nEach chapter of this action comedy manga features Joker and his sidekick Hachi pulling off a caper in a different geographical location.\nNote: Winner of the 58th Shogakukan Manga Award (2013) in the children's manga category.\nThe following are links to AnimeNewsNetwork for the anime:\nSeason 1\nSeason 2\nSeason 3\nSeason 4\nWikipedia\n\nChinese (Traditional)\nEnglish\nFrench\nJapanese\nKorean\nPortuguese\nVietnamese"},{"name":" Best Actors: Take-Two","avatar":"https://mangadex.org/covers/0aa272e7-a6e7-47f1-931b-d863120fe9bb/6fb25b7e-a66b-4d93-92e2-24d1f20b8d95.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.00","status":"Completed","tags":["Reincarnation,Romance,Comedy,Boys' Love,Drama,Web Comic"],"nutshell":"The Golden Horse Award winner for best actor, Yuan Mu, was murdered but his soul was trapped in a young and handsome body. The place of rebirth unexpectedly is the bed of his enemy, Huo Yi! And Huo Yi is his breadwinner?! While dealing with this fickle breadwinner, he is also trying to take down the man who killed him. Spending time with Huo Yi, Yuan Mu seems to have gradually fallen in love with the man he once hated the most?"},{"name":" Obutsu wa Shoudoku desu","avatar":"https://mangadex.org/covers/0aa3baca-9aaf-4dab-a728-d89f576e5a6c/cb38df76-4ad4-422a-94a6-3008db275d01.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Slice of Life"],"nutshell":""},{"name":" General, Watch Out For The Mad Dog!","avatar":"https://mangadex.org/covers/0aa650e2-bfcd-4fc5-aa52-272e10ce9695/909c5b03-ae37-48a2-bf2d-dc8afaab424e.png.256.jpg","country":"Chinese (Simplified)","stat":"8.08","status":"Ongoing","tags":["Historical,Action,Romance,Boys' Love,Martial Arts,Drama,Fantasy,Web Comic"],"nutshell":"In order to prove that he has more than just beauty, the General strictly runs the army and bravely fights battles to maintain the peace of the Human and Immortal Realms. This time, the “monster” causing chaos was actually the Spiritual Realm’s Heavenly Wolf and the rare Spiritual Clan was also participating in the chaos. As a prisoner of war, the Heavenly Wolf had a frivolous attitude and no remorse, leaving the beautiful General to feel disdainful! The Heavenly Wolf originally wanted to teach the General a lesson, but was captured by his beauty and gave him a bite mark?! For the best of the people, the General had no choice but to keep the prisoner by his side... Before the people is a master and servant relationship, but behind the scenes the roles are reversed?"},{"name":" HaTsuKoi LOGIC","avatar":"https://mangadex.org/covers/0aa6610d-f78d-40fb-9ccc-25fe724dae42/f5961135-8b2d-4059-bda7-477ead97321f.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Romance,Drama"],"nutshell":"马上就是比我大一岁的男朋友的生日了。\n他今年想要的生日礼物竟然是童贞毕业？"},{"name":" Persona 5 - A la Carte Anthology","avatar":"https://mangadex.org/covers/0ab31ee8-ce34-4d51-91fc-e065ab84f9f9/7dad4b87-6e4e-4c70-902d-587f1b142e8a.jpg.256.jpg","country":"Japanese","stat":"8.32","status":"Completed","tags":["Thriller,Monsters,Action,Demons,Psychological,Animals,Romance,Comedy,Anthology,Video Games,Philosophical,Drama,School Life,Slice of Life,Supernatural,Mystery,Adaptation,Tragedy"],"nutshell":"Collection of various stories based on the Persona 5 video game."},{"name":" WANTE-D","avatar":"https://mangadex.org/covers/0aba3597-649b-4663-96f0-700a464ad104/96965e80-d5b0-4134-998a-752cdf4933a9.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,School Life"],"nutshell":"Tori Ichihashi, a 10th grade student, has a strong sense of justice, and hates bad guys. Every night, burglars hover around the school that Tori attends. Tori can't let it go unchallenged."},{"name":" I Became the Housekeeper of the Bachelors' Barracks of the Kingdom's Knights","avatar":"https://mangadex.org/covers/0aba9c27-58df-4b3e-8967-302535775907/022046e6-7fb7-4f61-a1af-85a62417bb9b.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Ongoing","tags":["Time Travel,Historical,Romance,Reverse Harem,Isekai,Drama,Fantasy,Slice of Life,Adaptation"],"nutshell":"The 30-year-old Suzuhara Azusa traveled to another world on the way home from overtime work! When it was in dangerous, shining beautiful knights appeared on the stage, and she was treated like a \"princesses\". The 30-year-old white-collar worker who is obviously interested in saving money is actually doted by these perfect knight and handsome prince! ?"},{"name":" Koiiro Soft Focus","avatar":"https://mangadex.org/covers/0ac3ba05-34ac-41f5-ae49-99f5f92638c9/226f6893-b097-4930-8888-ae8486ae4ff7.png.256.jpg","country":"Japanese","stat":"8.21","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life,Slice of Life"],"nutshell":"Otomo Hisashi tries to seduce Mao after reading some BL stories brought to the drama club by Ichikawa."},{"name":" Just the way you are (GL)","avatar":"https://mangadex.org/covers/0ac5aa9a-7d81-40c5-884b-595e977ebe64/29058cca-8ff2-4cda-ad04-99ff805f7963.jpg.256.jpg","country":"English","stat":"7.50","status":"Ongoing","tags":["Girls' Love"],"nutshell":"They are two completely different girls. Lee Ha Na is an idol. She’s rich. She’s beautiful. She’s famous. But she wants to die. Park Ye Rim is a nobody. She’s broken. She’s brilliant. She’s unknown. But all she wants is a chance at life. The two girls are opposites, but opposites do attract"},{"name":" Demon Slayer","avatar":"https://mangadex.org/covers/0acb51ef-3d71-4993-81a0-8cbcfb88fa9e/92213ffe-51af-4d18-b0b9-eb3b91592028.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.00","status":"Ongoing","tags":["Action,Martial Arts,Horror,Supernatural,Mystery"],"nutshell":"\"Demon catching\" means catching the demons, and it not only fights with people but also fights with evil spirits. In the first year of the Northern Song Dynasty, in the prosperous city of Beijing, the countries were lurking. A list of the city’s alleys was stolen and a list of the city’s alleys were stolen and a murder case led to a battle of conspiracy and killing."},{"name":" The Class President's Circumstances","avatar":"https://mangadex.org/covers/0acb9ae2-3061-4d35-a2ee-2e414fc6547e/bbbcc232-a9f8-4882-898c-12ef2a7e9496.png.256.jpg","country":"Japanese","stat":"7.51","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life,Slice of Life"],"nutshell":"The class president has a crush on Takahashi! Now, she just needs to gather enough courage to talk to him… Huh? Why is she stripping all of a sudden?! A short comedic slice of life."},{"name":" Brave Frontier: Vargas Chronicles","avatar":"https://mangadex.org/covers/0acbc18e-b320-4123-a360-9e8a9a139743/ad5775df-5ced-4659-956d-eb9a6ac53162.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Action,Comedy,Adventure,Fantasy"],"nutshell":"This manga follows the flame swordsman Vargas in his younger days before he became one of the Six Heroes. He aspires to become the strongest swordsman in Grand Gaia and become a legend. See a different side of the heroes of old through this exciting adventure!\nBased on the mobile RPG game Brave Frontier. Original serialized in Dengeki Bazooka."},{"name":" Imasokari","avatar":"https://mangadex.org/covers/0acd0774-95af-4c53-bdde-eee11c23923d/79c8e6a2-c975-412b-99c5-b40be9d12f9d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Slice of Life,Supernatural"],"nutshell":"八百万（やおよろず）の神様が「見える」女子高生、社会人になりました。『ありをりはべり』待望の続編、恋愛成分多めで開幕――！　地元の美術館で働く棗（なつめ・20歳）は、八百万の神様が「見える」女子。彼氏の須佐（すさ）は、神主の資格を取るために東京の大学に通っている。遠距離恋愛のもどかしさを感じつつ仕事に奮闘していたが、初恋の人・井出（いで）と数年ぶりに再会して……!?"},{"name":" The Legend Of Mikazuchi","avatar":"https://mangadex.org/covers/0aced039-0827-457e-a179-17514d0b6adf/f546f982-eb92-4a3a-9720-7c1dacce9dbc.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Action,Demons,Samurai,Magic,Fantasy"],"nutshell":"On a remote island Mikazuchi is training to become a swordmaster. He dreams of visiting the outside world where he can meet girls. He grew up with Honoka who holds complicated feelings about Mikazuchi. This small island is protected by the divine gods and receives no visitors. The only things that ever happen are small quarrels between Mikazuchi and Honoka.\nThese peaceful days are shattered when Saya, a mysterious beautiful young woman, is washed upon the shore! The seal of the Yaoyorozu gods has been broken and a group of deformed monsters emerge. Honoka's parents prove powerless before the demons and are killed. Even the holy sword bestowed by the gods to protect the island since ancient times loses its divine powers and splits into two. Now they are faced with absolute danger!\nThen, Saya's sacred powers save them. The holy madonna Saya's blessings bestowed through a kiss brings about a Western sword that can destroy horrible monsters instantly. Mikazuchi begins his tumultuous journey carrying the holy sword.\nThe story is set in Japan's Edo period, taking us through a whirlpool of conspiracy. The worlds of mythology and legend are interwoven into this definitive romantic action comic. With the slash of the two swords, one divine and one holy, a fascinating, neo-historical romance filled with mystery and surprises unfolds."},{"name":" Love Capsule","avatar":"https://mangadex.org/covers/0acff0c7-3ed9-4ead-b606-6bc9b7173a7a/2df5ad87-bbf0-4475-80b2-a73d177e7cf3.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance"],"nutshell":"\"We communicate with our lips touching one another. But once they touch, we're unable to stop.\""},{"name":" Urekko Model to Kaseifu-san","avatar":"https://mangadex.org/covers/0ad13746-1d8d-4c83-bf96-e296c6f765a3/31704e53-e97c-40bb-bc72-2b0a3ad40753.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,4-Koma,Web Comic,Slice of Life,Full Color"],"nutshell":"Charismatic Model Iori Butler lost his heart to a plain and unnoticeable housekeeper, Usui Kaoru. He began trying approaches to catch his attention, but——?\nOther Raw"},{"name":" Splatoon 2 - Off The Hook Collection (Doujinshi)","avatar":"https://mangadex.org/covers/0ad3f722-e9cc-404e-b2a4-d09849d82ef3/86130ff1-7bec-4c7b-ae1e-a980de9d5a0f.jpg.256.jpg","country":"Japanese","stat":"7.62","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":"Links:\n\nAuthor's Pixiv\nAuthor's Twitter"},{"name":" Natsu no Zangai","avatar":"https://mangadex.org/covers/0ad41966-9c35-426e-a852-13dacc91408b/e5580e17-8cb3-417d-90c9-550be47787aa.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Ongoing","tags":["Drama,School Life"],"nutshell":"Collection of short stories.\nRuins of Summer:\nThere are some things that I can’t understand since I’m a child. So, I’m going to try my best to find someone who can show me how to become an adult."},{"name":" Hanatare Gakuen","avatar":"https://mangadex.org/covers/0ad70e07-4755-4cbc-bbb7-2ffca80d781d/f2b599c7-9ff1-4a23-ba5b-d1079a603a64.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":""},{"name":" Perfect Blend","avatar":"https://mangadex.org/covers/0ae4ddd3-81dd-4dd2-92af-106734569938/fd423a83-46fb-4187-bc50-a6afcf186faa.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.89","status":"Completed","tags":["Boys' Love,Cooking,Full Color"],"nutshell":"Coffee is a cash crop, too bad Declan doesn’t have any money. Terribly in debt, he plans to sell his family’s countryside coffee plantation. His father agrees…if he can master the trifecta of coffee: bean variety, brewing technique, and latte art. He has a month to make the perfect blend and Liam, the cool, attractive, barista will teach him. How do you like your coffee? At The Cat’s Meowcchiato, it’s always hot."},{"name":" Strawberry Syrup","avatar":"https://mangadex.org/covers/0ae578ee-22e5-4e10-9160-f1d8495346a7/b760e6ad-5f8f-4d28-baa4-8cb6e3c0b385.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Ongoing","tags":["Comedy,Girls' Love,Web Comic,Slice of Life,Full Color"],"nutshell":""},{"name":" Travel to Tang Dynasty","avatar":"https://mangadex.org/covers/0ae64856-89ec-41ab-8159-ff7760036052/e936531a-60da-4858-8b0d-555b65330b5e.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.64","status":"Ongoing","tags":["Reincarnation,Historical,Action,Long Strip,Ninja,Comedy,Martial Arts,Adventure,Harem,Wuxia,Isekai"],"nutshell":"One representative of the king's special forces, to protect the country's treasures, he was struck by thunder and sent to the early days of the Tang Dynasty. In this strange and ever changing era, he will fulfil all modern human dreams with a sincere heart: beautiful princesses, shui queens, loli, beautiful harem ladies!"},{"name":" Mimi Tsuki no Kuro","avatar":"https://mangadex.org/covers/0aeca63b-d14e-4542-ba3b-087da137d338/60fbf1da-db54-4543-9403-125050e2d8e6.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Fantasy"],"nutshell":""},{"name":" Tsuki ni Tsubame to Migi ni Kage","avatar":"https://mangadex.org/covers/0af7d879-daa7-44db-8b83-5d1e973b7db4/b773b49c-4054-430f-9ec8-71f7cadefe9f.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":[""],"nutshell":""}]