[{"name":" Reira","avatar":"https://mangadex.org/covers/630dd48e-9b6e-44d8-83b9-296d8c68feed/66f35f4f-3bef-4b2f-b966-a21f7bb9c997.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Comedy,Girls' Love,Drama"],"nutshell":"The story of the aspiring dominatrix Miyuki Wada aka Reira who entered a competition to become Queen of S&M"},{"name":" Villainess in Love","avatar":"https://mangadex.org/covers/6315a033-2f68-472c-86dd-dab446b2371d/3244d560-051e-489b-92f0-2a429ba5237a.jpg.256.jpg","country":"Korean","stat":"8.79","status":"Completed","tags":["Long Strip,Romance,Comedy,Magic,Isekai,Drama,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"So I’ve become Yunifer Magnolia, the villainess who’s crazed with jealousy that Duke Ishid Lucrenze, the devastatingly handsome hero, has eyes only for Raelle, Yunifer’s best friend. Yunifer torments Raelle so much that Yunifer’s killed off at the end. But... I’M Yunifer now. UGH! Good news is, I’ve reincarnated a year before her tragic end, so there’s time to make sure Ishid and Raelle have a fairy tale ending (and I stay alive). Bad news is, I got drunk and woke up with Ishid next to me. Crap.\n\nOfficial Translations:\n\nChinese (Traditional) / 漢語\nChinese (Simplified) / 汉语: Was on AC.QQ, but was taken down.\nIndonesian / Bahasa Indonesia\nJapanese / 日本語\nThai / ภาษาไทย"},{"name":" Gal no Haigo ni Rei ga Iru","avatar":"https://mangadex.org/covers/6316eac8-53cc-4ac8-bc6b-7c5e229ac607/89c8dcee-834d-44b4-8512-52d9a4424e87.jpg.256.jpg","country":"Japanese","stat":"8.56","status":"Completed","tags":["Ghosts,Comedy,Slice of Life,Supernatural,Gyaru"],"nutshell":"A girl notices something lurking behind her friend."},{"name":" Love Sick","avatar":"https://mangadex.org/covers/631e3820-770f-41d8-bf9e-67d5fb92016b/6da22e5a-bacf-4d66-93f3-6421a02ec02f.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Completed","tags":["Psychological,Romance,Reverse Harem,Crossdressing,Drama,School Life"],"nutshell":"Shiki threw everything away for the sake of revenge. But at the new school where she disguises herself as a male, she meets 4 popular rich guys… Haru (spring) the prince, Natsu (summer) the bishounen, Aki (autumn) the womanizer, and Fuyu (winter) the cold-hearted genius.\nWhat awaits Shiki? And will she get her revenge…?"},{"name":" Metal Heart","avatar":"https://mangadex.org/covers/631f17a1-4ef9-4204-8cf8-cae5391ecca3/fa536233-e783-450d-9bc1-6cfae5cb127c.jpg.256.jpg","country":"Korean","stat":"7.95","status":"Completed","tags":["Romance,Comedy,Harem"],"nutshell":"Meet Min Woo. A normal 18 year-old high school boy. Well… normal except for being a total otaku. He does what every good little otaku boy does. He collects figurines and toys, wins prizes at cosplay contests and is a two-time champion of the fighting game \"Metal Heart\". Unfortunately for him, his social life is dominated by girls telling him to get lost, since his otaku-ness might be contagious.\nBut after an accident while he is invited to participate in the playtesting of \"Metal Heart 2\", the main character to the game, Min Sia, materializes in front of his eyes at a cosplay festival. And now, Min Woo has to win Sia's heart in a real-life dating sim game with the fate of the world in the balance. Ok, so maybe not the world, but at least the fate of the company behind \"Metal Heart 2\" hanging in the balance.\nAnd who is this girl, Nuri, who appears to be following Sia and claims to be Min Woo's childhood friend…?"},{"name":" Magical JxR","avatar":"https://mangadex.org/covers/631f3306-9045-4611-aed7-87b46f6b9727/9ae42415-1b58-4ce0-83af-2724b24345b8.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Completed","tags":["Romance,Comedy,Drama,Fantasy,Supernatural"],"nutshell":"Magical JxR tells the story of two teenager wizards and the young girl they befriend: Jay and Aru are two of the most popular students in wizardry school. However, before they can graduate, they must venture out into the REAL world and fulfill a one year magic contract with a human girl named Cho-Ah. Is Cho-Ah ready for a whole year with two enthusiastic wizards-to-be at her beck and call?"},{"name":" Love or Pride","avatar":"https://mangadex.org/covers/63241664-f5e9-4c66-8df8-1528bd2715cf/a2073af1-59be-430a-a567-5debebd24566.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"As the son of a yakuza, Taiki was investigating a shop when he accidentally stumbled upon a young man giving the assistant manager a blowjob. The next day, he saw that young man, Yukiya, again. Yukiya begged Taiki not to tell anyone about what he saw and Taiki jokingly asked for Yukiya's body as payment. But he discovers unexpectedly that he's Yukiya's first man! Included in this manga is a sweet extra about Taiki and Yukiya when they've grown up."},{"name":" Heisei Umare 3","avatar":"https://mangadex.org/covers/63325f26-9dba-4f5b-be5c-de87e4085a5f/9ea2b40e-9103-4f90-b7fd-0148d82114d8.png.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Comedy,4-Koma,Slice of Life"],"nutshell":"High school girls' everyday surreal life. Three."},{"name":" Yubisaki Milk Tea","avatar":"https://mangadex.org/covers/633b7348-dd8f-402e-93fe-b0627356176a/b50fb21e-1746-415b-b627-bb36e1a6286f.jpg.256.jpg","country":"Japanese","stat":"7.63","status":"Completed","tags":["Romance,Comedy,Crossdressing,Drama"],"nutshell":"Through a series of coincidences, Yoshinori wound up having to fill in for his beautiful older sister as a model for a bridal gown. Now, he has discovered that he has a liking for cross-dressing, and that by doing so, he is learning a great deal about what it means to be a woman–and a man."},{"name":" Chrome Shelled Regios","avatar":"https://mangadex.org/covers/6343ad5c-a8b9-4815-ac83-65fdb24336d6/5fef54a6-70a8-4fa2-92bf-29061dc6359c.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Action,Adventure,Drama,School Life,Fantasy,Mystery"],"nutshell":"In this school fantasy story set in the distant future, creatures contaminated by pollution have overtaken the land, forcing humanity to live in isolated mobile cities called Regios. One such city named Zuellni is a self-contained school in which freshman Layfon Alseif has just enrolled. Layfon reluctantly joins the 17th Martial Arts Studies Unit led by the third-year student Nina Antalk and embarks on a series of adventures.\nIt is an original side story that focuses more on Nina"},{"name":" Dinner no Ato ha Otona no Jikan","avatar":"https://mangadex.org/covers/6346830b-005e-4bc4-9e93-482219270664/c7f9d293-43f7-45b6-bb48-3c639c91ba16.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Oneshot,Romance,Drama"],"nutshell":""},{"name":" Blue Archive! (Global)","avatar":"https://mangadex.org/covers/6348a562-067b-45cb-ab2b-c6f33f0e7ead/4ee5d1ff-0417-476e-ab7e-29b44f8f086f.jpg.256.jpg","country":"Korean","stat":"7.99","status":"Ongoing","tags":["Comedy,4-Koma,School Life,Web Comic,Adaptation,Full Color"],"nutshell":"Blue Archive GLB's official 4-Koma, featuring snippets of the daily occurrences in Kivotos!\nFor the Official English and Korean versions, you can find them on the respective server's Twitter account.\nThe series is titled (Global) to differentiate it from the Japanese 4-Koma.\n\nLinks:\n\nBlue Archive EN's Twitter\nBlue Archive KR's Twitter\nJP Server's 4-Koma"},{"name":" Wakeari Madoushi wa Shizuka ni Kurashitai","avatar":"https://mangadex.org/covers/63495920-6c44-457a-8353-b9e6fa4454cc/d8032450-f647-4d76-8457-b7fa840c49c0.jpg.256.jpg","country":"Japanese","stat":"7.14","status":"Completed","tags":["Comedy,Crossdressing,Magic,Fantasy,Adaptation"],"nutshell":"In a world where only men can use magic, Eco can use magic despite being a woman. Even though she was living while trying to hide her power, her magic might be exposed. Then, her cousin suggests \"work at the Magic Bureau in my stead.\" Eco decides to dress as a man and work as a mage. However, when she arrives, there are strange colleagues and incidents. Her life is full of trouble!? A fantasy story about a magician with special circumstances and a job full of troubles, adapted into a comic!"},{"name":" Kagamigami","avatar":"https://mangadex.org/covers/634d0c50-cd12-4016-9437-d5fb48c1f535/3c385c12-04fe-4988-a81a-00dfa32e175b.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Action,Psychological,Romance,Comedy,Adventure,Supernatural,Mystery,Tragedy"],"nutshell":"The new series by the author of Psyren … A serial killer is on the loose and authorities are baffled! What they do not know is that this case requires non-traditional research methods. That's where Mako Miyoshi a detective extraordinary particular, and Kyosuke Kagami a Shikigami user, enter the picture. Together they investigate the supernatural crimes …\nIncluded one-shots:\n\nVolume 4: Sakuran (Kari) (さくらん（仮）)\nVolume 5: Shikigami Twilight Days (式神トワイライトデイズ, pilot)\n\nAs a part of the JUMP START initiative, the first three chapters of Kagamigami were published in English in VIZ Media's digital Weekly Shonen Jump."},{"name":" Cardcaptor Sakura - Sakura Sakura (Doujinshi)","avatar":"https://mangadex.org/covers/63539b18-97ad-4fc4-8ba0-bb925ac995cb/3a56cde8-4210-4c58-a43d-64445de4b781.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Romance,Comedy"],"nutshell":""},{"name":" Love Live! - Kimi to Futari (Doujinshi)","avatar":"https://mangadex.org/covers/63591cc5-4a35-44e6-aa00-fe05ca2c3810/75ff53be-5619-4fdc-8737-76ba882d52ae.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":""},{"name":" God Summoner","avatar":"https://mangadex.org/covers/635b2d4c-0e51-4822-9373-3506001de016/503d7727-37ed-40a6-89d5-2d11173c216e.jpg.256.jpg","country":"English","stat":"7.95","status":"Ongoing","tags":["Historical,Action,Demons,Adventure,User Created,Post-Apocalyptic,Isekai,Fantasy,Villainess,Supernatural,Mystery"],"nutshell":"When the Old Gods of a parallel world mysteriously vanish, its people struggle to survive in a land ravaged by civil wars. Now, the tyrant of this world is in search of Adelice Belmont, a girl rumored to possess the powers of a God Summoner. An inevitable clash of worlds begins.\nPreviously on Kickstarter: https://www.kickstarter.com/projects/dionysis/god-summoner-1-2-comics-about-magic-guns-and-inquisitors"},{"name":" GetMarry","avatar":"https://mangadex.org/covers/635c0170-3ed9-4183-8d90-6f578315d3de/052bdca2-a3f3-4550-ab80-3b1c1b8476b5.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Action,Romance,Comedy,Crime,Adventure"],"nutshell":""},{"name":" Kowai Hon: Scary Book","avatar":"https://mangadex.org/covers/635cc5a0-7451-4cbd-9546-0988887cf26f/2a801cdd-cbe1-4560-a096-b0c2ec2731fa.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Samurai,Horror"],"nutshell":"The spine-chilling influence of Japanese horror cinema has taken hold in Western audiences with hit films like The Ring that are based on Japanese films adapted from classic manga stories. And the master of horror manga is Umezu Kazuo-known as the \"Stephen King of Japan,\" with several of his stories being adapted to film-and Dark Horse Manga is proud to bring his Scary Book horror anthology to Western readers for the first time. This first volume, Reflections, presents two feature-length tales of terror. In \"Mirror,\" a narcissistic girl's reflection begins to take mean-spirited command of her life; and in \"Demon's Revenge,\" a sadistic samurai master bent on seeking retribution for his son's injuries finds the tables of vengeance turned against him."},{"name":" Chains","avatar":"https://mangadex.org/covers/635f2e8a-94bb-4ff0-a9de-cd960e215b41/9e854515-6a74-4583-87d5-953247b12df0.png.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Oneshot"],"nutshell":""},{"name":" I'll Resign and Have a Fresh Start in This World","avatar":"https://mangadex.org/covers/63605dd2-d8ca-4ff2-967f-9fc33d1dbd6f/d89b52b8-a94c-4d17-9ff4-d55fff25e3a2.png.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Comedy,Adventure,Isekai,Drama,Fantasy,Web Comic,Slice of Life,Cooking,Full Color"],"nutshell":"The main character, Cho Isu, lived an ordinary but happy life.\nFive years ago, he suddenly loses his parents, and becomes a devastated man, as he struggles every day.\nWhen he was exhausted from the suffocating daily life, a portal opened in the room. A place he has never been to, a place he doesn’t know what might be.\nA healing life to enjoy in a different world starting as a commoner and turning into a feudal lord."},{"name":" Amanza","avatar":"https://mangadex.org/covers/63615e7d-0a26-40b4-b664-937ea902c4a9/e4168c3d-50c3-4674-beeb-e39e16a7f3fb.jpg.256.jpg","country":"Korean","stat":"8.00","status":"Completed","tags":["Long Strip,Drama,Fantasy,Web Comic,Full Color,Tragedy"],"nutshell":"A 26-year-old man's life is turned upside down when he is diagnosed with terminal stomach cancer. As he struggles with the pain of his treatment and the realization that he never truly lived, he retreats into his imagination, to a magical forest where answers and miracles can be found."},{"name":" Noise Cancelling","avatar":"https://mangadex.org/covers/6365b83c-48d6-4245-8b6a-9b6b8813e000/9e501cc7-74cc-4f4f-92d8-eefcac2b3329.png.256.jpg","country":"Japanese","stat":"7.43","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"Muku and Mizuki meet on a trip to Nagasaki. Muku, a university student, is in the middle of a trip to recover from his heartbreak over his uncle.  Mizuki, who is twelve years his senior, is in Nagasaki to see his stepson by his ex-wife, Hiroto. Muku hopes to fill the empty place in his heart. Mizuki is hoping to overcome his forbidden feelings toward Hiroto. At the beginning, both are only trying to fill the hole in their hearts, but fate gives them the chance to meet again, and each time they make love, it becomes harder to part. However, the extremely captivating and beautiful young man, Hiroto’s existence interferes with both of their hearts…!? Will these noisy hearts be purified, in this high resolution, adult love!!"},{"name":" Natural Junkie","avatar":"https://mangadex.org/covers/636c607c-44b0-4c1a-8592-d0a602de95d9/374b55eb-60f9-45d9-a482-455e44fa9915.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Superhero"],"nutshell":"Saitama x Genos doujin."},{"name":" Good-bye, My 19 year Old Self","avatar":"https://mangadex.org/covers/636daa88-4430-4d1c-a50f-6b9b74d28f43/0f9fb8d1-ac2e-494c-b870-7cad5eabb475.png.256.jpg","country":"Korean","stat":"7.92","status":"Completed","tags":["Romance,Drama,Tragedy"],"nutshell":"Jin-Pyo is in love… but with his brother's girlfriend. Sadness and tragedy will come out of it."},{"name":" Sumomomo Momomo","avatar":"https://mangadex.org/covers/636ddebe-5a03-404c-a81a-1de52c0ee830/13fdbcd1-dc69-4327-8d54-62f4169a5073.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Action,Romance,Comedy,Martial Arts,Harem,School Life,Supernatural"],"nutshell":"Momoko is the only child of the Kuzuryuu clan, a powerful martial arts family with inhuman strength. But strong as she is, her father fears a woman will never be able to master the skills of the family. Unless Momoko marries and bears a capable heir, the Kuzuryuu line is doomed to weaken and die off! With this mission in mind, Momoko is sent to the rival Inuzuka clan, where she is to marry the son of their mighty leader. But Koushi Inuzuka abandoned the martial arts long ago. Now committed to his legal studies, the last thing Koushi has on his mind is marriage — especially not to the world’s strongest bride!"},{"name":" Shoujo Kageki Revue Starlight - Ringopai315's Revue Starlight Works (Doujinshi)","avatar":"https://mangadex.org/covers/636ea328-18af-49ea-af8c-f50b844cfa16/9f122df6-4f9e-40e4-8d29-82380b8163dd.png.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Comedy,Girls' Love,Full Color"],"nutshell":"Collection of @ringopai315 's Shoujo Kageki Revue Starlight twitter works."},{"name":" Past Life Destiny","avatar":"https://mangadex.org/covers/6371d3a6-3663-4fb3-ad0f-e927c627d8ba/3c0558a5-1818-42c4-81de-0ffbbd4badb6.jpg.256.jpg","country":"Korean","stat":"8.09","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Isekai,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"\"I was a Queen from the Joseon Dynasty who was murdered by the royal consort?!\"\nKim Minju, who suddenly remembered her past life while taking an exam.\nShe was very confused when she remembered but tried to calm down because the most important thing was her college entrance examination and not her previous\nlife. But the Consort, who was her enemy in the past life came to find Minju.\nAnd soon after, even the King who was her husband in the past life appears in front of her and puts her student life into a crisis.\n\"I don't care about the past life or whatever, just please let me study!\""},{"name":" Evangeline's Sword","avatar":"https://mangadex.org/covers/6373ccf4-01fd-4b80-8f12-facc1b2a7a10/a065c46d-ec1b-40c0-9aa5-29ce366872b9.jpg.256.jpg","country":"Korean","stat":"8.02","status":"Ongoing","tags":["Action,Long Strip,Romance,Adventure,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"\"I want to bring it back… Our original form, our original Michael...\"\nEvangeline and Michael grew up together on the island since childhood. However, her friend Michael left the island to become a knight and lost contact with him. When was it wrong? Five years later, she and Michael met again and he had become a cursed magician who burned the continent.\n\"Me… I can't remember anything, Eve.\"\n\"What do you mean?\"\n\"I… I've been cursed by a demonic dragon.\"\nThe evil dragon's curse turned the boy with an angel's name into a slaughter-crazy demon. The boy's most precious person, Evangeline, made a decision.\n\"I will choose you this time. Mika.\"\nThe story of Michael, who became a magician under the curse of a demonic dragon, and Evangeline, who tries to save Michael.\n\nHow far are you willing to go for love? Not a day goes by that Eve doesn't wish to reunite with her childhood friend, Mikha. But three years later, when she learns that Mikha has become a cursed sorcerer who leaves only death in his wake, Eve must embark on a journey to save not only the man she loves but also the world as she knows it.\n\nNote: The webtoon was released as R15; its not R19 like the novel."},{"name":" Cosmos","avatar":"https://mangadex.org/covers/637b4eab-d063-4ff6-ba64-6e93d2e7775e/33ab3eb5-e5e1-4f79-b3fd-4514f08d88c3.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Oneshot,Romance,Slice of Life"],"nutshell":"A very short story in full color about the memories of walking along the path with blossoming cosmos."},{"name":" Bad Young Blood","avatar":"https://mangadex.org/covers/637c59ad-642c-4ed9-a94d-db26bd23803a/d55d3836-b227-4ef5-9810-8c7cae8151e8.png.256.jpg","country":"Japanese","stat":"7.60","status":"Completed","tags":["Psychological,Romance,Boys' Love,School Life"],"nutshell":"Satomi is a fuckboy on the outside, but in reality he has a fetish for wounds. He gets excited by biting and leaving marks on girls' skin. During class, he witnesses Kanoe, a clumsy boy covered in injuries, getting hurt. After seeing Satomi’s strange reaction to his injuries, Kanoe becomes curious about Satomi and continuously approaches him…"},{"name":" Kyou wa Hayaku Kaerou","avatar":"https://mangadex.org/covers/637cd2ad-cb13-4481-989a-48de122bc566/be48df03-a354-4dfa-8083-f6032dae4428.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Romance,Boys' Love,School Life,Slice of Life"],"nutshell":""}]