[{"name":" Hatsujou Pornography","avatar":"https://mangadex.org/covers/9d0a869e-b28a-4054-ac76-cc8be26731df/73463dfd-7829-46cc-aadb-12a508d34f7d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":""},{"name":" How To Deal With Players","avatar":"https://mangadex.org/covers/9d0c272d-c3cb-4ffa-ab5a-f42dc8091c84/8f66c22a-1560-416a-957e-f80580b11d54.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.06","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Comedy,Crossdressing,Drama,Slice of Life,Full Color"],"nutshell":"It was the time when cheating men swarmed the streets of the city and flirted with any woman who met their eye. The fl, to give those scumbags a taste of their own medicine, decided to help women by opening up a business of identifying cheating scumbags with the help of her so-called “elder brother”. Unbeknownst to her, the elder brother was, in reality, plotting against her, making her business harder and harder to run."},{"name":" Fuuka Special Edition","avatar":"https://mangadex.org/covers/9d1001f9-4ede-4073-a976-58b968df8316/d03ac03c-929f-44cd-b64b-e3b113c3f0e0.jpg.256.jpg","country":"Japanese","stat":"7.59","status":"Completed","tags":["Romance,Comedy,Adventure,Harem,School Life,Slice of Life"],"nutshell":"Special Edition of Fuuka.\nReleased in April, 2018 as a standalone volume. Featuring main female characters from Seo Kouji's popular series Fuuka in alternative timelines with the main character of the series Yuu Haruna!"},{"name":" Flying Planet","avatar":"https://mangadex.org/covers/9d113de1-b0f2-4a32-8612-432a6063fce0/b6a8d56f-4b7d-4fa4-a9b0-4fbd2697d1ee.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.95","status":"Completed","tags":["Official Colored,Long Strip,Boys' Love,Full Color"],"nutshell":"Be the witness in this fairy-tale-like love story as the flawless and rich main character strategizes his actions to get his first love, a poor senior, back!"},{"name":" The Comic Changes My Destiny","avatar":"https://mangadex.org/covers/9d117279-fdfc-49b9-bae8-a95d45185b0e/60de1327-8ec7-4fb2-bbb5-8a6d034b7429.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.04","status":"Ongoing","tags":["Official Colored,Action,Long Strip,Romance,Adventure,School Life,Fantasy,Slice of Life,Full Color"],"nutshell":"When the book of destiny can portray and change the future, when the characters in the pen become a living reality, the comic world and the real world overlap! Ordinary female college student Luo Youzhen is about to experience an unprecedented experience, and embark on an adventure journey… A hidden cartoonist, a cartoon character with abilities, a hegemonic young man next to him, a mysterious female killer, who represents justice Who is evil? The comic legend that crossed the dimension opened!"},{"name":" No Bra, No Panties, No Future","avatar":"https://mangadex.org/covers/9d14af8f-d0e3-4791-8b97-d71762ae79d0/d76217d1-3701-4e6d-9603-68a63876539b.png.256.jpg","country":"Japanese","stat":"7.57","status":"Completed","tags":["Oneshot,Comedy,School Life"],"nutshell":"For high school girls there are some \"battle days\", for example Valentine's Day, Christmas, and…"},{"name":" Lunar - Younenki no Owari","avatar":"https://mangadex.org/covers/9d15581c-27e6-43e5-b425-3a82567679fa/9d0cf737-3ff3-4ab6-a840-4d4ea4c434a1.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Action,Adventure,Fantasy"],"nutshell":"Takes place during the time between Zophar's defeat and the epilogue of Lunar 2: Eternal Blue. Alice, a young girl that Hiro and Ruby befriend, is being chased by Ghaleon and Xenobia for reasons unknown, and it is up to Hiro and his friends to protect her.\nBased on the Lunar video game series by GameArts."},{"name":" Ura Account Joshi","avatar":"https://mangadex.org/covers/9d17cdbe-b0be-424d-ac5c-9cb3be3c1dcb/08885712-bf8f-47e7-aeaa-f4104f9de670.png.256.jpg","country":"Japanese","stat":"5.75","status":"Completed","tags":["Romance,Drama,School Life,Slice of Life"],"nutshell":"What makes girls post naked pictures of themselves on social media? What hides beneath and what can be the consequences of such behavior..?"},{"name":" Hair-Tail Fish and Mackerel","avatar":"https://mangadex.org/covers/9d1bd14a-ff52-46a9-9496-4a3405d29615/d0efc4af-afca-4c9a-baa6-d616814bf316.jpg.256.jpg","country":"Korean","stat":"7.96","status":"Completed","tags":["Oneshot,Romance,Comedy,Fantasy"],"nutshell":"In a peaceful sea world, the world's most respectful Hair-tail fish king ruled so that all the fish tribes/species lived happily. What happens when the prince disagrees on whom he can marry?"},{"name":" Pick Up A Goldfish As Girlfriend","avatar":"https://mangadex.org/covers/9d1d435c-34dd-464e-886c-c8a460b6bb27/dc93608d-26d8-43a6-8052-e459bac790cf.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.86","status":"Ongoing","tags":["Long Strip,Comedy,Adventure,Fantasy,Web Comic"],"nutshell":"The goldfish was saved by the MC when he was young, so the fish morphed into a human to return the favor. Ever since, they have started living together, he has been able to eat and dress well, also work started going smoothly."},{"name":" Matsunaga Toyokazu Killing Paranoia","avatar":"https://mangadex.org/covers/9d266da7-9ece-401a-997f-80fd4e5225f5/516b575b-0aa4-4dc0-b96b-e0983b421ce8.png.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Oneshot,Action"],"nutshell":""},{"name":" Let's Do It After We Marry","avatar":"https://mangadex.org/covers/9d29a5c5-a43c-4fef-861d-fa5fdc95beb3/72bead2e-a358-4ac2-85ec-8f1842f6f145.jpg.256.jpg","country":"Korean","stat":"7.90","status":"Completed","tags":["Long Strip,Romance,Comedy,Office Workers,Drama,Web Comic,Slice of Life,Adaptation,Full Color"],"nutshell":"\"Marriage in my life is a definite NO!\" says Moa, a misogamist. One day, she faces a situation with a naked Geonwoo, her superior who was rumored to be strict and cold. But oh my goodness...... Are you telling me that such a body belongs to a human?! His body was like an art statue, excellent and magnificent, to which Moa forgot her embarrassment and couldn't take her eyes off of it. After seeing Geonwoo's perfect naked figure, Moa experiences a terrible aftereffect, and that was seeing his body whatever she did wherever she was. Tormented by it, a drunk Moa ends up confessing to him one night. \"Umm............ Team leader, do you want to try sleeping with me once?\" A confession that would never have come out in her right state of mind. Right as her regret came flooding in, a more shocking response came out from him. \"I'm sorry but I won't do it unless it's with a woman I'll marry.\""},{"name":" Tate no Yuusha no Nariagari - Horror of the Shield (Doujinshi)","avatar":"https://mangadex.org/covers/9d2c7924-5e3a-4743-a531-5e710ad95334/de0e7852-f678-4d2f-980b-db490937a9f1.png.256.jpg","country":"English","stat":"7.12","status":"Completed","tags":["Oneshot,Ghosts,Comedy,User Created,Isekai,Horror,Slice of Life"],"nutshell":"Naofumi returns to his village from a meeting with the Queen to something horrific…"},{"name":" Kono Ie de Kimi to","avatar":"https://mangadex.org/covers/9d2d3d50-922a-47d4-bf52-cb529766e99b/c8b752e0-1168-4ade-9533-b392b39bbbbc.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,School Life,Slice of Life"],"nutshell":"Tachibana Itsuka has always planned to live on her own once she became a high school student. On the day she's supposed to move into an apartment building, she finds it burnt and unfit for living. She's forced to live in the house of the landlady's son, along with two other women, and starting from day one, none of them gets along at all.\nIncludes oneshot:\nPure Heart Broken - To Rise to the House's Drama"},{"name":" Dare ni mo Ienai Yoru wo Ageru","avatar":"https://mangadex.org/covers/9d2d5e38-4332-4962-9be3-595c34464f01/ced34775-76ff-47aa-9b6b-aeda76d0f4e2.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Office Workers"],"nutshell":"Yui lavora in un grande magazzino, ma svolge di nascosto anche un \"lavoro part-time notturno.\" Questa violazione delle regole viene scoperta per caso da Rihito. Per far sì che mantenga il segreto, c'è una cosa che Yui deve fare per lui..."},{"name":" The Portrait of A and B","avatar":"https://mangadex.org/covers/9d2d76b6-abc8-4f84-b617-908193e2cf04/17d9abd0-862c-4494-83d0-a9da5a8b599b.jpg.256.jpg","country":"Korean","stat":"8.05","status":"Ongoing","tags":["Award Winning,Long Strip,Boys' Love,Drama,School Life,Web Comic,Slice of Life,Mystery,Full Color"],"nutshell":"In a village encircled by strange rumors of a certain estate, Yoon \"A,\" an average high school boy, is suddenly dumped with a single handwritten letter. As A retraces the clues his (ex)girlfriend left behind in order to discover the reasons behind her decision, he becomes closer to Shin \"B,\" the slightly gloomy and strange student librarian...\nThe 1st Lezhin Comics BL Contest Grand Prize Winner!"},{"name":" Ou-sama to Puppy Love","avatar":"https://mangadex.org/covers/9d2d9a0f-f545-4715-b4ec-5097476a1ca2/c36887ee-8e46-4b30-a8d5-5bacfdc7400f.jpg.256.jpg","country":"Japanese","stat":"8.23","status":"Completed","tags":["Romance,Comedy,Boys' Love"],"nutshell":"Despite being an Omega, Souichirou is hardworking and quite efficient at work. He aspires to become a politician. In spite of being rather beautiful, he didn't want to fall in love or get married, instead preferring to live his single life to the fullest together with his friends. A major reason for that is him being a severe \"neat freak\". But fate had something different in store for him… He ends up meeting his destined partner, a handsome hunk who is a king."},{"name":" .hack//Link - Tasogare no Kishidan","avatar":"https://mangadex.org/covers/9d2d9c67-0e46-4cb9-89c0-7945f8b50ce0/e7f32896-df49-49ea-9f5f-5eaedd6b6120.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Sci-Fi,Action,Comedy,Adventure,Video Games,Drama,Fantasy"],"nutshell":"Three years after the popular video game The World was shut down, Tokio Kuryuu cannot wait for The World R:X to come out. Unfortunately for him, he forgets to reserve a copy and finds himself with no access to the game. That is, until a mysterious new transfer student forces him into the game and makes him her servant."},{"name":" Adored by My Royal First Love","avatar":"https://mangadex.org/covers/9d2e27de-2d73-4942-8b78-0b581fcaff34/bfe3b3a8-90f1-46ef-842c-ad3e38f4f73d.png.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Romance,Fantasy,Adaptation"],"nutshell":"Louise is a noble lady who loves books and magic devices. One day, she suddenly had her fiancee stolen by the very same twin sister she was acting as. After her dream to be a magic device researcher was destroyed, the one to save her was her first love, the First Prince Lucius, whom she was able to meet again! From a book club in a secret library to outings to magic device shops, Louise manages to regain the light in her eyes with the time they spend together. With her feeling her heart beat from Lucius’s sweet words, just when you'd think they’d get together in no time, the past that the ‘substitute lady’ doesn’t want to be known becomes an obstacle.\n“What do you think about this?”\n(No… I couldn’t possibly tell him about that.)\nOn the other hand, Louise’s potential as a researcher is also starting to bloom…? A lady who loves magic devices and an iron-masked prince, a pure love story filled with misunderstandings!"},{"name":" Otaku and Mr. Taoist","avatar":"https://mangadex.org/covers/9d2e750f-fe00-4d23-af96-af16d8996261/760fb6ea-c3f9-4e7d-a500-c630ab18097c.jpg.256.jpg","country":"Korean","stat":"8.06","status":"Completed","tags":["Romance,Boys' Love,Supernatural,Full Color"],"nutshell":"Little Taoist.” “Call me Mr. Taoist.” A young Taoist who claims to be Mr. Taoist shows up at an ordinary man’s house. He is actually the God of Mountain, who cadging meals and drinks and making it as his own place. He keeps on pushing too far, but feels boring at the same time…While the ordinary man is a SOHO who’s engaged in drawing horny pictures, but something seems to be hidden in his body…"},{"name":" Gunjou - Ai ga Shizunda Umi no Iro","avatar":"https://mangadex.org/covers/9d2fc75b-8803-4b0d-8550-3c13a6a40688/60915afa-9d2d-4263-b2d5-ada38d4e638f.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Psychological,Romance,Drama,Tragedy"],"nutshell":"Even though they played together innocently since they were young, somewhere along the way, the seeds of \"love\" started to grow. Growing up on an outlying island from Okinawa, Kazuya, Ryoko and Daisuke were brought up like a family. They wanted to be together forever, but the three of them have different desires. One wants to stay, one wants to go, and one of them wants to go, but can't. When Daisuke is lured away from the island, Ryoko decides to stay on the island with Kazuya. However, the three of them will experience a cruel fate…!"},{"name":" The Glorious Rebirth: Good Morning, Mrs. Fu","avatar":"https://mangadex.org/covers/9d307ec1-9abd-4fa9-894e-275e94922187/36864b10-fe9c-483f-9f9a-f271a471ffce.png.256.jpg","country":"Chinese (Simplified)","stat":"7.75","status":"Ongoing","tags":["Official Colored,Romance,Drama,Fantasy"],"nutshell":"In a one-to-one comparison, they are both equally pure and innocent inside out. While she can be fierce and sweet, he is the son of a rich family, indifferent, noble, and unattainable. Despite it all, he develops a soft spot for his beautiful wife, and falls deep in love with her."},{"name":" Kimi ga Kawaii Riyuu","avatar":"https://mangadex.org/covers/9d33bf5a-2eef-4b56-a940-99a2af1bbf2b/a99724a5-09bc-4844-ab4b-d8a087b691a5.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Romance,Boys' Love,School Life"],"nutshell":"Third year of middle school, fifteen years old: at this age, the mind is full of lewd things. To my surprise, most of the lewdness was done with my best friend."},{"name":" Fake Romance","avatar":"https://mangadex.org/covers/9d365ea1-2ee1-4d62-bd87-63d66c5a1228/960c4272-8d96-4286-ac42-fd7003fa3bbd.png.256.jpg","country":"Korean","stat":"7.95","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Drama,Full Color"],"nutshell":"I didn't like that guy. Handsome, kind and good at studies. It's all good because he's perfect.That's why Dad likes Nam Jooha more than me, a stupid and deficient son.Though, I thought it would be fine since he was not part of my own family. However, one day, Dad said he would be offering Nam Jooha for adoption. Baek Kwonyoung, the youngest son of the Ilbi Family, senses that his position will be at stake if this goes on, and suggests Nam Jooha.\"Do you want to have sex with me?\"If he has sex with me, he won't accept the adoption proposal since that's just how Nam Jooha's personality is.You like me, don't you?"},{"name":" Boku ni Hana no Melancholy","avatar":"https://mangadex.org/covers/9d3679f2-3f4e-462b-8d10-1b3222c4a05f/fdd0a7d6-59f6-4f24-b326-b8971b325ada.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Romance,Drama,School Life,Slice of Life"],"nutshell":"When Hana was a child visiting her mother's grave, she got to know a young boy named Yuzuru. He was Hana's first love. When she heard that he ended up moving away, she thought that it wouldn't be possible to see him anymore, but…?"},{"name":" Neon Genesis Evangelion - One more final: \"I need you too\" (Doujinshi)","avatar":"https://mangadex.org/covers/9d36e823-30c5-42fa-b6d9-4ecbc4189f6f/90825049-2960-4292-918d-9f0e9bcf2167.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Romance,Comedy,Slice of Life"],"nutshell":"Set after \"Thrice Upon a time\", we follow Asuka who seems to have an important memory but doesn't remember what it is, until she sees 2 people from afar and something happens."},{"name":" Nanboku Seitokai Sensou","avatar":"https://mangadex.org/covers/9d39b254-be64-4dc1-9fad-30699a552e85/36c99af7-5b67-4171-b007-e696c3431a29.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Action,Comedy,School Life"],"nutshell":"Full-color one-shot about girls with guns. (From: MAL)"},{"name":" Shikkaku kara Hajimeru Nariagari Madou Shidou!","avatar":"https://mangadex.org/covers/9d39efab-9ab7-4a4d-9f89-9b81e3796fc3/c328d922-c60a-4a83-aeae-3992ead63635.jpg.256.jpg","country":"Japanese","stat":"7.35","status":"Ongoing","tags":["Reincarnation,Action,Magic,Isekai,Drama,Fantasy"],"nutshell":"Let me tell you the story of Arcs Reytheft. A great feudal lord’s disgraced eldest son. Because he was weak, he his family left. And so he strives to become the strongest one. For you see, Arcs was once a Japanese man. And got sent to this world as soon as he died. His father wanted to have. Arc inherit his land. But in terms of magic, he was disqualified.\nThe background is set, and Arc’s goal draws near. Get back at the people who mocked his weak skills. Whether by training or cheats? That part is unclear. But who cares? It’s time for some self-insert thrills."},{"name":" Katekyo Hitman Reborn! - How Do You Find The Bath? (Doujinshi)","avatar":"https://mangadex.org/covers/9d40f6f5-1542-4197-b6aa-031a54650f2d/044d457d-3cdf-4a4a-959c-d5df1fbcca87.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":"Yamamoto and Gokudera, back home after a long mission, take a bath together."},{"name":" Rouge - An Anthology of Stories Between Women","avatar":"https://mangadex.org/covers/9d465ba9-4b82-492b-9dad-df51f05ec9ee/beb7d264-c86c-4f32-b588-642066a42869.jpg.256.jpg","country":"Japanese","stat":"7.69","status":"Completed","tags":["Romance,Anthology,Office Workers,Girls' Love"],"nutshell":"A Yuri anthology of working adults\nCover: Kanarashi\nRetail link:\nMelon Books"},{"name":" Ragnarok","avatar":"https://mangadex.org/covers/9d49a908-358b-4f02-801b-bfb83f6b83a4/7f89fec3-aad0-4d94-bdb1-a8fcd6751363.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Action,Adventure,Horror,Fantasy"],"nutshell":"In the late-medieval land of Barnard, between the mountains and sea, the peaceful lifestyle of the people has been shattered by fear. Monsters known as the Dark Ones roam the land, killing indiscriminately. The townsfolk fear to venture out from their homes, and travel from town to town has become a risk to life and limb. To protect the people from this terror, several guilds have sprung up, including the Guild of Assassins and the Guild of Mercenaries. To go out into the world, or travel across the wilderness, hired mercenaries are essential.\nOne man has built a reputation as an especially fierce monster-killer ‹ a man known as Leroy Schwartz. A former high-ranking member of the Guild of Mercenaries, Leroy has struck out on his own. Many try to hire him for his superior skills, but Leroy has his own agenda. He has a mission to accomplish, a vow to fulfill. This vow is known only to himself, and his one companion: his sentient long-sword Ragnarok."},{"name":" Kanshaku Dama no Love Song","avatar":"https://mangadex.org/covers/9d4ec56d-f9b7-4e31-94e7-1797deaa22a7/d43503e1-8658-4297-8647-860fcb851cf3.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Boys' Love,School Life,Slice of Life"],"nutshell":"Wakou, a senior student, is in love with his childhood friend, Takeo. However, he's given up on that love and just wants to be his best friend. But one day, Takeo suddenly says \"I might be able to have a boyfriend\"?!\nFeaturing Takeo from Cupid ni Rakurai as main character."}]