[{"name":" Midori no Tomarigi","avatar":"https://mangadex.org/covers/65bf6645-89d1-4451-b87c-f307c30e0d7e/e0a3f93d-cd8e-41ff-a13f-452b59c69609.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"Following her mother’s passing, Midori is now not only responsible for raising her little brother, Ai, but she’s also tied down by housework and other school commitments, making it hard to establish any form of social life… Until she meets a man in the courtyard at school. Will he change her life or will she change him?"},{"name":" 1000 Yen Hero","avatar":"https://mangadex.org/covers/65cc4012-d604-4783-9222-016794869cb7/2782bf06-7f0e-4678-9b46-689238a5a648.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Sci-Fi,Monsters,Action,Comedy,Superhero,Video Games,Drama,Supernatural"],"nutshell":"Mysterious monsters attack the people of Japan, but heroes are there to protect them with powers that run on a rate of yen per second. For Hiasa Sen however, there are much more important things to worry about, like catching sales on groceries, his many part time jobs and most importantly, taking care of his little sister. When danger approaches however, he has a secret power of his own, but it may be more trouble than it's worth."},{"name":" Hagure Idol Jigokuhen Gaiden V","avatar":"https://mangadex.org/covers/65d15a49-e191-4e1b-9b07-3f2d08f88318/ba80bb0f-aebd-43f2-be4d-1b327177c8ce.jpg.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Comedy"],"nutshell":"A remake and continuation of Voice-Zaka."},{"name":" Daten no Tsuki","avatar":"https://mangadex.org/covers/65d5a626-e96c-48f8-b6e4-914de078e01f/01c8a464-a84d-48c4-983e-01d4a5510257.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,Boys' Love,Fantasy,Mystery"],"nutshell":"An unearthly collection of stories illuminating the complex lives of immortal beings. An angel, who loses his place in Eden, finds a mysterious and dangerous new patron. A poor painter finishes a woman's portrait without a subject and reveals his forgotten past. These stories and more will delight fans of beautiful angels and demon boys!"},{"name":" Shinigami no Koi","avatar":"https://mangadex.org/covers/65d6e98d-6b20-43a3-944e-60ed76fda182/ac2a3aa2-521a-45b4-bb95-5a2f30251acb.jpg.256.jpg","country":"Japanese","stat":"7.63","status":"Completed","tags":["Boys' Love,Fantasy,Supernatural"],"nutshell":"A grim reaper watches a man who has lost his wife through his crystal ball, but when he has to take the man's life, he is hesitant."},{"name":" Hal","avatar":"https://mangadex.org/covers/65ddd32a-39ae-493c-bf35-059c34a8c6ee/b1ff1fb0-4170-4017-8157-ad7928e1af08.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Sci-Fi,Psychological,Romance,Drama,Slice of Life,Tragedy"],"nutshell":"The happy life of Kurumi and Haru suddenly ends by a plane accident. In order to recover her willpower to live, the android Q01 is provided as robot \"Hal\". During her life with Hal, Kurumi gradually opens up to the android and for a while it seems as if she will recover from Haru's death. However…"},{"name":" La Vie En Rose","avatar":"https://mangadex.org/covers/65e0220d-98ec-4e21-a483-ba1963e134b1/2089bc6f-ba11-4326-9361-780a24a34613.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance"],"nutshell":"The everyday life of Aoi, a successful mangaka, and her husband Kai, a busy salaryman."},{"name":" Tsuzuki wa Mata Yoru ni","avatar":"https://mangadex.org/covers/65e706d7-e9d6-40fa-9d16-aadb09716995/6cdfc419-8523-4c87-a981-449af3dd197b.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"Popular host Akusawa Fumi and renowned detective Futagami Takaharu have been classmates throughout high school and college, and they were also lovers at one point. They met again two years ago, and have since rekindled their sexual relationship. And while it proved to be as hot and fierce as ever, in truth there might perhaps still be a little more to it than just that..?"},{"name":" Coincidental Contact","avatar":"https://mangadex.org/covers/65e83feb-1309-46b7-b575-06d131c261fd/03c74199-aa5b-4ff6-ba62-3de7d8f5ac8f.jpg.256.jpg","country":"Korean","stat":"8.08","status":"Completed","tags":["Long Strip,Romance,Comedy,School Life,Web Comic,Full Color"],"nutshell":"\"우리, 어디서 만난 적 있지 않아요?\"\n서로를 알기 전, 이미 몇 번의 만남이 있었던 우연과 예하.\n둘은 우연의 퍼즐을 모아 관계를 완성할 수 있을까?\n평생 엇갈릴 것만 같았던 둘이 세 번째 접점을 계기로 시작하게 되는 캠퍼스 로맨스."},{"name":" The Demon Bunch","avatar":"https://mangadex.org/covers/65ecbfe5-7075-4715-b94b-0921af9a75fd/da6d1d3a-ef64-4485-b4f1-b0388bd5a44b.png.256.jpg","country":"Japanese","stat":"8.80","status":"Ongoing","tags":["Monsters,Demons,Comedy,Office Workers,Fantasy,Monster Girls,Web Comic"],"nutshell":"Tales of Demons working in the Demon King Corps and a mimic aiming for the life of a adventurer."},{"name":" One Piece - Johnny & Yosaku Uncanon Adventures (Doujinshi)","avatar":"https://mangadex.org/covers/65f2e1a9-9a34-4123-a080-b3f34746e4a8/665642cc-4e86-4ba9-8b3b-6315004cd1d5.png.256.jpg","country":"English","stat":"7.88","status":"Ongoing","tags":["Action,Comedy,Martial Arts,Adventure,User Created,Military,Fantasy,Web Comic,Slice of Life,Supernatural"],"nutshell":"Unoffical spin off of one piece's characters Johnny and Yosaku missadventures.\nTwo bounty huntes from the One Piece get in a messy situation wen a corrupt marine official puts a bounty over their heads.\nSpin off cuz it sounds better than fanfict."},{"name":" Otto Carius - Tigers in the Mud","avatar":"https://mangadex.org/covers/65f5d836-a000-491f-a0dd-2c30b8cd4613/e083f024-a7b7-4114-8465-72acd3888c77.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Completed","tags":["Historical,Military,Full Color"],"nutshell":"An all-watercolor historical manga based on \"Tigers In The Mud\", the memoirs of Otto Carius, a WW2 German tank ace.\nMade by famous japanese animator Hayao Miyazaki."},{"name":" After the Curtain Call","avatar":"https://mangadex.org/covers/65f631d8-3965-435b-94c1-4c1808e36157/2e286c35-58c1-416b-aa0a-ea5cd5849e26.jpg.256.jpg","country":"Korean","stat":"8.28","status":"Completed","tags":["Long Strip,Romance,Girls' Love,Drama,Web Comic,Full Color"],"nutshell":"Soyoung is devastated when her favorite musical actor is swallowed up by the world of TV. Just after she quits supporting him, she discovers charismatic actress Jaeyi in a theater performance of \"Macbeth\" and becomes a fan at first sight. By meeting Jaeyi after her shows and even doing her a favor, Soyoung goes from a mere fan to her good friend. But when Jaeyi has to work with celebrity actress Hyesun, who she has a troubled past with, it unexpectedly sours their friendship. All Soyoung wanted was to support her favorite actress… so why does this new development bother her so much?"},{"name":" Rifle Is Beautiful","avatar":"https://mangadex.org/covers/65fa0e69-916f-4584-bb82-cb9362bced3b/5fac8663-06dd-42ec-bc18-5972ebc93e11.png.256.jpg","country":"Japanese","stat":"7.51","status":"Completed","tags":["Comedy,Sports,4-Koma,School Life,Slice of Life"],"nutshell":"Kokura Hikari is a first-year high school girl who loves rifle shooting. She entered Chidori High School because it had a shooting club, but finds that the club had been disbanded. She had only one day to find enough members to reform the club, but luckily was able to find three other first-year girls who she had met at a competition in middle school.\nThus begins the daily activities of the Chidori High Shooting Club"},{"name":" Lady Red","avatar":"https://mangadex.org/covers/65fa0f2b-363b-4f05-9598-28494163c022/bf983af5-a49f-4fe9-ad45-57661a42c624.jpg.256.jpg","country":"English","stat":"7.61","status":"Ongoing","tags":["Oneshot,Action,Crime,Mafia,Drama,Fantasy,Delinquents,Web Comic,Supernatural,Adaptation"],"nutshell":"Retelling of the Little Red Riding Hood story in a modern setting.\nNote: Read from left to right.\nEric Martin's Twitter: @ericmartinDOOD"},{"name":" After God","avatar":"https://mangadex.org/covers/65fa324d-4075-4f59-a71c-2c82f69f6779/bdff40e0-10c0-4411-9daf-ee135dbcb5c9.jpg.256.jpg","country":"Japanese","stat":"8.36","status":"Ongoing","tags":["Action,Psychological,Drama,Supernatural"],"nutshell":"Japan has been \"invaded\" by the gods. Tokyo, dwelling place of the gods, has been declared a \"danger zone\" and tightly sealed off by an impenetrable fence. A girl by the name of Waka keeps gazing beyond the fence's boundaries. Waka came to Tokyo from Saga in order to see her friend, but there she meets Tokinaga, a researcher who had been vigilantly guarding the city. It's this meeting that will change the fate of the world..."},{"name":" I'll Encount!","avatar":"https://mangadex.org/covers/65fd07e6-bf5e-49b6-afb7-0aa42dff8276/1646f110-f6ef-456a-bb33-7052c590c2d2.jpg.256.jpg","country":"Japanese","stat":"7.44","status":"Completed","tags":["Comedy,Adventure,Isekai"],"nutshell":"Hello, let's met with Airu, an airhead, cheerful girl who finds a mysterious cube device while cleaning her club's room. Suddenly she's sent to another world with her merrymaking friends. With this cube, these four will be adventuring in another world while living a peaceful daily life on earth."},{"name":" Sparkle x Sparkle","avatar":"https://mangadex.org/covers/6600ab18-8d6a-4433-8c14-e83f36a4e1fb/5dffdc61-97ca-4ce7-a17a-84ff112ceeeb.jpg.256.jpg","country":"Korean","stat":"8.01","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"A college girl finds her ideal guy. There is just one problem though. The guy's younger than her. In fact, he's in high school!\n(Source: MU)"},{"name":" The Pale Horse","avatar":"https://mangadex.org/covers/6600bc63-ebe4-4289-9ef5-a896e4bc6ae3/eaf661bf-7142-4820-ac51-34f85a14a60f.jpg.256.jpg","country":"Korean","stat":"8.23","status":"Ongoing","tags":["Historical,Long Strip,Romance,Supernatural,Tragedy"],"nutshell":"Set in the France 1835. The pretty Rose Dupre is bullied and called the witch's daughter. People say her mother is a witch who kills and eats humans. However, Marie and Peter don't believe all those rumors and decide to protect Rose… But what if the rumors are true?\nNote: The author has split the storyline into parts and seasons. Volume 1.1 for example means Part 1, Season 1."},{"name":" Romantic Egoist","avatar":"https://mangadex.org/covers/660b5a3b-2f34-4843-808d-8f727f426582/4ed4e390-7e75-425e-aa2c-153aa17cc634.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Romance,Comedy,Drama"],"nutshell":"All Arisa wanted was to go overseas for the summer, but instead she found herself roped into an Omiai with the heir to the Narimiya Corporation. She doesn’t want to be involved in this and is trying to find a way out, but Narimiya has decided that he wants to marry her – and actually has the romantic skills and determination to win her heart!"},{"name":" Shingeki no Kyojin - Sono Kemono no Na wa (Doujinshi)","avatar":"https://mangadex.org/covers/660f5e5b-0b85-4cd8-908f-fee25332ebd9/a18609d4-4728-47de-bfea-f22e6cff3967.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Boys' Love,Drama,Tragedy"],"nutshell":"Pairing: Levi x Eren\nLevi isn't the real name of the captain, his past is buried with it. A true moster maybe will be able to know and keep alive the memory of what is lost in many lives."},{"name":" Koi wa Ameagari no You ni","avatar":"https://mangadex.org/covers/661eaad1-3de3-4685-ae43-f534294b6d8d/f4d3bdd7-7204-4c39-a678-d2481a6c4ac5.jpg.256.jpg","country":"Japanese","stat":"8.31","status":"Completed","tags":["Romance,Comedy,Office Workers,Drama,School Life,Slice of Life"],"nutshell":"Akira Tachibana is a soft-spoken high school student who used to be a part of the track and field club but, due to an injury, she is no longer able to run as fast as she once could. Working part-time at a family restaurant as a recourse, she finds herself inexplicably falling love with her manager, a divorced 45-year-old man with a young son.\nDespite the age gap, Akira wholeheartedly embraces his mannerisms and kind nature, which is seen as spinelessness by the other employees, and little by little, the two begin to understand each other. Although unable to explain why exactly she is attracted to him, Akira believes that a concrete reason is not needed to truly love someone. On a rainy day, she decides to finally tell her manager about how she feels… But just how will he react?"},{"name":" Shoukoku no Altair-san","avatar":"https://mangadex.org/covers/661fe186-4f4b-4453-9e30-ff6e9986f29c/c933b5b0-dad6-443c-bffa-ccf07568e5d9.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Comedy,Adventure,Fantasy"],"nutshell":"A spin-off of Shoukoku no Altair following the secret adventures of tiny Mahmut and friends at the Kodansha publishing office. Romance, adventure, strategy… A lighthearted tale of war.)"},{"name":" God Qi Lishang","avatar":"https://mangadex.org/covers/662101df-15d3-4f18-9ea1-e90e6aabc203/0fe0baad-0ad7-47ab-81ac-59f37271d2ab.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.07","status":"Completed","tags":["Adventure"],"nutshell":""},{"name":" Senyuu. - Main Quest Part 2","avatar":"https://mangadex.org/covers/66236cfd-3050-405e-9c7a-4150f5fae170/3417e13d-4a5f-4edc-b6f4-f54d4c5af354.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Action,Comedy,Adventure,Fantasy"],"nutshell":"Note: This is a direct sequel of Senyuu Main Quest Part 1, which should be read before starting Part 2.\nHero Lyman and Royal Soldier Toryuu, sent off by the King to subjugate the Demon Lord. The two of them are facing off against rampaging demonic beasts to protect some children. But just when they thought all hope was lost… he appears! Who's grown stronger than anyone could've ever believed! What kind of battle will he show us?\nRib Ma- whoops, that is, Hero Alba's new adventure starts now!\n(This is a manga remake of Season 2 of the webtoon \"Senyuu.\" Most of the plot remains the same, but with some additional scenes added and minor changes to dialogue.)"},{"name":" Denkou Sekka Boys","avatar":"https://mangadex.org/covers/66238f2c-ddc7-4106-a51f-a3e16fc71b50/34c48815-e56a-4037-b19c-23dcb3e2826e.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Comedy,Boys' Love,Drama,School Life"],"nutshell":"Four-eyed Nobita is ignored by everyone at school or they highly suspect he's an anime dork. Little does he know, sexy Ritsu has been staring at him from afar. What happens when the glasses come off and what's next… the shirts?\nNote: The story is unfinished because the mangaka passed away."},{"name":" The Domestic Yapoo (SATO Sugar)","avatar":"https://mangadex.org/covers/662d84c7-3f45-4303-8d9c-09f100c1f11a/7fafa119-a964-49ac-a58d-d4916a34cd7b.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sci-Fi,Time Travel,Historical,Monsters,Psychological,Romance,Military,Drama,Horror,Delinquents,Aliens,Adaptation,Tragedy"],"nutshell":"The remaining content of The Domestic Yapoo, adapted by Ishinomori's assistant Sugar Sato with Ishinomori supervising. Note that there was a large gap between these and Ishinomori's.\n\nVol 2:  The Nightmare History of Japan Arc  (悪夢の日本史編, Akumu no Nihonshheni, January 1st, 1984) - (from ebookjapan): A Japanese man named Rin is brought to the space empire EHS, which rules the world 2000 years later. There, white women rule the world, and the Japanese are domesticated animals called yapoos. How were the Japanese, who had been modified into bodies specialized for their respective roles as human chairs, flesh toys, vehicles, etc., domesticated! The gods of Japanese mythology were white women from EHS! Volume 2 reveals the history of the primitive Yapoo tribe.\nVol 3: The Pleasurable Super SM Culture Arc (快楽の超ＳＭ文明編, Kairaku no Chou SM Bunmeihen, May 1st, 1993) - (from ebookjapan): In EHS, an empire dominated by white women, Rin, a Japanese from an earlier era, has been physically altered and castrated. He is reunited with Clara, but she has adapted to the aristocratic society of EHS and already has a new lover. Rin and Clara, lovers until yesterday, are no longer anything more than slave and mistress. As Rin is forced to listen to the humiliating history of his homeland, Japan, at Clara's side, not only his body but also his self-esteem is neutered.\nVol 4: The Unconditional Surrender Arc (無条件降伏編, Mujoukenkoufukuhen, March 25th, 1994) - (from ebookjapan): Two thousand years later, in the cosmic empire of EHS, the descendants of the Japanese, the yapoos, were nothing more than domestic animals, tools and consumables of the white man. They were not only toilet bowls (settsin), but also womb animals (yapum) that carried children, vaginal infants (tunnel boys) that served as contraceptives, and all sorts of other things. Determined to devote his life to being Clara's yapoo, Rin has let his natural canine nature blossom ....... The manga version of the outstanding masochistic literature is now complete!"},{"name":" Cremators","avatar":"https://mangadex.org/covers/662eafe3-345b-4e3a-9989-605741167561/3962edb1-da21-45b0-a434-a8b18d0e4529.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Comedy,Fantasy,Supernatural"],"nutshell":"In the world, there are some evil creatures known as \"chousha\" (the kanji read \"Chou\" = \"Omen\" and \"Sha\" = \"person\") that can only be killed by Cremators, people who use fire to incinerate them."},{"name":" Soredemo Kimi ga","avatar":"https://mangadex.org/covers/6631c439-6870-4b1b-9e69-c56b992afbed/9bb38d5a-3d36-4b48-8aeb-f6ef468ea28c.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Español:\nLa tranquila Nazumi conoce la vida real del popular Kasai-kun en los exámenes de recuperación. Al enamorarse de él se le confiesa y ¡¡Esta decidida a obtener una respuesta!!. ¡¿Sus sentimientos llegarán este pequeño diablo, Kasai-kun?!\nEnglish:\nThe quiet Nazumi gets to know the real life of the popular Kasai-kun in the make-up exams. When she falls in love with him, she confesses to him and is determined to get an answer!"},{"name":" It’s All Black Silk","avatar":"https://mangadex.org/covers/66336e77-9543-41c4-bf9a-d781723ac8f0/6bc1b388-8fd7-4458-8757-5bc7a6163295.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Harem,Web Comic,Full Color"],"nutshell":"Liu Mang, a programmer in his thirties, has always been a good student before, but he is not very happy. By chance (squeezing her feet to the beauty director and fainting), she found herself back to the 17-year-old school days. After being a good student, knowing that it is useless to study hard. After two lives, Liu Busy has done many things that young people want to do but dare not do."},{"name":" Hokuto no Ken & Toaru Majutsu no Index - Toaru Kenpouka no Jigoku no Mokushiroku (Doujinshi)","avatar":"https://mangadex.org/covers/663743f2-6088-4588-8863-8e260d682ea3/29dbb261-5c8d-4500-b638-0ba1622351e2.jpg.256.jpg","country":"Japanese","stat":"8.22","status":"Completed","tags":[""],"nutshell":""},{"name":" Blood and Steel","avatar":"https://mangadex.org/covers/66400137-fce8-4240-8a7c-8b25624b49a6/a86fdd8a-f628-4f38-b0a5-c7db630cb3e7.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.23","status":"Ongoing","tags":["Historical,Action,Martial Arts,Adventure,Wuxia,Drama"],"nutshell":"The story begins with an eradication of Qingcheng by a group of martial art fanatic from Wudong, whose master and disciples only has one belief: to become the strongest. In order to maintain supremacy, it takes over all the other martial arts group and kill those refuse to yield themselves to it. Yan Heng, a young swordsman in Qingcheng, was saved by 'Wudang Hunter' Jing Lie, who also lost his fellows because of Wudong. Being the only remnant of their groups, the two allied and start their journey of revenge."}]