[{"name":" Odoru! Kyouki no JK Kali-chan","avatar":"https://mangadex.org/covers/10c38cd4-70f4-4041-b54f-fe6a3723b3f4/6f7ed4ce-d42c-4574-a704-7969599e3ff2.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Comedy,School Life,Fantasy,Slice of Life,Supernatural"],"nutshell":""},{"name":" Kamen no Hanayome","avatar":"https://mangadex.org/covers/10cb6b08-4f3b-4505-87f7-1d3477a57998/cb47d910-9667-4a31-ab65-48e953916905.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,Drama"],"nutshell":"Despite being born to a wealthy Greek family, Alesia lived a humble life with her mother after her ruthless grandfather banished them from the family. Then, for the first time in 15 years, Alesia is summoned by her grandfather only to be told he has chosen a man to whom she must marry. He demands she marry Sebastien Fiorukis, the eldest son of another wealthy Greek family. The two families have been feuding for two generations, so what could her grandfather be scheming? But if she accepts this proposal, her ill mother will be saved. Alesia reluctantly agrees, but she didn't know how her new fiancé would treat her…"},{"name":" The Heaven Sword and the Dragon Saber","avatar":"https://mangadex.org/covers/10d7df68-4250-4b21-95df-6f0b51cb5d32/7eca0618-663c-4feb-83c0-347d1083c96f.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.74","status":"Ongoing","tags":["Action,Long Strip,Martial Arts,Web Comic,Adaptation,Full Color"],"nutshell":""},{"name":" Otaku Savior","avatar":"https://mangadex.org/covers/10d8dd2f-a2fa-4a32-b768-71dce098bf98/c4841854-d77c-4dad-8ce6-06197fc83e1f.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.50","status":"Ongoing","tags":["Action,Animals,Comedy,Adventure,Fantasy,Web Comic"],"nutshell":"When a variation occurred in the old wardrobe of Jiao He family, several strange cats from the otherworld appear in his home, Jiao He has to make a serious effort to make a living in order to feed the otherworldly meowers who have suffered severe disasters."},{"name":" Mahoko no Kuse ni Namaiki da!","avatar":"https://mangadex.org/covers/10dacde6-aa94-41af-83ab-3a57fcd5e4eb/9b1701fc-062b-456d-a3a0-8876fd5e5de6.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Comedy"],"nutshell":"Mahoko's been with her buddy, Chise, since the day that she was born. He's cool, good-looking, and a hit with the girls. But, Chise has a secret that only Mahoko knows ? he likes boys. He was always leading her around by the nose until one day, he grabs her and kisses her!!"},{"name":" You Go! Brave Little Yellow Croaker! Fall In Love!","avatar":"https://mangadex.org/covers/10db75be-6359-4f92-9c6e-6d9135886ab7/84dc5e32-9725-4b96-8589-71aafd352eb2.jpg.256.jpg","country":"Chinese (Simplified)","stat":"5.70","status":"Ongoing","tags":["Genderswap,Action,Long Strip,Romance,Comedy,Video Games,Fantasy"],"nutshell":"An otaku girl isekais into a shounen bishoujo game?! No! But I'm straight! (Even if it makes my heart flutter picking up girls) The game slowly gets out of hand after a server outage, with settings in total mayhem. Do yo finally need my help to save the world? To save the world, I have to pick up chicks? That's so damn cheap! The love story of an otaku and 2d waifus~ Filling the world with love! ...But tbh, standing up to use the toilet is still really weird."},{"name":" Kohitsuji Project","avatar":"https://mangadex.org/covers/10dd21ab-4f69-4409-b99d-1e8b5d4eee3f/2cebc4be-0069-4202-8e4c-7ff77d603861.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,School Life,Vampires,Supernatural"],"nutshell":"Kohitsuji Project is about a boy being accepted into a prestigious school not knowing he is the \"sheep\" that is meant to let the vampires learn that humans are not to be treated like food!"},{"name":" Love Live! - I Say You Say I Love You (Doujinshi)","avatar":"https://mangadex.org/covers/10e14b3b-5d08-4431-bb87-75ab3a8afc83/30ab1a61-a3bd-434c-98d3-1881cb07bee9.jpg.256.jpg","country":"Japanese","stat":"7.63","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":""},{"name":" Strain","avatar":"https://mangadex.org/covers/10e49024-d3d9-4f64-bdf5-4a5e345a5818/23980352-4ba8-4184-af1a-b8f6386cbadc.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Action"],"nutshell":"Mysterious assassin Mayo, a Japanese man in Malaysia, will kill anyone you want for just five dollars. Of course, he'll kill you for five dollars too, but doesn't that just even the score? With outcast allies at his side and formidable enemies against him, Mayo is the only one who can stop a conspiracy that stretches around the world!"},{"name":" Childhood Friend & Me","avatar":"https://mangadex.org/covers/10f9c390-b0c2-4dff-8287-226e20b27400/b553ab87-dd69-42cb-9c3b-78f78207500b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.85","status":"Completed","tags":["Oneshot,Long Strip,Romance,Comedy,Girls' Love,School Life"],"nutshell":"The story of me and my childhood friend, who's so cute I just want to eat her.\nGL oneshot, fluffy. A manhua I made to practice over summer break in high school, the art and writing are both pretty rubbish. I hope you don't dislike it."},{"name":" Transistor Teaset","avatar":"https://mangadex.org/covers/10fd0813-c429-4c38-94f8-f364a1c3cd75/9ccdbd21-e49c-494f-957d-16b11a2342bd.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Comedy,Girls' Love"],"nutshell":"When they were young, Suzu and Midori were separated as Midori moved away. Suzu grew up and has become a builder of robots and anything else mechanical she can get her hands on. One fateful morning her favorite electronics shop is closed so she goes off to relax while waiting for the shop to open when Midori calls again, after all these years, wanting to take up where they left off. Suzu is ecstatic about this – they had so much in common when they were young…\nOnly Midori has opened up a Maid Café…\nWikipedia"},{"name":" Okujou no Bai-Bai","avatar":"https://mangadex.org/covers/1100b6c7-3b41-4cc9-bbba-a68e37173f07/e19adca4-71f8-4e78-bafb-e33e4f58fc6d.jpg.256.jpg","country":"Japanese","stat":"7.69","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Drama,School Life"],"nutshell":"Nogi is a fearless and respected karate black-belt who beats up bullies without breaking a sweat. But to Fujiwara, he's just \"Kei-chan\": best friend and object of his secret affections. Can their friendship survive? Or develop into something more?"},{"name":" By Myself","avatar":"https://mangadex.org/covers/1101b245-d1fa-457b-a456-2e3948d03564/d88c80b3-42c1-4bea-a6aa-b2dfc65bd0f1.jpg.256.jpg","country":"Korean","stat":"7.94","status":"Completed","tags":["Thriller,Psychological,Long Strip,Survival,Post-Apocalyptic,Drama,Web Comic,Mystery"],"nutshell":"The spread of a virus of the national disaster proportion has shut down Seoul! Haebin, who lost all of his classmates in an incident a year before, left home in order to avoid being alone again. What is the unexpected truth awaiting him that keeps him from regaining his normal daily life?!"},{"name":" I Wish...","avatar":"https://mangadex.org/covers/11042a9e-303a-4f26-a43e-680a58d972d6/68accc7e-4073-490a-a370-36617b887d60.jpg.256.jpg","country":"Korean","stat":"7.93","status":"Completed","tags":["Romance,Comedy,Drama,Fantasy"],"nutshell":"K is a wizard who can grant wishes–all he asks in return is that which is most precious to the wisher…\nMourning from a horrific loss, Jin Ryu wants K to bring back her parents and brother from the dead. But when K tells her that a wish such as this can only lead to greater tragedy, he agrees to take her on as an apprentice. Now Jin observes K with his various and sundry clients: A father who wants to put a stop to his son's relationship… A young woman who longs for her lover to remember… A boy who will do anything to be accepted…"},{"name":" Kyuuketsuki no Sumu Machi","avatar":"https://mangadex.org/covers/1109d620-f2cd-4178-ab62-ce721d39401b/45f8cfaf-22a1-4d2c-814d-8405cda32d10.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Comedy,Vampires"],"nutshell":"Two-shot about a town inhabited by a vampire."},{"name":" Knowing You","avatar":"https://mangadex.org/covers/110ae9cc-d6fb-4bc4-bb23-84f08b0cfb81/1b31fff4-b9d1-43aa-9d4c-9c3dc0090eb7.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.73","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Comedy,Boys' Love,Drama,School Life,Full Color"],"nutshell":"Since he started high school, Lu Jia has rarely called Mu Wenran “Big Bro”. Exceptions would be whenever he is lying or feeling nervous. Back when he didn’t want to do his homework, he would act sickly and say, “Big Bro, my head hurts” or “I understand everything in this chapter. I really do, Big Bro”. Yet now, 23-year-old Lu Jia will still cry in front of Mu Wenran. While crying, he said, “Sorry, I don’t like you, Big Bro.” He lied. Mu Wenran smiled and wiped Lu Jia’s tears, before saying softly, “It’s alright. I like you.”"},{"name":" Hantsu x Trash","avatar":"https://mangadex.org/covers/11101340-f122-40e6-a5e6-a0feffa120da/880507c5-375f-48b2-a0f0-dc769547bd26.jpg.256.jpg","country":"Japanese","stat":"6.16","status":"Completed","tags":["Romance,Comedy,Sports,Harem,Drama,School Life"],"nutshell":"Hamaji Youhei, a freshman in high school, lives his life aimlessly, lazing around all day. He can't keep up with his studies, no good at sports and won't stick with anything for long. Besides that he's a pervert who's continuously rejected by girls. A sophomore convinces him into joining a club where he could lunge at girls, fondling and touching all he wanted. Thus he joined the Water Polo Club. Can Youhei, who never sticks with anything for long, find his place in this club?"},{"name":" Wings","avatar":"https://mangadex.org/covers/1113e7a6-341b-4f63-83ae-954d4aebaf2c/424e50ef-e361-44e3-ad0d-f562322f5928.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.83","status":"Completed","tags":["Oneshot,Psychological,Tragedy"],"nutshell":"A very short (poetic) oneshot about breaking free.\nFrançais :\nUne histoire courte et poétique sur la liberté."},{"name":" Truth Mask","avatar":"https://mangadex.org/covers/1116821f-0141-45ef-b91d-a8131343dd87/8de468fa-7424-4381-8e18-690abf5c6d34.png.256.jpg","country":"Chinese (Simplified)","stat":"7.89","status":"Ongoing","tags":["Thriller,Official Colored,Action,Psychological,Long Strip,Drama,Horror,Fantasy,Web Comic,Supernatural,Mystery,Tragedy"],"nutshell":"Student Wu Mian accidentally obtained a mask. Once you wear it, everyone will agree with whatever you say or do. Even then, he has no courage to confess to a girl that he secretly loves. Until an incident completely changes his whole life…    Official English (INKR)"},{"name":" Flowering Harbor","avatar":"https://mangadex.org/covers/1116ca63-ca60-46b4-8161-908749a1c2fb/db972642-8812-4ebd-81a1-dc1f8b26ec7f.png.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Psychological,Survival,Philosophical,Drama,Slice of Life,Tragedy"],"nutshell":"It is 1969, and famed artist Seiichi Hayashi has decided that his comics, having flirted with pop, need some heart and soul. He turns to the moody graphics of old kashihon gekiga and the sentiments of Japanese enka blues. \"Because of you, my long life will be withered with frost. This fading shadow of an empty shell … our love.\" So laments the heart-broken bar hostess of Flowering Harbour, one of the classic works of the legendary alternative manga magazine Garo."},{"name":" Meiryotei Goto Seijuro","avatar":"https://mangadex.org/covers/11178b82-42d8-475e-82b7-779adf654d6f/b1cc0381-051c-49da-91f3-aa30d58497e0.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Action,Psychological,Long Strip,Martial Arts,Philosophical,Drama,School Life,Supernatural"],"nutshell":""},{"name":" Super Gakko Den Gut!!","avatar":"https://mangadex.org/covers/111afcfa-1175-4136-b348-76864c7e6829/0a958cee-a718-4067-ae70-6b6209bb27ee.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":"A huge school that rises above the sea, its name is \"Garyugakuen\" . There, a hot-blooded boy named Bandou Gut enters the school. Together with his classmates who possess various abilities, he fights his way through hell's classes and aims to become King Dragon King."},{"name":" Mawaru Sekai no Kimi to Boku","avatar":"https://mangadex.org/covers/111f516d-057e-4dc0-94aa-45351051199b/50593850-5616-4684-8aae-b601bd65c11b.png.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Historical,Romance,Boys' Love,Drama,School Life,Supernatural"],"nutshell":"Mawaru Sekai no Kimi to Boku\nWhen they were very young, Keito and Tomoya made a promise to be together forever, but after Tomoya disappeared one morning, Keito lost his faith in people. Years later in high school, Tomoya makes a sudden return, but now Keito's no longer a cute little kid Tomoya seems to have forgotten who he is!\n\n\nMasaka no Futari\nHigh-school student Akito is too cute! So cute that he's been traumatized by attackers both male and female. When Akito's mother convinces laid back college student Kunugi to tutor him, is Akito destined to be attacked again? Or is Kunugi really just a nice guy?\n\n\nLucky Item\nYazawa Shizuma, receives a visit one night from a middle school classmate, Hanai. Hanai is running from debt collectors and needs someone to take care of his son, Hanai Souta. What will happen between these two? Maizuru from Yubisaki no Koi makes a guest appearance in this story.\n\n\nHitomi no Ori\nWhen he was small, Ran was found at the brink of death by Byakuroku-sama, a non-human man with beautiful eyes. Byakuroku-sama now employs Ran as a jack-of-all-trades, often undertaking dangerous missions and depending heavily on his loyalty. What happens when that loyalty comes into question?\n\n\nHitomi dj - Sakayume no Niwa\nRan has a dream in which Byakuroku vanishes into thin air and only bones remain. Even knowing it was a dream, he can't just help being worried. Will the dream become reality…?"},{"name":" Pas Seul on Clavier","avatar":"https://mangadex.org/covers/111f6845-32e2-4f5e-9d60-371b1e964692/62bf544d-cece-4988-9fc2-e85df27c87a7.jpg.256.jpg","country":"Korean","stat":"8.09","status":"Completed","tags":["Long Strip,Boys' Love,Drama,Web Comic,Music,Full Color"],"nutshell":"Poe, an unfortunate pianist prodigy who lost his right arm, decides to write a solo melody for the rising dance prodigy, Cyril. Now, the fate of a flower that has just bloomed and a flower that has already wilted, meet… Can a lost solo melody filled with yearning and envy be completed?\n\n\nOriginal Webtoon <kakao>\nOriginal Webtoon <Naver>\nOriginal Webtoon <Mr.Blue>\nOriginal Webtoon <RidiBooks>\nOriginal Webtoon <Bomtoon>\nOriginal Webtoon <Comico>"},{"name":" With Schluss","avatar":"https://mangadex.org/covers/11203e11-3b8d-448c-bade-2e009e26941c/d66c6cb0-c0d1-4784-827d-b5be66b377f9.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Demons,Romance,Comedy,Adventure,Fantasy,Supernatural,Mystery"],"nutshell":"The boy who is a prestigious demon, Yuri, helped the fallen witch, Vie. Two people are attracted to each other, but they have a secret to each other-?! A heartfelt love story about the \"blood\" of a witch!!"},{"name":" Kankin (Mujiyu)","avatar":"https://mangadex.org/covers/11259c8d-2347-4fe9-a28e-1b3744efeedd/589bec03-1d38-468c-891f-31877070fdaf.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Psychological,Romance,Office Workers,Drama,Mystery,Adaptation"],"nutshell":"One night, an office lady Anna, who is returning home, is asked by an elite office worker-like handsome man for directions. But that was all I remembered, and then I fainted for some reason. And when I wake up, I'm bound up on a bed in the middle of an inorganic room!?\nWhen a person, in extreme conditions, was crazy about distorted love... what will happen in the end?!"},{"name":" Kimera","avatar":"https://mangadex.org/covers/11268778-d757-4d70-8012-0537dd1afc13/c45fcfc6-715f-47cc-9cc3-e94e10ef6194.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Action,Romance,Adventure,Fantasy,Tragedy"],"nutshell":"Once upon a time, there was a tribe that fought for the empire. They were feared by everyone. Their specialty was destruction and slaughter. They were called \"kimera.\" Rin was one of them. She lived in a peaceful village until the war broke out. And at that moment, something within her began to awaken, and something beyond imagination began!"},{"name":" It's Been Awhile, Shall We?","avatar":"https://mangadex.org/covers/11286799-7832-4aae-a0db-e5be67a63027/147af27a-92dd-4c82-8026-2f26bd830586.jpg.256.jpg","country":"Korean","stat":"7.96","status":"Ongoing","tags":["Long Strip,Boys' Love,Web Comic,Full Color"],"nutshell":"Never in my life had I felt bad luck… Until now… The editor-in-chief at my new company is the ex-boyfriend I had a bad breakup with?!\nThe scruffy looking Ah-jun that disappeared long ago has now changed completely. Since his first day on the job, Shin had been suffering from Ah-juns harassment overtime. In a fit of anger, he has a one night stand with someone else then heads to work. But seeing Shin, Ah-jun begins to feel mixed emotions."},{"name":" Jamais Vu","avatar":"https://mangadex.org/covers/112fc0f3-3661-4428-a2dc-3715d72b6ab6/ab63adcc-3650-4874-8107-838463a7e466.png.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Oneshot,Sci-Fi,Time Travel,Mystery"],"nutshell":"Another Earth has been discovered by an astrologer in the US, giving it the name \"Jamais Vu\". That Earth is soon discovered to be a group of aliens, going around the galaxy before arriving in the actual Earth to kill people and appear like them."},{"name":" Have a Safe Day!","avatar":"https://mangadex.org/covers/11326ff0-fda7-42b2-b4ac-7f226c871e03/21435190-bfb8-413a-aa0a-a8ef030224ff.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Drama,Web Comic,Full Color"],"nutshell":"Minju, who has been unable to tolerate injustice since childhood, is stronger than anyone else and has the skills to subdue opponents, unlike her small and cute appearance. Then, one day, at a freshman reception, she mistakes Joo Won, a junior, for a molester, and ends up breaking his arm...! Min-ju, worried about Joo-won telling her not to worry as if it's nothing special, decides to protect him until his arm is healed!?\n\n• Alternate Raws (Naver Series)"},{"name":" Houkago Kiss","avatar":"https://mangadex.org/covers/1133022d-10e5-4c42-a222-bc896e267c13/79899a35-55ad-46fe-9051-7e8456d03615.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance,Comedy,Anthology,School Life"],"nutshell":"After School Kiss\nAll the guys think Fuyu Yamashita is the stupidest girl in school and dare the guy who does the worst on the next test to go out with her. That guy turns out to be Minato Sakurai, the scariest guy in school. Poor Fuyu?\n\n2-3) Making an Angel\nSayaka Sunohara a highschool student and a talent scout find a cuteish boy playing with a cat. Thinking that he would make a perfect image of an Angel she brings him to her mother's agency. After the makeover, he fits the image perfectly. When Sayaka asks him \"what would you like to eat?\" as a treat for his successful photo shoot. He say \"I would rather have you instead…\". what would Sayaka to do with this Cute Angel or rather a Bratty Devil?\n\nYoung Nobleman Lock On!!\nIori Seto known as the \"Stupidity Queen\" has a crush on Motochika Ishida who happens to be a school elite, a cold student body president plus the chairman's son. Just to stay close to him she decides to join student body. But all she does is cause trouble for Motochika. How will Iori be able to lock on this cold young nobelman?"},{"name":" Kaguya-san ha Hansei Shinasai","avatar":"https://mangadex.org/covers/11354aa5-47c9-4583-bdb8-5fe232e99702/202860ca-0162-4123-b812-490b971b96bb.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Sci-Fi,Comedy"],"nutshell":"Kaguya, an alien who was cast down onto Earth as punishment, takes over the body of a high school girl and must learn to adapt to human society... but of all things to take interest in, these lowly life forms' \"sexual reproduction\" is what catches Kaguya's attention..."}]