[{"name":" We Are Not Familiar","avatar":"https://mangadex.org/covers/7969981c-d424-46ba-9c8e-f448252cbc96/18401d10-c344-4b26-bf69-057bf8a0695e.png.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Office Workers,Drama,Web Comic,Full Color"],"nutshell":"Even if you're a social elite, you can never escape the nightmare of going on blind dates! This is a story of a workaholic man and woman who meet each other while trying to escape their respective blind dates.\nIn order to fulfill the \"Couple Contract\", the fake couple must perform perfectly in various emergency situations. The contract clearly states that they are merely just \"business partners\", but why is there always this uncontrollable throbbing sensation inside?!\nStay tuned to \"We Are Not Familiar\" and watch how awkward adults fall in love."},{"name":" I'm a Virgin, So What?","avatar":"https://mangadex.org/covers/796a641f-6dd6-46a4-aebc-44930967b920/e8bbd899-da19-40bf-82ab-1bd5fc682d2c.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"正在受困于人生第一次桃花期。\n究其原因正因我还是处男——。\n然而对于这样的我来说\nSEX的机会突然降临！？ \n我！！该怎么办！？"},{"name":" The Prince Regent's Concubines","avatar":"https://mangadex.org/covers/4bb27ee8-2aa9-4c43-a7bf-176de85e3a90/f39c98bc-d5d7-4fa0-9466-baeb1363e4c2.png.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Completed","tags":["Reincarnation,Historical,Long Strip,Romance,Drama,Web Comic,Full Color"],"nutshell":"Faced with betrayal by her lover and relatives, Lin Yaoyue dies with despair in her heart. Awakened back to her youth, she is shocked that Murong Jin of her past life has become her lover!. With a new lease on life, Lin Yaoyue begins her new journey to punish villains for their evil deeds"},{"name":" The Girl With a Mirrored Heart","avatar":"https://mangadex.org/covers/4bb2b312-0a55-4db5-a229-e7ab1d0da0b5/4950b3a9-d742-4f8c-ac01-06144894e6de.png.256.jpg","country":"Japanese","stat":"7.51","status":"Completed","tags":["Oneshot,Romance,Girls' Love,Drama"],"nutshell":"The story of a girl with a rare medical condition."},{"name":" Dojikko Pants","avatar":"https://mangadex.org/covers/4bb77aea-71bd-4e56-8c9b-c6dbd10108e7/b4f999f4-16fc-46d1-8460-960a98f703cc.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance,Boys' Love,School Life,Slice of Life"],"nutshell":"One day, a super-clumsy Tanigawa accidentally went to school wearing his sister's underwear. Unfortunately, he was seen by his classmate Matsuyuki, and through a ridiculous misunderstanding thought Tanigawa was some kind of gay pervert? Tanigawa tried to clear up the misunderstanding, but instead just made everything worse! However, Tanigawa gradually becomes attracted to Matsuyuki, who in turn tries to help Tanigawa get rid of his clumsiness."},{"name":" Taka to Tonbi to Aburaage","avatar":"https://mangadex.org/covers/4bc34c79-773e-4343-8545-f23c4a302a68/20273f98-4901-40dc-9ddb-c37291769d0e.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Romance,Boys' Love,School Life"],"nutshell":"Hanajima is the most popular and sought-after guy in school. But he has a secret: a hidden self, who is unbearably egoistical in both words and thoughts! The only one who knows that is a fellow schoolmate, Nodate!"},{"name":" Fushi to Batsu","avatar":"https://mangadex.org/covers/4bc76b48-d9c2-4f58-9f6d-d0eb4db71b2b/553ee26f-d51a-4c91-ba74-2eff186733c8.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Ongoing","tags":["Horror"],"nutshell":"A boy with a death fetish trapped in a love hotel amidst a zombie apocalypse."},{"name":" Kimi ga Kokoro ni Sumitsuita S","avatar":"https://mangadex.org/covers/4bd02114-8d2f-42cf-baf2-2343f67f601a/e4cf7dcd-8650-4b3f-a743-ae5b837b4ba7.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Psychological,Romance,Office Workers,Drama"],"nutshell":"Kyouko 'Kyodoko' Ogawa, who works at an underwear company, meets the person she was in love with in her university days once more at her workplace. Even though she ought to have been able to fall in love with someone else at least once, she ends up realising that the curse of Hoshina, who hurt and controlled her, was stronger than those feelings. At the same time as Kyodoko once more gets mired in the maze that is Hoshina of her own will, he has a relationship with her kouhai and even manipulates her work as he likes—?"},{"name":" CEO X Otaku Girl","avatar":"https://mangadex.org/covers/4bd7e36c-6d23-4fb1-9831-70c116a1e157/02c1b66d-4a63-41a2-b423-36db0839adab.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.94","status":"Ongoing","tags":["Long Strip,Romance"],"nutshell":"A cute otaku girl ventures out of the virtual world and into the real world. Due to a chance encounter, she witnesses a 'gay moment' involving the CEO of a huge corporation.\n'Wha—?! That was such a gay moment… He's the CEO?!\n'Omigosh! That's way too exciting for me! I-I-I… I'd better leave before he catches me…"},{"name":" Jikantou","avatar":"https://mangadex.org/covers/4bdc3266-64a2-41c8-90c2-ecb125cb1465/0b53de6b-d067-4b21-bc6a-90886ccd25dd.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Drama,Horror"],"nutshell":"Jun is a part time assistant director for a variety TV show that takes place in abandoned buildings and ruins. Today's episode features a massive former residential complex on Yagou Island, once a thriving coal mine settlement but now an abandoned island. Jun receives a video message on his phone from a bandaged man in a wheelchair claiming to be from the future.\n\"Everyone is going to die.\" Yagou Island has a legend surrounding it. The locals say that the island is a forgotten land, an island that does not know time. And it is on this \"Island of Time\" that Jun and the rest of the crew have to avoid being killed, setting the scene for an unexpected murder mystery."},{"name":" Renai Shigou Shugi","avatar":"https://mangadex.org/covers/4be018ea-d733-4323-8840-e2dc1082729e/4d2ea247-0949-4d38-8f36-4f80d38be9da.jpg.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Romance,Comedy,Martial Arts,Drama,School Life,Tragedy"],"nutshell":"Karate girl Seri tries to kick away her past in order to catch a new guy at a singles party, but Tamaki, a childhood flame from her old karate dojo, shows up to show off and makes her heart pound. Their reintroduction leads to a karate challenge, and if Seri loses, she must become Tamaki's \"toy\"…!? It's a game of love with more rivals and obstacles (and sex!–LOTS of SEX!) than either Seri or Tamaki could have foreseen!"},{"name":" Kin no Kuni, Mizu no Kuni","avatar":"https://mangadex.org/covers/4beb73b3-13c8-4b2a-8bbc-8e42514b3b38/1ed5bc33-e308-445a-bfca-942480efe8e3.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Historical,Romance,Comedy,Slice of Life"],"nutshell":"Long long ago, there were two neighboring nations who were on bad terms.\"The grass from your nation keeps getting into mine every single day\". \"The sound of futons getting hit in your nation is annoying\". They argued over dull subjects like these. At long last, they got into a war because of the dog shit incident, And in the confusion, the gods intervened and mediated a truce between the heads of the two nations. This is what they said to say: Land A will send the most beautiful girl in the land to Land B, And Land B will send the smartest boy in the land to land A, and they will both be wed.\nNote: Ranked #1 Kono Manga ga Sugoi! 2017 (Female readers)"},{"name":" Watashi no Shiiku Gakari-kun","avatar":"https://mangadex.org/covers/4bebc956-a4c6-4d0b-8c24-6254a9362f46/fd40f2ea-8fcd-45a1-a482-862e0e1904c0.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"The first time for a shy girl to want to have a friend. But, mistakenly she talks to Hayamizu-kun the delinquent…! But, surprisingly Hayamizu-kun is xxx…?! Warm and kind?! A youthful love story."},{"name":" Haru yo Koi","avatar":"https://mangadex.org/covers/4beceeb0-6f0e-4817-a240-2c7f7b68cbf9/0b49f965-ec43-46ef-8b82-b9a6cc9cb94a.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Romance,Boys' Love,School Life"],"nutshell":"Spring and Love Come Early?\nIchio Tomochika, the archery club president, likes the calligraphy club member, Komada Aoba. With black hair and black eyeballs, Komada is just like a stubborn black cat. Looking at such an adorable cat everyday, Ichio hopes Komada can sense his feelings he has for him. After an unexpected kiss from Ichio, will Komada return his feelings?\n\n\nThe Trap of Love\nIwami Seiichirou is in love with his beautiful classmate Yuuzaki Midori… unfortunately, Midori is what you call a bubble brain - and really popular in their all-boys school. Iwami has known Midori since middle school, but is just friends enough now?\n\n\nI Want A Bit More Love\nTakanori was Rokuta's classmate in highschool. After meeting each other coincidentally, Rokuta has been eating at Takanori's Italian restaurant every night. When a female editor ends up tagging along with Rokuta one night, complicated feelings arise.\n\n\nYouth Melancholic\nNikaidou is always second to Hirahata, be it in sports or studies. Naturally, Nikaidou thinks of Hirahata as his rival and dislikes him. When Nikaidou goes to buy a pair of glasses, the shop turns out to be owned by Hirahata's family. After that day, the two boys always seem to be together… but why is Hirahata so interested in being around Nikaidou?\n\n\nWhile Numbering Stars\nYoshino Sakumi noticed his boss, Kashihara Ryouji, looking at him… the way a woman looks at a man. After confirming his suspicions, the two men became engaged in a sexual relationship… but why is Cheif Kashihara so nice to everyone, and why is Yoshino so irritated about it?\n\n\nWhile Numbering Stars Extra\nYoshino invites Kashihara to his house…. but for the night, or forever?"},{"name":" Batsu Game","avatar":"https://mangadex.org/covers/4bedde50-1af0-4e1f-b23e-b845c2527bf7/f823bf32-e7e1-4e63-bb04-a09f79e2d992.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Boys' Love,Drama,School Life"],"nutshell":"On a dare, Nagami kisses a random guy that just happens to be walking down the street. He apologizes and just laughs it off with his friends, but when some days later he accidentally meets this person again, things take a rather unexpected turn."},{"name":" Where the Sea Breeze Blows","avatar":"https://mangadex.org/covers/4bef98a3-62b4-4931-8c9a-26d457671bc6/27829585-6006-49e6-8a11-600b53404dd1.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Drama,Slice of Life,Full Color,Tragedy"],"nutshell":"During an accident, he was once able to feel the warmth of mankind. Many years later, he met his savior again during a migratory period but was unable to save her so he brought her child back home. The person who picked the child up was the her father who named him Xiao Hai. For more than ten years, Xiao Hai’s kindness and warmth healed his grandfather and affected the people around him…"},{"name":" Shiro no Sakana","avatar":"https://mangadex.org/covers/4bfa0b68-73f8-4f7b-b692-e11f9ac468b5/d08b5414-5cfd-431f-bf7d-5bde2082c3d1.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Drama,Slice of Life"],"nutshell":"藝大受験に失敗して美術予備校に通う一浪の少年、今 正孝(こん まさたか)\n絵を描くことが好きで、\n予備校には同年代の仲間がいて、\n毎日それなりに楽しいけど\n厳しい現実の前に不安が募る毎日。\nそれでも筆を取ることを止めない少年は仲間たちと共に美大合格を目指して今日も奮闘する。"},{"name":" Touhou - Lovely Dream (Doujinshi)","avatar":"https://mangadex.org/covers/4bfc4a52-a8da-4b54-8855-85f1a3ed7df8/c1bcd5b2-5f79-4ea9-9099-b3e9f404feac.png.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Drama"],"nutshell":"A story of how Reimu and Gensoukyou have deal with the Shrine Maiden of Hakurei losing her powers over time. She must marry and bear a child.\nPrimarily told from the perspective of Marisa.\nNote: This is a sad story."},{"name":" Dragon Jam","avatar":"https://mangadex.org/covers/4bff1f95-398f-4303-93a6-41f48f0c937d/ffa4c14d-69e7-44ed-b89f-cb56fb748669.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Sports"],"nutshell":"Tatsuya Tachibana is a sixteen years old guy that decides to not go to highschool and devote his life to basketball. After a year, Tatsuya spend his days with Taizo and Ako, friends from middle school attended the basketball's club with Tatsuya, playing streetbasket at the playground and scraping together money in 3 vs 3 matches. One day, after a huge defeat both in numbers and money in a 3 vs 3 match against Ryoji, an old acquaintance from the past, Tatsuya is approached by a weird man named TJ. TJ is a professional Streetball player, he is interested in the way of playing of Tatsuya&Co and decide to give them the chance to training with his team. Tatsuya&Co play against TJ and his friends, realizing soon that they are still very inexperienced and not ready to enter this world.\nThe way for Tatsuya to embrace and understand the sport loved by his late father is still very long."},{"name":" Crows ZERO - Borderless (Doujinshi)","avatar":"https://mangadex.org/covers/4bffa0ef-4047-4776-ad55-1dfa160394ae/87a3c917-9a55-4f83-a826-5750ac8ae7df.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Boys' Love"],"nutshell":"Pairing: Genji x Izaki"},{"name":" Netsuai Prince - Onii-chan wa Kimi ga Suki","avatar":"https://mangadex.org/covers/4c087a01-072a-4e0f-b4d1-46bca6a82cf7/26841944-8918-4947-8eca-c76cf92965db.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Ongoing","tags":["Romance,Reverse Harem,School Life,Music"],"nutshell":"Due to the second marriage of her mother, lively high-school student Amamiya Matsuri becomes the younger sister of the super popular idol group of triplets \"Terzetto\"! Star celebrities for stepbrothers?! A forbidden secret love with a perfect prince ★"},{"name":" Dousei Chuu!!","avatar":"https://mangadex.org/covers/4c12d145-74a7-469a-9169-78260e429a1f/1f28d7eb-316a-4edf-9d4b-2f376c873a5e.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Comedy,Boys' Love,Crossdressing"],"nutshell":"Shinya goes to live and take care of with his two younger cousins, Tsubasa Fujisaki and his younger brother Subaru, after their parents go overseas. However, Shinya is surprised to find both cross-dressing upon his arrival."},{"name":" Tobu, Kokoro","avatar":"https://mangadex.org/covers/4c138741-0ad9-425d-94c5-26840a930a51/9276ec34-9ac8-48d6-ad59-746d5c37d396.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,School Life,Supernatural"],"nutshell":"Noda, a boy who has 3 secrets: First, he's in love with his classmate Fukushima. Second, he can draw his spirit out from his body. And finally, sometimes he secretly watches Fukushima at home, when his spirit has left his body. But one day he drops in at Fukushima's at a very unfavorable moment.\n\n\nA boy who is asked to take care of a huge white rabbit and how the animal makes him understand his own feelings.\n\n\nYuzuru Sakaguchi, a boy who leads a lonely but peaceful life, cut off by the rumor that people can see ghosts around him. One day a new teacher comes to his school and his life is thrown completely out of joint."},{"name":" Tsari to Yobareta Otoko","avatar":"https://mangadex.org/covers/4c1454fe-0443-439c-9cde-76c6c36296a4/2ff13837-4bea-468b-ae0b-96e79766807f.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Drama"],"nutshell":"Akira Kousaka was a lecturer for Tokyo Art University. Ever since he read about the Imperial Eggs, he wanted to visit Prussia to look at it with his own eyes. Finally with the winter break, he was able to go to Irina Art Museum in Prussia where the Imperial Eggs were displayed. Little did he knew that just by triggering the alarm system, his life would forever be changed with a single encounter.\nConsisting of a manga by Higashino You and a novel by Minakami Rui. 2/3 of this book is a novel in Japanese text."},{"name":" Hell is Other People","avatar":"https://mangadex.org/covers/4c168341-c8cd-4549-89ca-85318e10dfcc/97e1016f-a707-4339-97a0-f6028050b498.jpg.256.jpg","country":"Korean","stat":"8.05","status":"Completed","tags":["Thriller,Long Strip,Horror,Web Comic"],"nutshell":"Yoon Jong Woo arrives in Seoul from the countryside to work. He lives in a Goshiwon, a small room usually rented by students because of the cheap rent. However, strange events start to happen because of the strangers around him."},{"name":" Mujintou Lovers","avatar":"https://mangadex.org/covers/4c17fc7e-2193-4408-bb3d-82ce8e7ab984/b174a480-841b-43f5-b170-e07faf799db3.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance,Comedy,Boys' Love"],"nutshell":"Lovers on a Desert/Peaceful Island\nThe little rich boy, Hiroshigu, went on board a fishing boat out of curiosity as well as for the fun of it. However, he was swept off by waves and ended up on a deserted island with the bodyguard he hated most - Miyakawa!\n\n\nLift\nAkasaka is on his way to a very important meeting when the elevator gets stuck! But he's not alone: Ozawa is stuck with him, and he seems to know Akasaka…\n\n\nLove on a Storm Mountain\nRickshaw driver Hayate was educated about the town by the beautiful Kei, who he first saw dressed as a woman! But Kei is keeping a secret from Hayate…\n\n\nThe Gaze That Never Wilts\nItou-sensei just recently transferred to the all girl's school, only to have fellow teacher Tanaka confess to him in public! Tanaka is determined to win Itou over, but Itou just wants to live a quiet life, especially after what happened six years ago at the boys school he used to work at.\n\n\nThe Return of the Desert Island\n3 page short about Hiroshigu and Miyakawa.\n\n\nHousekeeper Tomioka's Diary\n4 page short about Hiroshigu's housekeeper following him to Miyakawa's place."},{"name":" The Cat's Gratitude","avatar":"https://mangadex.org/covers/4c19a8ea-c19c-408d-a94e-bc3e70c5e5cf/7b528cdb-0b96-46ca-8ebd-9e36c7c64399.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.90","status":"Ongoing","tags":["Long Strip,Comedy,Fantasy"],"nutshell":"One day, Yan Jingnan saved a cat which was lying on the ground and injured. Instead of turning into a cute cat girl, it turned into a……"},{"name":" Kekkon Shitai Monsutaa ni Natta Watashi no Hanashi","avatar":"https://mangadex.org/covers/4c19e8ca-c95f-43eb-890a-3c599942cb3f/8b950ba3-f663-48f3-b33a-1effbf6e304a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Psychological,Comedy,Drama"],"nutshell":"あの頃の私には「結婚」しかなかったーー。　整形をしてコンプレックスから抜け出した新しい人生に待っていたのは、「結婚」という新たな壁！　彼への“想い”が“重い”に変わったとき、私は、一線を超えてしまったのかもしれない…。「幸せ」って？「自分の価値」って？　『自分の顔が嫌すぎて、整形に行った話』の著者がその後のリアルすぎる人生を描く実録エッセイコミック！！"},{"name":" Sanwen and Xiaobai","avatar":"https://mangadex.org/covers/4c1d8732-cbc8-495c-b67b-58b699265e0a/865618e1-4425-49c1-ae7b-6f0e96f0861c.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Animals,Long Strip,Comedy,Web Comic,Slice of Life"],"nutshell":"The daily life of the orange cat \"Sanwen\" and her son \"Xiaobai\". Oh, yes, and their strange friends."},{"name":" Again","avatar":"https://mangadex.org/covers/4c1e7dd6-66d6-405d-911d-c8092072d179/c34dd0a3-183c-46a1-9ee2-246bccbb81e3.jpg.256.jpg","country":"Korean","stat":"7.78","status":"Ongoing","tags":["Official Colored,Boys' Love,Web Comic,Adaptation"],"nutshell":"Korea's top actor, Han Nok-Yung.\nHe lived a life full of pride, and believing in his beautiful appearance and popularity, however...\nA sex video that was taken with him and a 3rd generation Chaebol was revelled to the world and his career went into the abyss.\nTo make things worse, an anti-fan attacked him and threw sulfuric acid all over him and scarred his face.\nJang Hyun-Jae, his Hyung who he had a crush on and the CEO of his trusted company who he expected to save him, but sadly he is abandoned. In the end Nok-Yung makes an extreme choice...\nHowever, he opens his eyes and wakes up to 3 years prior.\nHe must have gone back in time. This time Nok-Yung decides to try and build his career steadily and lead a better life by being nicer to the people around him...\nKang Jun-Il, the 3rd generation chaebol, who he was filmed with in the past are constantly intwined.\nHe thought that Jun-Il hated him, but now he doesn't think that's the case...\nIn his second life, will he be able to succeed and have a chance to find a new love?"},{"name":" Hitler","avatar":"https://mangadex.org/covers/4c1fce47-9d04-4c0c-a25c-30e068a0f60e/78d17133-eb37-434d-973e-5c1f8aaef61b.png.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Thriller,Historical,Monsters,Psychological,Comedy,Crime,Survival,Military,Philosophical,Drama,Horror,Slice of Life,Tragedy"],"nutshell":"(from amazon.jp):\nShigeru Mizuki depicts the life of the dictator who shaped the 20th century!\nIn addition to the title story, which carefully traces the strange fate of Adolf Hitler, this volume also includes a Beethoven biographical manga and rare short essay works from a wide range of adult-oriented magazines.\nThe book is packed with the charm of Mizuki's verse, which depicts a wide variety of themes.\nCommentary: \"Hitler is a monster who appeared in human society\" by Taro Minamoto (mangaka and manga critic)\nOfficial English"},{"name":" Dazzling Prince!","avatar":"https://mangadex.org/covers/4c2112b6-348b-454d-b2a1-327d170a7ac4/2bd81feb-6929-4398-b7c4-3f784ec5c6cf.jpg.256.jpg","country":"Japanese","stat":"7.40","status":"Completed","tags":["Romance,Comedy,Magic,Drama,Fantasy,Adaptation"],"nutshell":"The young lady Lina originally comes from the wealthy count Randall’s family line. However, because of the bad weather that resulted in bad crops and because of her good-natured father, the family ended up being severely swindled. She quickly fell and became a poverty-stricken young lady. But then one day Lina is forced to participate in the evening party to decide the fiancée of the third prince Gilbert… Since she stuck out like a sore thumb she decided to leave after she got a glance of the prince but… What is that dazzling light behind the cheers of joy the young ladies are making…?!"}]