[{"name":" The Bad Ending of an Otome Game","avatar":"https://mangadex.org/covers/6fcd4531-a8f2-43ee-a1a1-b53bfd4726b2/7720036c-163d-4039-be17-aaf3c62632c4.jpg.256.jpg","country":"Korean","stat":"8.19","status":"Hiatus","tags":["Reincarnation,Long Strip,Romance,Reverse Harem,Video Games,Isekai,Drama,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"The game's heroine had a limited time to live. Meanwhile, I played the role of the villainous friend that vies for the male leads' attention before being eliminated by the player. However, after that kid died, I made the decison on my own to exit from this story.\nBut, what do I do? The reactions of those around me are a bit strange.\n\"I came to the marquess’s estate because Ophelia needed a friend around her age. And now, Ophelia's dead.\"\nTheir gaze seemed to be asking me why I was stating the obvious.\nI said it plainly.\n\"So, I should leave now.\"\nFor some reason, the two men made an expression as if they were at a loss for words.\nThey used to consider me a fly that stuck to Ophelia's side, so why?\n*Otome Game: A game targeted towards women where the protagonist (player) is female"},{"name":" Born as the Villainess’ Daughter","avatar":"https://mangadex.org/covers/6fd4e79c-b717-4f36-8226-5cd17d702547/588e1690-f096-4584-8641-52f09e415d4c.jpg.256.jpg","country":"Korean","stat":"7.71","status":"Ongoing","tags":["Reincarnation,Long Strip,Romance,Survival,Isekai,Drama,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"I was born as the villainess's daughter inside a novel. When I was born, Mom's wrongdoings have already been revealed leading to her confinement in the tower, and soon she'll receive a miserable death at the hands of the main characters. I held her hand while looking over my mother who searched for her ex-husband until her dying breath. My small hand entwined Mom's rough one and she finally turned to me with a warm gaze. \"I understand you, Mom.\" \"...\" \"Don't struggle anymore, and rest well.\" And don't wait for something like Dad who won't come. At my words, a tear fell from my mother's eye and soon, she comfortably rested. As the novel's villainess is dead, I, her daughter, will also die tomorrow night by those people. And then the second part of the novel will start. A novel where the main characters go on adventures, love and become happy at the first part. But I don't want to die and I have no thoughts of letting the second part flow as it is. \"It's fine even if I'm this mean.\" It's a life where I don't know when I'd die anyway, so might as well change how the novel's second part goes."},{"name":" I Have Max Level Luck","avatar":"https://mangadex.org/covers/6fd8201f-6f3a-48a5-b39e-f8359cfa2eff/ffdfd0d8-fd08-445c-825a-5455f89f75fc.png.256.jpg","country":"Korean","stat":"7.93","status":"Ongoing","tags":["Monsters,Action,Demons,Long Strip,Adventure,Video Games,Magic,Isekai,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"<End of The World> A Virtual Reality game praised for its extreme difficulty.\nHansung was once a top-tier ranker, but he got trapped inside the game!\nIt’s hard to survive with his current stats. However, Hansung has a high level of luck!\nObtaining SSS class skills from random boxes? That’s easy!\nHitting the jackpot from the slot machine? A piece of cake!\nHe is overflowing with luck!\nSo, can Hansung safely clear this game by only relying on his luck?"},{"name":" Castle Swimmer","avatar":"https://mangadex.org/covers/6fda1789-a09e-4fba-ba60-ac5aa71cbdbe/9d13d160-79a9-4b3d-8e9a-9462dc65f843.jpg.256.jpg","country":"English","stat":"8.16","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Fantasy,Web Comic,Full Color"],"nutshell":"What happens when your entire life is ruled by a prophecy – your future foretold by people you’ve never met, who died long before you were born. Such is the story of two young sea creatures. One believed to be a guiding light for his people, a Beacon who will lead them to a bright, prosperous future. The other is a teenage prince for who’s destiny is to KILL the Beacon so that HIS own people might thrive. When both reject the course set for them, it leads to a raucous adventure as big and unpredictable as the ocean itself – and a romance that nobody could have predicted."},{"name":" The Demon Lord's Love Life Isn't Going Well","avatar":"https://mangadex.org/covers/6fdbb56d-4438-4118-a806-013774c16137/29122f91-53b2-4159-a574-5172461afd2a.jpg.256.jpg","country":"Japanese","stat":"8.34","status":"Completed","tags":["Reincarnation,Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"Entering high school, Fujimura Kotone dreams of making friends and finding love. However, her classmates avoid her because of her scary demeanor. One day, a group made up of two girls and a boy come into her class and kneel before her, proclaiming, \"It's an honor to meet you, Demon Lord!\". With their antics, will she be able to obtain the normal love life she desires?\nA reincarnation romantic comedy that transcends space and time!"},{"name":" Fullmetal Alchemist - Digital Steel Remake: Armstrong Muscle Siblings (Doujinshi)","avatar":"https://mangadex.org/covers/6fdbfc27-e543-43ec-b4ce-7f97f6776980/c7a3214b-e432-4d39-9554-5a287ecfede7.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Oneshot,Comedy,4-Koma,Fantasy,Slice of Life"],"nutshell":"FMA fanbook, dedicated (mostly) to the Armstrong siblings: Alexander, Olivier and fan-favourite Catherine all make an appearance here."},{"name":" 3CM Hunter","avatar":"https://mangadex.org/covers/6fe9a526-e05e-48c4-8adf-af38ab4d4aec/8510c6e3-baae-4d26-a52e-e0e61a45018b.jpg.256.jpg","country":"Korean","stat":"7.78","status":"Completed","tags":["Award Winning,Action,Psychological,Long Strip,Survival,Superhero,Adventure,Post-Apocalyptic,Magic,Drama,Fantasy,Web Comic,Adaptation,Full Color,Tragedy"],"nutshell":"While out to get his sister’s favorite snack, Baekhyeon finds himself and the people around him suddenly shrinking... to the size of ants! Now, everything from cats to robotic vacuums pose a threat to human survival. Within this chaos, everyone is given a gift -- a unique superpower and interface that lets them see data about themselves. Though it’s become a dark and desperate world, Baekhyeon must put his ability and wits to the test to make it out alive and save his sister.\n\n\n\nOfficial Simplified Chinese Translation\n\n\nOfficial Spanish <Es> Translation\n\n\nOfficial Indonesian Translation\n\n\nOfficial Japanese Translation"},{"name":" Shokkan Harassment","avatar":"https://mangadex.org/covers/6ffaa442-aedd-4547-b1ca-0d7213b96a0c/79a4c2f9-b4eb-49f4-b60c-9c42a5083ed3.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Boys' Love"],"nutshell":"Yajima, a project lead in the design department, is swamped with work by Mita, his newly arrived boss from hell. Every day, he doesn’t even have enough time to eat a meal! When he becomes unable to endure his empty stomach and starts having snacks at his desk, Mita orders that snacking during work hours is prohibited! Yajima takes offence at this unreasonable order, but by accident, learns that Mita has a strange sexual fetish that means he gets aroused… by seeing people eat?!"},{"name":" Social Outcast","avatar":"https://mangadex.org/covers/6ffcf906-0f39-4dd4-a98c-9456724bd383/2cbd8c40-e6c9-4301-9ec1-099413e9afd3.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.77","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,School Life,Web Comic,Adaptation,Full Color"],"nutshell":"Song Yuanxun, an indifferent homophobe, matched with Fang Zhaomu, whom he hates, on a dating app! Unexpectedly, he found out that Fang Zhaomu is clingier than he thought…"},{"name":" Shingeki no Kyojin - The monster cries, “it’s scary, it’s scary.” (doujinshi)","avatar":"https://mangadex.org/covers/6ffe6f31-c0f5-4580-8d2a-dc535025cb55/a2d1beac-3774-4ced-b96a-f7d6e7e6a768.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Psychological"],"nutshell":""},{"name":" Ujin","avatar":"https://mangadex.org/covers/6fffad1d-2767-4439-9b8b-3c4dc7b4416f/82c56f2a-dec3-4339-89f5-5939a9bb30ac.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Fantasy"],"nutshell":""},{"name":" Marshmallow - Sugimoto x Asirpa -","avatar":"https://mangadex.org/covers/700106dc-efcf-4d13-b351-9adabdc55df9/5f75a4f1-1aa3-4c28-aa9e-97a0d2f489e8.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Drama"],"nutshell":""},{"name":" I Don't Mind Being Second Girlfriend","avatar":"https://mangadex.org/covers/70015311-3e53-4501-bd6e-7504edd16d08/eb7f0849-d9fd-4048-be9a-06dffe5edec2.png.256.jpg","country":"Japanese","stat":"7.65","status":"Ongoing","tags":["Romance,Comedy,Drama,School Life,Slice of Life,Adaptation"],"nutshell":"Kirishima and Hayasaka are two classmates who have a secret relationship in the public eye.\nIn their school life they act as if they do not know each other, but secretly, there is much more than people can imagine. Both of them get into a relationship that becomes difficult to break and ends up being impure, unhealthy and complicated since the relationship between them was nothing more than a fling that simply generated a love triangle before Kirishima’s first love and second love.\n\nLinks:\n\nOfficial LN (JP)"},{"name":" A Manga About a Village of Super-Ultra-Ultimately Cute Elves Burning Down","avatar":"https://mangadex.org/covers/700ca48a-57fc-46ce-8a1f-c35d56c4dd71/38551a25-f31a-4863-b7c5-99d27d9f7e75.jpg.256.jpg","country":"Japanese","stat":"6.99","status":"Ongoing","tags":["Comedy,Fantasy,Web Comic"],"nutshell":"In which a village of super-ultra-ultimately cute elves burns down.\nFrom the mangaka of Do Chokkyuu Kareshi x Kanojo."},{"name":" Day in the Life of the Shinomiyas","avatar":"https://mangadex.org/covers/700db640-6682-4a1b-804c-077f892e33dd/faabdf8c-9f6b-4d6e-b46f-d07f2bde5edd.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Slice of Life"],"nutshell":""},{"name":" Tokyo '80s","avatar":"https://mangadex.org/covers/700f7d54-71ea-497d-b279-87ed8199ea4e/476b89ad-48c8-4fe3-b551-5a854147bd5d.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Historical,Psychological,Romance,Comedy,Office Workers,Philosophical,Drama,School Life,Slice of Life,Tragedy"],"nutshell":"It's the story of a trip from a teens league of friends in Tokyo of the 80's till today, mirroring their paths and relationships."},{"name":" Something Happening","avatar":"https://mangadex.org/covers/7014040d-cb00-4215-bde0-516a28f4fc5a/97c18765-03ed-4454-9a0c-e84a7abb5696.png.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Oneshot,Comedy,Boys' Love,Slice of Life"],"nutshell":"Chihiro was just dumped by his girlfriend, so his senpai organizes a drinking party to cheer him up."},{"name":" Opening My Eyes, I Was a Princess","avatar":"https://mangadex.org/covers/70183b4a-30d2-4814-b89e-2c85ed0dc79a/54792709-6f81-4402-96a0-6e86ee35b749.jpg.256.jpg","country":"Korean","stat":"7.87","status":"Completed","tags":["Oneshot,Romance,Adaptation,Full Color"],"nutshell":"KR: ||\n콩가루 왕가의 막내딸로 다시 태어났다!?\n막둥이 공주의 콩가루 왕실 찰떡 만들기 프로젝트!\n“네 혼처가 정해졌다. 제국 황제.”\n막 태어난 자기 딸에게 무슨 소리야?!\n가족에겐 관심 0! 워커홀릭 국왕 아빠.\n나 홀로 로맨티스트 사치 만렙 엄마.\n자신감 대출 급구!! 오늘도 고독하신 첫째 오빠\n마이 라이프 이즈 마이 룰! 유아독존 둘째 오빠.\n심지어…… 미래의 남편은 할아버지?!\n\"그래. 내가 여기서 살아남으려면 딸바보, 동생바보로 만들어야 해!\"\n||\n\nLinks:\n\n\nOriginal Web Novel <eBook> (RidiBooks)\n\n\nOriginal Web Novel <eBook> (Naver)\n\n\nOriginal Web Novel <Book> (Yes24)"},{"name":" Mashiroiro Symphony","avatar":"https://mangadex.org/covers/7018f583-e9de-4f28-922d-7571baa42462/aa18e23d-096c-4d29-bae4-b0596cc83e04.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life"],"nutshell":"In all-girl's school is preparing to consolidate with another nearby school, which will make them co-ed. Uryuu Shingo is chosen to be a male 'test student' at the girl's school before they officially merge in the following year. On Shingo's first day, he learns that many of the girls are not happy about the coming merger. Specifically, Sena Airi is staunchly opposed and refuses to welcome him to the school. Some of the other girls are friendly, but Airi has a lot of power over public opinion. The truth is, though, that Shingo has met Airi before. When she and Shingo's little sister got lost, he helped them find their way. Airi seemed to like him then, back when she didn't know he was going to be her new male classmate. Maybe he'll be able to win over Airi, as well as all his other interesting female classmates!\nThis is the official comic based on the game of the same name by Palette."},{"name":" Sazae-san","avatar":"https://mangadex.org/covers/701e67c9-45b2-459b-a517-a0cb9865def8/912f5f03-8dfb-448e-b117-a93c064a5fc5.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Comedy,Slice of Life"],"nutshell":"Slice of life manga about a woman named Sazae and her family."},{"name":" Ishiguro Masakazu's Kyoufu Tanpen","avatar":"https://mangadex.org/covers/70281eed-7252-4207-b6a7-71fc6b92eabf/7393157f-7779-4970-a4a1-78d5b2781c73.png.256.jpg","country":"Japanese","stat":"7.99","status":"Ongoing","tags":["Comedy,Horror,Supernatural"],"nutshell":"Using the theme \"Gag to Horror\", the Gag Manga Artist, Ishiguro Masakazu starts his series of horror collection.\nHis first story, Shinchiku, speaks of an unfortunate tale of a woman moving into her new residential area."},{"name":" The Wonderland of Ten Thousand","avatar":"https://mangadex.org/covers/7030914d-5c54-47ee-a50e-379a34b5e9da/48ff30ec-f711-440b-9057-aba9b5570c9f.png.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Official Colored,Historical,Long Strip"],"nutshell":"The whole world can be seen in a single flower...The mortal world is nothing but a speck of dust to the immortals and demons.A single command from the immortals or demons will ripple through the mortal world.Wealth and prosperity are nothing but illusions.When humans die, their souls will return to the vast galaxy."},{"name":" Shin Megami Tensei IV Dengeki Comic Anthology","avatar":"https://mangadex.org/covers/7032ad8e-79d7-4270-b32a-3675495b318e/69edf854-bf6c-4ece-952a-77eedb07336f.jpg.256.jpg","country":"Japanese","stat":"8.24","status":"Completed","tags":["Thriller,Monsters,Action,Demons,Psychological,Animals,Comedy,Anthology,Survival,Martial Arts,Samurai,Adventure,Post-Apocalyptic,Magic,Philosophical,Drama,Horror,Delinquents,Supernatural,Adaptation,Tragedy"],"nutshell":"Anthology of shorts based on Shin Megami Tensei IV."},{"name":" It's Not Fun Being the Empress of the Empire","avatar":"https://mangadex.org/covers/703bb963-6010-4f48-a4f5-279eec943715/fae520e2-aa8e-4468-99a7-7ce54377a6ef.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.96","status":"Ongoing","tags":["Long Strip,Romance,Magic,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"My name is Clara, and I am a renowned romance witch. The most outstanding Crown Prince of the Empire fell into an everlasting slumber, and was unable to awake. People made many speculations that it was I who did it out of love and hatred. However, I have never even touched his hand before! I merely went to visit the Imperial Palace one day, and sneaked in to catch a glimpse of the Crown Prince. But because of that glimpse, he actually fell in love with me at first sight and insisted on marrying me?! As a result, the Crown Prince led his troops into the forest. \"Clara, stop playing around. I've come to bring you home.\""},{"name":" Sore Wo, Kou","avatar":"https://mangadex.org/covers/703e9f09-a249-4135-8462-edf75493f1bf/ebc426db-07c3-4f76-9c02-7eb8c0a59952.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Romance,Comedy,Slice of Life"],"nutshell":"Ah, love... The little flowers, the song of the birds, the sun shines. Vacuum cleaner blows to the face. The crash of our heads against the walls. Strangling each other in that soft scarf we used to love to snuggle up in together. Sora Ono portrays couples who hate each other to the extreme, but always with a lot of humor!\nFor those of you who want your head to explode. This popular series with more than 300,000 RTs on Twitter has been turned into an illustrated book. Illustrations of the kind of things you would like to do if you had a boyfriend or girlfriend. Illustrator Sora Ohno completely destroys these situations in a wonderful way."},{"name":" Futari no Himitsu.","avatar":"https://mangadex.org/covers/7040ae76-c0e2-4dfc-a864-c34de26f5b72/74f05f8b-07c1-425c-a4c7-1b044d537807.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Genderswap,Romance,Comedy,School Life,Supernatural"],"nutshell":"Saijou Kiki is a model and child star, but with the release of her new commercial, her popularity skyrockets. At school, she harbours feelings for Takumi-kun… but she somehow ends up kissing Teppei, his friend?! And what's more, they've switched bodies due to some sort of old legend?!\nPt-Br:\nSaijou Kiki é uma modelo e atriz infantil , que quando tem seu primeiro comecial anunciado fica muito popular. Na escola, ela é considerada um tipo de celebridade e a mesma, por ser meio timida, esconde sentimentos por seu colega Takumi-kun… Mas de alguma forma ela acaba, em um certo dia, beijando seu amigo Teppei! E ainda tem mais, ambos após o beijo têm suas almas trocadas… E agora o que eles farão para ter seus corpos de volta?"},{"name":" Ojousama wa Oyomesama","avatar":"https://mangadex.org/covers/7045de54-8630-403c-af4f-7c0ae6b63225/9cf10247-ebc6-4710-ba8a-03b364873c47.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Comedy,Reverse Harem,Drama"],"nutshell":"Towako the ojousama (daughter of a high class family) will be turning 18 years old soon. When she was very young, she was told that on this 18th birthday she is to marry the young man who was born on the same day, the same time, and the same year as she was. However, during their first meeting, Yuuga was incredibly mean to her! What’s Towako to do when her husband-to-be is the shy and cool type of guy?"},{"name":" Kieli","avatar":"https://mangadex.org/covers/7050ae6a-6ebe-4e6e-9d68-c4103b58f3ff/37b1ebfc-1fca-4368-bda5-81270b35ebc8.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Adventure,Fantasy,Supernatural"],"nutshell":"Kieli sees ghosts. It’s an odd ability for a 14-year-old girl, and it makes her a bit of an outcast at her boarding school. Her only friend, in fact, is the (semi-) departed spirit of a girl who used to inhabit her room. That is until the two encounter a young man who appears to share Kieli’s “gift.” It doesn’t take long to discover, though, Harvey is an altogether different sort of creature — one of the infamous Undying, the reanimated corpse of a dead soldier. Could it be that in this cursed fellow Kieli has finally found a kindred spirit? Throwing in her lot with this strange, soulless man and his possessed radio, she means to find out…"},{"name":" Noroi to Seishun - Fumino Aya Tanpenshuu","avatar":"https://mangadex.org/covers/70528470-c611-4bbc-b928-1c1ea952d112/113948fd-6c47-49da-ae93-e6a14de9f633.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Anthology,Drama,Slice of Life"],"nutshell":"Collection of short stories by author Fumino Aya. Includes:\n\nChapter 1-2. Noroi to Seishun\nChapter 3. Bokura Jigoku no Touhikou\nChapter 4. Kamisama no Shinzou\nChapter 5. Himitsu no Hanazono Pink\nChapter 6. Chi no Ryouiki"},{"name":" Shitsuji wa Itsumo Yuuutsu","avatar":"https://mangadex.org/covers/70578311-aa7e-4502-b0d9-e6d4867758fc/9a7caf23-1afa-4266-a33a-04bf0d0d312d.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":""},{"name":" Kenka Banchou Otome - Koi no Battle Royale","avatar":"https://mangadex.org/covers/7058d8ae-8b21-4528-8799-11c76ff1d73c/2b51b324-89e5-4cef-ad88-e9f64d98d206.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Completed","tags":["Romance,Comedy,Reverse Harem,Crossdressing,School Life,Delinquents,Adaptation"],"nutshell":"For as long as she's been aware, the heroine, without a single relative, lived under care of the state. Both of her parents' faces were unknown to her.\nIn front of this heroine, a young boy appeared.\nThe young boy's name was \"Hikaru\". It appeared that he was the heroine's twin brother, separated at birth. He had a proposal for the heroine.\n\"Could you go to school in my place?\"\nThe heroine was shocked by this crazy suggestion.\nFurthermore this was an all-boys school. The only high school in this prefecture for delinquents."},{"name":" The Bell Rings in the Holy Night","avatar":"https://mangadex.org/covers/705a16f2-5408-4c32-87b3-a906abcef57c/d283458f-b527-4d45-8882-1aea772e975c.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Action,Romance,Adventure,Drama,Full Color"],"nutshell":"On Christmas Eve, a young man is about to make the decision that will change his life and that of his beloved, but fate intervenes putting them face to face with the voice of a lifetime's experience."}]