[{"name":" Boku wa Konomama Kaeranai","avatar":"https://mangadex.org/covers/df28295a-bf8c-41e3-9d74-b680181cb2be/e026fbf7-21e1-4375-b8ae-21c6dca9aee7.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Psychological,Romance,Boys' Love,Drama,School Life,Slice of Life"],"nutshell":"Upbeat Ritsuro and downbeat Ken have been longtime friends. Although Ken leads a dark life of prostitution after dropping out of high school, Ritsuro still cares about him. When Ritsuro realizes that what Ken wants is something more than friendship he vacillates between Ken and his girlfriend Moeko, setting the stage for a bizarre love triangle."},{"name":" Harry Potter - Synodic Month (Doujinshi)","avatar":"https://mangadex.org/covers/df2bc72f-5bff-48b0-8ae5-fb56ddc59f0c/8f32efcc-8ee7-4f8d-9784-6932e6887e5b.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Boys' Love,Drama"],"nutshell":"From Impending Doujishi:\nThis whole doujinshi pretty much talks about how Remus and Sirius felt about each other. The first story is told in Lupin's point of view about how he felt when he found out that Sirius escaped from Azkaban. The second story is told in Black's point of view about how he felt for Lupin while they're living together with Lupin transforimng in every full moon. Both are pretty serious and agsty, but none the less good. Of course, the pairing would most definetly be Sirius x Remus."},{"name":" Satou-kun to Tanaka-san - The Blood Highschool","avatar":"https://mangadex.org/covers/df2d991b-28b9-4bc3-a337-c823d3f56187/4a8b92b8-d4b1-40bf-ae0a-b84255b71ea2.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,School Life,Vampires,Supernatural"],"nutshell":"Satou is a vampire who fell in love with a human, Kumiko. But his love was spurned so he vowed to come back in 50 years. Years later, Kumiko is now an old lady with a granddaughter, Tanaka, a high school-er who is a splitting image of her in her youth. Satou has now infiltrated Tanaka's high school in a mission to make her grandmother fall in love with him.\nChapter 0 was part of Arcana 04: Vampire as \"Crossing the River\"."},{"name":" The Human","avatar":"https://mangadex.org/covers/df354105-de17-40aa-bbc2-2bcf390777da/b2d8b1d4-33c4-4e7a-a126-cd846fd19e57.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Oneshot,Award Winning,Action,Sports,Philosophical"],"nutshell":"In 2036, the World Olympic Committee made the groundbreaking decision to lift all restrictions on doping for athletes. All those hallowed, longstanding records of human ability were buried in a single night of competition. The public enthusiasm for the performances was suffocating. The new rules were here to stay.\nBut, not all athletes want to dope. Not all of them see the 'enhanced' records as legitimate. And Mike, a clean-running 100-meter specialist, is about to hit these steroid monsters with his very best shot."},{"name":" Oyajina!","avatar":"https://mangadex.org/covers/df35809e-737f-4b2a-b765-35c580087817/c66ec152-5837-4f44-98e3-f9e71a89631e.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Genderswap,Comedy,Boys' Love,Girls' Love,Drama,School Life"],"nutshell":"It's romance, unbridled lust, and the scandalous relationship of a lesbian and her best friend… all while being a man in your forties? Thanks to a chemical leak, all the teenage girls in Tokyo have magically turned into middle aged salarymen! Who knew sexiness came with bald spots, parted hair, and neatly-trimmed mustaches? Chinatsu and Tomoe were the best friends two teenage girls could have, but will they be something more as over-the-hill office workers?"},{"name":" People Are Free to Think of What They Want -Her Anger Management-","avatar":"https://mangadex.org/covers/df366369-53f2-462a-bcd9-5dd932df2dc4/49be5e7f-7fe7-4872-8490-78d972304c86.jpg.256.jpg","country":"Japanese","stat":"8.29","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":"Author Twitter"},{"name":" Ghost Terminal","avatar":"https://mangadex.org/covers/df3b2dfd-3ffc-4812-9839-0209c4597cbc/4d216dd4-2301-4071-9b88-d5b55c74fa7d.jpg.256.jpg","country":"Korean","stat":"8.02","status":"Ongoing","tags":["Action,Psychological,Long Strip,Full Color"],"nutshell":"Ghost Terminal , the transit center of the dead , is a must – visit place for the dead who have left this world before going to the underworld . The dead will stay in the < Ghost Terminal > for 49 days , undergo immigration screening , and only the dead can cross the Nether on a boat bound for the underworld . Seon – woo , who lost his mind in an explosion at Incheon Airport , wakes up in < Ghost Terminal > However , Seon – woo is in a coma , not dead , and he finds out that he has come to < Ghost Terminal > by mistake . While waiting to return to Riseong , Seon – woo hears the news that his wife and daughter , who were together at Incheon Airport , are still trapped at the airport and that the airport is about to collapse . The place where his wife and daughter were imprisoned was in a remote place out of the reach of rescuers , and only Seon – woo knew the location of the place . Seon – woo hurriedly tries to return to Seung – ri but the situation goes against his will , and he ends up being trapped in the terminal . Seon Woo , who had to return to the world to save his family , tries to escape from < Ghost Terminal > with all his might …"},{"name":" Cake wo Kai ni","avatar":"https://mangadex.org/covers/df3ce611-5ed5-4b2a-9efb-0f97531950a8/31d5d9f8-41ef-482c-b99d-fb8d6ff46363.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Drama"],"nutshell":""},{"name":" Attaque","avatar":"https://mangadex.org/covers/df3cef8c-605e-488e-897e-589f6c3f6b97/7fda8473-b91b-459d-a741-15c473f08733.jpg.256.jpg","country":"Korean","stat":"8.08","status":"Completed","tags":["Long Strip,Sports,Drama,School Life"],"nutshell":"Leesu came from a poor family but he didn't mind at all not having any money or status. Being the school's strongest fighter made him feel as if he was on top of the world in his eyes. But alas, a car accident made him lose what was most precious to him; His ability to fight! Craving for his past glorious days he turns to fencing with the hope to regain what he once had?"},{"name":" Rare Ji","avatar":"https://mangadex.org/covers/df3d74de-4524-4753-aa35-c186d5357480/53956042-4e66-461f-bcae-4cee14cce02f.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Romance,School Life"],"nutshell":"Momoe is the type who accepts everyone’s opinions without contesting them regardless if they are right or not. That’s why people around her tend to call her dumb or stupid. Never showing a hurt face she’ll always smile back at them and she won’t even get angry. Takasugi, the school’s idol, gets to know her after some meetings in the infirmary and he’s amazed by her lack of self esteem combined with a warm smile ready to be given to anyone. She also starts to feel attracted to him, but is love what Takasugi feels or only curiosity?"},{"name":" Mibu no Ookami, Neko wo Kau","avatar":"https://mangadex.org/covers/df474fe4-d965-47d6-b593-ef002b6e2328/ae0cbd5a-769a-460e-b981-59ea825944a6.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Action,Comedy,Samurai,Drama,Slice of Life"],"nutshell":"The time is the end of the Edo period. The Shinsengumi, a group of swordsmen entrusted with the maintenance of public order in Kyoto, the most important center of the turbulent times when the shogunate faction and the anti-shogunate faction intermingled. One day, a black cat appears before Hajime Saitou, the leader of the 3rd division, who was feared as the \"Wolf of Mibu\" and was one of the best swordsmen. From that day on, they became indispensable to each other――!?\nA completely new Shinsengumi emaki drawn by Tomohiro Shinohara, who wrote \"In the Blunt Box\", which was also made into a live-action drama, is now here!"},{"name":" Front Mission - Dog Life & Dog Style","avatar":"https://mangadex.org/covers/df475b9f-f961-41d7-bf69-5176edc6827b/7c9231de-db32-4f3b-9f26-92ccc3896273.png.256.jpg","country":"Japanese","stat":"8.46","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Mecha,Survival,Adventure,Military,Drama,Tragedy"],"nutshell":"Huffman Island is a land that emerged from the deep due to volcanic eruptions over three decades ago, now, it is split by an uneasy cease-fire between two major world powers, the United States of the New Continent (USN) and the Oceania Cooperative Union (OCU).\nThe cease-fire has held for 20 years, but now tensions are mounting, and it looks like open war will break out again soon. Matsuda Akira has gone to join the on-site reporting team for NNTV.\nAre he and his colleagues really ready for the horrors they may face if they're caught in the middle of a war?\nAdapted from the Front Mission games."},{"name":" Saki - surroundings (Doujinshi)","avatar":"https://mangadex.org/covers/df51889f-46ec-4e2f-9e7a-7ff619be5e08/29c8f9a7-5680-46bc-81a8-28f27b4a54d1.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Ongoing","tags":["Girls' Love,School Life,Slice of Life"],"nutshell":""},{"name":" Domestic Beast","avatar":"https://mangadex.org/covers/df525b32-a615-4737-bc00-fb28b6a29d66/a94924e6-3c8b-4341-a9ad-fe080fb44ae5.png.256.jpg","country":"Japanese","stat":"7.72","status":"Ongoing","tags":["Boys' Love,Drama"],"nutshell":"The story of Kuramochi Family's Biter, Youjirou and the person that the branch family left in charge of him, Ooba Isshin. This is Smoky Nectar's spin-off, set two years after Renew."},{"name":" Kishi-tan wa Jouheki no Naka ni Hana Hiraku","avatar":"https://mangadex.org/covers/df599049-8765-4f80-b7e7-220e23110194/fbd5269c-c479-4409-8467-d06f297ae8e7.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Comedy,Adventure,Crossdressing,Fantasy,Slice of Life"],"nutshell":"Taking arms and protecting the people, Knights. And the apprenticeship period to obtain that title… The job of a knight apprentice is not to practice with the sword nor ride horses, but anywhere from taking care of horses to laundry; all sorts of odd jobs. At the Padlock Castle, Claustra, the story of the knight apprentice Rosa begins!"},{"name":" Meiji Tokyo Renka - Oboro no Koku no Gikyoku","avatar":"https://mangadex.org/covers/df5aa4f1-d857-476b-b438-0ab8bd6b086e/b4806cf1-7725-449e-80e0-454710c38c99.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Time Travel,Historical,Romance,Adaptation"],"nutshell":"A very normal girl, Mei Ayatsuki, has made a time slip to the Meiji Era. There she meets the historical figures, Otojirou Kawakami and Kyouya Izumi--!? A romantic yet a little mysterious historical love story is beginning.\nAdapted from the Meiji Tokyo Renka otome game."},{"name":" W Pinch!!","avatar":"https://mangadex.org/covers/df5c95c6-40ba-41f1-94d2-16df537622c1/b1b8e10f-9b0f-45d2-a6a5-592bc76d1c87.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Kawai Arisa is a timid girl with a split personality. She used to be a super bully and commands her army of \"servants\" to do things for her. Due to a freak accident, she has forgotten all her memories and turned into a crybaby who never sticks up for herself. Then, a new student shows up to seek revenge against her, which makes Arisa revert to her former self."},{"name":" Wan Tail","avatar":"https://mangadex.org/covers/df602ee0-6d11-4388-87b2-681ef3389e19/f85ab615-84c2-44d0-b209-84c7f2e962df.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Comedy,Supernatural"],"nutshell":"Komori Kaguya es una chica solitaria que por su forma de dirigirse no consigue amigos. Ella se encuentra con un perrito abandonado que, por pena, decide llevar a su casa. Después de contarle a este todos sus dramas descubre algo raro en este perro."},{"name":" Scapegoat Baby","avatar":"https://mangadex.org/covers/df7008b7-4948-4fc2-a8d6-566f8aa74c6d/2a255c36-b742-41d1-b10a-c1ecc733ef5b.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,Boys' Love,Vampires"],"nutshell":"Aoi greets his regular customer Amamiya at the flower shop where he works, but for some reason today, the pale, handsome Amamiya seems extremely unwell, as if he were feeling anemic. When Amamiya smells a giant bouquet of roses, he seems to feel slightly better, but it isn’t nearly enough. Aoi accompanies him home to make sure he arrives safely, but things for Amamiya may be direr than Aoi realizes. To save Amamiya’s life in this moment of danger, Aoi realizes he may need to supply something much more intimate than flowers!"},{"name":" 141108","avatar":"https://mangadex.org/covers/df7334a1-39bf-4420-95bc-ed3f05f2c82c/9944aec4-5847-46cb-b5e0-8776c07d19e4.jpg.256.jpg","country":"Vietnamese","stat":"8.12","status":"Completed","tags":["Oneshot,Psychological,Girls' Love,Drama,Medical,Tragedy"],"nutshell":"She wakes up not remembering anything, all because of her love and a terrible accident."},{"name":" Blue Bird ~The Blighted Leaves~","avatar":"https://mangadex.org/covers/df749c05-953e-4951-8c2d-3527a4ba47ed/228a09c2-823f-43c0-8118-204a27f8f0d7.jpg.256.jpg","country":"Japanese","stat":"8.19","status":"Completed","tags":["Animals,Anthology,Drama,Slice of Life,Tragedy"],"nutshell":"This is a two stories anthology, about three generations of the Higashimoto family.\nMurakami Takashi's story about the loss and rebirth of families.\nThe first story is about a young family, while the second story is about a couple dealing with old age. It's a work that confronts life with sincerity, talking about the lives that are connected to everyone who has a family."},{"name":" Wahhaman","avatar":"https://mangadex.org/covers/df7713a7-f8da-4c0f-86e4-a0ec5e251486/c06833fb-78d2-41c8-9367-339b5121e942.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Completed","tags":["Sci-Fi,Action,Comedy,Mecha,Superhero,Slice of Life"],"nutshell":"Wahhaman is a special robot soldier built ten thousand years ago by the Atlanteans. Found and dug up in present-day Toukyou, he doesn't remember anything, due to a nasty knock to the head he received at some point."},{"name":" A Happy Child","avatar":"https://mangadex.org/covers/df7f1547-5c7f-42fc-8c77-e98ca1b65abe/690e4b71-7d91-48c7-a379-743326688c97.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Oneshot,Psychological,Drama,Vampires,Supernatural"],"nutshell":"A young woman takes in a peculiar child.\n\nArtist's pixiv"},{"name":" Cube Arts","avatar":"https://mangadex.org/covers/df87d7ad-69b3-445b-90be-619e311b1182/d9285de8-f93d-42a4-a41f-0c138548870c.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Action,Adventure,Video Games"],"nutshell":"Takuto receives a headset to test out a game that is basically VR Minecraft. While playing, the game suddenly goes on maintenance and the players are unable to log out. They are to survive in the game until the maintenance is over. The thing is, six hours in the real world is half a year in the game and to make things edgy the revival system is no longer active."},{"name":" Fireman Daigo","avatar":"https://mangadex.org/covers/df8884eb-8495-4525-baff-1b20a1b98958/ebac8997-c439-426d-a2ba-63d341e83860.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Action,Romance,Drama,Slice of Life"],"nutshell":"Asahina Daigo, a young man fresh out of school and inaugurated into Company \"Me,\" a firefighting unit in an area known for its lack of fires (which gives Company \"Me\" a slacker image). Daigo is not particularly heroic; he's overly competitive against his rivals, naive, myopic, inexperienced, short-tempered, and is often off in la-la land with a spaced-out expression on his face.\nIn 1997, Megumi no Daigo received the Shogakukan Manga Award for shōnen."},{"name":" Touhou - Aquakyuu (Doujinshi)","avatar":"https://mangadex.org/covers/df8c0c63-d6ce-4a27-802a-fb934cafea7b/b8586d75-3921-45c6-97fc-7f594854fd68.png.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Comedy,Fantasy"],"nutshell":""},{"name":" Itsuka Koi ga Kanau made","avatar":"https://mangadex.org/covers/df96f7eb-545e-429c-bf89-01fbb71bb256/b79f2f08-00bd-4631-a4c3-b11683d25e88.jpg.256.jpg","country":"Japanese","stat":"7.60","status":"Completed","tags":["Sci-Fi,Romance,Boys' Love,Drama"],"nutshell":"Student Sui's summer vacation starts off with a bang, when a handsome foreigner appears in a bolt of lightning. Sui can't leave the injured man alone and takes him home. Normally a lonely and boring guy, Sui's life is about to get a lot more interesting!"},{"name":" The Cat Who Wanted to be a Bride","avatar":"https://mangadex.org/covers/df9766bd-0c5e-477d-8fef-5cbada4a4876/1006f5b9-6627-4c16-8e62-53d3ceec4c16.png.256.jpg","country":"Japanese","stat":"8.35","status":"Completed","tags":["Romance,Comedy,Monster Girls,Web Comic"],"nutshell":"(Translated with permission) Listen, she's just a normal human female, okay? So obviously she can get normal human married, just like any other human.\nDefinitely a normal human and not a shapeshifting cat of any sorts, can't stress that enough.\n Author’s Twitter"},{"name":" My Little World","avatar":"https://mangadex.org/covers/df99f422-a777-4872-817f-c377f9c5624c/3f752a0f-8fbc-4f74-8984-5247b806990d.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,School Life"],"nutshell":"Towards the boys who do not understand her inner self and only say they like her for her appearance, she absolutely hates them. Especially her homeroom teacher, who ticks her off even more. But how come…?\nIn addition, there are four more love stories in this debut collection!"},{"name":" DJ Teck's Morning Attack","avatar":"https://mangadex.org/covers/df9aae61-b06b-41ef-b69d-210da198215b/8c97797e-ab5c-4ade-a311-e943ad1787bd.jpg.256.jpg","country":"Japanese","stat":"7.65","status":"Completed","tags":["Oneshot,Sci-Fi,Comedy,Mecha,Survival,Military,Drama,Tragedy"],"nutshell":""},{"name":" Kuyashiikurai, Suki.","avatar":"https://mangadex.org/covers/df9d2e82-2cc8-4492-80db-649457305446/65659a38-6b3f-4cf5-9c45-631f1f3a4357.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Sports,Drama,School Life"],"nutshell":"Spanish:\nEsta historia gira en torno a dos estudiantes que se conocen desde la primaria; Kojima Arata, un jugador de basquetbol, y Lena, una chica arisca que no entiende mucho del amor. ¿Pero qué pasará cuando Lena descubra nuevos sentimientos hacia el chico que ha conocido por tantos años?\nEnglish, From Chibi Manga:\nYou're making my heart beat all alone stupid. The unfriendly girl, Reina is a first year in high school. Because of her childhood friend, Kojima Shin, she became the boy's basketball manager. He was like a small brat when they were in elementary school, but not he's gentle and so cool. But there's a Senpai who he looks up to. But I can't seem to stop falling in love with him…!?"},{"name":" Koiseyo Kimono Otome","avatar":"https://mangadex.org/covers/df9fd320-3fdd-4be5-aa29-d9c264f32651/dfcaeb4c-b38b-40e0-8b12-8b44e53cb326.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Slice of Life"],"nutshell":"Momo Nonomura lives with her family in Osaka. Enjoying a day off from work is going out with a kimono inherited from the grandmother who passed away. On a holiday in in March, I fell in love with a man at a long-established coffee shop in Kyoto who was sitting alone."}]