[{"name":" Futaribocchi Sensou","avatar":"https://mangadex.org/covers/b5dc8959-2d5b-4b04-92f3-94b17b5ce4bb/279cc46b-9424-465f-844d-5dcd838ce3e6.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Action,Supernatural,Tragedy"],"nutshell":"Confined to a wheelchair, Ilya Kravitz's dream is to pilot an Arcana, a super-powered humanoid weapon, and to fly through the skies defending America from the gargantuan alien Idola. With the support of his sister Anna, a talented military Sergeant, Ilya passes the final test to become a \"player,\" controlling his very own Arcana unit. However, the opportunity of a lifetime comes with a painful price that challenges the bonds of unconditional love…"},{"name":" Yuuwaku ha Nichijyou Sahanji","avatar":"https://mangadex.org/covers/b5dc9406-d5cb-4cb4-b305-47cbf1e93a8d/8ba5ce88-88da-421c-99d6-5e5a566c35b8.png.256.jpg","country":"Japanese","stat":"7.96","status":"Ongoing","tags":["Romance,Boys' Love"],"nutshell":"Genji is the youngest son, and heir to the Kamatani tea house. In the shadow of two successful brothers, he struggles with how to make the traditional tea house a success with younger people. Then one day, his grandfather shows him a precious object, a beautiful tea caddy of an intricate wooden design, made by the son of a craftsman in the neighbouring town. Genji is inspired and implores his grandfather to make an introduction, to propose a collaboration between the two businesses. When he finally meets the handsome and imposing creator of the tea caddy, he has a shocking response to Genji’s request!"},{"name":" Furare Girl","avatar":"https://mangadex.org/covers/b5dcc75d-b8b4-4081-b14d-a883a6122b71/f6e87bc1-3371-4ab5-a880-a1703f2fcb97.jpg.256.jpg","country":"Japanese","stat":"8.80","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"The drop-dead-gorgeous and high-sex-appeal Akasaka Hibiki is going through breakup blues. Soon after being dumped, she's asked to become her schoolmate Aoyama-kun's mistress?! Aoyama-kun will try to gain Hibiki's affections through different means, so let's just hope he doesn't nosebleed to death in the process."},{"name":" Koregakoidato Wakarumade","avatar":"https://mangadex.org/covers/b5dfdb66-96b2-4972-b921-c8fba255b1c0/ddd87239-1c76-4a04-90bb-c66b6b919fba.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Web Comic,Slice of Life"],"nutshell":""},{"name":" Semi","avatar":"https://mangadex.org/covers/b5e0a91b-2c37-414d-8575-4b3c98e62d58/f20c8043-499c-49b4-bca6-1fd2a41379e4.jpg.256.jpg","country":"English","stat":"7.97","status":"Completed","tags":["Comedy,Martial Arts,Adventure,School Life,Supernatural"],"nutshell":"Kajitsu Kura always dreamt of being a gangster, and the leader of a powerful gang. Her biggest goal, to claim every District in the city as her own! It wasn’t until the appearance of Namekuji Peruro, and the brutal defeat of her best friend and mentor, Kusay Kame that she finally had the resolve to make her dream come true. Things were going smoothly, that is until a handsome stranger, who claims to be her father appeared. He says that he wants to make use of her…\nShe doesn’t like the sound of that.\nNot one bit."},{"name":" Mousou Cherry","avatar":"https://mangadex.org/covers/b5e6ba4d-f9c3-438e-a097-646911c81589/6d437036-f256-4abe-b312-9d760c898c40.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,School Life,Slice of Life"],"nutshell":"1: Cherry Paranoia\nKitagawa gets confessed to by the popular, Yamamoto. Taking advantage of the situation, he accepts and they start going out. But, Kitagawa has a secret that he would die before letting Yamamoto know about… Can their relationship work out, or will the secret be exposed?!\n2-3: A Way Too Perverted Friend\nKeisuke have been friends with Atsushi, the ace of the baseball team, since middle school. One night, like any other usual one, Keisuke crashes at Atsushi's place after gaming away, only to wake up to Atsushi calling out his name while masturbating.\n4: A Way Too Exciting Friend\nAfter catching himself staring at Suou's sleeping face, Ayumu noticed his more-than-friends-feelings for Suou. Knowing that this love would be fruitless, Ayumu resigns to his fate and begins to avoid his friend… which doesn't exactly sit well with the person in question.\n5: Malicious Love Lesson\nNo one else offered to help him besides the president of Student Council, Nishida. That's why Kazuya couldn't help but fall in love with the gentle and princely Nishida. However, his meek nature makes talking, let alone confessing, to the object of his affections all the more difficult. So he seeks Nishida's scary second-in-command Tamaki for assistance."},{"name":" Koi no Katachi","avatar":"https://mangadex.org/covers/b5e79606-ad69-4058-86c3-071d11d70558/614ed4c3-5c4e-4ac5-a0d4-f02f1c605e30.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Boys' Love,Incest,Drama"],"nutshell":"From Nakama\nA father and son love each other dearly. But when Emily, a girl from Kazui's past, visits them in Japan, their relationship starts to crumble under the threat of their own thoughts. . .\nThere is also another one by the same name scanlated by nodeadline by the same author but a whole different story.\nBasically one doctor is in love with kazui (not sure if it's the same one from nakama version,) and another dr is in love with him, it's quite a sad and tragic story, but its a good one."},{"name":" Super Doctor K","avatar":"https://mangadex.org/covers/b5e79d8b-76b9-4ad0-a7fd-d54db67361dd/883dc91a-d03c-4129-a9d6-ce56d3fb05bc.jpg.256.jpg","country":"Japanese","stat":"8.55","status":"Completed","tags":["Action,Drama,Medical"],"nutshell":"Doctor K is a doctor with exceptional skill.\nGraduating from a top-tier medical college, he prefers to live his life wandering around to treat people in need of help\ninstead of working in a hospital or running his own clinic."},{"name":" Akudou Sousui Mamoru","avatar":"https://mangadex.org/covers/b5eb6882-fa20-4626-8dac-17d4ca10cec3/29709d6c-ede4-412a-ac13-be6f8e5a36e1.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Comedy,Superhero,Slice of Life,Supernatural"],"nutshell":""},{"name":" Retire Shita Ningyoushi no MMO Kikou Jojishi","avatar":"https://mangadex.org/covers/b5ef1317-7c35-411a-b33b-f588c2f76940/8d4d765a-9e27-4aa6-8906-4f7b89947660.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Ongoing","tags":["Action,Virtual Reality,Fantasy,Adaptation"],"nutshell":"The past of one of the top five doll-makers in the world. Due to the evil act of those who envied his talent, “Sakura Iroha” is no longer able to move his right hand to its full capacity. One day, Iroha learns of the existence of a VRMMORPG - a virtual world of dolls called 'Battle Fairies (Doll)'. It seemed that Iroha had regained his own existence, but his encounter with Sara led to a conflict between him and Zik, who was targeting her persistently, and a duel with no chance of victory ends up taking place. Seeing Iroha backed into a corner, his doll begins to develop its own ego. When the doll maker, whose only purpose was to make dolls, comes face to face with Battle Fairies for the first time, an \"elaborate fairy tale\" is spun!"},{"name":" ef - a fairy tale of the two.","avatar":"https://mangadex.org/covers/b5f8f7ac-f09c-42e5-b19b-0614e74894c9/e7944fb7-0de5-40f8-b3e0-8cd30bf97c9a.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Hirono Hiro is a high school student, and secretly a shoujo mangaka, to all but his childhood friend and kouhai, Kei Shindo.\nOne cold Christmas after meeting a mysterious woman in church, a strange girl steals his bike.\nRunning after her, he finds her collapsed on the street.\nLearning her name is Miyamura Miyako and that her bag was stolen by a man on a motorbike, Hirono finds himself spending time with Miyako, much to the dismay of Kei…"},{"name":" His and Her Circumstances","avatar":"https://mangadex.org/covers/b5fab65a-641d-4637-aa4a-d6353f99d836/5b578281-6e30-4916-8530-6f92e611482d.jpg.256.jpg","country":"Japanese","stat":"8.57","status":"Completed","tags":["Psychological,Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"Yukino Miyazawa is the perfect model student. Pretty, kind, good at sports, always at the top of her class. But she's not all that she seems. It's all an act of deception; she is really the self-confessed 'queen of vanity,' and her only goal in life is winning the praise and admiration of everyone around her. When she enters high school, she finally meets her match: Soichiro Arima, a handsome, athletic, popular, and very intelligent young boy. Ever since he stole the top seat in the class from her, Yukino has hated him, and has been plotting on how to take back her former place as the object of all other students' admiration. What she wasn't expecting, however, was that Soichiro, the very boy she hated, would confess his love for her. Or that he would find out about her deception - and use it to blackmail her!\nTogether, they discover that they have more in common than they knew, and they slowly begin to bring out each other's inner selves.\n\n\nAlso included are the following short stories in this manga:\n\n\nThe Tiger and the Chameleon - A Promise for One Week (Vol. 1)\n\n\nAshita Mata Mori de Aoune (Meet Me Again Tomorrow in the Forest; Vol. 4)\nAlways an outcast because of her black hair the heroine of the story finds a strange man in the forest - a man from Earth - and he has black hair, too!"},{"name":" Kokan Musou ~Kiraware Yuusha wa Mazoku ni Aisareru~","avatar":"https://mangadex.org/covers/b5fc2842-d748-4a11-a7d1-4e5573762bda/34a7128e-97d6-488d-82d4-93150c01d28f.jpg.256.jpg","country":"Japanese","stat":"7.41","status":"Ongoing","tags":["Isekai,Fantasy,Monster Girls"],"nutshell":"Sweat Taro, who has ascended to heaven because he is too sick, reincarnates in a different world. Sweat Taro, who is distorted in character and is a kimodebu, is disliked even after reincarnating, but notices that a cloudy potion that cures anything from his crotch appears. Moreover, it also has the effect of powering up the demons, and it will be loved by the demons ...!? A different world reincarnation fantasy that is unmatched in the crotch !!! (Google Translate)"},{"name":" Toshishita Yakuza wa Kojirasedanshi","avatar":"https://mangadex.org/covers/b5fcfed9-6b03-4647-815f-69c498731908/21acb495-a835-4ad2-9e38-61ef5f43b765.png.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Boys' Love"],"nutshell":"When Kakeru saves Haruma from a mugger, Haruma becomes obsessed with him. Kakeru thinks he's cute, like a little brother, so he doesn't make much of the situation. However, things turn serious when Haruma asks Kakeru to be his lover. Furthermore, Haruma turns out to be the son of a Yakuza leader! Kakeru tries to politely turn him down, but that's when Haruma gets physical. Haruma's so good, Kakeru might just let him go all the way…!"},{"name":" Harahara Sensei","avatar":"https://mangadex.org/covers/b5fe36a6-a45b-48a9-baff-1fef19012abf/b1e4e7aa-d1d8-4ca6-9630-2db1d0929731.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Action,Drama,Mystery"],"nutshell":"I won't run away anymore. Even if I have to face against yakuza to whom money is everything. As long as it means I can get my sister back.\nAfter having her dream of working in academia ruined, Azusa now works as a teacher in the countryside and her days are spent putting up with the terrible treatment she receives from both her students and colleagues. One day, she came to learn that her younger sister Ruka, the only blood relative she has left, has gotten caught up in some trouble in Tokyo.\nWhat will Azusa do now that she's faced up against suspicious members of the underworld society? Here's the start of a hardboiled action series!"},{"name":" Zoombie City","avatar":"https://mangadex.org/covers/b6033b19-1aaf-4548-929e-91415ea22046/bb7b8b1d-427b-4f27-89cc-0e9d2fd8ae1b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"6.90","status":"Ongoing","tags":["Sci-Fi,Action,Romance,Zombies,Adventure,Fantasy,Full Color"],"nutshell":"[exclusive/updates on every Saturday] Doomsday suddenly occurs, and Qin An's girlfriend, who has been in love with him for 7 years, suddenly betrays him. Then, things are not as simple as they seem. Many clues slowly unravel. All of the stories are not so plain and ordinary. Qin An is unsure of what is going on and what to do. So, he embarks on his own quest, while simultaneously searching for love."},{"name":" No Love Zone","avatar":"https://mangadex.org/covers/b6086a9b-5ac5-4c53-b7d0-b5087a35408d/26ef0d5f-98f2-4749-830c-2fdf465cf516.jpg.256.jpg","country":"Korean","stat":"8.30","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Office Workers,Web Comic,Slice of Life,Full Color"],"nutshell":"Lee Eungyeom is your typical office worker. A newbie at his workplace, he's friendly and sociable. However, when it comes to love and relationships, he has the most rotten luck.\nEnter Han Jihyuk, the handsome team manager who's totally Eungyeom's type! But wait a second… Is this demon of a manager out to get him? His arrival is about to send Eungyeom through a roller coaster of emotions!\nOfficial PV"},{"name":" Stage S","avatar":"https://mangadex.org/covers/b60fa5bf-c76a-480a-89b7-266b45b7068c/eadef58f-ff2a-40be-b3a2-e213e3279772.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Hiatus","tags":["Action,Drama,Supernatural"],"nutshell":"Ukiyo Meguru is in love with his childhood friend, Tatsumi Sara. One day, he meets a white snake that can \"see the future\"...!?"},{"name":" Red Cloud","avatar":"https://mangadex.org/covers/b6100cd5-60cd-455f-b10c-5d26b1861582/77ed188f-e8ca-401c-b91e-6fa7ba7efed7.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Historical,Romance,Boys' Love,Web Comic,Full Color"],"nutshell":"The poor prince and the handsome guards! The overbearing bandit and the pretty scholar boy! Do you want to get close to them?"},{"name":" Kimi ni Ai ni Iku","avatar":"https://mangadex.org/covers/b6185646-a8d3-4d3c-bd34-ec08df8ec86f/f1fbdeb4-b775-4700-9154-a6a38c7d4249.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"1-2: Meeting You\nWhen Tooru confessed his love to classmate Himeshiro, he wasn't expecting violins to start up in the background or for the clouds in the sky to part. He was expecting a simple yes or no answer. But instead of giving a simple reply, Himeshiro decides to tease Tooru by setting up various trials of love the latter must complete to prove his affection! Will Tooru get fed up with these weird conditions and humiliating acts? Or will Himeshiro get serious?\n3: How To Find A Gentle Kiss\nAfter Senken's best friend Sakuma kisses him in their last days as university students, Sakuma disappears for three years. Senken now has a job working in a company but he still wonders what happened to his friend.\n4: Mornings At The Bus Stop\nOne day, Machida misses his morning bus to work. It leads to a meeting with the alluring man Touhon. From now on, Machida is always missing his bus – on purpose!"},{"name":" Gen-Cha!","avatar":"https://mangadex.org/covers/b61ef991-cb76-4364-a346-cf66bdd40f51/b6421e21-d05d-450b-b197-63ed88df4d4f.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Action,Sports,Supernatural"],"nutshell":"Looking for anything valuable to sell to replenish his depleting allowance, Fujisawa Takumi finds a TZM50R motorcycle in his garage. Strangely enough, the bike has a spirit, a female fairy named Timu. She is passionate and knowledgeable about motorcycles but is the jealous type, especially when it comes to other bikes. Takumi has always been uninterested in anything, but something inside him changes as he starts to learn about motorcycles from Timu and learns what it means to have passion in his life."},{"name":" This Woman's Body Tells Lies","avatar":"https://mangadex.org/covers/b6203ae7-64c2-46f3-b5ff-3e3f56874261/710d7511-6a6d-4732-83f1-3f8933beecab.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Ongoing","tags":["Drama"],"nutshell":"“Hey, Shouma… Have I maybe soured your rosy image of me?” Shouma works as a porter in a brothel. He was living a meager life that was far from the city life he longed for. Then, a miracle happens: He reunites with his first love, Yura Honjou. With her naturally gorgeous looks, Yura started working in the entertainment industry while she was still in high school, and was completely out of Shouma’s league. And now, she’s right beside him…? Shouma is completely ecstatic at this turn of events, and Yura is snuggled up right against him. With her warm breath in his ears, she reveals her body to him. “Y-Yura… We can’t… Do this…!” What is the fate of Shouma, who’s dancing right in the palm of Yura’s hand…!?"},{"name":" Kodomo ga Neta Ato de","avatar":"https://mangadex.org/covers/b621ea46-3a3e-423d-9c06-3449706c97ce/0066a5c8-bc19-4dba-962a-07aae3f81e1b.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Completed","tags":["Oneshot,Comedy,Boys' Love,Slice of Life"],"nutshell":"A single father takes pity on a drunken man outside his bar, only to be taunted by his equally adorable, and impudent young daughter. Little did they know that he will play a major part in their life."},{"name":" Transmigrating to the Romantic Fantasy Novel Written by My Daughter","avatar":"https://mangadex.org/covers/b6277ef2-12cd-4b89-a747-bea0fdd9e014/e758517b-aada-4969-b1f8-781d79ab1b08.jpg.256.jpg","country":"Korean","stat":"8.00","status":"Ongoing","tags":["Reincarnation,Long Strip,Romance,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"Park Soonja stumbles on a mountain and passes out, waking up as the heroine of her daughter's romance-fantasy novel, Belita Partel. She first enjoys her new life and youth, until it hits her that her daughter is left all alone in the real world. She then tries everything to go back but nothing works. It seems the only way to escape is to marry the male lead of the novel, the crown prince. As she strives to achieve the goal, she unintentionally charms the male characters one after another. Can she ever get out of this novel and reunite with her real daughter?"},{"name":" Innocent","avatar":"https://mangadex.org/covers/b62cf8d8-7ca1-4b3a-a295-aeb770a18187/d8bd59c8-c308-4755-ae6c-4c43c0cf6995.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Boys' Love,Slice of Life"],"nutshell":""},{"name":" Meteornauts","avatar":"https://mangadex.org/covers/b62d7e83-ce40-4ff7-b9de-f3115cc3b119/be7b7700-9c23-4821-866b-8c1dc2ac8d04.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Sci-Fi,Adventure"],"nutshell":"Beautiful girls from all over the world gather up to live... in a space station? A comedic and tear-jerking story that accurately depicts the struggles of space!\nAuthor: https://twitter.com/miyaoryuu"},{"name":" Lovers Come, Come!","avatar":"https://mangadex.org/covers/b62dd0ab-0483-4ffe-a4fc-4c1ae5f9ea02/3ff4f78f-1043-4bd1-aa95-66c891f61dc9.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Boys' Love"],"nutshell":"Hirota is considered the nice guy around the office. Even Reiji thinks so, but he's still breaking up with Hirota. Reiji always has to initiate everything and Hirota just follows along. If Hirota loved him, he'd want to do something more than just kiss, right?"},{"name":" Lamento – Scraps","avatar":"https://mangadex.org/covers/b62e7568-ebab-4441-b5cf-25c22754015d/4b850f35-9c68-41c1-bff2-2b771680761e.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Oneshot,Boys' Love"],"nutshell":"Pairing: Rai x Konoe"},{"name":" Unable to Become the Main Force","avatar":"https://mangadex.org/covers/b62eeaad-2015-426e-8b14-eda3b97b99fb/d3218c8e-c01b-4b52-96f1-367060f1f420.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Action,Adventure,Fantasy"],"nutshell":"He was identified for having poor aptitude, unable to become the main force despite being the main character, and obtained a legendary professional card player, and since then he walks on leveling route which is different from most people – level up by playing cards."},{"name":" Koushaku no Himeta Kuchizuke","avatar":"https://mangadex.org/covers/b630d539-4593-4a74-9b21-bbd91a93c6c0/7b8040ec-eb0b-4715-afc5-555e9fe9f5c1.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Romance,Boys' Love,Drama,Tragedy"],"nutshell":"The Grand Duke of Sandford and Prince Louis are secret lovers. Although, disheartened by his partner’s cool facade surrounding an exposed love affair with a woman, Duke Sandford is determined to incite the prince as much as the prince does to him… “Unless I can possess you as mine alone, my prince, I’ll never stop!” What would be the outcome of their passionate struggle in this forbidden fight for love?"},{"name":" Nightmare Busters","avatar":"https://mangadex.org/covers/b6356e8e-5550-45a1-bb6e-205e00dd27d3/f1492c9c-aed3-42fa-ba89-815e5e2251ea.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Sci-Fi,Psychological,Adventure,Drama,Mystery,Full Color,Tragedy"],"nutshell":"The stage of \"Nightmare Busters\" is Tokyo in 2034. In the streets, a strange disease of unknown cause, which made me wake up while sleeping, was rampant. One day, Ichijo, a salaryman who spends his days working hard, has a mysterious dream. In a dream, Ichijo meets a coma patient … This is the latest work presented by Akase of \"Southern and Comet Girl\" as a full analog drawing and all-color work.\n\nLinks:\n\n Mangaka’s Twitter"},{"name":" Ashita mo Sekai wa Itsumo Doori","avatar":"https://mangadex.org/covers/b63c4dad-1c67-4616-b4c1-73b2e6a7eb2e/e1bbbef3-2736-42d3-9b90-e430d1b952a1.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Slice of Life"],"nutshell":"A high school girl is bored with her everyday life."}]