[{"name":" I'm Yours, Teacher, Only in Bed","avatar":"https://mangadex.org/covers/825bc6f0-8011-4788-86e4-30335edd68c4/ccb5c31a-5e21-4fa7-9adb-b7c270b8be70.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Boys' Love"],"nutshell":"\"It's okay to think of me as him and hold me, you know...?\" My body's actually trembling, but I'll hide it all behind a smile and become his tonight."},{"name":" Rika no Jikan","avatar":"https://mangadex.org/covers/8261e080-724f-4553-a98a-1e6bee780acb/55993537-7bae-4fae-b9af-f66a83f05b70.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Oneshot,Sci-Fi,Comedy,School Life"],"nutshell":""},{"name":" A Contractual Relationship","avatar":"https://mangadex.org/covers/82643fb1-22c2-488f-9f49-29eeff898936/19a33ce3-f390-428a-bdd5-b28ab457d924.png.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Demons,Long Strip,Boys' Love,Drama,Web Comic,Supernatural"],"nutshell":"So tell me what's the exact connection between you self-proclaimed Soloman's descendant and me, a normal college student? Don't explain something fiction-like to me, please. Wait, wait, wait. You have been my classmate for a year and I don't even know you? How could that be? And what's the red stamp on my neck? I have so many questions… OK first, why my roommate wants to kill me now?!"},{"name":" Shite, Okeba Yokatta Koukai","avatar":"https://mangadex.org/covers/82664c5f-c3d7-4904-9077-389cd4112641/c22993ee-0b37-4ddb-a8d7-756178e5f3b3.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Drama,School Life,Slice of Life"],"nutshell":"I should have…\nEn Asakura often has the same dream lately. She dreams of a boy asking her to kiss him. Her dream is connected to a painful memory from her high-school life, when she felt in love with a boy named Maru. When he asked her to kiss him, she refused, and now she's regretting it. Not to mention that the boy started to date another girl after that incident.\n\nEn is now in university and is trying to find her life partner through goukon: blind group dates. What will she do when a boy with the same name as her past crush asks for her number? Will she refuse and regret it again?\n\n\nThe Realization Of Happiness\nContinuation of the preview chapter.\n\n\nAfter School Kiss\n\n\nTell Me You Love Me\n\n\n5-6) My Friend's Boyfriend"},{"name":" Crown","avatar":"https://mangadex.org/covers/826b4e75-73ad-4738-95d1-99a95bfec7a1/fe326978-c14b-4cc2-878f-4aca2871c9db.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Romance,Comedy,Incest,Drama,Mystery"],"nutshell":"Mahiro thought she was all alone in the world until her long-lost brother, Ren, and his handsome, mysterious friend showed up and turned everything upside down! Competent, determined and dangerous, the two men have vowed to protect the innocent girl from the ruthless Queen Phibula, who is hell-bent on seeing her dead. As Mahiro learns more about her forgotten past, she and her handsome bodyguards must face explosions, assassins, betrayal… and the promise of blossoming romance."},{"name":" IZUMO - Takeki Tsurugi no Senki","avatar":"https://mangadex.org/covers/826fce22-a1aa-45e7-949b-cd812360304a/29051be1-7db2-4700-aabe-cfae919db61b.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Action,Adventure,Fantasy,Tragedy"],"nutshell":"A manga adaption of the visual novel by the same name by Studio e.go!\nSucked into the underworld to fulfill the deeds of the Gods, Takeru soon finds himself at odds against the demons… and his best friend."},{"name":" Color","avatar":"https://mangadex.org/covers/8278a605-f960-474d-8788-c9f884656456/3fd30f36-7593-46f5-a1f4-2c7a47f2846a.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life"],"nutshell":"Tsuda and Sakae are both artists who coincidentally painted nearly identical paintings. Now they are students at the same school. Are they destined to be together?"},{"name":" Touhou - Yamanba Life (Doujinshi)","avatar":"https://mangadex.org/covers/827a925b-778c-4dbe-acba-9bf395e89300/78766eac-92e7-4193-a3d5-f3928ad08151.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Oneshot,Fantasy,Slice of Life"],"nutshell":""},{"name":" Strawberry Shake Sweet - Zlay Bomb Tour (Doujinshi)","avatar":"https://mangadex.org/covers/827b10a6-81bf-4d36-8e5d-334004fd64af/21844d67-b390-474b-a572-d56b2a99843e.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Girls' Love"],"nutshell":"A gag doujinshi focusing on Kaoru and ZLAY. Includes artwork by Inoue Shinkai (mangaka of \"Pops\" from Yuri Shimai), Hayashiya Shizuru (official mangaka of Strawberry Shake Sweet), members of UGO, and others.\nAfter cutting Ryou's hair, Kaoru is invited to a private party with ZLAY. Will she escape with her virtue intact?"},{"name":" KAT-TUN - Tagatame no Hana (Doujinshi)","avatar":"https://mangadex.org/covers/827b40ba-217d-4bd1-85fb-cc1570d0c851/c1aaa29e-e1d9-4f28-92c0-e4b59aa057e0.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Boys' Love"],"nutshell":"pairing: Nakamaru x Ueda"},{"name":" Your Ghost Boy","avatar":"https://mangadex.org/covers/828559ca-b560-47e6-81a8-48477c56d5bf/8754ba37-4ccf-4e8d-9fbd-a4e4c89c033b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.64","status":"Completed","tags":["Ghosts,Long Strip,Romance,School Life,Fantasy,Web Comic,Full Color"],"nutshell":"Wang Zi Yan, a University student, has always had a body different from everyone else’s. When his body is touched by moonlight, he will become invisible. One night, after getting off work, he uses this ability to save a woman. That’s how an uncontrollable love story started! A soft and cute boy VS a rich, confident woman, how will this love story turn out?"},{"name":" Christie London Massive","avatar":"https://mangadex.org/covers/828b4541-6f75-4e19-8626-8d9f22b37937/156b6ddf-e69f-4f59-8f64-5aae0f26ee32.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Historical,Action,Psychological,Romance,Comedy,Crime,Survival,Adventure,Drama,Police,Slice of Life,Mystery"],"nutshell":"Sherlock Holmes' 17-year-old niece Christie is just as intelligent as her uncle.\nA lot of things are expected of a young aristocrat woman like her but she has little patience for banquets or corsets.\nAlthough she appreciates the maids who care for her, she'd rather spend her time working on interesting cases.\nIn the opening of the manga she's on the trail of a mystery that has London in an uproar,\nthe \"Case of the Old Russian Woman\" in which Sherlock Holmes' greatest rival will appear! [tethysdust/MangaHelpers]"},{"name":" Eel Man","avatar":"https://mangadex.org/covers/828e4edd-c4ce-436a-a052-a8871c89b6da/895d08ec-a56b-472b-8ce6-8be142a133a1.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.02","status":"Ongoing","tags":["Action,Adventure,Horror,Full Color"],"nutshell":"Fan, who is studying marine biology, accidentally got an electric eel as a pet, and was accidentally shocked by the electric eel while changing water for its tank one day. But this accident gives Fan a surprise, that is, he can even enter this electric eel’s body! Then a variety of amazing and exciting adventures begin…\nSource: MangaToon"},{"name":" Haikyuu!! - Do You Know Anything About TPO, Kageyama-kun?! (Doujinshi)","avatar":"https://mangadex.org/covers/8295452a-6960-43d2-a1fa-9750fce07a2c/97668b28-0e50-4dc8-af71-af3475fff6ad.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Romance,Comedy,Boys' Love,School Life,Slice of Life"],"nutshell":"Kageyama has an annoying habit of kissing Hinata where all and sundry can see, and Hinata needs him to learn a thing about appropriateness regarding TPO–time, place, and occasion."},{"name":" Shiba to Ran","avatar":"https://mangadex.org/covers/8298a00f-4634-4ff8-baf9-794addbbe7a7/ac9a158c-5a03-4638-ac37-1b16a95f6a86.png.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life"],"nutshell":"The master said: “Learn the art of popularity and train in its arts…”?!\nShibata is a high school boy who really wants to be popular. He worships his super popular female upperclassman, Ran, as “master” and becomes her disciple to learn the secret techniques to being popular. Where will this strange master-disciple relationship take them?\nDrawn by the author of the popular manga, “Koi to Yobu ni wa Kimochi Warui”, this is a princely girl x unpopular boy high school love comedy between master and disciple!"},{"name":" Sakazuki-san Chi no Gikyoudai","avatar":"https://mangadex.org/covers/8299b191-1f4b-4463-9103-61604ab3c13b/2b6eff88-bc61-4ef5-9d9d-b8c28b0e762e.jpg.256.jpg","country":"Japanese","stat":"8.28","status":"Completed","tags":["Comedy,Slice of Life"],"nutshell":"Youichi is a gruff boy of few words that goes to a school full of problematic students. Chikage is an innocent and friendly boy that goes to a prestigious school. These boys are very different and became brothers when their parents married, and are now living alone together. This comedy is about the day to day life and cohabitation of these stepbrothers."},{"name":" Mint Chocolate","avatar":"https://mangadex.org/covers/829d9d9f-579f-4e0a-b24d-aec0b2fb5051/eaed8e53-154c-4c69-b0d6-fe3a1cd299b3.png.256.jpg","country":"Japanese","stat":"8.11","status":"Ongoing","tags":["Romance,Comedy,School Life"],"nutshell":"Her stepbrother from her mother's remarriage is the classmate that she's always been interested in!! with an arrogant and cool boy under the same roof, this is the start of many sleepless nights full of love and flirting!"},{"name":" 11 Eyes -Tsumi to Batsu to Aganai no Shoujo-","avatar":"https://mangadex.org/covers/82a25052-0b86-4a9a-9160-f099e8afce10/4ac13982-92d7-4308-b547-a23065bf247b.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Action,Romance,Fantasy,Tragedy"],"nutshell":"Satsuki Kakeru lost his sister by suicide and has been living a dull life ever since then. One day, he is transported into a bizarre world \"Red Night\" along with his friend Minase Yuka and six other classmates. In order to survive and escape from Red Night, they must defeat six black knights in order to return home.\nAdaptation of the 11eyes -Tsumi to Batsu to Aganai no Shoujo- adult PC game from developer Lass.\nSee AnimeNewsNetwork for TV anime.\nSee AnimeNewsNetwork for OAV anime."},{"name":" Hana yori Ookami","avatar":"https://mangadex.org/covers/82a27f82-1e56-409b-b2d1-00d8eff48740/3fdd7df5-bb3b-4079-ac2f-5dd6ebee5e52.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Boys' Love"],"nutshell":"Riku Kirishima, a rough-looking high schooler, is a lover of romantic comic books who takes care of his family in place of his late mother. He has a younger brother, who he cares for deeply. One evening, he is suddenly embraced by a man in the park who offers him $300 to spend the night. Riku runs away, but soon learns that the handsome pervert who approached him is actually the guardian of his brother's friend! Enjoy this love story between a handsome florist and a romantic high school tough guy!"},{"name":" Princess Princess - Sweet 10 Diamond~Lovers' Secret (Doujinshi)","avatar":"https://mangadex.org/covers/82a29a8d-eee7-468f-8f41-4829f0ff1d20/e3973c6d-48e6-4a65-affc-a96ceb3fd31c.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Comedy,Boys' Love"],"nutshell":"A parody doujinshi of Train Train and Princess Princess.\nYuujirou, annoyed with Mikoto's happy mood, decides to do a little something to knock him down a peg or two – with Tohru's help.\nYuujirou & Tohru x Mikoto"},{"name":" Blavet","avatar":"https://mangadex.org/covers/82a6b9fe-6a32-46d3-9eb0-4d9a0fd0ac78/3985653c-c66f-4ef7-b55b-da3778fe092d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Long Strip,Comedy,Fantasy"],"nutshell":"The world has remained at peace since the hero from the blavet clan defeated the demon king a hundred fifty years ago… however, the demon king has appeared once again but this time, in front of yuushi, the descendant of the blavet clan! and now, a new adventure is about to begin!"},{"name":" Fascination Melt","avatar":"https://mangadex.org/covers/82a91b02-975e-4f1b-abf1-5deb7ab1f856/5b9a61a5-757c-4b7a-a6ae-bea414981742.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Demons,Romance,Boys' Love,Supernatural"],"nutshell":"From Good Girls Scan BL:\nLucky, an incubus attending demon school, has been assigned to make a human fall in love with him as a graduation requirement. His target is Aoi, and Lucky easily gets invited into his house and flawlessly invites him into bed. “With this, I’m sure to pass!” Lucky celebrated, but his body and heart have been melted by Aoi’s tricks…?!\n☆ The heart-pounding love trial between an impregnable, handsome college student and a simple and pure incubus."},{"name":" Satanister","avatar":"https://mangadex.org/covers/82ac0dfe-90ae-44e5-af45-029d48db84f2/f304dabc-9fcd-4271-85cf-78b731962da0.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Action,Comedy,Horror"],"nutshell":"Partake in the horror, the terror, the bloodcurdling madness of the serial killer mind, and the one who dares exterminate them! Except it's a comedy horror. Anyway, contains explict blood and gore, so you have been warned.\nWikipedia"},{"name":" Animetamae! Tensei no Miko","avatar":"https://mangadex.org/covers/82aeccac-49db-41f5-afde-1cb4200bec39/969949ef-27fd-4cbb-959c-d5608dd16aad.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Comedy,Girls' Love,Supernatural"],"nutshell":"Shinka and Sagiri, the two heroines of our story, fight yokai to protect people. In daily life, they attend school, and work as voice actresses. The story includes characters and elements loosely based on Japanese folklore, Shintoism and Buddhism."},{"name":" AKB0048 - Heart-gata Operation","avatar":"https://mangadex.org/covers/82bc4f0e-c83b-40d5-955b-f0e6604fc7c3/cbe461ad-a31c-4f29-b1aa-aae87789a013.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Comedy"],"nutshell":""},{"name":" Outen no Mon","avatar":"https://mangadex.org/covers/82bf73a9-401b-4f07-9dd1-be9a720ccb19/7a504f7b-0c4b-4f19-b404-3e6dedf72c0c.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Ongoing","tags":["Historical,Mystery"],"nutshell":"Heian period Japan. The Fujiwara family is plotting to seize power at the court, when two maids suddenly go missing from the capital. The emperor fears that it is the work of a demon, and orders Ariwara no Narihira to work with a young man. The boy's name is Sugawara no Michizane.\nSugawara no Michizane, a shut-in student, and Ariwara no Narihira, a Kyoto playboy, are twenty years apart in age. They are different in status and birth, yet work together to solve the mysteries of Kyoto!"},{"name":" Gintama - Noboru Tsukiyo no Kaigou, Futari de. (Doujinshi)","avatar":"https://mangadex.org/covers/82c159a9-0217-4fd0-914a-d9a1889eefae/c0d37552-dc16-4395-b553-cbce6ec07a25.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Action,Romance,Drama"],"nutshell":"Pairing: Kamui x Tokugawa Soyo\n(feat. background Okita Sougo x Kagura)\nKamui runs into Soyo on a certain moonlit night after finishing a job. Kamui assaults Soyo, who is not afraid of him, but his relationship with the princess does not end there. Kamui gradually becomes attracted to the princess... Volume 1 of a feature-length story in which a villain and a princess in completely different positions meet and are drawn together."},{"name":" A&B","avatar":"https://mangadex.org/covers/82c54dff-1017-4e8d-b6c0-750e9fc432af/a29791ea-be21-4833-bf8c-23a138caaed2.jpg.256.jpg","country":"Korean","stat":"8.13","status":"Completed","tags":["Long Strip,Romance,Comedy,Boys' Love,Web Comic,Slice of Life,Full Color"],"nutshell":"A sweet fluffy story between the calm, quiet A and wild, social B. With not a single thing in common, will the two be able to nurture a safe romantic relationship? Let’s find out!"},{"name":" Renri no Eda","avatar":"https://mangadex.org/covers/82c6b4cd-9137-44cf-ad80-32fae40ca499/33aeceb6-06b4-479b-890b-7d0ba58b4f7c.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Oneshot,Romance,Drama,Supernatural,Tragedy"],"nutshell":"\"On the earth, let us be two branches of a tree, inseparably intertwined.\"\nKei and Mizuki's quiet lives together in the countryside are shattered when Mizuki collapses and a parasitic plant-like organism is discovered spreading its roots through her body, leeching away her life. How will Kei and Mizuki spend their last days together?"},{"name":" Gun Dragon Σ","avatar":"https://mangadex.org/covers/82cf4a9c-215d-4fd6-9ba1-b145e28bce63/9cc07afa-1fce-42a3-b005-1b807d54448b.jpg.256.jpg","country":"Japanese","stat":"7.57","status":"Completed","tags":["Sci-Fi,Official Colored,Action,Mecha,Crime,Martial Arts,Drama,Police,Aliens,Mystery"],"nutshell":"2030, the boundaries of space are officially opened. Visitors from different planets in the system are allowed to come to Earth.\nJapanese government decides to limit galactic trade to the artificial island of Dejima created off Okinawa\nbut the encounter of species from other worlds creates tensions on the island.\nA special force, made up of humans and aliens, is created to maintain order in Dejima: the Dragon Gun.\nDuring a patrol, DG officer Σ (Sigma) casually stops a lorry carrying illegal goods. Inside is a Mumère, a species coming from a marine planet,\nwhich ends its life to protect a heavy secret. This will be the beginning of a long investigation for the officer Σ."},{"name":" Dusters","avatar":"https://mangadex.org/covers/82cfe70b-e3dc-487c-b277-30c157ebadc7/5f7e4008-979d-46a6-bbef-0f2f0f2e78e6.png.256.jpg","country":"English","stat":"7.84","status":"Ongoing","tags":["Action,Demons,Comedy,User Created,Fantasy,Web Comic"],"nutshell":"The adventures of a group of demons fighting other demons to protect their city St.Albarn!"},{"name":" Katsuko Otsukaeshimasu!","avatar":"https://mangadex.org/covers/82d598b4-416b-43f6-acaf-095365a1dfb0/c8af1559-fdc8-4989-bdf2-00b6d704f541.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Ongoing","tags":["School Life"],"nutshell":"Katsuko, the daughter of a prestigious line of butlers that has served the Ootori family since long ago, now has to deal with the heir of the Ootori family and also the principal of High school that Katsuko attends. Her life is becoming more and more busy than usual because she has to serve the eccentric young master plus attend to High School as a normal student."}]