[{"name":" Teizokureigari","avatar":"https://mangadex.org/covers/53d645a4-247b-4693-b5ff-d05f1bc97ebb/71f98b9f-53d2-44a5-9917-41bf37ad4752.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Horror,Supernatural,Mystery"],"nutshell":"Mami Ryuuka, who has a talismanical power, hunts only low-grade spirits, and all the requests are for vulgar spirits. Actions between death spirits and Mami are displayed.\nIncluded one-shot:\nVolume 5: Gosenzou-sama wa Gokigennaname"},{"name":" Uchuu no Sparrow","avatar":"https://mangadex.org/covers/53d9920e-a11b-4f42-87e9-c669b4da594b/3d39fda6-c1af-464b-9701-319f0e1982f2.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Comedy,School Life"],"nutshell":"Like a typical teenager, there is nothing Tsubaki Ryuuta wants more than to not stand out from the people around him. Unfortunately, on his way to school one day, he is run over by an alien. The alien promptly resurrects him, but now he has superpowers that he can't control. The alien, now in sparrow form, attempts to help guide him, but there's no way for a kid who's constantly breaking things and has an alien sparrow perched on his shoulder to blend in at school. For his part, the alien is completely bewildered at Ryuuta's continuing refusal to use his superpowers to fight crime and evil. Will Ryuuta be able to get over his self-consciousness and embrace his new life?"},{"name":" Kedamono Shounen Shoujo","avatar":"https://mangadex.org/covers/53dc3647-dc15-4e7e-b1b3-8ca61cc9e314/e5df00c6-2653-4ce4-b37a-8aa69c5e90c5.png.256.jpg","country":"Japanese","stat":"7.73","status":"Completed","tags":["Romance,School Life"],"nutshell":"Enatsu is fascinated with cool and aloof Toba. He's rebuffed her 13 times, telling her he hates girls. Enatsu finallly manages to get Toba alone with her and hugs him. To her surprise Toba's personality changes and he almost rapes her. A book falls on his head and he changes back into the Toba she loves. She pretends they went all the way and extorts Toba to be her boyfriend. But what if he finds out nothing happened…?"},{"name":" Saki - Sketch With A Calligraphy Pen (Doujinshi)","avatar":"https://mangadex.org/covers/53de97a1-1aac-457a-9187-f66a9b51ff40/e811d7b5-2107-419d-a8f4-a387ca17c41c.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Girls' Love"],"nutshell":"A short Saki pixiv doujinshi."},{"name":" Kokoro Note","avatar":"https://mangadex.org/covers/53e26b65-9fac-4bfd-9242-e854773089f2/eaf0dc0b-5531-4498-a2ae-5c4ca145706d.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"She has a secret little notebook filled with her goals and thoughts of him..?"},{"name":" Dirty Work","avatar":"https://mangadex.org/covers/53e50f79-89f5-4331-9395-2e3c48359a24/8eafa243-93f5-4b33-b981-9e77b7ec133d.png.256.jpg","country":"Japanese","stat":"7.46","status":"Completed","tags":["Oneshot,Psychological,Drama"],"nutshell":"Tetsuo is a quiet and uncharismatic boy who is desperately in love with one of his classmates… who refuses to be his girlfriend. However, his feelings lead him to do anything for her; even become her puppet…\nWhat are the girl's true feelings?"},{"name":" Words and spirits","avatar":"https://mangadex.org/covers/53e63c7e-904c-4bc1-b34c-86e7c7dcccf5/820d7207-cbd3-4904-874d-39103100ab89.png.256.jpg","country":"Chinese (Simplified)","stat":"7.77","status":"Ongoing","tags":["Long Strip,Adventure,Magic,Girls' Love,Fantasy,Web Comic,Full Color"],"nutshell":"Xu Zao Yue, who had just become a comic editor, was the editor in charge for the first time as a comic artist, and met an eccentric comic artist who looked like a duck. After confirming the look in her eyes, it turned out to be an illusion. Later it was discovered that the ghost stories drawn by the original cartoonist were all based on real events, including his worldview. The spiritual world and the wheel of fate have drawn the two into an unknown lost journey…"},{"name":" Detective Conan Special","avatar":"https://mangadex.org/covers/53ef0bb0-7620-40be-b282-177b71021222/56e192dd-29a2-41d4-9781-855a25d386c9.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Ongoing","tags":["Action,Psychological,Romance,Comedy,Crime,Adventure,Drama,School Life,Police,Mystery"],"nutshell":"Kudo Shinichi is a high school detective who was poisoned during a confrontation with suspicious criminals, and was transformed to look like a child! Now he's staying with the Mouri family and secretly continuing to solve cases while investigating the organization who put him in this situation.\nA spin off series of short stories and cases from the Detective Conan universe, drawn by Aoyama Gosho's assistants. These stories are all separate from the main plot and don't follow any kind of over-arching continuity.\n\nOfficial Release:\n\nIndonesian release by Elex Media as Detektif Conan Spesial"},{"name":" Neko ga Nishi Mukya","avatar":"https://mangadex.org/covers/53f25044-1d36-4966-89bc-4e1d259778f2/2773370e-69d4-4dd3-a172-836f3dc0c33b.jpg.256.jpg","country":"Japanese","stat":"8.54","status":"Completed","tags":["Psychological,Drama,Slice of Life,Supernatural"],"nutshell":"The story is set in a world with a mysterious phenomenon known as \"flow,\" and features two people (and one cat) who make a living dealing with it."},{"name":" Kingdom of the Queen","avatar":"https://mangadex.org/covers/53f5bad9-c2d0-49c2-89fc-d929004e76c9/59a72bb4-42cf-4da1-9aba-bae915729caa.jpg.256.jpg","country":"Korean","stat":"7.87","status":"Completed","tags":["Historical,Action,Long Strip,Military,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"A delightful political revolutionary drama by four women! Who will claim the throne at the end?\n\nDespite the Kingdom of Blenheim having a woman on the throne, it is a nation made for men. Women are restricted in what they can do, and those who think differently are reminded of their place. But now comes four ambitious girls with their sights set not only on the crown, but also on a revolution! Whose eccentric vision will shape the fate of this great kingdom?\n\nOriginal Webtoon\nOfficial Translations:\n\nEnglish\nFrench / Français\nIndonesian / Bahasa Indonesia"},{"name":" WisteriA","avatar":"https://mangadex.org/covers/53f6ebac-8962-44f6-9c09-271fa3b3b529/5bdffea2-c06f-4c3c-a957-b475815ee87c.jpg.256.jpg","country":"English","stat":"8.11","status":"Ongoing","tags":["Girls' Love,School Life,Slice of Life"],"nutshell":"WisteriA is the story of a girl named Momo! After joining a small art club on a whim, a series of changes pave the way for a new journey all her own…\nA story about art, growth, and life. Slow and steady. You'll find your way there."},{"name":" Mobile Suit Gundam Pulitzer - Amuro Ray Beyond the Aurora","avatar":"https://mangadex.org/covers/53f750df-53b0-4823-aa7b-0d69b90d853a/709789d3-d544-4fdf-b381-95edbad5cc5f.jpg.256.jpg","country":"Japanese","stat":"8.23","status":"Ongoing","tags":["Thriller,Sci-Fi,Action,Psychological,Mecha,Survival,Adventure,Military,Drama,Mystery,Tragedy"],"nutshell":"In UC0095, following the events of Char's Counterattack, Kikka Kobayashi gathers testimonies about Amuro Ray to show the world the kind of person he was."},{"name":" The Story of a Boy Who Petrifies Those Who Meet His Eyes and a Blind Saint","avatar":"https://mangadex.org/covers/53fabff2-f22e-4b36-a3e9-fc68dd84aca8/c27db423-49be-4583-aab2-6cec599403d4.jpg.256.jpg","country":"Japanese","stat":"7.65","status":"Completed","tags":["Oneshot,Fantasy,Web Comic,Supernatural"],"nutshell":""},{"name":" Vicious Luck","avatar":"https://mangadex.org/covers/53fdb760-5e25-435e-b6ec-595e0169a688/737dc78b-3fcf-4eed-ad98-6cff2984bd1a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.77","status":"Ongoing","tags":["Romance,Slice of Life"],"nutshell":"Chen Yang was just an ordinary person. One day, he was given an opportunity: he was offered the ability to control his luck! Love, status, and fortune were suddenly all within his grasp. When a person can control his luck at will, how will his life change? Will he run into beauties as soon as he steps outside his door? Will he trade as much stock as he possibly can? Damn… it's too good to be true… Those who are my friends will all live wonderful lives. Those who are my enemies have already paid the price!!"},{"name":" Tada Shiawasena Isekai Kazoku Seikatsu","avatar":"https://mangadex.org/covers/54016980-802d-4780-b964-23ee03891b6d/eae40d90-ddc8-484d-8802-ab36bfd4ef57.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Ongoing","tags":["Reincarnation,Survival,Isekai,Fantasy,Slice of Life"],"nutshell":"Araki Susumu, a salaryman who has been working ceaselessly without caring for his family, loses consciousness on his birthday and is reincarnated in another world as \"Tidus\", the son of a couple named Dee and Tin. Regretting his previous life, Tidus begins to work on the development of his village from an early age to live happily with his family this time. Taking advantage of his father's position as head of the village, he teaches the children around him how to write and creates new special products from the blessings of nature. However, some forces want to take advantage of his success…\n\" I hope and pray that the ones around me will be happy.\"\nThis is the story of a young boy who starts his second life to make his family happy."},{"name":" Motto, Ikitai...","avatar":"https://mangadex.org/covers/5409d71f-e669-4da0-9053-bb642e922fae/381ff28b-17fa-4646-a224-fff9f9ceaa8b.png.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Romance,Drama,Horror,Mystery,Tragedy"],"nutshell":"Mayumi is a girl who lost her parents in a car accident; unable to deal with the overwhelming sadness, hatred and anger, she wishes only to be able to stop feeling altogether. Five years later, the now 18-year-old Mayumi's sister is the first victim in a series of bizarre incidents that involve people receiving text messages indicating a certain body part, immediately after which said body part is removed - painlessly and without blood loss - from their body and disappears completely."},{"name":" Necrophilia of Darkside Sister","avatar":"https://mangadex.org/covers/540a9c85-aefe-4263-bcef-68441b13ea35/e9a614e7-54e8-4e35-937a-9872d3de70d1.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Drama,Horror,Supernatural,Tragedy"],"nutshell":"Georg and Riselotte are your typical brother and sister, except the former's a priest and the latter's \"alive\" by way of…darker methods. As a result, Rise is stuck in a child-like body. Georg immerses himself in research to free Rise from these chains.\nNote: This manga is about necrophage and not necrophilia. However, the correct title is still necrophile."},{"name":" Ouji no Hakobune","avatar":"https://mangadex.org/covers/540e19f7-9a86-4400-a91c-0a0d4ea2b30c/a078ae04-c39b-4d36-8c07-32e3f7becc77.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Oneshot,Sci-Fi,Historical,Romance,Boys' Love,Drama"],"nutshell":"An Ark of the Prince\n\n\nThe Direction Of The Ark\n\n\nTreasure\n\n\nCage Of Eternity\nTomoyuki seeks revenge for the games Shibata played with his sister. Thus begins the Master and Pet game, but Shibata may have become too accustomed to the role Tomoyuki forced upon him.\n\n\nLove Chocolate\nA short sequel to Cage of Eternity where Shibata only wants one thing for Valentine's Day: Tomoyuki.\n\n\nWild Sons\nAs the sole heir of Flanagan, Vincent was to take on his father's role in maintaining the peace in a small town. He’d never expected Luke, the man who inherited his father’s name and a share of his father’s legacy. Will Vincent acknowledge Luke as his brother and someone with equal rights to Flanagan’s inheritance or will Luke die before he accomplished his sole purpose in that town?\n\n\nMusic At The Break Of Dawn"},{"name":" Electric eel's strategy","avatar":"https://mangadex.org/covers/541080d4-ed34-48e3-a51a-2766a75f7075/7c1f18f4-6357-4508-b91c-157db2343986.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Romance,Comedy,Drama,Web Comic"],"nutshell":"Shunichi Odagiri can hear humans' inner thoughts through their spirit animals which are called heart beasts. Shunichi, who knows the ugliness and foolishness of human beings more than anyone else, have felt that he'll be alone forever. Until a beautiful girl who doesn't have a beast appears in front of him…"},{"name":" Shishunki no Iron Maiden","avatar":"https://mangadex.org/covers/54126645-6ac5-4781-ae43-3f3fd2443624/28059cc4-4607-445d-bac9-0b9518b7a429.jpg.256.jpg","country":"Japanese","stat":"7.59","status":"Completed","tags":["Sci-Fi,Romance,Comedy,Drama,School Life,Supernatural"],"nutshell":"Mayama Haruki and Himemiya Tsukiko have been childhood friends and neighbors for as long as they can remember, but after a girls-only meeting in fourth grade, Himemiya distanced herself from Mayama. Now in their 2nd year of middle school, Mayama has become an ero-freak who specializes in harassing Himemiya.\nDetermined to unravel the greatest secret of girls, what happens on \"that day\", Mayama follows Himemiya and uncovers…!"},{"name":" Infinite Stratos - WATAKUSHI no LOVECOME ha DALE nimo JAMA sasemasenwa (Doujinshi)","avatar":"https://mangadex.org/covers/5412fe1f-0b35-4136-a994-433487ee0800/103f0f63-2ff6-40e1-9e4a-786e05ad1f83.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy"],"nutshell":""},{"name":" HOW NAIVE","avatar":"https://mangadex.org/covers/54198378-25bb-4d38-834d-a1ae37d38e56/26c99a71-1e9c-4978-be3e-addf786baf0c.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.95","status":"Ongoing","tags":["Action,Long Strip,Romance,Comedy,Sports,Drama,Web Comic,Slice of Life,Full Color"],"nutshell":"For some reason the campus hottie of da tian high school, dong fang gu yue cannot contact females. so people labeled him as “gay lord”. under his despair, a young lady passed by, who got the same aura as him. the dark dong fang gu yue grasped the last bit of spark and started planning evil deeds towards her…"},{"name":" Ore no Pantsu ga Nerawareteita","avatar":"https://mangadex.org/covers/541aa653-9b2c-4bb3-bfb1-79151ec792f4/e64a3468-ada7-491e-bd0b-2c342299c7ae.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Murakami-kun's dream is to have an ideal relationship with a normal girl like in shoujo mangas. One day, a girl finally confesses to him but to his surprise, all she wants is his underwear! Now, what kind of love story will unfold with his underwear at stake?"},{"name":" Super Manbe","avatar":"https://mangadex.org/covers/542d94e7-9369-461b-b7d3-5664dda61c84/5611f571-6168-4928-b45a-13e5bf55456d.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Thriller,Historical,Action,Psychological,Animals,Comedy,Survival,Martial Arts,Samurai,Adventure,Military,Drama,Delinquents,Slice of Life,Tragedy"],"nutshell":"(from ebookjapan):\nThis is a poignant jidaigeki manga about Super Manbe, a skilled samurai with a strong sense of justice and a kind heart, who goes on an unusual journey to exterminate a group of villains.\nManbe subdues a rampaging horse with his bare hands and then makes the acquaintance of Senkichi, a horse boy who hates samurai. Later, Senkichi's horse is almost taken by the arrogant samurai Shigebei Nagashima, but Manbe rescues him...?"},{"name":" Brilliant Galaxy","avatar":"https://mangadex.org/covers/54332bd8-a03e-476e-964c-f401e97e7253/02e12bb5-266d-4c50-ba6b-4d0c7daa6118.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.02","status":"Ongoing","tags":["Reincarnation,Time Travel,Official Colored,Action,Long Strip,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"After the divorce settlement, she was in dire straits with no money, no house, and no looks! To counterattack, Xia Xinghe became a top-notch hacker, gaining vast wealth without much effort!"},{"name":" How a Rebellious Girl Fell into Love","avatar":"https://mangadex.org/covers/54349b82-7b0f-413b-bdb0-ff7f495f2c74/fa9ce771-dfa3-4a25-adc1-c4ac993cd04e.png.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Long Strip,Romance,Drama,School Life,Fantasy,Delinquents,Web Comic,Full Color"],"nutshell":"When a troubled teen girl returns to school, all she brings are imminent conflicts! A female gangster leader is forced to go back to school by her grandfather. Encountering reunion with her childhood sweetheart, conflicts with another gangster organization, school bullying and exploring the secret behind the death of a student... her school life is set to be chaotic."},{"name":" Wild Rock","avatar":"https://mangadex.org/covers/543f3238-9f49-42e2-a8ff-8af1413d6ab4/baf76059-e271-48ac-b395-8caca0d23710.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Historical,Romance,Boys' Love,Drama"],"nutshell":"Wild Rock takes place in a prehistoric setting.\nThe first story is about a boy, Yuuen, who is asked by his tribal chief father to seduce Emba (a great hunter and the next chief of the rival Lakeside clan) by pretending to be a female so that they can get more food. The other stories are in the same setting, but with different characters (including the fathers of both characters from the main story when they were young)."},{"name":" Nagisa Wants Taiyou All to Herself","avatar":"https://mangadex.org/covers/54431c18-d881-45b7-986a-ae5b15a84acd/9a863b79-e90a-4279-9b0a-0df889d8f6d4.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Ongoing","tags":["Romance,Comedy,4-Koma,Slice of Life"],"nutshell":"[from lost-translations]\nThe frustration is unbearable!\nOkawa Taiyou is a systems engineer who looks scary and unapproachable on the outside, but is actually just a clumsy, good-natured guy. He has a a long-time crush on his high school classmate, Ikeda Nagisa, who is obsessed in collecting goods from her favorite anime and manga.\nNagisa thinks that there's no reason for Taiyou to fall in love with such a hardcore otaku like her. Taiyou, on the other hand, couldn't confess his feelings to her because he's so afraid that she'll hate him.\nWhat will their story of fangirling and unrequited love result to?"},{"name":" Santa Claus wa Blue","avatar":"https://mangadex.org/covers/5450f41c-bb12-483f-a0b6-50d40f4cf406/eb6b01ee-7413-4793-96a8-623270a56283.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"Christmas is a joyful time to eat cake with loved ones. But is that the case for Hujita?!"},{"name":" Iigakari Neesan","avatar":"https://mangadex.org/covers/54597bb4-f0c8-4669-9c73-bd958ecf8bad/0d96dc88-5f6b-4ccc-b0d7-1d45a2436189.png.256.jpg","country":"Japanese","stat":"7.68","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":"The story is mainly told from a young boy's point of view, who's older sister spends all day falsely accusing anyone and everyone of anything and everything. When she finally finds a job at a department store, she doesn't only accuse customers but also feels falsely accused by them…"},{"name":" Kemono wa Ai de, Iyasareru","avatar":"https://mangadex.org/covers/545a8ab7-6db8-47f4-affb-618a8df3e6f9/297afe0f-de5c-4603-853e-f4c067cc9bce.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":"As the son of a huge enterprise, Kazuki had always been starving for real affection – and the appearance of Saijou Chiharu rescued him from that miserable life. However, one day a suspicious document came, claiming that Chiharu has plans to take over the whole group. Because of that document, Chiharu's unknown past was exposed…!?"},{"name":" Watashi no Koibito ni wa Himitsu ga Aru!","avatar":"https://mangadex.org/covers/5466f5e9-f92b-412b-a6f3-01766c108403/43d7d7bc-2e39-4ee7-8bf2-a69d482c4e45.png.256.jpg","country":"Japanese","stat":"7.65","status":"Ongoing","tags":["Romance,Crossdressing,School Life"],"nutshell":"She has a boyfriend straight out of a Shoujo manga. However, her boy is cute in more ways than she expected…"}]