[{"name":" Heaven and Earth","avatar":"https://mangadex.org/covers/69258243-ca3d-4f41-b627-05203050c8a8/c10a110a-7f9f-410a-8449-9e702c43109c.png.256.jpg","country":"Korean","stat":"8.04","status":"Ongoing","tags":["Historical,Long Strip,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"In order to bring the right order to the heavenly world, the first Jade Emperor gathered the representatives of the 12th, the Ten Longevity Symbols, and the Obangsin. He joined the organization as Hwang Ryong's representative. What did she see on her first day at work?\nFantasy drama, which takes place against the backdrop of the heavens where various races live together.\n\n\nOfficial Simplified Chinese Translation"},{"name":" Omega Syndrome","avatar":"https://mangadex.org/covers/692be0c4-8b13-41b3-9571-de6bd13fbf17/718fa96c-cd38-42c3-b75d-67fe7ae07243.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Haru Nishimiya has been affected by special condition call omega syndrome, and could get pregnant. Surprisingly, the doctor in charge turns out to be one of his former high school classmate, Katsuragi. During their time in highschool Haru could always feel Katsuragi glaring at him whenever they met but he never knew why. This time, will Katsuragi reveal the reason of his hatred and past secrets? Will the misunderstanding get cleared up…?"},{"name":" Full Dozer","avatar":"https://mangadex.org/covers/6930ee12-8553-458e-9e5d-86149d7eb1a9/518eb767-3636-46ae-b64c-dbc003f4ea81.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance,Comedy,Drama"],"nutshell":"Ryouma Muroto secretly has feelings for his childhood friend Mao Manaka, a 15-year-old girl who appears to be a refined beauty on the outside, but she's actually an impulsive girl who is very persistent once she has made up her mind to do something, which Ryouma likens to a bulldozer. This personality causes others her age to tend to stay away from her, and Ryouma enjoys the fact that he's basically the only person who can hang around her.\nRyouma's daily interactions with Mao change one day when she meets Hayato Honjou, a fledgling actor who has had trouble making a name for himself in the entertainment industry. Ryouma quickly notices a change in Mao's demeanor when she starts showing a lot of interest in Hayato's up-and-coming career. Mao soon tells Ryouma that she has feelings for Hayato, and she shows Ryouma her determination to get closer to Hayato by joining a talent agency and moving to Tokyo. When Ryouma is later scouted by a talent agent, he decides to chase after Mao in the hope that their paths will connect someday."},{"name":" Special Outing in SAGA","avatar":"https://mangadex.org/covers/6936b358-d869-4f15-ba58-7e5b0564839c/bb3a5c30-15ce-4ea1-834d-1b5739e505a0.jpg.256.jpg","country":"Japanese","stat":"7.47","status":"Completed","tags":["Zombies,Girls' Love,Slice of Life"],"nutshell":""},{"name":" Ironsnow","avatar":"https://mangadex.org/covers/6943619b-f264-442d-b1d4-721072194951/5cd0da19-cf4e-42c0-b363-3899e4c5a96b.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Drama,School Life,Slice of Life"],"nutshell":""},{"name":" Ashita wa Docchida!","avatar":"https://mangadex.org/covers/69445a8c-ad13-4fb8-8781-e9e5a2c8cdc8/5ef17b88-3c05-4d15-abd4-7d77ae03e296.jpg.256.jpg","country":"Japanese","stat":"8.75","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,Drama,School Life,Delinquents,Slice of Life"],"nutshell":"Kirara is seen as a cute and girly boy by others. However, he wants to be a cool and manly guy! So when two tall and cool boys move in nearby, he starts to follow them around to learn how to be manly. As they grow up together, Kirara realizes that his feelings towards the younger brother, Ken, isn't just simple friendship."},{"name":" Waiwai ★ Hey! Say! JUMP","avatar":"https://mangadex.org/covers/694956b4-3a87-4206-a945-71f74c0a59a4/327bb091-e84e-4e26-87d1-ee944dc4b538.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":[""],"nutshell":"This manga is about the boy group in Japan called, Hey! Say! Jump."},{"name":" Giant Ojou-sama","avatar":"https://mangadex.org/covers/694fd8ba-0865-4821-b7cc-a7133645f757/1e2ea1b7-6c1f-48db-9dc9-29b732a384a5.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Award Winning,Sci-Fi,Monsters,Action,Comedy"],"nutshell":"I can't believe my ojou-sama is so huge!\nFujido Oriko is the buxom young head of the Fujido Zaibatsu, a group that has a monopoly on Japan's vending machine industry. And serving at her side is her personal butler, the eccentric Dr. Sebastion.\nWhen a monster suddenly attacks the city, Dr. Sebastion slips his ojou-sama an experimental energy drink his team in R&D has been developing. As a result, she quickly finds herself growing into a giantess, matching the attacking kaiju in size! Will she be able to stop his rampage, or at the very least, keep her dignity intact?\n[Winner of Shounen Jump's Dec 2020 Bronze Rookie Award]"},{"name":" Everfallen - The Beginning of the world","avatar":"https://mangadex.org/covers/69508764-8043-4a32-a93e-5c002c6333d7/f72bbd47-3009-4de9-bed4-aeb467ea3ef4.png.256.jpg","country":"English","stat":"7.97","status":"Ongoing","tags":["Adventure,Fantasy,Web Comic,Mystery,Full Color"],"nutshell":"On raconte qu'il y a bien longtemps, le monde était immortel.\nMais un jour, le monde a changé. La mort est apparue.\nC'est l'histoire de deux frères nés de la Poussière et de la Lumière.\nCes deux dieux immortels bien téméraires trahirent leur père, à leurs risques et périls.\nC'est l'histoire de deux frères qui doivent maintenant faire face à un choix lourd de conséquences…\nCette histoire est un prélude qui permet de vous présenter l'univers d'Everfallen."},{"name":" Life Howling","avatar":"https://mangadex.org/covers/6953ecff-a277-4441-b282-c0b6d43b8743/796f2c20-3ed1-4f2d-8403-7f8eb429ecc5.jpg.256.jpg","country":"Korean","stat":"7.99","status":"Hiatus","tags":["Action,Long Strip,Adventure,Drama,Fantasy,Web Comic,Supernatural,Adaptation,Full Color,Tragedy"],"nutshell":"Jung Yoon-hwan may be an orphan but he was a college student who was focusing hard on his studies, one day he is brought to a mysterious \"White room\" to fight even when he does not want to. Every time he defeats these monsters he gains psychic power, magic, and items beyond his imaginations…."},{"name":" Black Jack Secret Production Stories  ~From Osamu Tezuka's Workplace~","avatar":"https://mangadex.org/covers/69570413-3581-4d16-83d2-07012b5bcdb6/cb96c5e9-961e-4f9a-9608-49d5168bcc3f.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Award Winning,Historical,Comedy,Adventure,Office Workers,Drama,Medical,Slice of Life,Mystery"],"nutshell":"(from ebookjapan):\n\"The Mangaka created the Doctor. The Doctor saved the Mangaka.\"\nBlack Jack, the immortal masterpiece that sparkles in the history of manga! This is a Manga nonfiction work that recreates the creative process of the God of Manga, Osamu Tezuka, through the testimonies of those involved!\n\n\nWon 1st Place for the Kono Manga ga Sugoi! Award for Shonen/Seinen in 2012"},{"name":" Nier: Automata - Is this hatred? (Doujinshi)","avatar":"https://mangadex.org/covers/69581ef1-9907-47eb-86bf-2b02d92463e5/9022234a-4dea-4491-96f5-512cedc1244d.jpg.256.jpg","country":"Japanese","stat":"8.22","status":"Completed","tags":["Oneshot,Sci-Fi,Comedy,Mecha,Post-Apocalyptic,Shota,Web Comic"],"nutshell":""},{"name":" Anaesthesiologist Hana","avatar":"https://mangadex.org/covers/69598407-e128-4c8b-be43-feffa9fd98e8/919aa5f8-5ce6-4710-b95e-968b37287489.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Ongoing","tags":["Thriller,Comedy,Drama,Medical,Slice of Life"],"nutshell":"As a young anesthesiologist who has been with her hospital for about three years, Hanaoka Hanako has just about had it with her job. The hours are grueling and there are never enough hands. Her coworkers are either obnoxious jerks who call her incompetent or sexist boors who try to cop a feel. She hardly ever sees the sky, has to eat cup ramen for most meals, and has no social life to speak of. Worst of all, her job is thankless. Everyone loves surgeons who perform lifesaving operations, paramedics who rush to the scenes of emergencies, or nurses who provide primary care - but anesthesiologists are only singled out if something goes wrong and a patient is lost. Still, someone's got to do it, and if not her, then who?\nSo even with crappy pay, terrible work hours, and sexual harassment…anesthesiologist Hana will cheerfully knock you out!"},{"name":" Higurashi no Naku Koro ni Kai - Utsutsukowashi-hen","avatar":"https://mangadex.org/covers/695c44bd-2ffa-46a6-8a3c-b4bf3c81e9db/fc3f120f-60d2-4ea1-b49d-e4c09805278d.jpg.256.jpg","country":"Japanese","stat":"7.65","status":"Cancelled","tags":["Psychological,Drama,Horror,Supernatural,Mystery"],"nutshell":"By the decision of the Sonozaki family, Sonozaki Shion has been \"imprisoned\" at St. Lucia Academy, an all-girls boarding school. One day, a male teacher is found dead in the school's swimming pool, and Shion's classmate Kousaka Mizuho, who was the first one to discover the body, is summoned to the board chairman's office, but Mizuho refuses to discuss the details of the incident. Shion hears a rumor that Mizuho's own grandmother is trying to kill her and that she entered the school to escape the danger, and uses her French homework as an excuse to try to make contact with Mizuho, who refuses to open up to anyone."},{"name":" Free!","avatar":"https://mangadex.org/covers/6968e4a5-4ac5-4222-93d3-772ee57ad893/985768e9-1b97-4a8c-8eba-5708c12faa86.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Comedy,4-Koma,School Life"],"nutshell":""},{"name":" Get Rich Overnight: I Married the Director","avatar":"https://mangadex.org/covers/69694bf6-3692-4fb0-912c-4835c3dcad0e/f6f5516f-f550-423d-bd72-035153f081d9.png.256.jpg","country":"Chinese (Simplified)","stat":"8.03","status":"Completed","tags":["Long Strip,Romance,Comedy,Web Comic,Full Color"],"nutshell":"He marries her for the inheritance and she marries him for the family. How can one maintain a marriage without love? The nightmare begins on the wedding night. How dare he bring another woman home and be intimate in front of me just to spite me?! Don't trifle with me! Playboy Ling Qiao, go to hell!"},{"name":" Nude - AV Joyuu Mihiro Tanjou Monogatari","avatar":"https://mangadex.org/covers/69708585-a102-4b86-91e0-ddf759aed5bd/c983df3a-5064-461d-9a34-7548c8c28a3d.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Romance,Drama"],"nutshell":"After graduating from high school, young Hiromi moves from Niigata to Tokyo to pursue her dreams of becoming an actress. She first starts out in the adult film industry under the stage name of Mihiro.\nNude is based on the autobiograpahical novel \"Nude\" (published in 2009), written by real life AV actress Mihiro. (AsianWiki)"},{"name":" Noru","avatar":"https://mangadex.org/covers/6972526d-aeab-4812-8a16-c9f06312db72/2030c225-99af-40ce-8b8c-79030e8dec00.jpg.256.jpg","country":"Korean","stat":"8.09","status":"Completed","tags":["Long Strip,Adventure,Drama,Slice of Life"],"nutshell":"The story is set after the fall of civilization on earth due to resource scarcity. It follows the tale of Noru, a boy who shares resources with the people still left on earth. But Noru is not a savior. His goal is to record the fall of civilization on earth, to leave a record for the future generation."},{"name":" Martial Lord","avatar":"https://mangadex.org/covers/6972e083-7271-4952-b4b7-2228e368ddef/f6011977-6498-4099-8625-9592a1035853.png.256.jpg","country":"Chinese (Simplified)","stat":"7.79","status":"Ongoing","tags":["Official Colored,Action,Long Strip,Martial Arts,Fantasy,Supernatural,Full Color"],"nutshell":"The legend of the Tianwu Continent, Qin Chen, accidentally fell into the martial domain after being double-crossed by his best friends. Three hundred years later, he was reborn as an illegitimate child in a royal family who was being constantly bullied. With his attainments in previous life, cultivation methods, and pill refining skills, he quickly rises against all odds and embarks on an amazing journey that will shock the whole continent..."},{"name":" Suzuka","avatar":"https://mangadex.org/covers/69766b88-5843-4c6b-8c2b-e1da42e4c55f/8cd8f547-224a-405c-a64a-c6d6a29ce3a6.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,Comedy,Sports,Drama,School Life,Slice of Life"],"nutshell":"Yamato is ready for a fresh start. So when his aunt invites him to stay rent-free in her big-city boarding house in hustling, bustling Tokyo, Yamato jumps at the chance. There’s just one teensy-weensy catch: It’s an all-girl housing complex and spa! Things get even more nerve-racking when Yamato meets his neighbor Suzuka, a beautiful track-and-field star. She’s not just the cutest girl Yamato’s ever met, she’s also the coolest, the smartest, and the most intimidating. Can an ordinary guy like Yamato ever hope to win over a girl like Suzuka?"},{"name":" BanG Dream! - You Mustn't Lose (Doujinshi)","avatar":"https://mangadex.org/covers/697962ee-614b-45ae-9083-2bffe29dbcab/527d2935-4f0e-4dfc-a042-80cc341405b6.png.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Oneshot,Girls' Love,Slice of Life"],"nutshell":"Sayo watches a TV drama featuring her twin sister Hina, and then…!\nLinks:\n\nAuthor's Doujin E-book Store\nAuthor's Pixiv\nAuthor's Twitter"},{"name":" Halfmoon Emotion","avatar":"https://mangadex.org/covers/698b23c1-417c-4e17-8d29-5a77ccf7e0ce/05ddf58c-fe42-4078-be9a-dc3b0090e7df.png.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"It's been about 2 years since the end of Yatteraneeze! and Chisato and Kanae have FINALLY gotten their shit together… or have they? They still fight all the time, clash at work and glare at each other across the breakfast table. But a little adversity has a funny way of bringing people together…"},{"name":" Chicha Koi Nikki","avatar":"https://mangadex.org/covers/6994db1c-60c9-4362-81cf-ed7deb2b85e3/b1bb3ff2-b81e-4e47-b73b-b60212ee44dc.jpg.256.jpg","country":"Japanese","stat":"8.21","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life"],"nutshell":"Nakamura Yukiko is a 13 year old middle school student, who lives together with her mother and her big brother. Since her mother got a new job, her family has recently moved from a small village in the mountains to the local town. Yukiko, however, misses her friends from the village and has problems adapting to the fast-paced town life. Will she ever come to like her new home?"},{"name":" Knuckle Girl","avatar":"https://mangadex.org/covers/699b8e6c-e98b-4ed5-beee-580937d220e4/da6f467a-5098-458e-98e6-aedd19c9924e.jpg.256.jpg","country":"Korean","stat":"7.27","status":"Completed","tags":["Action,Long Strip,School Life,Web Comic,Full Color"],"nutshell":"Ran, a high school female boxer, goes out into lawless territories of school bullies and school gangs to get revenge for her sexually assaulted younger sister."},{"name":" Futari Awasete Puramai Zero","avatar":"https://mangadex.org/covers/699e0ce3-5d42-41bd-853f-f9c2f57fc132/38247a60-7207-4de3-9573-c1c146b0ec21.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Oneshot,Romance,Comedy"],"nutshell":"Yamada Nadeshiko has always had a negative personality, so she always thinks that whatever she does, it will lead to the worst possible outcome. But by meeting Samejima-kun, with his conceptualization, she finds that she can slowly become more positive.\nThen Nadeshiko realises that she has fallen for Samejima. What is she supposed to do now!?"},{"name":" I Will ~Not~ Fall for My Contractual Girlfriend","avatar":"https://mangadex.org/covers/699f08d0-7661-4f8e-8eb8-9718b3de1a7a/709b9c84-e067-4076-9a81-8f7c77ae648b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.88","status":"Cancelled","tags":["Long Strip,Romance,Full Color"],"nutshell":"Three years ago, Shen Yucheng and Mo Ran were framed into a night of entanglement but failed to remember each other’s face. Shen Yucheng was blackmailed with his photos. For his own benefits, he lied about her being his girlfriend who was going to study overseas for three years. Three years later—pressured with marriage—he found her figure to be very similar to the woman he had a one-night-stand with and signed a contract with her to be a contractual partner. Mo Ran was originally a rich lady, but she was cast out of her family because of a plot and had to resort to taking the roles of movie extras. How would the love life of the romantic CEO and middle-aged background actress develop from this?"},{"name":" A Story about JK Who Has A Crush on DK Who Likes Mature Women","avatar":"https://mangadex.org/covers/69a1ab40-3542-4f18-a711-7b1ad841dbf1/35a02791-3e5a-4db0-a45e-9bdc5d3c235c.jpg.256.jpg","country":"Japanese","stat":"7.60","status":"Completed","tags":["Oneshot,Romance,Comedy,Drama,School Life,Gyaru"],"nutshell":"A high school girl tries her best to make her crush look her way. The thing is, her crush only likes waaay mature women."},{"name":" Boukun Shachou to Keiyaku Dorei","avatar":"https://mangadex.org/covers/69aa9739-329b-4698-a270-133129b0cae2/e77fb95d-c838-49ed-8826-7245bc66ef7e.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Romance"],"nutshell":"Saori's a bright, hard-working girl whose life is about to take a turn for the better. With her mother remarrying, Saori is going to get a new dad! This exciting prospect is ruined when a handsome stranger with awful manners informs her that her mother is dating a married man - and that very man is his father.\nAdding to Saori's shock, the gorgeous but cruel Takahito demands money for moral losses. There's no way Saori can come up with the sum he suggests, but Takahito then makes another proposal: Saori is to be his to command for a week... body and soul! Although he's seemingly heartless, his gentle caresses light a fire in her heart..."},{"name":" Smokin' Parade","avatar":"https://mangadex.org/covers/69acd33f-9af0-495a-b5c7-6631fa4752b2/00bc63e9-19f4-44f1-811e-dbcda31560be.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Sci-Fi,Action,Psychological,Comedy,Drama,Horror,Supernatural,Tragedy"],"nutshell":"The story follows Kakujou Youkou, who lives in a seemingly normal world where medical technology has skyrocketed to new heights, making it possible to completely replace any human organ. Those behind this are called the Ame No Tori (Rain of Birds), but it all turns out to be a plot against humanity where the new technology can take over its host, thus turning them into a killing machine. A task force is created called the Jackalope; its goal is to annihilate these mindless murderers before they raise any more havoc. This is where Youkou's new life begins…"},{"name":" April Fool","avatar":"https://mangadex.org/covers/69b2a9ae-5145-4264-99e5-89219132c2da/d1d0553b-ae2b-4710-9d01-b570ee6d7e39.png.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Oneshot,Boys' Love,Drama,Supernatural,Tragedy"],"nutshell":"5 years ago, Haruki's brother Hiroki was swept away by the raging river when the bridge Haruki had built broke, and Haruki believes he is responsible for his death."},{"name":" 18+ Manga","avatar":"https://mangadex.org/covers/69b412f0-bca1-486c-abe9-adda417468ae/5fd4ec7f-f2f8-4cfb-9204-c07fd53e982c.png.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Thriller,Comedy,Slice of Life"],"nutshell":""},{"name":" Young Master's Return to 16","avatar":"https://mangadex.org/covers/69b9d905-b7e5-4b9d-8550-16ad8c84f67c/f084ac28-7f11-4ff2-937f-b4b8543a3844.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.38","status":"Ongoing","tags":["Official Colored,Action,Long Strip,Adventure,School Life,Web Comic,Full Color"],"nutshell":"Mafia boss Wang Tianxia declared his intention of leading his brothers to turn away from illegal business, however was assassinated out of the blues. What he did not expect was that his soul would possess the body of a student instead of dying. And for that student to actually be the school’s number one loser…\n漫画讲述了社会大佬王天下宣布打算带领兄弟改邪归正，结果意外的被射杀，然而自己竟然没死而是灵魂附身在一名学生体内。而自己附身的学生，竟然是学校里的第一受气包·····\nAprès 20 années de travail acharné, Wang Tianxia est enfin parvenu à unifier la pègre de C-City. Mais un soir, lors d'une transaction, il se fait tirer dessus par un sniper et se réveille, à sa grande surprise, dans le corps de Chen Jiong, un jeune collégien de la ville victime de harcèlement scolaire…"}]