[{"name":" Marry Marry Me!","avatar":"https://mangadex.org/covers/80f4a9ba-0d4d-4c52-8de6-922a829f7304/faf574ab-028a-41c0-a935-894169635871.jpg.256.jpg","country":"Japanese","stat":"7.65","status":"Completed","tags":["Romance,School Life"],"nutshell":"Let's get married.\nThat's the promise they made before being forced to separate. After 5 years they've met again but, will have time and distance torn each other apart even more? And what will happen to that promise…?\nIncludes oneshot: Summer Chocolate Mint Kiss"},{"name":" Era of Turmoil","avatar":"https://mangadex.org/covers/80f8c2ff-73eb-4484-a98c-5af5ab78d0a0/571f5fd6-29c2-47ef-8e98-1abbef3a88d9.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Psychological,Romance,Comedy,Sports,Office Workers,Drama,School Life,Delinquents,Slice of Life"],"nutshell":"(from ebookjapan):\nSt. Mary's School for Girls, a beautiful and gentle maiden's castle, was built by the richest man in Japan with the aim of creating a modern-day version of a good old European noblewoman, with a wonderful environment.\nHowever, as ideals go, the environment in which these adolescent girls live is a whirlwind of love and greed! Drawn by the 100,000 monthly part-time job, Masako Natsume accepts a coaching position at the soccer club, a place where especially troubled girls gather!"},{"name":" An Extremely Attractive Gorilla","avatar":"https://mangadex.org/covers/81013efd-f9ab-4e97-bc94-cf0ed451dcda/cd92f9e7-f5b3-48ac-acc6-a4170a49a16a.jpg.256.jpg","country":"Japanese","stat":"8.86","status":"Hiatus","tags":["Animals,Comedy,Sports,School Life"],"nutshell":"A story about a very attractive gorilla who can make everyone fall for him because of his very kind attitude and unscientific actions.\nNote: It started as a self-published work on Rookie Shounen Jump. It won the bronze Rookie Award for December 2019 and the first chapter was published as a one-shot on Shounen Jump Plus on January 2020.\n\nLinks:\n\n Author's Twitter Account\n Official Youtube Channel\n Author's Line of Stickers"},{"name":" LIMIT","avatar":"https://mangadex.org/covers/81037c4f-b2e8-4f72-98df-98841affb7fe/74725fc3-49a7-4e93-a1be-3251a3e26520.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Psychological,Survival,Drama,Tragedy"],"nutshell":"This manga focuses on Mizuki Konno, a typical high school junior at Yanno Prefectual High School. A group of high school girls is on their way to an exchange camp when the bus driver passes out and causes the bus to drop from a cliff. The few survivors gather together and try to survive until rescue arrives.\nSee TVTokyo for the live action drama.\n\nOfficial Release:\n\nIndonesian release by Level Comics"},{"name":" Happy Valentine's Day","avatar":"https://mangadex.org/covers/8109ef24-e1a9-4215-932c-babc37e6dfc7/a4644463-51d9-48b5-a106-629bf51e56e8.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":""},{"name":" Uchi no Maou ga Tenshi de tsurai","avatar":"https://mangadex.org/covers/81115f09-d571-4b57-89fe-326e433ebce5/baf970a9-19df-4cd6-b2a8-f918fd771d07.png.256.jpg","country":"Japanese","stat":"8.38","status":"Ongoing","tags":["Demons,Comedy,Magic,Drama,Fantasy,Web Comic,Slice of Life"],"nutshell":"The Dark Knight Jade is tasked with guarding Princess Vignetta, whose mother was the slain Demon Lord, as this was her last wish before perishing at the hands of the Hero. The Princess is but a sweet small child brimming with virtues, so Jade wonders:\nWhen it comes to the time, will the Princess side with evil like her mother did and fight the Hero? A girl this sweet, no less?"},{"name":" Ijiwaru Na Kuchibiru","avatar":"https://mangadex.org/covers/811718c3-5ab3-408e-9feb-67cf272d4b8b/19028b5f-7ba9-417e-8d48-2886765c50ab.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"Ill Natured Lip\nSalaryman Takafumi has fallen deeply for his childhood friend, and neighbor Ryu, who is still in high school! But Ryu always gives him the cold shoulder, which worsens as time goes on. What is happening?\nNote: Chapter 1 contains a scene of rape.\n\n\nUnspeakable Innocence\nStudent Esumi is constantly sexually harassed by his friend Oda.\n\n\nNeighbor Love\nIkuo and Hyuuga are neighbors that are friends, and maybe something more?\n\n\nThe Key of Bonds\nNara and Hirao are college students who just sort of fell into a relationship. But Nara is getting more serious about the light-hearted Hirao.\n\n\nA Kiss Sweeter Than Honey\nTakumi's older sister is often brought home drunk by her coworker, Sasaki. But whenever Sasaki comes over he brings Takumi delicious desserts.\n\n\nInnocent Smile\nRyou's going off the college and Takafumi's freaking out!"},{"name":" Mahou Tsukai to Koi no Biyaku","avatar":"https://mangadex.org/covers/811796b5-7c2c-44b5-887d-6edaf9307455/3b3e5c7f-6528-4c30-8e59-6233b20eec0b.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Oneshot,Romance,Drama,Fantasy"],"nutshell":"In this twist on familiar fairytale tropes, a persecuted wizard makes a love potion for a girl he saved several years ago."},{"name":" Hanappe Bazooka","avatar":"https://mangadex.org/covers/811d5116-c6b5-40cd-b537-431c0185b13d/f86d3c64-0738-4e67-867a-7e42a6ff8f21.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Action,Comedy,Girls' Love,Drama,School Life,Fantasy,Supernatural,Tragedy"],"nutshell":"This one is just plain bizarre. Funny and ecchi, but bizarre. Hanappe is something of a loser. He’s no good with women, and some have been known to take advantage of him. After one such incident where he winds up helping in a gun robbery after a woman flashes her breast at him, he goes home to (ahem) relieve himself when two demons pop out of his television set. They are Mephisto (the she-devil) and Ofisto Bazooka (the demon) and they’ve come to grant three wishes, but instead the demon assaults his mother, Mephisto piles a ton of money in front of his father and then goes after his sister, and they lose track of things. They decide instead of granting wishes to simply live here.\nAs a result of this unplanned madness, Hanappe winds up with the power to make people spontaneously undress and want to have sex with him. He is also given the power to shut this off, but he doesn’t learn this immediately. It has consequences far beyond what he imagines though…\nAnd then Hanappe discovers a side-effect; he has untapped strength and abilities.\nAnd then it gets weird…"},{"name":" Koneko-chan, Kocchi ni Oide","avatar":"https://mangadex.org/covers/811e74bc-83f7-4c18-95e4-6a2d2f7d6904/4cf2f8c8-84a4-46c7-9d21-52702c579e56.png.256.jpg","country":"Japanese","stat":"7.55","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"After Yuuko graduated from junior college, she ended up managing a clothing shop. Though her career is going well, she hasn’t had time to work on her love life. One day, she’s out drinking with her best friend, Mikan, bemoaning her lack of a boyfriend for a Christmas date. When she trips and hurts her leg, Mikan asks her little brother Leo (an 18-year-old) to see Yuuko home safely. When they arrive at her apartment, though, Yuuko makes a move on him and they end up sleeping together. The next morning, she realizes that she not only slept with her best friend’s little brother, she actually took his virginity! Leo isn’t satisfied with it being a one-night stand, and they start having a completely sexual relationship. Will she be able to keep this from Mikan, and is it possible their relationship may grow to something more?"},{"name":" Guin Saga","avatar":"https://mangadex.org/covers/81223afe-278f-4cd9-8741-b8784186f359/35153b2f-3d17-4230-8631-80e31bee3b5a.png.256.jpg","country":"Japanese","stat":"8.31","status":"Completed","tags":["Historical,Monsters,Action,Adventure,Magic,Drama,Fantasy,Adaptation"],"nutshell":"In ancient times, the King of Paroh is savagely murdered with his wife and servants in his castle by mercenaries from the Gohra army. Only his children, Prince Remus and his twin sister Princess Linda managed to escape during the massacre in the surrounding forest. Quickly caught up by bloodthirsty murderers, they are saved by a strange-warrior with the face of a leopard. Suffering from amnesia, the mysterious savior only remembers his name: Guin. Twins explain him their situation and decides to help Guin hoping to learn more about its origins. On their way, they meet some allies including a young girl from an ape-people, a mage and a mercenary by the name of Isht Van. The small group will rally the tribes Sem and legendary giants, the Lagons, to expel the invaders and to avenge the massacre committed by Gohra."},{"name":" Second Lead Complex","avatar":"https://mangadex.org/covers/81245ee2-4145-4622-a18b-3c98afaf13f9/f37f9742-7127-40fc-8bdf-28c46ec8d889.jpg.256.jpg","country":"Korean","stat":"7.37","status":"Completed","tags":["Long Strip,Romance,Comedy,Isekai,School Life,Web Comic,Full Color"],"nutshell":"When I opened my eyes, I had become the heroine of a romance comic!\nI may have become the heroine, but I prefer the second male lead!"},{"name":" Yatteraneeze!","avatar":"https://mangadex.org/covers/812517a9-0775-4a4e-9409-653ce88f0a5b/71d84dbb-6a93-4a50-a223-afb7b81c746b.png.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,School Life"],"nutshell":"Fujimoto Hiroya is at the top of his class. He's the Student Council Vice President, spends all his time studying, and is the idol of all the \"good girls\". But the truth is, he'd trade it all just for the chance to be someone else… someone popular, outgoing and carefree… Someone like Masaki.\nMasaki's what Fujimoto's friends would call an \"idiot\". He'd rather play soccer than study, almost never cracks a book, and is popular with all the \"normal\" kids. He's got flashy clothes, bleached hair and a reputation just as lousy as Fujimoto's is good.\nIn the summer of Fujimoto's freshman year of high school, he resolves to change his image and his life… all to make friends with Masaki. But can dyed hair, new clothes and a piercing really change a person inside?"},{"name":" Que Rico!","avatar":"https://mangadex.org/covers/81267176-10f2-4070-9f3e-4cb678376ec9/264c9e61-ae67-47f6-9590-bf97cb7b918f.png.256.jpg","country":"Japanese","stat":"7.34","status":"Completed","tags":["Oneshot,Romance,Girls' Love"],"nutshell":"A very short oneshot about taste, using the relationship between two women as a case study."},{"name":" Sansanroku","avatar":"https://mangadex.org/covers/81271c9a-25d8-4b37-8151-b31f4c021221/6f54dcbf-fee6-455f-ad0a-2658dd2fa115.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Comedy,Drama,Slice of Life"],"nutshell":"Sanpei’s wife, Otsuu, recently passed away and his son, Shirou, offers Sanpei to live at his place with his daughter-in-law, Reika, and granddaughter, Nona. Ever since Sanpei married Otsuu, she has taken care of him and Sanpei has never learned how to cook, clean and other household chores. After going through his late wife’s belongings, Sanpei finds a book that she was writing that records all the things she was doing for him. Things from recipes and how to do household chores to dealing with the family that he has never really connected with. Now with the help of the late Otsuu’s book, Sanpei learns how to do all the things she did for him and start making connections with the closest family members he has."},{"name":" Charming Grim Reaper","avatar":"https://mangadex.org/covers/8129c71a-7495-44de-9dba-9291b10d953d/58b3d701-6660-4e2e-8b41-5db6232a913d.jpg.256.jpg","country":"Korean","stat":"7.75","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Drama,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"I, Han Ji-An, am already struggling as a no-name actress. To make matters worse, I ended up falling down the stairs and dying because of superstar Ji So-Won’s fanclub. However, in reality, Ji So-Won is a grim reaper trying to take me to the afterlife!? That can't possibly be true!? I’m not ready to leave this life. No. It shouldn't be me!"},{"name":" Oshikake Twin Tail","avatar":"https://mangadex.org/covers/812b8e07-86bd-4327-ba85-ea441575e460/bbe1cf1c-1ea6-4563-9080-843debac3a2a.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Ongoing","tags":["Romance,Comedy,4-Koma,Slice of Life"],"nutshell":"A reliable JK and a beautiful mother. Toshiro Nitta is a Hikikomori who happens to be a trader. He lives alone in a large Japanese house as a shut-in. One day, some of his relatives have to start living with him … !! The life of a heart-pounding harassing life begins!"},{"name":" The Faceless Girl","avatar":"https://mangadex.org/covers/812cf528-b390-4e14-b335-52b44e2f353a/77ec37ff-df6c-4a69-8685-29b1220d514c.jpg.256.jpg","country":"Japanese","stat":"8.38","status":"Ongoing","tags":["Monsters,Romance,Fantasy,Monster Girls,Web Comic,Slice of Life"],"nutshell":"The story of a guy and his faceless girlfriend.\nCreator-approved translations by TheElusiveTaco.\nLinks:\n\nAuthor's Pixiv\nAuthor's Twitter\nAuthor's Fanbox"},{"name":" Fly By","avatar":"https://mangadex.org/covers/812f6ab4-4aee-4e3d-b22c-cfad90c76eac/9c1ac09a-7cff-44cb-a810-b740e8ebc695.png.256.jpg","country":"Japanese","stat":"7.48","status":"Completed","tags":["Oneshot,Romance,Girls' Love"],"nutshell":""},{"name":" Meow Meow","avatar":"https://mangadex.org/covers/8131dd4d-a43d-4619-9266-1bf4504ebae2/88d416ef-fdef-46d7-acd2-8797367d824b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.01","status":"Ongoing","tags":["Animals,Long Strip,Comedy,Web Comic,Full Color"],"nutshell":"A story about an unexpected cohabitation life between a warm and cute cat and a irritable chicken boss~~Life is hard, let me sweeten it with meow!!"},{"name":" Shuukan Ishikawa Masayuki","avatar":"https://mangadex.org/covers/8136c3e1-6c94-422e-9796-e49a76ca4bcc/48d0ee1b-f0bc-4d49-80dd-137e22333d09.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Comedy,Drama"],"nutshell":"A collection of eleven short stories with a wide variety of subjects.\n\n\nHer Confession\n\n\nThe National Bird of France"},{"name":" Miss Kitty and Her Bodyguards","avatar":"https://mangadex.org/covers/813e1105-49c2-4853-9f59-34df06fcb80c/d1f85ec9-beaa-4fb2-9122-e6ef0d49f91e.png.256.jpg","country":"Korean","stat":"8.45","status":"Ongoing","tags":["Animals,Long Strip,Comedy,Drama,Fantasy,Web Comic,Slice of Life,Full Color"],"nutshell":"Follow Anna's daily life with her bodyguards!"},{"name":" Code Geass - Arcadia (Doujinshi)","avatar":"https://mangadex.org/covers/8148ddc9-894d-44e1-8d57-d4509853d224/8f925eb5-ac9d-4b0d-8045-a4ebecb8fc2a.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Boys' Love"],"nutshell":"Suzaku/Lelouch doujinshi."},{"name":" Low Teen Blues","avatar":"https://mangadex.org/covers/8150b715-60af-48d9-98c2-2b96b75e1e5a/674cf16b-feda-4a58-b3f6-69639ad1caa9.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":"Shingo falls in love with his new teacher, Ichijou Yuuko.\nAfter a kiss happens on a class trip, and another classmate sees them, the plot of this forbidden love story thickens!"},{"name":" The Devil Never Sleeps","avatar":"https://mangadex.org/covers/81523d00-7732-4b99-bdd3-7a0d1dbe5441/790c0d55-ab98-461a-8ba7-54d0694e0ac7.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Ghosts,Romance,Drama,Horror,Mystery"],"nutshell":"Kazumi Nanase, a second-year high school student, meets a transfer student named Sho Amano.\n　He looked exactly like the ghosts she often saw from an early age.\n　Around the same time, a female ghost named Maria appears from her body.\n　Maria says that when Kazumi was young, when she died, she entered her body and brought her back from the world of death.\n　Since then, Maria has been sleeping in her body and has awakened now that she is fully grown.\n　However, despite her appearance as the Virgin, Mary was actually a devil.\n　Maria uses Kazumi's hatred to drive people to death one after another.\n　Sho Amano, who has the power to exterminate the devil, struggles to defeat the devil that lives in Kazumi ... \""},{"name":" Zombie Prince","avatar":"https://mangadex.org/covers/8159e0ff-cafa-46a5-8722-f33dd7711ec8/89410aea-1def-4721-9071-bd2232cb83fd.jpg.256.jpg","country":"English","stat":"8.02","status":"Ongoing","tags":["Sci-Fi,Action,Comedy,Boys' Love,Survival,Zombies,Fantasy"],"nutshell":"A mysterious disease plagued the Western Kingdom of Gavanne, turning people into mindless creatures who crave for flesh and blood. Crowned Prince Enzo and his retainer Lukas escaped the chaos to embark on a journey to take back their Kingdom.\nUna misteriosa enfermedad plagó el Reino Occidental de Gavanne, convirtiendo a las personas en criaturas sin sentido que ansían carne y sangre. El príncipe coronado Enzo y su sirviente Lukas escaparon del caos para embarcarse en un viaje para recuperar su reino.\nWARNING: CONSENTIMIENTO DUDOSO."},{"name":" Virgin Break","avatar":"https://mangadex.org/covers/8160149a-a93a-4ef8-9435-21f8067ea1a6/15f8c27d-e07a-4491-bf30-3de1cafb420c.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Completed","tags":["Romance,Comedy,Boys' Love"],"nutshell":"The opening chapter (title story) focuses on two friends in the gay AV industry.\nLair You: Chapter two is a historical piece on the ambiguous feelings between a prince and one of his followers.\nPenalty: In chapter three, the boss of a security firm (specializing in bodyguard services) resorts to \"punishing\" one of his subordinates with a kiss every time he's about to get into a fight in order to reduce the number of complaints filed against him.\n7 Days: Next up is the story of another bodyguard who has seven days with a client who cannot speak during that period.\nRevenge! Ring Out: Rounding up the volume is a chapter with cosplay elements."},{"name":" Ocean by the Forest manga","avatar":"https://mangadex.org/covers/8163c545-63b7-4469-9991-e41a5583135b/fad6dd48-2217-4af2-ae25-7051b24d1b6d.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Oneshot,Boys' Love,Drama"],"nutshell":"A story of two people and the bond between them. A story of untold feelings and expressed ones. A story of reaching out and pulling back, just like the ocean waves crashing on the shore"},{"name":" Irekawarare Complex","avatar":"https://mangadex.org/covers/81683b23-a3d6-4200-8fec-82b2ea1a89b1/550b66f3-0be4-4b8a-b738-42ebb1ee5382.jpg.256.jpg","country":"Japanese","stat":"7.57","status":"Ongoing","tags":["Genderswap,Romance,Comedy,Magic,School Life,Supernatural"],"nutshell":"I finally reunited with my first love, but I am getting in my own way!? A Gender-Swapping Romantic Comedy begins with my two forms and her!"},{"name":" A High School Girl Who Admires the Onee-san She Sees On the Train Every Morning","avatar":"https://mangadex.org/covers/816ae8b9-5a38-4ddb-9dce-a8e2713d0248/b925dd6a-a0ec-44aa-a179-d7f84845b81e.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":""},{"name":" Tron: Legacy","avatar":"https://mangadex.org/covers/816c00fa-b61e-470d-9bba-55e11fd7fbe5/ff87bb64-2b6c-4fc0-9b9f-ce1adca69399.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Sci-Fi,Action,Adventure,Fantasy"],"nutshell":"A high-tech adventure set in a digital world. Sam Flynn, when he was a child, has been told stories about a different world his father created. After 25 years of not seeing seeing his father, he enters his dad's arcade and finds himself pulled into the digital world of \"TRON\" where his father has been trapped and living for years. This is a life-and-death journey of an escape across a cyber universe that has become far more advanced and exceedingly dangerous."},{"name":" Ringo, Ki kara Ochiru","avatar":"https://mangadex.org/covers/817070da-b4ed-4366-abb2-8dc3d182d175/6518b46f-1d4c-475f-9109-f2b1685d76c1.png.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Oneshot,Romance,Comedy,Boys' Love,School Life,Slice of Life,Supernatural"],"nutshell":"Ringo, Ki kara Ochiru\nMichi to no Souguu\nKanojo nano ni Otoko\nOre wa Ninkimono\n\n\nsequel: Boku wa Ninkimono (Erotoro v.4)\n\n\nAfterward and Omake"}]