[{"name":" Ikenie Monzenbarai","avatar":"https://mangadex.org/covers/66bb98d0-1fb4-4e7b-9958-4f715735f15a/6e3646cf-937f-4274-81fa-13873be5fde6.png.256.jpg","country":"Japanese","stat":"7.92","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,Supernatural"],"nutshell":"“I don't want a sacrifice or anything like that, so please leave.” Born into the prominent Uzumaki family, Nanao was raised to become a god’s sacrifice. On the day of the 111th year contract renewal, Nanao visited the serpent god’s shrine to be eaten. However, the god rejects Nanao at the door, saying that there is no need for a sacrifice!"},{"name":" Twinkle","avatar":"https://mangadex.org/covers/66bdeefe-ee08-4cea-8a4f-d8c0302a1238/b68a1391-debd-42ad-b55c-cfcc29e79aad.png.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Slice of Life"],"nutshell":"Two classmates joke around about their close relationship."},{"name":" Shakugan no Shana","avatar":"https://mangadex.org/covers/66c4539a-a581-479b-a00d-e1c8ec6c69e3/5ae10406-4abe-4d9a-abd2-ceb5a88130e6.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Action,Romance,Drama,School Life,Supernatural"],"nutshell":"Saving the World Is Easier Than Falling In Love\nYuji Sakai is beginning what he thinks will be another boring year of school. But everything changes when the world around him stops, the surrounding people are engulfed in blue flames and a freakish doll-like creature begins sucking them up! Before Yuji suffers the same fate, a young redheaded girl with a sword appears and saves him. Yuji is drawn into the struggle between these creatures from another world: the Crimson Denizens and the girl Shana, called Flame Haze. He too has a crucial role to play in the conflict, despite the fact that…he's dead!"},{"name":" All for You!","avatar":"https://mangadex.org/covers/66ce3480-d797-4b7b-8e00-0a5b0196dfa1/5d42101a-07b7-4519-919a-128c3073a25d.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,School Life"],"nutshell":"A volume that filled with cute and naive beginners of love. Yuna has fall in love at the first sight towards the baseball club ace Sanada-senpai. her friend always told her \"he is out of your league\". but there's no way she could just give up like that?"},{"name":" Ore no Joshi ga Elite nano ni Hetare Kawaii","avatar":"https://mangadex.org/covers/66d00bb5-f8c8-4fbd-83ce-54f3d768a29c/124e742f-99a3-4c14-846f-4a788ea39aeb.jpg.256.jpg","country":"Japanese","stat":"8.24","status":"Completed","tags":["Comedy,Office Workers,Slice of Life"],"nutshell":"The appearance of shrewd and capable, but also a handsome young-elite, when he got depressed he shrinks to puppy size. This matter was discovered by his subordinate, instead of spreading the discovered matter, this subordinate put his boss to domestication."},{"name":" Psychic Detective Occult","avatar":"https://mangadex.org/covers/66d040a8-c86a-4d5f-8c35-f039a2fb5f8e/c0eb8ea4-5078-4b47-be2b-e478d8a137a5.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Psychological,Magic,Horror,Supernatural"],"nutshell":"Five boys and girls confronting many mysterious incidents that cannot be clarified by modern science. People call them psychic detective occult teams! Introducing their eight horror experiences. In particular, the final story has a high degree of perfection, and the unusual tension is depicted in a speedy development."},{"name":" 14 Manga Staging Blueprints","avatar":"https://mangadex.org/covers/66e0db69-64ba-4f47-b0ab-8be4161285f6/b58f55c3-56e9-476f-946c-6c4066b1f071.png.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":"自分がよく使うもの、よく見かけるものの演出をまとめてみました。\n技法名は私が3秒でつけたものなので各自脳内でリネームしちゃってください。"},{"name":" Kamisama Gohan: Koryouri Takamagahara ni Youkoso","avatar":"https://mangadex.org/covers/66e5e10e-965d-4732-b142-67fb2d5fe360/5e703372-431f-4aaf-9f35-887b06aaa434.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Slice of Life,Cooking,Supernatural"],"nutshell":"神社の麓にある「高天原」は三人姉弟が営む小料理屋。\n優しい味の料理はどれも逸品。\nしかし、この小料理屋にたどり着けるのはごく一部の人間のみ。\nそんな不思議な小料理屋の暖簾をくぐったのは\n冴えないサラリーマンの氷川で――。"},{"name":" [GwangGong Industrial Complex] Rock'n Roll in Forging","avatar":"https://mangadex.org/covers/66ec485a-661b-4b81-9610-618488c5dd93/bfb3ee13-040e-49ba-becf-13f303a5366a.jpg.256.jpg","country":"Korean","stat":"7.87","status":"Completed","tags":["Long Strip,Anthology,Boys' Love,Drama"],"nutshell":"Nam Jungoo, who is the live bar’s most notable newcomer, and Joo Taekyoung, who is his core fanatic, and even plays the role of his manager. Jungoo, who was actually Taekyoung’s underclassman at his art school, was different from Taekyoung. Taekyoung, who had lived in an oppressive GwangGong family, and Jungoo, who had freedom unlike Taekyoung, was approached after finding the confidence to do so, and was rejected. So, his first love ended in vain, as the other can’t even remember him. By a second chance of fate, they meet once more. He decides this time to get closer to Jungoo, by concealing his identity, and ends up becoming his manager. Then one day, after a performance, Jungoo, who was unable to relieve his excitement, recommends that they spend a night together…"},{"name":" Kawaki's Childhood (Fan colored)","avatar":"https://mangadex.org/covers/66ed626c-a40c-4fc8-b351-e1a400a9f99c/3c2cc7dc-64ee-4208-8efe-b58aead41374.png.256.jpg","country":"Japanese","stat":"7.99","status":"Ongoing","tags":["Action,Ninja,Fan Colored"],"nutshell":"Fan colored pages of Kawaki’s childhood collected in a mini chapter."},{"name":" Message from Space","avatar":"https://mangadex.org/covers/66edf17d-1424-4dca-93d7-fe497110d178/d521a101-0b24-44f6-a282-fee594795fc5.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Romance,Comedy,Survival,Adventure,Military,Drama,Fantasy,Delinquents,Aliens,Tragedy"],"nutshell":"From ebookjapan):\nThe planet Gilucia belonged to a certain stellar system on the frontier of the Andromeda Nebula. However, it was dying, ruled by the space invaders, the Gabanus aliens, a race of steel. When Chief Kiddo prayed to the Spirit of Cosmic Creation for a miracle of salvation, the holy eight riabe fruits flew into the air. And the riabe fruits chose eight heroes of the Galactic Earth Tribe. The eight warriors did everything in their power to fight the legions of the Gabanus, but because of their efforts, the \"Earth\" was targeted by the Gabanus. ......?"},{"name":" Touhou - Touhou Dankest (Doujinshi)","avatar":"https://mangadex.org/covers/66efac60-0bc9-4a8b-9a59-86c7d122e5c6/f00ebd6d-d95c-4d1b-90d2-b96fb8efc5fe.png.256.jpg","country":"English","stat":"7.95","status":"Completed","tags":["Oneshot,Action,Fantasy"],"nutshell":"Uploaded with the permission of the Author Addamelech"},{"name":" Zokugun Hijikata Toshizou","avatar":"https://mangadex.org/covers/66f0a013-eb5a-4696-b206-ee7832e32144/dbb8f836-0819-4241-9b14-7a1e661db65e.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Historical,Action,Samurai"],"nutshell":"The story follows the \"last battle\" of the famous Japanese historical figure Hijikata Toshizou. It begins in 1868, both the first year of the new Meiji era, and the year before the Battle of Hakodate in 1869."},{"name":" Cardcaptor Sakura - Cutie Little Cupid (Doujinshi)","avatar":"https://mangadex.org/covers/66f2e41e-4591-4d68-a2e1-6327c19497ed/950d3992-707e-4f25-84e4-9e994497d81f.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":[""],"nutshell":""},{"name":" THE iDOLM@STER - A summary of iM@S 4-koma collection in an hour (Doujinshi)","avatar":"https://mangadex.org/covers/66f82506-13e7-4771-8579-e17f7aa8467e/8ab26ba5-8f61-4053-a6e7-803c7501f516.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["4-Koma"],"nutshell":""},{"name":" Professional Fan","avatar":"https://mangadex.org/covers/66f8fbb4-0348-4ef2-8941-d9d9b0a5c90a/30b8858d-40db-4bb7-9ded-ce988e5531f2.png.256.jpg","country":"Chinese (Simplified)","stat":"7.86","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Full Color"],"nutshell":"#OTP #InspirationalIn the entertainment industry, there’s a certain profession called “professional fans”. Professional fans earn their living through chasing stars. When a novelist Zhu Xiaotong who lost her direction in life met a singer Li Xixing who managed to fulfill her dreams, Zhu Xiaotong decided to become a “professional fan” for Li Xixing and her shield. This time, Zhu Xiaotong will use her own ways to lead everyone onto the correct path of chasing a star, creating this chaotic Li Xixing support squad!"},{"name":" Your Eyes, My Words","avatar":"https://mangadex.org/covers/66fb3f70-3fe9-414a-878e-7ba8031cb9df/bef7454c-d2a7-4592-94f5-08f227432ed4.png.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Long Strip,Boys' Love,Drama,Slice of Life"],"nutshell":"“Every day, I ravenously awaited those 30 minutes”... Hwane is studious, careful, and serious. Jinha is popular, cool, and fun. They seemed so different, and yet, throughout high school, they secretly met up for silent, passionate encounters. Hwane treasured these moments—until he is betrayed by Jinha’s denial of him to their classmates. It haunts him even into adulthood. When chance brings them back together, will it restart their hot love or will they both be burned in disaster?"},{"name":" Silva","avatar":"https://mangadex.org/covers/66fe4763-8999-49bb-825b-40a6efee7699/1711ec55-9da1-4af2-9f55-807abe0910da.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Comedy,4-Koma,School Life,Slice of Life"],"nutshell":"A happy-go-lucky girl named Silva wielding a scythe and claiming to be part of an evil organization transfers into a normal high school. She befriends her classmates, skirmishes with the heroes of justice, and helps to recruit new members into her organization. It's a comedy full of good and evil (which is which is sometimes difficult to tell), dubious magical girls, hopeless adults, and pudding."},{"name":" 48 Hours a Day","avatar":"https://mangadex.org/covers/67013e72-6034-4551-a874-9c16167d95df/c1d5c9af-be6c-4261-bdac-c26fca4bf10f.png.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Sci-Fi,Action,Long Strip,Drama,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"The God of Time – Khronos – gave Zhang Heng an incredible gift. Time freezes at the end of the day for everyone except Zhang Heng, who gains an additional 24 hours.\nIn exchange, Zhang Heng must act as the agent for the God of Time and participate in a dangerous game each month: Deserted Island Survival [Mission Objective: Survive for 40 days], Tokyo Drift [Mission Objective: Win the modified street car race], and so on… As Zhang Heng stacks victory upon victory, he gets closer to the truth of the world."},{"name":" K - The First","avatar":"https://mangadex.org/covers/67072481-bf38-4baa-b92e-da6d46e86d96/03127d1d-1958-4569-8ec2-ca027ef9c0c5.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Action,Romance,Comedy,Adventure,School Life,Fantasy,Supernatural,Tragedy"],"nutshell":"The story takes place in a world where seven people with unusual powers are crowned as \"kings,\" and revolves around the \"bonds\" and \"fate\" between the people involved."},{"name":" Shuffle! - Days in the Bloom","avatar":"https://mangadex.org/covers/671058eb-e819-4522-a996-e0ab634db511/1482d4e8-0b07-41c9-9167-8a6967edc9ae.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Comedy,Harem,Fantasy"],"nutshell":"The world as we know it was suddenly altered forever when the door for the dimension of the gods and the door of the dimension of the demons suddenly opened up. Ten years later, a boy named Tsuchimi Rin was entrusted with two princesses from those dimensions. Will he be able to keep his sanity while living with his childhood friend Kaede, trying to live a normal school life, and also being a neighbor to both of princesses and their fathers, the mighty dimension Lords? The hearts of those girls are at stake and only Rin has the key to unlock them."},{"name":" Tsurugi no Kuni no Arnis","avatar":"https://mangadex.org/covers/67113c45-9497-440f-a54e-0eb4bb48f587/4d61fc8d-b73e-4e24-b9af-3315489aef81.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Sci-Fi,Monsters,Action,Survival,Adventure,Magic,Military,Fantasy,Supernatural"],"nutshell":"Wandering female assassin of supernatural origin confronts men's hatred for all things different in a cruel world of dark fantasy genre.\nNote:\nThe manga continued in form of Doujinshi."},{"name":" Hentai Ouji to Warawanai Neko.","avatar":"https://mangadex.org/covers/67135456-bd6e-4960-bf5d-23f2eb1d7aaa/3fbe52f5-0d23-4cbc-8795-0687ddf0d6d1.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Romance,Comedy,Harem,School Life,Supernatural,Adaptation"],"nutshell":"If Yokodera were an equation, he'd be 'peeping at girls' plus 'does not care what others say,' therefore 'he peeps vigorously, intensely, diligently, and frequently.'\nYokodera mops so that he can see the reflection of panties in the floor. He weeds so that he can see up skirts. He rides fast so that each girl he passes has her skirt flipped. He does these sorts of things every day.\nTo everyone else though, he's a nice and diligent guy who's greatly appreciated. Lucky? Far from it, at least in his eyes. Yokodera doesn't like being misinterpreted, but he is also a coward. He wishes others would stop seeing his actions as good, but he just can't do anything about it.\nThen his friend told him about a cat statue, which might remove this unwanted trait…\nNote: This manga is adapted from a light novel of the same name and illustrated by Kantoku.\nProject H: Only has released 3 volumes in English Print"},{"name":" The Count's Intruders","avatar":"https://mangadex.org/covers/67160854-0c9e-4f0d-b29b-42d480d51597/94c4aae7-e610-45b7-848b-df2d8bab1e13.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Ongoing","tags":["Historical,Long Strip,Romance,Drama,Fantasy,Web Comic,Mystery,Full Color"],"nutshell":"The 'Count of Fildette's', famous for being scandalous and uneducated. The Counts are the main culprits in eroding the honor of the venerable family, but fortunately, thanks to the couple's clever and lovely only son, 'Hayden', the Countess of Fildette's manages to keep the peace. Hayden is the pride of the count, and at the same time, the only link between the counts and the couple who growls at each other, and the center of peace. But the peace Hayden created is nothing more than a thin ice curtain that hides the depths of the water. Behind it, old misunderstandings, mistrust, and unspeakable secrets are deposited in the far-off darkness... Then one day, unexpected guests suddenly come and walk on the ice curtain?! Peace of those who are slowly cracking! The count struggles with the uncomfortable truth, but he realizes that in the sediment of misunderstandings, the feelings of cherishing each other are together like a treasure. The story of a family who overcame misunderstandings, supports each other, and grows together.\nThe story of the Count Fildette's family in search of true love and peace."},{"name":" Backstage Kimi no Iinari","avatar":"https://mangadex.org/covers/67205d07-f493-4034-9388-b1e47cb244e1/1dc884d4-0246-4021-b0ae-d38cb2e848b7.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":"Masataka, an audio technician, has known Kei since his amateur rock days and used to treat him to ramen. But, now that Kei has become a top-selling artist, their positions are reversed. One day, Masataka is assigned to help with Kei's upcoming performance, and after the show he's invited to the after-party. Little did he realize it was an orgy!"},{"name":" Sabaku no Harem","avatar":"https://mangadex.org/covers/67229608-bd03-4283-9746-ca02be17d20c/b9651d7a-3919-44c7-977d-563002498bf5.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Romance,Comedy,Drama,Fantasy"],"nutshell":"Mishe, a strong willed girl raised from poverty, has caught Prince Kallum's attention. Attention as in \"you will become one of my concubines\" - thus begins Mishe's adventures into Prince Kallum's world."},{"name":" Prey","avatar":"https://mangadex.org/covers/6724bbf4-5855-4972-b6c9-ea92469aba89/3f49cf2b-ff30-4750-bb62-31e303a20238.png.256.jpg","country":"Korean","stat":"8.42","status":"Completed","tags":["Thriller,Monsters,Ghosts,Long Strip,Horror,Fantasy,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"Park Yun-yeong has a mysterious power which allows her to see ghastly creatures that seem to inhabit our world but not interact with it - unless they notice you acknowledge their existence. That’s when they stop being harmless."},{"name":" 3, Street of Mysteries","avatar":"https://mangadex.org/covers/672704a8-037d-4e55-8be7-2a34d508b915/1ef1aa2f-0737-413d-8d72-508fa73b07f7.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Horror,Supernatural"],"nutshell":"3, Street of Mysteries explores the fantastical-poetic vein that has forged Mizuki's reputation in Japan. The stories contained in this series hold in common the obsessive ideas of immortality and of life after death. Skillfully blending a range of black humor, drama, and questions of morality, Mizuki shows once more his profound understanding of the human soul."},{"name":" Ghost Stories","avatar":"https://mangadex.org/covers/672a4e66-1dc9-4a32-a51d-78b521412746/03fb79fa-386c-40bc-bda3-fe7e0764006e.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Oneshot,Ghosts,Comedy,Anthology,Horror,Supernatural"],"nutshell":"Gokushufudou's Oono Kousuke's legendary gag horror returns!"},{"name":" Aoi no Yuuwaku","avatar":"https://mangadex.org/covers/672ed210-28a4-439c-971e-0073d1dba509/0c222242-3242-4931-bc93-7d418ed077e3.png.256.jpg","country":"Japanese","stat":"7.57","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"Shinichi is an apprentice photographer who has recently returned to Japan after 10 years. There he meets his old childhood friend Azusa who much to his surprise, has become a Gravure Model for her father. Azusa who used to be such a kind and good girl turns out to be a sadistic bitch and apparently hates him… or does she?"},{"name":" Urameshiya","avatar":"https://mangadex.org/covers/67455606-f291-45eb-8bb1-87ffa0ebefac/83da3f54-51bb-4595-a97c-22862cdcbca3.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Historical,Romance,Supernatural,Tragedy"],"nutshell":"One cold winter, a young woman appeared near the bridge, and tempted a man. The man accepted her offer, and was found dead the next morning. There has been an unusual number of freezing deaths this year… With unusual ghostly powers, this necromancing fairy goes on to solve the mysteries of Edo and take on challenge after challenge in the 1st issue of this popular series!!"},{"name":" Idea no Hana","avatar":"https://mangadex.org/covers/674b25e4-7218-43f7-9013-721bc33c4a89/e7ad311c-56ec-4b9b-b0b0-ea796e669081.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Demons,Romance,Drama,Fantasy,Supernatural"],"nutshell":"Azurite, an orphan taken in by a group of traveling entertainers, has always been able to see spirits that others can't. When he was four, two traveling doctors, who seemed to have the same ability he had, healed one of their troupe members. They left, but people who seemed to either be them, or be exactly like them, showed up seven years later. This time, they joined the troupe as two entertainers, Ruby and Sand. Ruby and Sand were kind of mysterious, and held themselves a bit away from the rest of the troupe, but Azurite was determined to get to know them. Through his relationship with them, he hopes to learn much more about his abilities and the supernatural part of the world that they both experience."}]