[{"name":" Alice no Hyakudo CC","avatar":"https://mangadex.org/covers/fc86d6fe-c66e-4fcb-8484-99e0f17b1af4/b590848d-b7a5-4665-9224-220acafb6808.jpg.256.jpg","country":"Japanese","stat":"7.38","status":"Completed","tags":["Comedy,Harem,School Life,Fantasy"],"nutshell":"Aoi Kururi is an onmyou-ji who is studying smells at a private academy. He in fact hates using onmyou magic, but when a spell is mysteriously cast on his whole class that causes everyone to wet themselves, he finds that with the warm power and sweet smell of girls' urine, his magic becomes more powerful, and he saves his class by breaking the spell. This is the story of the strange misadventures of Aoi, his sisters, and his friends."},{"name":" Christmas Shimasho","avatar":"https://mangadex.org/covers/fc918b1f-70f5-4399-b681-d7bb333a266d/1cf2fdb4-1ba2-4d31-925c-bd3eb6f1701a.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":[""],"nutshell":"Kyouko has always liked Takuto and eventually they start dating. Kyouko is looking forward to spending Christmas together with him - their first Christmas as a couple. But a few days before Christmas, Takuto starts avoiding Kyouko and then she sees him with another woman!"},{"name":" [switch] - Insanity (Doujinshi)","avatar":"https://mangadex.org/covers/fc93c955-3ead-4763-bac0-7cc5af0a3a0d/6cf77600-66f3-45a0-8f85-c059c018f577.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Comedy,Drama"],"nutshell":"A story set in an alternative universe, where Hal and Kai switch bodies."},{"name":" Ladies versus Butlers!","avatar":"https://mangadex.org/covers/fc942cd3-41bd-4cf4-8686-ffdaf9827431/196db785-2e8a-41c5-a2cc-02d2056d9c94.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Comedy,Harem,School Life"],"nutshell":"Hino Akiharu lost his parents when he was an elementary student and was taken in by his uncle's family. One day, he sees on the news about the newly-established Hakureiryou Gakuin, a school which was re-built from an elite girls' school. He decides to take the exam for that school and succeeds in entering the House Management Department (the place to train maids & butlers). He wants to become a butler, although his appearance scares the ladies. Akiharu has a sinister look in his eyes, a scar on his right eyebrow, and bristled up hair. Add 3 piercings on his ears and he indeed has a typical bad boy look on him.\nHe meets his \"nemesis\" at that school, Saikyou Tomomi, a girl with a two faced character who traumatized him many times since they were kids. Another girl named Cernia Iori FlameHeart chases after him because of his looks and calls him suspicious. Still, Akiharu starts finding his feet at the school and his relationships with the girls also get better…"},{"name":" Shinigami wa Korosenai","avatar":"https://mangadex.org/covers/fc960d58-79ed-47a4-b71c-ed2e70bb46a4/59eb948e-323d-4100-aa5c-699e5ae5adcd.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,Anthology,Boys' Love,Supernatural"],"nutshell":"Since childhood Eiji has always had accidents that would have been fatal, but he always survived unscathed. Because he sees things that normal people don't see, he realizes that there's a mysterious shadow that always saves him. But what is it? So he decided to find out what this mysterious shadow was and wanted to thank that shadow. And to call him, he tried to jump off the balcony of his apartment.\nHere comes the handsome God of Death appearing before him. Will Eiji be able to thank him?"},{"name":" Sono Tenshi, Toriatsukai Chuui!","avatar":"https://mangadex.org/covers/fc9b73fe-7329-4ff2-ac18-394386f867df/7eecf517-4ccc-4129-86ff-d09212f53419.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"Hazuki, a second year in high school is a gopher for her next door neighbour Rin, a kouhai. Rin may have an angelic face, however, his attitude is just like the devil. Because Hazuki has fallen for his angelic face, she cannot turn back. Will their relationship ever change?"},{"name":" Diamond no Ace - Tsukiai Hajimete Ni ka Getsu Chotto (Doujinshi)","avatar":"https://mangadex.org/covers/fc9f1ad0-ae78-4196-85f0-aca740cea094/9f2c267b-870d-4b7c-be38-d5e1ed94f32f.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":"Kuramochi is struggling with when and how to take his relationship with Sawamura to the next level."},{"name":" Mitsujou","avatar":"https://mangadex.org/covers/fc9f2a82-98a5-440e-a7db-85a768e22566/88e78825-8cb0-4355-acda-05a21b4a8cf5.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Romance,Boys' Love,Fantasy,Supernatural"],"nutshell":"A werewolf becomes pregnant and gives birth…?! The Jinguuji Clan is a yakuza family that bears the blood of werewolves. Their eldest son, Hayato, fell in love with Kamon, the leader of a rival clan, and they eloped to England. Then, the ones who attack them during their short-lived honeymoon are the “werewolves” in England…?"},{"name":" Tamanyan","avatar":"https://mangadex.org/covers/fc9fc6f6-2197-4951-b36c-9e3880023b29/abd37d69-986b-4c4d-af1e-3134fedcaf41.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Romance,Comedy,Harem,Fantasy,Supernatural"],"nutshell":"Long ago a magical cat disguised as a human woman fell in love with a human man. It is said that during their time together they even had children. They say that afterwards, the magical cat dwelt happily as a human, that she ascended to the heavens and became a cat-god, and is even now watching over the world of cats and men.\nOf those descendants, the cats of Cat Forest Town say that they have mysterious powers. The townsfolk care for the cats as their guardian dieties, and the cats, too, have become attached to the humans."},{"name":" Tokidamari Hime","avatar":"https://mangadex.org/covers/fca3feb5-1073-4d47-894f-c2833757a2fb/d9fbcc82-b6af-43de-9d0c-5a48aaee9c8c.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance,Supernatural"],"nutshell":"A story about a mirror princess/demon. It seems that a new condo building was built on a certain location where this princess was housed and worshiped with a stone monument but it was moved due to the new construction.\nOne room in particular seems to have a direct link to the princess who calls herself the owner of the pool of time. Beware when mirrors are placed opposite of each other because you may just be drawn in her world and powers."},{"name":" Heartsick","avatar":"https://mangadex.org/covers/fca41209-7807-446e-909a-40ba8dbe0818/d0602df4-6a54-4ec1-acb5-fefed6e98614.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.34","status":"Ongoing","tags":["Psychological,Romance,Girls' Love,Drama,School Life"],"nutshell":"As two girls with completely different personalities meet each other, their share of interests resulted in them coming together. However, both of them face a hard journey ahead by being in different cities and having difficult parents…\nAuthor Weibo: https://www.weibo.com/u/5360925536"},{"name":" In the Classroom","avatar":"https://mangadex.org/covers/fca4ee0a-a0c5-4b8b-942b-91f1da3c8d76/80107a86-2728-4923-b4cc-055b22608e9b.jpg.256.jpg","country":"English","stat":"7.16","status":"Completed","tags":["Oneshot,Comedy,User Created,School Life,Slice of Life"],"nutshell":"Maximillian Wundt tells his classmate Elsa Himmler a story."},{"name":" Machikado Mazoku - Tamuhei's Machikado Mazoku Twitter Manga (Doujinshi)","avatar":"https://mangadex.org/covers/fca51562-b3d9-4793-a943-7369169ac03f/0f0f655f-0549-4046-8955-8ec4258c2b1f.jpg.256.jpg","country":"Japanese","stat":"8.40","status":"Ongoing","tags":["Girls' Love,Web Comic,Slice of Life"],"nutshell":"Tamuhei's short Machikado Mazoku stories released on Twitter\nCreator-approved translation by Krosis Fansub.\nAuthor's twitter: https://twitter.com/6nasiki\nPixiv: https://www.pixiv.net/en/users/37921648"},{"name":" SSSS.GRIDMAN","avatar":"https://mangadex.org/covers/fca8bf23-18e7-4fa6-a907-bae16573431a/f3585b28-b3ed-4596-bb4a-695d310df66a.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Sci-Fi,Action,Mecha,School Life,Slice of Life,Adaptation"],"nutshell":"Yuta Hibiki awakens with amnesia and the ability see things that others cannot. He first encounters a Gridman in the reflection of his friend Rikka Takarada's computer and it tells him to \"Remember his calling,\" but Yuta doesn't understand what this means. Later, in the distance, he sees an extremely large monster but it doesn't move. It's only when Yuta gets to school that the two sightings make sense: a monster attacks and the hero Yuta saw in the computer screen pulls him within the computer and transforms Yuta into a giant hero named Gridman."},{"name":" Arcadia of the Moonlight","avatar":"https://mangadex.org/covers/fcaa3e36-44b4-4bc3-99c3-cbe13c0ec2ff/3371c113-4e55-4629-9236-c3bd13cee52a.jpg.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Oneshot,Sci-Fi,Action,Drama,Fantasy"],"nutshell":"Rashil lives with his grandpa in a mountain area. On a trip in the woods he sees an airship crash and finds a girl. She's been followed by soldiers, which want to capture her."},{"name":" Once it's over...","avatar":"https://mangadex.org/covers/fcab8305-b252-46f3-916b-abb234ac71da/877671a7-4019-4da5-8cee-aab440ff3cd9.jpg.256.jpg","country":"Filipino","stat":"7.97","status":"Hiatus","tags":["Action,Incest,Superhero,Girls' Love,Military,4-Koma,Drama"],"nutshell":"war…"},{"name":" Tsuki ni Sakura no Saki Sohite","avatar":"https://mangadex.org/covers/fcb41761-75e2-4af8-adae-34d0470a96ca/36924139-99ca-4b8c-80f8-3746251ed985.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Boys' Love,Drama,Supernatural"],"nutshell":"Haruaki works for the Kamo house as an exorcist. He is assisted in his task by Yuzuki, whose powers are used to purify and heal him. But when a powerful enemy is attacking the Kamo family, will Yuzuki's power be sufficient to protect Haruaki?"},{"name":" Kiss Made Ato 3 Senchi","avatar":"https://mangadex.org/covers/fcb7a37e-2614-4946-b0d8-7a533fe4357a/b88c0403-6238-420e-8c4b-8ebfd9141cef.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Boys' Love,Slice of Life"],"nutshell":"Sakurazuka, a manager at an entertainment agency, has been on the receiving end of the advances by the agency's president, Umekage, for many years. At some point recently, however, the joking confessions by Umekage have, oddly enough, started to become more serious…"},{"name":" Demon Evolution","avatar":"https://mangadex.org/covers/fcb7f53f-fd9d-4dfe-a764-20b12d61391a/0773de3e-4253-4f7b-a611-fce2f0ce082b.png.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Reincarnation,Monsters,Action,Demons,Long Strip,Adventure,Fantasy"],"nutshell":"Aang, the strongest human warrior on the verge of death, has inexplicably travelled 60 years into the past, with the double-edged sword of the “strongest demon” power hidden inside him. “The only way to escape the fate of the pastis to evolve. Aang: “Don’t let yourself be a slave to your limits, break free and become a demon that reigns!"},{"name":" This Rich Lady Will Die in 100 Days","avatar":"https://mangadex.org/covers/fcc4b5be-cb5a-4fae-afc5-71b6e54ccec6/5803dca8-97f7-4bb4-b5ab-54d12138bad7.png.256.jpg","country":"Japanese","stat":"7.21","status":"Ongoing","tags":["Comedy,4-Koma"],"nutshell":"Through the power of medicine, this bedridden, terminally-ill girl will spend the next 100 days living her life to the fullest!"},{"name":" Hitotsu Shikanai Mono","avatar":"https://mangadex.org/covers/fcc6deff-f370-4040-96f7-ff70513dc7ff/7593819d-28bf-4985-8230-0a64a96b5075.jpg.256.jpg","country":"Japanese","stat":"8.24","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"Homosexual university student Haruhi Sakagami has low self-esteem and is tired of people comparing him to his twin brother. Trying to find his own individuality, he ventures into Nichoume, Tokyo's gay district, and begins living a double life as a prostitute named \"Kazuki\". Wanting to defile himself, he carelessly lets himself be used by random strangers; but when a kind-hearted salaryman named Masahiro Tachibana takes him home and cares for him after an encounter with an especially violent client, Haruhi begins to regret his self-destructive behavior. As the two men grow closer over time, Haruhi finds himself falling in love… and, in the process, begins learning how to love himself as well."},{"name":" Kawaisou ni ne, Genki-kun","avatar":"https://mangadex.org/covers/fccf8436-e642-4a5e-8c62-60eb99aea92e/83539cbd-46ec-4ed0-9f28-dc56dd3faaf7.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Psychological,Romance,Drama,School Life"],"nutshell":"The protagonist Hirota Genki has what others would call a peculiar fetish. Knowing the abnormality of it, he had intended on giving up on love, however, his feelings towards his classmate, Yachimidori, gets smoldering? To cope, he draws out painful scenarios in which a character made in her image always suffers, however, when his comics gets discovered by the class idol, Sagisawa, he gets pulled on along by her whim."},{"name":" Chatting at the Amber Teahouse","avatar":"https://mangadex.org/covers/fcd11e14-3551-4dec-a780-0b5241fe87e2/bd550385-3e5f-461c-9df3-5f1312acba6a.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Romance,Comedy,Girls' Love,Slice of Life"],"nutshell":"Set at a shop called The Amber Tea-house, this is a very heartwarming story that focuses on Seriho, the proprietress of the tea house, and Sarasa, the high school student who works there part-time. It'll set your heart aflutter!\nVolume 2 also includes Chapters 1-4 of Otomeiro Stay Tune as extras.\nA prologue can be found in Eternal Sisters."},{"name":" Sagara - S no Dousotai","avatar":"https://mangadex.org/covers/fcd16cc6-89e7-45d7-adbb-a06a97cf6a80/03751abf-0f15-4f90-9074-c76100d01e06.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Action,Crime,Adventure,Military,Drama,Police"],"nutshell":"The manga centers on two men: a Japanese police officer who has secretly trained in Jerusalem, and a Japanese man who heads a group of armed insurgents in Iraq."},{"name":" Isle of Dogs","avatar":"https://mangadex.org/covers/fcd725b5-6f94-459d-aa6f-56b95070a1da/94a0d94f-18cf-42b1-9295-3f399f7c4e46.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Animals,Adventure,Drama,Adaptation"],"nutshell":"This series is based on Wes Anderson's Isle of Dogs film. The story follows an orphaned young boy and his beloved dog."},{"name":" Iya x Shite","avatar":"https://mangadex.org/covers/fcd9aebb-2be5-4498-8d20-b7026a069f2f/25c86637-cc21-4671-9076-b94a5ab2e3de.jpg.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Romance,Comedy,Reverse Harem"],"nutshell":"Ruho Miyatsuki wants to fall in love, but she is totally unable to! One day she discovers a club that will help girls with any problem. There she meets three hot guys… Will she be able to be cured and find her prince?"},{"name":" Dolls Code","avatar":"https://mangadex.org/covers/fcdbc45e-6aaf-4e49-86ad-68efe509d80b/1bd2abcd-a91d-4061-8883-b22ba13d3f70.jpg.256.jpg","country":"Japanese","stat":"7.38","status":"Completed","tags":["Psychological,Horror,Supernatural,Mystery"],"nutshell":"Rumor has it that teenagers who have committed a terrible misdeed in their life will go missing. These young criminals are taken away and never heard from again.\nWhen Yuuki Oku awakens, he has no memories and is being driven to a remote school in a car. After arriving, he is led into a classroom. Only six other people are inside. To his horror, he learns that everyone in the room is a criminal, including himself. As students of the class, each and every one of them is incomplete. Whether it's a limb, a heart, an entire head, or—in Yuuki's case—memories, they have all had something vital removed. Though there are seven people in the class, they are told that one of them is not human, but a puppet constructed from their stolen body parts.\nTo escape, Yuuki must first earn the right to graduate in a week's time. But even if he does, he must also identify which of his classmates is the puppet and take back what was once his."},{"name":" Dream Eater","avatar":"https://mangadex.org/covers/fce24f32-1694-4c7c-9cba-ffe907b382a0/0f62e4e6-fb2d-419b-89ee-a4535d543258.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Drama,Fantasy,Supernatural"],"nutshell":"In order to restore the Great Dream Tree of Elfland to life, Kiki, a mare, has to eat bad dreams that plague people’s hearts and foster good dreams so that they sleep well. Aided by Gilly, the tree guardian, and the garden elves, she wanders the human world. However, the world is a dangerous place…\nVolume 1: Dream Eater\nVolume 2: Dream Eater - Saigo no Yume"},{"name":" Little Fox and Artist","avatar":"https://mangadex.org/covers/fce3d2de-6d3c-4176-a690-b803be28465e/09806eee-55ec-4f43-ad0b-bc1180082e5a.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Web Comic,Slice of Life"],"nutshell":""},{"name":" Body Swapped Fraternal Twins","avatar":"https://mangadex.org/covers/fce457ea-1275-475d-91a7-1a21074c326c/491538b4-325e-4e55-82ba-08d2e7c01fc7.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Oneshot,Genderswap,Comedy,Web Comic"],"nutshell":"A pair of fraternal twins gripe to each other about having swapped bodies the month before."},{"name":" I Live With a Demon King","avatar":"https://mangadex.org/covers/fce6924a-b0c7-4044-8e2d-db164542cfd8/a2ed6d15-2bfe-4753-9b26-c62af1d5aee7.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.40","status":"Ongoing","tags":["Demons,Long Strip,Romance,Comedy,Drama,Web Comic"],"nutshell":"The entanglement and love between demons and humans! Little Luo Li lives with the indifferent \"little brother\" at home, but he is actually the big demon king.\nHis goal is to take over Luo Li's body and mind, and then offer her as a sacrifice?! Is there no true love between humans and demons?"},{"name":" Kin'niku shinshi wa o kiraidesu ka?~ Idakarete yamitsuki gorigori H","avatar":"https://mangadex.org/covers/fceb6439-a1d0-4879-b703-641eaface09d/6344d57f-bb38-4077-9d95-c8d616e24ca6.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Ongoing","tags":["Romance,Comedy,Drama"],"nutshell":""}]