[{"name":" Schoolmate Friend","avatar":"https://mangadex.org/covers/9361edc1-7a80-4fd6-8cfd-db15afb43e2b/4fdbc80c-a41f-4a28-aa8c-74dd4a268811.jpg.256.jpg","country":"Korean","stat":"8.15","status":"Ongoing","tags":["Long Strip,Romance,Comedy,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"Gyeoul, a friend from the same class, always maintains proper posture. For some reason, Gyeoul keeps catching Yohan's attention. Suddenly, the two of them become deskmates. Just like the physical distance, their hearts get closer.\nThis loud heartbeat. What should we call the rising blush of that face? A clueless boy and girl's first love story."},{"name":" My Secret Buddy","avatar":"https://mangadex.org/covers/93622dc2-2f6d-474e-a811-e8920c969267/cf5f37ba-e12e-4819-a52e-527f9c9e694e.png.256.jpg","country":"Malay","stat":"7.97","status":"Completed","tags":["Long Strip,Romance,School Life,Delinquents,Full Color"],"nutshell":"Black’s father’s refusal to accept Black and Molly’s relationship is causing a rift within the gang! Black is determined to be with Molly forever and even threatens to leave Black Storm. Horrified at the thought of losing Black, Francis and Mic do all they can to keep their friendship intact. A touching yet funny story of friendship and loyalty!"},{"name":" Préface de Hengshui","avatar":"https://mangadex.org/covers/936441ce-bf12-4e3f-a4d5-036e4c257810/4ab801ad-f59e-4544-b878-1185aa75852a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.90","status":"Completed","tags":[""],"nutshell":"Chinese:\n过去的过去，消失之人尚还存在之时，衡道众之名还鲜为人知，他们行走夹缝之中，寻求传奇之物。那时，他们还不仅是“他们”，也还不曾成为“他们”……"},{"name":" Kankinjou","avatar":"https://mangadex.org/covers/936512cd-3663-4dd1-a94b-656978ae2eb5/4744655f-7381-4e74-99a5-451a4a3ac461.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Drama,School Life"],"nutshell":""},{"name":" APOSIMZ","avatar":"https://mangadex.org/covers/936771f7-eec8-45bd-b1fa-d5802a9cfd06/6cf1f548-a45c-4f3f-9bd8-4f86fc98e828.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Sci-Fi,Action,Romance,Adventure"],"nutshell":"The 200,000 KM diameter artificial celestial body of APOSIMZ. Most of its volume is its core space, which is covered by a superstructural shell. Fifty centuries ago, the people who lost a war against the core lost their right to reside legitimately in APOSIMZ, and were left behind on the extremely cold surface. They face the spreading Frame disease and aggressive automatons which appear frequently on the ruins level. Yet even so, somehow people survive."},{"name":" The Chronicles of the Boy Hanada","avatar":"https://mangadex.org/covers/93691105-5b9f-4cd6-be76-e31cdd768fec/41e2fe74-6422-4107-9e3a-46790aa20f6e.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Ghosts,Comedy,Drama,Slice of Life,Supernatural,Tragedy"],"nutshell":"A little bumpkin kid by the name of Hanada Ichirou gets into all kinds of mischief until things take a turn for the nasty. Trying to escape the wrath of his enraged mother, he gets in an accident, resulting in nine stitches on the back of his head, and one little side-effect: a knack for the supernatural. Young Ichirou is now able to communicate with ghosts, who just can't get off his back with all kinds of requests."},{"name":" Ochikobore “1” Mahou Tsukai wa, Kyou mo Muishiki ni Cheat wo Tsukau","avatar":"https://mangadex.org/covers/936a179b-a865-4e14-aa94-7a31679d7e90/8f87c2f7-3565-46d0-ab44-510d11ba2bfa.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Ongoing","tags":["Romance,Adventure,Magic,Fantasy,Adaptation"],"nutshell":"The world of Lemshiria guarded by twenty-two Gods, a world where one receives a special blessing called an \"arcana\" during their rite of adulthood which determines their worth with \"stars\".\nWe follow the story of Aster, a one-star \"cheat\" Magician."},{"name":" Yu-Gi-Oh! (doujinshi) - Anzu Birthday","avatar":"https://mangadex.org/covers/936a6c16-03b7-4553-87ea-6ec9bb5eaf6c/a0120945-1124-48b5-bada-f39dd373d12e.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Oneshot,Comedy"],"nutshell":"Source:\nhttps://www.pixiv.net/en/artworks/37905307"},{"name":" Bloody Little Circus","avatar":"https://mangadex.org/covers/936b0977-3aa4-45e0-b5eb-561964d7456c/1e467096-2dfd-44bb-93bb-8b62563814e7.png.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Comedy,Fantasy,Vampires,Supernatural"],"nutshell":"Anna is a little vampire girl who loves cute little animals. Whenever she sees an animal she likes, she is tempted to suck its blood and make it into her familiar making it grow wings. Because of her strange passion for cute things, her room is full of cuddly animals with black wings, and she even throws out her coffin because it isn't cute. Her cat familiar, Noel, always complains about her strange behavior. One day, Anna is on her way to see the fireworks at a town when she sees a poster for an Animal Circus full of wonderful exotic animals. Can Anna resist this temptation or will she end up creating her own little animal circus?"},{"name":" Air Koi","avatar":"https://mangadex.org/covers/937961e2-6bea-45d2-9d99-f5b263c44b14/83d8f3c4-17ab-49f5-9cfe-ce6af690968f.png.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"1-3) Air Koi\nNina has one sided feelings for Hayashino Senpai. Nina is unable to see Senpai until she clears the game that Senpai provided. That it's find and take the exact pictures that were e-mailed to her. But Taro from the same class was assisting her And realized how odd this game is and…?!\nA Painful dramatic love story!\n\n\nLost in a First Love\n\n\nLove Materializes"},{"name":" Reijou Elizabeth no Kareinaru Migawari Seikatsu","avatar":"https://mangadex.org/covers/937bc8b0-e092-46a0-b438-df3b0b3d94fb/a5ec8967-b1ae-40f2-9c98-30567b6e1fa8.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Ongoing","tags":["Romance,Comedy,Drama,Fantasy,Adaptation"],"nutshell":"“Elizabeth!” as someone called out to her, she turned around just to see a fine nobleman in front of her.\nElizabeth, a noble lady from the countryside was suddenly grabbed by the arm and abducted.\nAccording to Sylvester, the heir to a Duke household and her so-called \"kidnapper\", she looks exactly like his younger sister to the point they even shared the same name ‘Elizabeth’, the duke's daughter who went missing after eloping.\nIn exchange for lending her penurious family a help, the vicious lady Elizabeth who takes every opportunity to her gain, begins her… splendid life as a replacement…?"},{"name":" Cyberpunk 2077","avatar":"https://mangadex.org/covers/937bfb69-1c3d-4b1b-8ca5-6fa5b21181aa/2aef1f78-664b-4eb4-8f52-9c2cdd802a4f.jpg.256.jpg","country":"Japanese","stat":"7.09","status":"Completed","tags":["Oneshot,Sci-Fi,Action,Anthology,Crime,Video Games,Web Comic"],"nutshell":"The world's most talked about game Cyberpunk 2077 is out now! The game takes place in the huge city of Night City. This is an open-world RPG in which the protagonist \"V\" hunts for a mysterious implant.\nShown here are mini-sketches from manga artists who tried out the game before its release, with their personal experience of the game."},{"name":" Love Story","avatar":"https://mangadex.org/covers/9389f45c-f2e8-46c0-ab45-4219cd5748a2/d3164bfb-c059-495c-ba1a-9e40e51b02c7.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Historical,Boys' Love,Adventure,Drama"],"nutshell":"1-3: Love Story\nA knight and a pilgrim are thrown together by circumstances in this tale set in Europe during the Middle Ages.\n4: Paradise, Paradise\nAn underling resents having to accompany the boss of another division on a business trip to a tropical location."},{"name":" Coke Code","avatar":"https://mangadex.org/covers/93903dae-0860-42da-a78b-8c09d8afcf00/e3fb0c33-4517-41fd-a0fb-3a4424c5ae3b.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sci-Fi,Action,Mystery"],"nutshell":"Makoto Furuzuka is a boy living in a provincial town.\nHe is an ordinary high school student, with a hobby of making work with clay. However, a black stuff, the coke, starts to destroy his daily life and the life of the town.\nMakoto, who has acquired the ability to 'make things' by kneading clay with his fingers, is attacked by Kurihara, a boy who 'manipulates the coke'. He seems to want Makoto's 'fingers'.\nA dark tale of youthful battles."},{"name":" Seijo Celestia no Keikenchi","avatar":"https://mangadex.org/covers/93909350-89d9-4975-a57c-d20cab8063d6/62eff7ad-fa9f-4e36-bc07-c49f5367c8a2.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Romance,Comedy,Adventure,Fantasy"],"nutshell":"The story is an erotic comedy about Celestia, a priestess who fell in love with a knight. Although her status as a holy priestess required her to remain pure, Celestia wanted to have an intimate relationship with the knight, so she devised various schemes to tempt him into making the first move."},{"name":" Back to Rule Again","avatar":"https://mangadex.org/covers/939361bd-32c5-4fb9-ba93-dce280889af4/a9b0316d-738d-4c02-b276-56ea30408474.jpg.256.jpg","country":"Chinese (Simplified)","stat":"6.93","status":"Ongoing","tags":["Time Travel,Long Strip,Survival,Zombies,Post-Apocalyptic,Web Comic,Supernatural,Full Color"],"nutshell":"A young man named Yang Fan was betrayed by his girlfriend while he and his sister at death's door, when suddenly, he traveled back to the past. Last time, you guys bullied me and sold me out. This time, with the power of the ring, only the strongest can survive. And I, am the strongest."},{"name":" Baptism","avatar":"https://mangadex.org/covers/93946519-7acd-42f3-9207-94578dc1ec93/1ba53a69-8dfd-45ae-99c9-80d7a9124ca7.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Sci-Fi,Psychological,Drama,School Life,Horror,Slice of Life,Tragedy"],"nutshell":"Izumi Wakakusa is a renowned actress obsessed with beauty. When an hideous mark shows up on her face she suddenly disappears and gives birth to a little girl: Sakura.\nSakura is always pampered and overprotected by her mother, until the day that she discovers why she was born.\nNOTE:\nThe Scanlation comes from the 4 volume Bunko version."},{"name":" Swordmaster of Warcraft: Invasion of the Otherworld","avatar":"https://mangadex.org/covers/9394cf43-9e5d-4fae-aaf5-6d543c680fc8/5eacd208-8602-4a3f-b9f3-e822c767aa84.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.84","status":"Ongoing","tags":["Action,Long Strip,Adventure,Harem"],"nutshell":"Liu Feng, a youngster who is an internet addict, had accidentally travelled through dimension into a world of swords and magic. He was unable to use his magic and held the grudge where many ridiculed him as a “Sword and magic wreck”. At first, he thought that he could be at the peak of his life when he awakened the skills of a swordmaster in this game with his extraordinary gaming skills. However, the natives taught him a lesson until he even doubted himself. In this crisis-ridden continent, can he really survive and become the bettermost of himself who controls his own destiny?"},{"name":" Mahou Shoujo Lyrical Nanoha - Egoist (Doujinshi)","avatar":"https://mangadex.org/covers/93971e73-c546-49fb-92fe-1ed87f255249/2ee93948-7bbc-4549-96c4-9094508f454f.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Romance,Girls' Love"],"nutshell":""},{"name":" 1999 (What a wonderful world)","avatar":"https://mangadex.org/covers/93993bc6-5e80-4b80-966d-e229e2f50c6e/b1db50e3-95b6-45e2-8601-207b367a06e4.jpg.256.jpg","country":"Japanese","stat":"7.52","status":"Completed","tags":["Oneshot,Award Winning,Sci-Fi,Time Travel,Demons,Psychological,Romance,Comedy,Survival,Girls' Love,Drama,School Life,Slice of Life,Mystery"],"nutshell":"A story about how two friends tries to stop the antichrist, while the are making efforts to deal with their lives."},{"name":" Gaodo","avatar":"https://mangadex.org/covers/939b4352-248c-4e61-a03e-fcb505d7865e/6a8172e6-58aa-466f-8952-2f511f1a8dff.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Philosophical,Drama,Mystery"],"nutshell":""},{"name":" Kuro Bara Alice","avatar":"https://mangadex.org/covers/939ff071-fede-44df-8f1a-b9e2ac0e0bd6/5d88cd9b-a1d5-402b-9aa3-dfd86ae45db1.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Reverse Harem,Drama,Horror,Vampires,Supernatural"],"nutshell":"Dimitri Lewandowski is a celebrated tenor in early 1900s Vienna. When he is killed in an accident, his corpse is colonized by the seeds of a vampire master. At first, Dimitri denies that anything has changed, but as the people around him start dying, he is forced to accept the ghastly truth.\nFlash-forward to 2008. In Tokyo, Azusa Kikukawa’s troubled love life comes to an end with a fatal accident. Dimitri appears in her dying dreams with a diabolic proposal—he will save her lover if she agrees to become the breeding ground for the next generation of vampire seeds…"},{"name":" My Next Life as a Villainess: All Routes Lead to Doom! Comic Anthology","avatar":"https://mangadex.org/covers/93a147bb-9548-4aa8-9502-a427b16f0167/31c7d897-e2e9-4905-ac26-b84be4bbb7b3.jpg.256.jpg","country":"Japanese","stat":"8.42","status":"Completed","tags":["Reincarnation,Historical,Romance,Comedy,Anthology,Video Games,Magic,Isekai,Drama,Fantasy,Villainess"],"nutshell":"A collection of short stories by various mangaka, centered around the hit series I Reincarnated into an Otome Game as a Villainess with Only Destruction Flags...\n\nVolume 1\nCover: Ooshima Miwa (大島美和), Shigetomi Eri (重冨英里) & Kishita Naoya (木下尚也)\nTitle page: Morino Harifu\nAuthor list:\n\nSakurai Yukke\nAmeno\nMajiko\nYoshimura Yoshi\nKatsura Ichiho\nKakitsubata Waka\nToya Tsugumi\nTakahara Yu\nStroma\nRegu 95\nichinomi\nHayase Reku\nMochizuki Kazuomi\nSayu\n\n\nVolume 2\nCover: Natsuko (夏子)\nBackcover: Koichi\nTitle page: Bimita\nAuthor list:\n\nSakurai Yukke\nCocoa\nwim\nNagao Uka\nSuzuka\nBimita\nMochizuki Kazuomi\nOnigiri\nShiraume Nazuna\nMajiko\nSakamoto Bin\nKitano Ririo\nHayase Reku\nYukiya Tomoki\nKakitsubata Waka"},{"name":" Code: Leviathan","avatar":"https://mangadex.org/covers/93a41554-2aab-49d9-9e09-0ef291711af4/c4c15cae-609f-4fb8-8b0c-31a83c0e9698.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Ongoing","tags":["Action,Boys' Love,Adventure,Magic,Drama,Fantasy"],"nutshell":"A parallel world fantasy of the kin of dragons - the curtain opens!! What exists at the ends of the earth - one day, a child of the water dragons meets…?!"},{"name":" Kamikaze","avatar":"https://mangadex.org/covers/93a67cf1-949a-4a89-b66a-da131fe2fea3/1bc7fdda-893d-4b5f-9e22-97e615e35fba.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Action,Supernatural,Tragedy"],"nutshell":"Imprisoned for a thousand years, eighty-eight fabled beasts seek resurrection from their world so that they can unleash their wrath upon present-day Japan. And a band of young warriors would love nothing more than to let loose these beasts so that they can feast upon the human world. The only thing preventing civilization's annihilation is the Girl of Water, who is lost in the human world–without any memory of who she is! As the elemental warriors continue their search for her, they cross paths with another of their kind: Ishigami, the Man of Earth. However, Ishigami is one who wants to stop the dreaded resurrection…"},{"name":" Meteor-san Strike desu!","avatar":"https://mangadex.org/covers/93ab40b9-0efd-4704-8828-49a9ac5651ca/5240f317-af8c-444b-9a63-eb217edb3ecc.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Sci-Fi,Romance,Comedy,School Life,Aliens"],"nutshell":"Everyone lies when they are young, but the lie Kobayashi Hiro told when he was just six haunts him daily to this day. He claimed that he was abducted by aliens, and, even though it was quickly discovered it was a hoax, thanks to national attention, the town became a hotspot and tourist stop for UFO fanatics.\nSo when the beautiful Yamada Meteor transfers to Hiro’s school, claiming that she is an alien and Hiro is the only one that can save the planet from destruction, he thinks that the whole thing’s a prank. He quickly learns that she isn’t joking.\nMeteor is here to test if humanity is worth saving from the monstrous asteroids headed toward Earth. To prove humanity’s worth to the universe, Hiro must complete the assigned missions, even if they are a little perverted."},{"name":" Usotsuki Na Cinderella","avatar":"https://mangadex.org/covers/93ab74ab-3cb7-4dee-9df0-64d1ac878f28/bc67b069-6a3e-40fb-814d-f14f7287b0f3.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Ongoing","tags":["Romance,Drama"],"nutshell":"When the wealthy Alfred Wingate dies, his personal assistant, Cynthia, is utterly confused. He has left her his mansion in his will! Cynthia thought she was in love with Alfred's grandson Graham. But when she finds out he is cheating, she breaks off the engagement. But the terms of the will won't allow her to refuse the inheritance, and she's stuck with the mansion. On top of all this, Graham's brother, Rick, treats her with contempt, believing she tricked his wealthy grandfather!"},{"name":" Siesta","avatar":"https://mangadex.org/covers/93b1870f-1655-45ce-b762-159d13aa7753/d2955274-2dd8-4fce-a02b-6f17f064ffc5.jpg.256.jpg","country":"Korean","stat":"7.94","status":"Completed","tags":["Action,Romance,Comedy,Fantasy,Supernatural"],"nutshell":"The world of Siesta is set in fantasy Europe where there are people called bullet users who were discriminated against badly for reasons unknown to readers as of volume 1. The discrimination has gotten much weaker due to Grande Corp's efforts to wipe out the decades-old pirate faction with the help of Bulletron, a battle suit designed exclusively for bullet users.\nThe story begins as the protagonist Dia Canto tells you a little bit about herself: how she became an orphan, how she met her foster family, and how she is very much in love with her step brother, Loe. However, her affection toward Loe is brutally crushed before it would even bear fruit and she goes out to vent her sadness. This is when she encounters Cid Leon, who she would ultimately be paid to \"protect\"."},{"name":" 200 M Saki no Netsu","avatar":"https://mangadex.org/covers/93b32844-c583-4f90-b23d-ed95e168df47/cc39fc3f-4a45-4c40-bc17-08d90e9befd6.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Ongoing","tags":["Romance,Slice of Life"],"nutshell":"Kikka Tsumugu (28 years old) lives alone on the 2nd floor of an apartment building. Kikka, who works as a wasai (traditional Japanese clothing manufacturer) at home, is a job given by Mashimo, her ex-boyfriend from high school. One day Kikka was selected to be a board member of the apartment complex lives at and met with a man named Hirara...!? Mashimo lives 200 meters away from Kikka's house and Hirara lives 200m above. The vertical and horizontal romance triangle has begun!"},{"name":" Sorcerous Stabber Orphen - The Reckless Journey","avatar":"https://mangadex.org/covers/93b3ac9c-81d9-4702-936a-80966e9aa247/ce5eb824-69c7-467b-bfbd-4ba41ea3daa9.png.256.jpg","country":"Japanese","stat":"7.87","status":"Ongoing","tags":["Action,Comedy,Martial Arts,Adventure,Fantasy"],"nutshell":"Poverty and Partners can always be counted on to make a bad situation worse. When trouble comes to town, Orphen finds himself forced to team up with the worst police officer on the force! Can he keep himself fed while avoiding friendly fire?"},{"name":" Touhou - Utsuho in the Sleeping Forest (Doujinshi)","avatar":"https://mangadex.org/covers/93b8b35f-e2ec-467b-9589-179d8b1e804c/8d11eae8-4076-41ef-aea0-93310027a630.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":[""],"nutshell":"\"Okuu is the sleeping princess and Satori is the damsel in distress in this very fairytale like story. (With quite an unusual choice of prince charming, we might add.)\""},{"name":" Date A Live","avatar":"https://mangadex.org/covers/93bb38b2-8394-44b6-8aa6-34febe2b89e2/f5a9d94f-cc55-4051-8853-c42fda31ef48.jpg.256.jpg","country":"Japanese","stat":"7.58","status":"Cancelled","tags":["Sci-Fi,Action,Romance,Comedy,Mecha,Harem,School Life,Fantasy,Supernatural"],"nutshell":"April 10th. Yesterday was the last day of spring vacation, so starting this morning it was a school day. After being woken up by his cute little sister, Itsuka Shidou believed that it would be the start of another normal day. As for predicting the chance meeting with the girl who called herself a spirit……\nAlong with a sudden shockwave, the townscape vanished without a trace. In a corner of the street which had now become a crater, the girl was there.\n\"—You, have you come to kill me too?\"\nShe is the disaster that will destroy humanity, a monster of unknown origin, and a being rejected by the world. There are only two ways to stop this girl: annihilation, and conversation. His little sister Kotori, wrapped in a military uniform, thus said to Shidou: \"Since it's like this, just go date her, and make the spirit fall for you!\" \"Wh.. whaaaaaaaat!?\" Enter a new age of boy meets girl!!"}]