[{"name":" Wilderness Operation Reverse","avatar":"https://mangadex.org/covers/8e414128-5e57-44ba-a438-dbed366d7af7/4e2f0ba9-8426-4cb8-8928-13c39f9ab292.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.92","status":"Ongoing","tags":["Official Colored,Action,Long Strip,Comedy,School Life,Full Color"],"nutshell":""},{"name":" Hime to Onna Yuusha ga Musubareru Tame no 12 no Hijiri Koui","avatar":"https://mangadex.org/covers/8e4192ce-6b10-476b-bce6-67db3e79bfd1/76238611-f718-4da7-8afd-7d816e8d39eb.jpg.256.jpg","country":"Japanese","stat":"7.65","status":"Ongoing","tags":["Sci-Fi,Girls' Love,Fantasy"],"nutshell":"百合えっちで王国を救え!\nツッコミどころ満載のバトルファンタジー!\n幼い頃から将来を約束していたセフィリア姫と女勇者レナリア。時が経ち、勇者はついに魔王を滅ぼして姫の城に帰還する。しかし、勇者が魔王に受けた呪いを解くには、姫の脱ぎたてパンツが必要らしく…!?"},{"name":" Tokyo Marble Chocolate","avatar":"https://mangadex.org/covers/8e449cba-768f-449c-bdef-ff9338cc0981/e15c3ad5-f631-4c7d-8922-7d5ed3e76369.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"This is a sweet and heartwarming love story, told from the different viewpoint of the two young lovers, a girl named Chizuru and a boy named Yudai. They mean well but cannot seem to succeed at love. They want their relationship to succeed but a combination of uneasiness and lack of self-confidence keeps them from advancing to the next step.\nSometimes, it takes an unexpected third party to intervene in order to make two people realize what is right in front of them. That is exactly what happens in this story.\n[*This is prequel to the 2 part OVA with the same title]"},{"name":" Majime ni Otsukiai","avatar":"https://mangadex.org/covers/8e46d8ab-cef4-4749-a78c-320f4089e276/e9a55861-b7fa-4303-8dba-d79a369a9a54.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Romance,Slice of Life"],"nutshell":"Raised in a household with the mottos \"illicit sexual relationship prohibition\" and \"serious and sincere\", Minami is currently in the companionship of her senpai at work for the 3rd month <3 they are in a pure relationship where they haven't even kissed. But Minami has a secret that she can't tell to the mature and calm him… That is, she reads ecchi manga at home and has delusions about them, in other words \"a pervert who's always on their best behaviour\"…!\nAt that time, she accidentally drops her ero-manga at her workplace…!?"},{"name":" Last Exile - Sunadokei no Tabibito","avatar":"https://mangadex.org/covers/8e482ba8-2c9e-405c-ace5-91246904456b/0df15603-4cb6-4fa3-bf83-b411c6702e07.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Action,Romance,Mecha,Drama,Mystery"],"nutshell":"After the first \"Last Exile\" series, Claus, Lavie, Alvis, and our other heroes board the colony ship, Exile, to return home to the planet humanity abandoned hundreds of years (ago/before). A few months have passed and the quiet, peaceful life they had hoped for is suddenly disrupted when a familiar enemy shows up. How did the enemy they left behind a world ago follow them all the way home!?"},{"name":" Kuroko no Basket - 36°C Danro (Doujinshi)","avatar":"https://mangadex.org/covers/8e485be6-80ec-4a24-b559-a8a752e457f2/69cc4430-dd1c-4979-a209-c3fd67a2bd12.png.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Oneshot,Romance,Boys' Love"],"nutshell":"Pairing: Murasakibara x Himuro\nMurasakibara is having a hard time to get out of his bed, on a snowy day..."},{"name":" More Puzzling Than A Riddle","avatar":"https://mangadex.org/covers/8e48608b-729b-46f6-aa8b-d5753ce44299/2f86c8b4-9bd3-48c5-b872-7f174546dfc4.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Comedy,School Life,Mystery"],"nutshell":"What you need is \"inspiration\"! This is the beginning of a youthful riddle-solving comedy!\nSaki Junjino, a student at Meichi Academy, has the looks, smarts, and athletic skill to be the best girl at Myochi Gakuen, but she also has an unusual fondness for riddles. Eita Ichinose is recruited by Saki to become a member of her riddle-solving club, and he has to figure out her brain-teasers every day after school! Wanting to spend time after-school with the beautiful senior, Eita will solve her riddles again and again... No knowledge or calculation required! You can try it for yourself!\n(Source: Young Magazine, translated)"},{"name":" Taming the Ultimate Tyrant","avatar":"https://mangadex.org/covers/8e4b2ce5-2efe-4ecf-ac69-2bd5e9679452/6e2a8c42-8a52-42c7-8ad7-5a45efcb0031.jpg.256.jpg","country":"Korean","stat":"8.08","status":"Ongoing","tags":["Long Strip,Romance,Office Workers,Web Comic,Slice of Life,Adaptation,Full Color"],"nutshell":"Kang Eun-Hyun, the CEO of \"Red Fit,\" is considered the next-generation leader in the domestic game industry. There was only one thing he lacked, with his good-looking face and perfect physical: when he opens his mouth, his sharp words attack those listening!\nCho-Eun is Eun-Hyun’s secretary. With a calm and patient personality, she skillfully accepted the president's twisted words, and after work, continued her normal(?) work life by swearing at the same company colleagues and friends about Eun-hyun. However, Eun-hyun sharp words became worse as the days went by, and the moment she thought she had to make a decision whether to stay with Eunhyun, his words were so unexpected!\nCho-Eun personality remodeling love project, a universal secretary who tamed Eun-Hyun, the absolute tyrant!"},{"name":" Kyou, Aitsu (♂) ni Kyun to Shite Shimaimashita...!!","avatar":"https://mangadex.org/covers/8e4dd2b0-3adb-453c-b4ce-c97428afc2f3/1c2004c0-7d7f-4db7-82b2-63c40994d7f6.png.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Romance,Comedy,Anthology,Boys' Love,Slice of Life"],"nutshell":"A light BL short story collection written and illustrated by 13 splendid artists that's so precious it'll make your heart skip a beat! Best friends, childhood chums, unlikable punks, and strangers just encountered—we're both guys, but I fell in love with him!"},{"name":" Kid Detective Rock Holmes","avatar":"https://mangadex.org/covers/8e518e76-c52e-4179-a0bd-7473a383b773/d684d821-0d66-4d37-8aeb-cf3fdc7f2f5e.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Psychological,Comedy,Anthology,Crime,Mafia,Adventure,Drama,Police,Slice of Life,Aliens,Mystery"],"nutshell":"(from MangaUpdates): This is a collection of short stories anchored by the tale of a young boy who fancies himself as a detective.\n\nVolume 381 of the Osamu Tezuka Complete Works"},{"name":" Fox Wedding","avatar":"https://mangadex.org/covers/8e5b0ac6-c870-40ab-b56f-5c57098cf53a/71b3ba6b-f107-4cf6-9be1-0c242c623a4c.png.256.jpg","country":"English","stat":"7.81","status":"Ongoing","tags":["Oneshot,User Created,Girls' Love,Monster Girls"],"nutshell":"After Saving a fox Kit the Fox wishes to repay the favor with her devotion"},{"name":" Irene of Love Revisted","avatar":"https://mangadex.org/covers/8e5cb227-2190-4d86-8b63-6962759aec52/32464d31-7b4f-47e5-82fe-66b21b950535.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Psychological,Romance,Comedy,Drama,Slice of Life"],"nutshell":"The story of a mixed couple, A Japanese man named Iwao Shishido and a Filipino named Irene. Foreign wife Irene suddenly appeared in a cold village like a blowing pool.\n\nNote: This title has an original edition of 6 volumes and a shinsouban of 2 volumes, released in 2010. Most of the details here cover the latter edition."},{"name":" Sun Dog Zero","avatar":"https://mangadex.org/covers/8e5f29d8-0d00-4ff1-b225-0f183ff2f165/7f5cea87-7b9b-49fb-a543-4c2d42517e23.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Animals,Adventure"],"nutshell":"Zero is a wild dog who is saved by a boy named Taro after making enemies with hunters. Their carefree days of living on the streets are interrupted when Zero undertakes a journey to sharpen his fangs."},{"name":" Revenge of the Heiress in Distress","avatar":"https://mangadex.org/covers/8e5f4ada-5696-4744-b8f8-7dab37c7cb11/f80dc494-7215-461f-bba2-a520ba262ad8.png.256.jpg","country":"Chinese (Simplified)","stat":"7.87","status":"Ongoing","tags":["Official Colored,Long Strip,Full Color"],"nutshell":"“I’m your sister! You owe me this!”“My daughter, please promise me that you’ll never bear a grudge against your sister for any of her wrongdoings.”Xiao Keyan could no longer take it. After her sister continually tarnished her name, and her family’s morals became like shackles to her, she had finally had enough.“One day, I’m going to take my baby back and nobody will be able to stop me!” she declared.The time would come when the ice and the snow would melt, and the winter plums would bloom. That would be the day when she would turn the tables.Wait and see."},{"name":" Sunny & Rainy","avatar":"https://mangadex.org/covers/8e5f7fcf-18d8-4da8-ae6c-f771cbd274b1/4576d98d-dd73-45b5-846b-3a12d8296942.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Supernatural"],"nutshell":"One-shot from Feel Young Magazine.\nA short story about a girl and her strange relationship with the rain.\nLinks:\nAuthor's Twitter: @icori_a"},{"name":" Mekake no Koukyuuhi Ranking wa 133-banme no Youdesu","avatar":"https://mangadex.org/covers/8e667090-2e5b-46b3-a7c5-ec58dd8358e6/8ee7fd5b-864e-4d42-b0fb-5eaebeb42c40.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Ongoing","tags":["Historical,Romance,Comedy,Adaptation"],"nutshell":"Beauty, wisdom, personality, degree of love - the \"princess ranking\" is regarded as absolute in this harem.\nAmerei, who entered the harem at a young age, is the 133rd concubine. If nothing is done, the love of His Majesty, the Emperor will only remain a dream. But then a mysterious young man, Kasei, met Amerei and she ended up falling in love with him.\nKissing!?\nNo! This body is only for His Majesty, the Emperor! However, after I was embraced by him my \"princess ranking\" soared!\nWait! Could his true identity be that of the Emperor himself?"},{"name":" Yuri!!! on Ice - Nikaime. (Doujinshi)","avatar":"https://mangadex.org/covers/8e676adc-6032-4f8a-baa8-f53285135620/edfdbbfa-e00e-44ca-ba70-3b6f48e9f789.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Pairing: Yuuri x Viktor"},{"name":" Taiyou no Kishi","avatar":"https://mangadex.org/covers/8e6ffea0-554e-448c-83df-e12f8e26521e/ffb4c143-29f6-4d18-a26f-f1dd17c0061b.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Boys' Love,Fantasy,Supernatural"],"nutshell":"Hinata was corrupted by his stepfather and he felt that he had lost the right to love his childhood friend, Tatsuya. He left home and became an escort to support himself. Soon, he met a pretty Shinto priest, Clayle, who gave him the spear of the light's fragment. After this encounter, Rele, knight of the sun shrine, suddenly appeared and told Hinata that he'd obey and protect the owner of the fragment. Clayle was imprisoned before they could find out more. What will happen from here?"},{"name":" Oshiete Katekyo","avatar":"https://mangadex.org/covers/8e70b64c-391b-4d1e-a595-f4d14ee9c4aa/2180ad97-c77f-4634-b8fa-d98fe7df2dbd.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Comedy,Boys' Love"],"nutshell":"Uta, a seemingly perfect guy with no weaknesses, is invited to Minami's home as a private tutor. Minami's skills in bed are as pathetic as his grades, but thanks to Uta's help, he starts scoring better and \"scoring\" better! Excitement gives way to an all-out rollercoaster ride as they begin their lessons in love!!\nAlso included in this volume: A sweet, two-part romance about a hair stylist saving for marriage who ends up living with a divorcee, and a short story about a rough-and-tumble rival pair who can't stop arguing over who should \"top\" long enough to admit their feelings!!"},{"name":" Westwood Vibrato","avatar":"https://mangadex.org/covers/8e71a1d0-626c-4d81-81dc-58670b86317f/a8eb09c9-a45b-49c7-8ff7-b2cd5099202c.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Completed","tags":["Official Colored,Romance,Adventure,Drama,Web Comic,Music,Full Color,Tragedy"],"nutshell":"Whatever instrument, the genius instrument repairman Cornelia Bobo Warshaw will tune it to your desire. From Yoon In Wan, the author of 'Island', 'New Amhanguhsah' and Kim Sun Hee, the author of 'Three Kingdoms of Go' comes a new creation about music and drama.\n\nNote: Westwood Vibrato is a manhwa written by Youn In Wan with art by Kim Sun Hee. Originally released in Japan in black and white, it was later released as a Korean Webcomic in full color."},{"name":" Shutterbox","avatar":"https://mangadex.org/covers/8e7a42ac-14e6-4014-b6ec-68710df8984f/ea7535a8-850b-4e87-b480-c0c9ba80ee41.png.256.jpg","country":"English","stat":"7.98","status":"Ongoing","tags":["Romance,Magic,Isekai,Fantasy"],"nutshell":"Megan Amano is a young photographer who has ties to the spirit realm. One day, when Megan captures a picture so mysterious, she questions everything around her. Follow Megan as she embarks on a journey that will have her more entwined with her fate in the world"},{"name":" Crossdressing Grandpa and Grandma","avatar":"https://mangadex.org/covers/8e7ac573-25fd-460f-9969-9178e2c561e4/7e88c3e7-8c48-48de-b97e-f60dd47c9465.png.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Crossdressing,Web Comic,Slice of Life"],"nutshell":"This elderly couple isn’t just cute! These are stories of their days after having practiced and perfected their ideal appearance!\nTatsuhiko and Haruko might seem like your average couple past their prime, but when nobody is looking, they change into Rose and Haruhiko and reverse their roles! Witness these two indulge in their sparkling and oddly stylish irregular but also ordinary daily lives!"},{"name":" Red Garden","avatar":"https://mangadex.org/covers/8e7f5b2c-5af9-4471-b440-132992d40ee3/be3c2a84-4b03-44ac-84c2-715b8df404c6.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Drama,Supernatural,Mystery"],"nutshell":"This is the story of four girls with nothing in common save for a single friend who has suddenly gone missing.\nWhat awaits them? A destiny far stranger than they could ever have imagined!"},{"name":" Kare no Barairo no Jinsei","avatar":"https://mangadex.org/covers/8e87f582-e4b2-4ceb-ada8-aed95d4f1e26/49e0c33b-44fd-43c1-926c-61e31964f597.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Psychological,Romance,Boys' Love,Drama,School Life,Slice of Life"],"nutshell":"Natsuki Matsuda, twenty-years-old, has proudly identified as gay since age fifteen. Then Komano, nineteen-years-old, comes into his life. He's always been popular with the ladies, but he's a free-spirit who cannot be tamed – by man or woman! This is the story of their love. Can Natsuki handle Komano's bohemian nature in the long haul or will jealousy and possessiveness get the best of him?"},{"name":" Haitoku wa Amaku Mushibamu","avatar":"https://mangadex.org/covers/8e88caab-103b-4871-be58-878922700919/4bf25f9a-f39b-40eb-9d4e-304b26e1ac0d.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Romance,Comedy"],"nutshell":"Anna, a reporter on sweets, likes Toranosuke, a patissier. She wants to develop her love to him, but his twin brother Ryunosuke always gets in the way. Soon, however, she gets aware that she likes Ryunosuke as much as Toranosuke."},{"name":" Kimi no Ashiato wa Barairo","avatar":"https://mangadex.org/covers/8e8b5e4c-6221-4fb5-a70d-1e21da51034a/31b8978f-8a37-41ec-9dd2-752203ff0a61.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Genderswap,Romance,School Life,Supernatural"],"nutshell":"Haruka and Takumi had their bodies swapped when they fell down a staircase at a shrine. After several years of searching for a way to go back to normal, they find themselves increasingly aware of each other as their physical sex…"},{"name":" Don't Make a Wish","avatar":"https://mangadex.org/covers/8e8d0fc8-2860-4bfc-a6cc-814392c3a436/d1c521e0-efa3-4c96-a31b-cd4c9154b384.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.53","status":"Hiatus","tags":["Long Strip,Comedy,Web Comic,Supernatural,Full Color"],"nutshell":"I was an only child, but when I woke up, a younger brother appeared. Even more frightening is that this younger brother can unconditionally grant any wish… for a safe life, for the sake of world peace, as his sister, I sincerely advise you to not to make a wish to my younger brother."},{"name":" Three Cat Cookies","avatar":"https://mangadex.org/covers/8e8d6a7b-9ef5-4006-a0e4-095b1e97de7c/0b6333bc-a9b7-47a5-b35e-01da8b75d465.png.256.jpg","country":"Chinese (Simplified)","stat":"7.95","status":"Completed","tags":["Animals,Long Strip,Fantasy,Web Comic,Full Color"],"nutshell":"During one's ordinary high school life, an average student happens to meet an extraordinary cat and thus their adventure begins."},{"name":" Red Thread of Fate","avatar":"https://mangadex.org/covers/8e8f3676-2102-4703-b829-b5b663731437/287f350a-576c-4c20-a5c8-fb5b403ab29f.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Romance,Comedy,Fantasy"],"nutshell":"Reeling from her latest failed relationship, Jungin curses the god of fate for matching her with such terrible men. Unbeknownst to her, the god of fate is listening, and so is his unimpressed father. Exasperated by his son's incompetence, he banishes him to Earth until he is able to make up for his matchmaking mistakes."},{"name":" Kigurumi Guardians","avatar":"https://mangadex.org/covers/8e91c90d-26ab-4474-94d5-9026cf081716/682704b5-c14e-4beb-80d7-b2f999d09abd.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Hiatus","tags":["Romance,Comedy,Magical Girls,Magic,School Life,Supernatural"],"nutshell":"Hakka Sasakura's life is about to turn upside-down. She comes home from a day of admiring the student body president only to discover that a mysterious creature resembling a man in an animal suit has taken up residence at her home! What’s more, she's been chosen to work with this strange being to fight off invaders from another dimension and save the world… and she has to kiss him to do so?!"},{"name":" Gekibuno.","avatar":"https://mangadex.org/covers/8e9732e7-0d69-43a6-9379-b4693c0c539f/95dcc0dd-b211-428b-8ad3-dee452c39f20.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Comedy,4-Koma,School Life"],"nutshell":"Kuramoto has just transferred to a new school, which has a Drama Club with a touch of mystery around it.\nKuramoto has a retiring personality, and he feels like his existence is barely noticed by others. He wants to change all this, so he joins the Drama Club.\nBut soon… he regrets! Commencement of a stupid comedy!"},{"name":" Seija no Koushin Revenge","avatar":"https://mangadex.org/covers/8e991225-b2b7-47b7-ba09-58c30ab77e02/43aaa365-f422-4d99-8b21-62fea5f71391.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Drama,School Life,Horror,Supernatural,Mystery"],"nutshell":""}]