[{"name":" Takane-san, Kimi no Koto Sukirashii yo","avatar":"https://mangadex.org/covers/1841f400-2313-455c-9ffb-cb2fcd4dbd5e/76791fc7-9005-40ff-b530-f68c4036d376.jpg.256.jpg","country":"Japanese","stat":"8.34","status":"Ongoing","tags":["Oneshot,Romance,Comedy,Drama,School Life,Web Comic,Slice of Life,Adaptation"],"nutshell":"The unrequited love comedy between a serious disciplinary committee member x the school's most beautiful girl.\nLight Novel: Shogakuan link"},{"name":" Sorenari ni Shinken Nandesu - Suki no Katei (Doujinshi)","avatar":"https://mangadex.org/covers/1849ed08-f715-490e-9d94-71ca61507e96/b4f9d3c0-6aee-4015-b8aa-6369823d387f.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Oneshot,Boys' Love,Slice of Life"],"nutshell":""},{"name":" Te wo Tsunagou yo","avatar":"https://mangadex.org/covers/184a6d41-c35e-4ea8-82af-36ff463a5c58/8fff6ba0-8734-434c-af85-ec40f1362f59.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Romance,School Life"],"nutshell":"Kusunoki Azuki and Daizu are close siblings who live in the Arisuno apartment complex. Their next door neighboor is Azuki's childhood friend Tachibana Chika, who has feelings for her. One day, two brothers who are close to their ages, Hiiragi Mizuki and Ryuusei, move into their other neighboring apartment. A heart throbbing neighborhood graffiti starts now!"},{"name":" Forest Bear","avatar":"https://mangadex.org/covers/184cdbab-e7f3-4970-bcca-878504889d6f/98701000-14ca-47d9-8f7e-ef4c1e6e69c1.png.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":"On a walk, a trio of rabbits encounter a frightful bear. This one-shot discusses the use of chemicals on animals."},{"name":" Himawari Memory","avatar":"https://mangadex.org/covers/184decd1-1c95-41b1-b14b-8b22e938dacb/465f227e-c8aa-4e7e-9de4-a984d32bfaf5.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Oneshot,Long Strip,Drama,Fantasy,Slice of Life"],"nutshell":""},{"name":" Paradox Blue","avatar":"https://mangadex.org/covers/184fb4b6-4ab2-4eb0-87a9-10ec6280fe9e/3492851b-324a-47b7-8162-71a52b81109d.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Action,Comedy,Adventure,School Life,Supernatural"],"nutshell":"\"What is the boundary between game and reality?\"\nThe world is in danger. Strange juggernauts called \"Angels\" have started to appear all around the planet, presenting riddles called \"Paradoxes\" to whoever happens to be in the near vicinity. Answer right and your land will receive God's blessing. However, if you fail to solve the paradox be prepared to receive divine punishment…"},{"name":" Michiru Heya","avatar":"https://mangadex.org/covers/1858dc96-d7bc-4535-bcab-49eee88ae661/2c326aa9-0297-42db-aaf1-d7dc4cabbbf9.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Boys' Love,Drama,School Life"],"nutshell":"Reno has a new roommate: his name is Roje, and there seems to be a lot of nasty rumours about him in this boys' school. They call him \"Casanova\" – he sells his body to almost anyone willing to pay for it. Reno is surprised to find that, for Roje, this is only business. The transaction is over when people get the wrong idea about something that's just sex. Reno just wonders how such a nice person can be so cold at times – and why is it that he can do those things as if it means nothing?"},{"name":" Veggie Dragon","avatar":"https://mangadex.org/covers/18697261-949c-4ed6-88b7-bb8fda4bf324/d851b936-12f0-44d9-9898-a8b90adb12ce.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Oneshot,Comedy,Web Comic"],"nutshell":"Niños, mejor coman sus vegetales."},{"name":" Holy Ancestor","avatar":"https://mangadex.org/covers/1873d8af-59bf-467c-843e-47032d6888c8/e233fffc-6c82-4775-80eb-9d3c180c6f2a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"6.45","status":"Completed","tags":["Action,Romance,Martial Arts,Adventure,Isekai,Fantasy"],"nutshell":"This is a brand new upgraded divine world. There are King Zhou, Jiang Ziya, Su Yuji and Yang Lan. All of them are peak figures here. Also, there are Kings and Three Emperors of Huoyun Cave here. There are Saints and Daoist sects here. Ancient Gods and Devils, Chi You and Xing Tian are here too. Last but not least, we also have a youth named Luo Lie. He will open up a new divine era where “he is not a hero but he is unmatched in the world”!\nFR: Luo Lie a toujours été un étudiant paresseux, mais ces derniers temps, il s’endormait plus que d’habitude en classe. Simplement assis à son bureau un jour, il est soudainement entouré de lumière et voit une mystérieuse silhouette dorée qui frappe en lui. Quand Luo Lie se réveille, il est dans un autre monde, vêtu de vêtements différents, et les gens l'approchent pour l'appeler «jeune maître»! Maintenant, Luo Lie est sur le chemin de l’apprentissage de techniques puissantes dans les arts martiaux avec l’immense force divine qui sommeille en lui!"},{"name":" Hanakanmuri no Ryuu no Himegimi","avatar":"https://mangadex.org/covers/187b680b-e42c-4fd3-bc08-c5f689654af2/ed1b81fb-5d34-44b3-9309-5f90f201a521.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Adventure,Drama,Fantasy"],"nutshell":""},{"name":" Alien Crash","avatar":"https://mangadex.org/covers/18820a89-f247-4863-8bbc-abf7841b8963/fdb79763-3693-41b4-840f-655d154b2396.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Anthology"],"nutshell":"Discover six short stories in cyberpunk style by the master Shûhô Itahashi, composed between 1981 and 1984. This anthology gathers the first anticipation stories of the author of Code Name: Love City (Ai city), whose title was adapted into an animated film in 1986. The book opens with the character of Rick, an investigator living in the underbelly of a technologically advanced city. His mission: to unravel the mysteries surrounding the murder of a scientist whose corpse was found intact in his locked car... The book then plunges the reader into a universe where virtual reality and transhumanism are the law: humanity seems to have grown tired of its condition. Lost in its daydreams, it started to develop new tools of distraction. Imaginary worlds in which it is possible to give free rein to its fantasies, like raising an army to go to war against extraterrestrial life forms."},{"name":" One Million Gold","avatar":"https://mangadex.org/covers/188558f7-ecb6-4797-970f-a3ea6dce507c/0fc6a1e2-e996-43b0-9edc-79bfea3e459b.jpg.256.jpg","country":"English","stat":"6.79","status":"Ongoing","tags":["Long Strip,Comedy,User Created,Fantasy,Web Comic,Full Color"],"nutshell":"Evangeline, a half-elf merchant, tries to earn her way to one million gold so that she can enter the Final City, a place where only the rich and powerful are allowed."},{"name":" When She Touches Me","avatar":"https://mangadex.org/covers/1885bf21-afe1-4680-a59a-2a8f4932f9d1/2e15fa1e-2403-4c52-8433-a9500be2a1ea.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Completed","tags":["Oneshot,Comedy,Girls' Love,Drama,School Life"],"nutshell":"\"When She Touches Me,\" by Amaguri Tarou, is a teacher-student story."},{"name":" Spray King","avatar":"https://mangadex.org/covers/18868868-ef41-45c6-b811-9ca8a17c9041/58759b6b-92e2-41e5-91bb-4c76487606e8.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Action,Comedy,Adventure,Supernatural"],"nutshell":"In the city named Kotobuki, there are rumors of a man who defeats bad people, leaving only giant, beautiful graffiti at the scene. Since no one has ever seen that man in person, they called him \"Spray King.\" Kuroda Miu, a photography student in an art academy and part-time photographer for a weekly magazine, wants to catch Spray King on film in order to create a good scoop for the magazine. One day, she met with Tanaka Torateru, a boy who just entered the academy, but who wasn't that good in art. How could the meeting of the two lead to the \"truth\" about the city they live in and about the hero in the shadows named Spray King?"},{"name":" Bokura wa Minna Ikiteiru!","avatar":"https://mangadex.org/covers/1887cf6f-9bd5-4a2b-9fcf-2a126df26aa6/7a9ef3e6-245b-4c22-8bc4-8f5066092493.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["School Life,Supernatural"],"nutshell":"We Are All Alive!\nMiko, a young girl from the north, finally manages to visit the city for the first time. She came in hopes of finding her older sister, but gets lost instead. She finds a cat scaling the handrail of a bridge, but it accidentally falls off. Miko tries to save it, but instead she falls off herself. When she wakes up, she realizes that she's actually already dead, but the cat had saved her with one of its nine cat lives. Unfortunately, a cat's life only lasts for a year, and Miko needs to figure out a way to get her original life back, as well as a way to somehow find her sister."},{"name":" Fuusui Pet","avatar":"https://mangadex.org/covers/188bf2f6-de9a-4e85-a9ae-a3262131f18c/56054a91-52fa-45f6-82a3-ba16a6aac754.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Animals"],"nutshell":""},{"name":" A Manga About High School Boys Who Woke Up as Girls One Morning (Webcomic)","avatar":"https://mangadex.org/covers/18990219-4e9f-4c9b-8f6c-2368a765eeb9/7f03b2c6-b8ac-4173-9bd5-a2ddab8b4078.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Genderswap,Comedy,Web Comic"],"nutshell":""},{"name":" Eien no Aida ni Miru Yume","avatar":"https://mangadex.org/covers/189c552e-d2b8-4886-b235-a9fdba33855d/1253863b-45bb-4143-84d0-0f7acdf9af04.png.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Fantasy,Tragedy"],"nutshell":"A fallen angel finds himself infatuated with a human, and despite knowing the consequences, he decides to indulge himself… if only for a little while."},{"name":" 21st Century Journey to the West","avatar":"https://mangadex.org/covers/189e2fc8-911b-49c9-bc42-75ab4838bb00/fc528521-df9f-4d03-b46b-7b82bacd8627.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.04","status":"Ongoing","tags":["Action,Demons,Long Strip,Martial Arts,Adventure,Magic,Web Comic,Supernatural,Full Color"],"nutshell":"Several thousand years ago, in order to propagate the teachings of Buddhism through the Central Plains, Tang Sanzang traveled to Sukhavati to seek the scriptures. But in the end, at the very last moment, he failed.\nAfter experiencing countless cycles of samsara, it is now the modern era. No one knows if Tang Sanzang’s reincarnation can successfully obtain the scriptures in this lifetime…\n\nAuthor's Lofter"},{"name":" Mitsu no Yoru","avatar":"https://mangadex.org/covers/18a0b750-2156-4ac1-bcd6-1d60dbdf76ec/4cf45c9d-7963-4045-a939-10068774f662.jpg.256.jpg","country":"Japanese","stat":"7.65","status":"Completed","tags":["Romance,Anthology,Incest,Drama"],"nutshell":"Mitsu no Yoru\nThe younger brother, Yakou, attracts and embraces me. He is so special to me, but this sin is too heavy for me to bear. However, maybe it will worth it if Yakou can play and do as he pleases with me?\n\n\nBoku no Pink\nShe lost her parents when she was 10 years old. Since then, she's dreamt of having her own family, even if that family is temporary…\n\n\nKanojo no Himitsu XXX\nThe main character is always mistaken for a ko-gal due to her natural blond hair, but in truth, she's just a turtle-loving gal! The only one that noticed was her handsome (duh!) student council president. As she joins the student council for you-know-what reason, will the president just misunderstand her as many others do?\n\n\nIchioku no Koi\nMy price is worth 100 million? Money is in exchange of Love? It is a super love story\n\n\nKimete Agemasu ~Mamotte Agemasu Bangai Hen~\nOnizuka doesn't want to be \"a good person\" in Kotome's eyes any longer and is determined to buy THAT. (A side story based on the Agemasu series by the same author.)"},{"name":" Shitsuji de Maid na Otoko no Musume","avatar":"https://mangadex.org/covers/18a141eb-5a44-433e-ae0a-98fa60f590d6/75080bb1-1f00-4ff4-98e7-9307136aa64c.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Action,Comedy,Boys' Love,Martial Arts,Crossdressing,Slice of Life"],"nutshell":"A body guard in an effort to protect his rich mistress has to dress up as a maid and act as a female to protect his boss from all potential harm , many things occur in which try to harm his master but he will always protect her even if he loses his life, but is master also has a secret. A Oto Nyan Series, so its a trap series."},{"name":" Touhou ~ Curse of Red (Doujinshi)","avatar":"https://mangadex.org/covers/18a97c86-1d2f-47cc-b64c-23c257af2a97/f9c26b96-b78d-4ad0-b525-dbe7a886f3d6.jpg.256.jpg","country":"Japanese","stat":"8.31","status":"Completed","tags":["Reincarnation,Romance,Comedy,Magic,Girls' Love,Slice of Life"],"nutshell":"The story of Gensokyo's new shrine maiden and the curse of red which binds a certain youkai magician to her and the previous shrine maiden."},{"name":" Nekorobi Yaoki","avatar":"https://mangadex.org/covers/18adc2ff-21fb-4b0d-8b1b-2ecdccb0327e/4c6aeb05-a872-42f9-8ee4-172d3405e426.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"'I've got someone I love more now. Goodbye.' was written on the note left behind when she disappeared. It's just me and the cat now. Yūsei dreams of succeeding as a graphic designer, but he spends his days without being able to make a difference while living in a town near the ocean. His girlfriend, Akane, left him, and he sank to rock bottom, but his cat started to unexpectedly expand his world?"},{"name":" Kaijuu no Shiiku Iin","avatar":"https://mangadex.org/covers/18ae5872-fa24-4a23-a9dc-bfea5e2c7c6e/bbffbc59-b41e-4293-b275-38f545108425.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Sci-Fi,Comedy,Slice of Life,Supernatural"],"nutshell":"Two girls start attending a new school and find themselves responsible for the care and feeding of monsters."},{"name":" Hokuriku Ghost Story","avatar":"https://mangadex.org/covers/18b1d68a-3396-4063-949d-f399439ebad7/8aaa6ba3-a0a4-4e7d-8f1f-1001432128cb.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Psychological,Drama,Supernatural,Mystery"],"nutshell":"One day, teenager Nakai Kunta meets a ghost in the school. The girl, Houzuki Yuzu cannot rest in peace until her corpse is found – and it’s up to Nakai to solve the mystery of its whereabouts…"},{"name":" The Elegant Sea of Savagery","avatar":"https://mangadex.org/covers/18b65fea-2344-4fd2-9fb2-f44e40070219/4c203dc5-207d-492f-8f6d-0626e6ead369.png.256.jpg","country":"Korean","stat":"8.02","status":"Ongoing","tags":["Long Strip,Romance,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"Irina Nodiac, the eldest daughter of the Marquis, was entrusted to Count Elenoa Schuberg after her father's business continued to fail. All rights were handed over to Elenoa, whom she has known since childhood.\n\"You belong to me. So don't go messing around.\"\n\"Are you treating me like an object?\"\nHowever, even though she became a maid, her reputation of a \"Crazy Bitch\" during Academy days will never change. And now, Irina, who is self-disciplined and confident, stands in front of Elenoa.\n\"I can do more than what meets the eye. I can carry a lot of stuff.\"\nElenoa, who wants to own her completely, and Irina, who is trying to move forward despite difficult situations. What kind of voyage will they embark on in the future?"},{"name":" A Hint of Purple","avatar":"https://mangadex.org/covers/18b85725-0f70-4e9b-b799-6846f30f5941/5cf4d625-e370-4bb5-aa20-eb3eee06865f.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Drama"],"nutshell":"From Storm in Heaven:\nThere's a legend about a certain library at the Doumeikan University: whoever meets there for the first time will fall in love. One fateful day, Shino waits for her date there, but she doesn't meet him. Instead she meets a football player who took refuge there, trying to avoid his angry teammates. Then the two surprisingly find out that their parents are getting married, and so they start to live together…"},{"name":" Shoujo Hachi Gatsu no","avatar":"https://mangadex.org/covers/18bec826-74b1-4a28-8854-cb9005933009/efa398a3-50b6-46d9-8351-c6efc10f8069.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot,Romance,Drama,Supernatural,Tragedy"],"nutshell":"Related Series:\nKagehime no Konrei (Main Story)"},{"name":" Watashi no Suki na Hito","avatar":"https://mangadex.org/covers/18bfe440-2670-4b45-a264-1a3adbb65d01/a44383e2-ca3b-4ec5-97cb-1330bb2e078b.png.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"Drawing on CLAMP's own personal experiences, The One I Love provides insight both into the creators' own lives, and into the oft-elusive concept of Love itself.\nThis intimate collection of short stories and essays doesn't skirt issues at the heart of the matter such as insecurity, honesty, distance, independence, age, and - of course - marriage.\nThis one-volume anthology comprises 12 individual stories, each of which consists of seven pages of manga and two pages of prose."},{"name":" 1-Nichi 1-Kai, Hateru made... Ueta Zetsurin Oji-sama wa Watashi o Musabori Tsukusu","avatar":"https://mangadex.org/covers/18c0edf4-42cf-48b8-a4e0-326acefb670f/77a82d61-be91-4c9c-90ed-1b91a46a1464.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Ongoing","tags":["Romance"],"nutshell":"\"We're not even close to being done though?\" His enthusiasm is enough to make me tremble as I cum over and over. He teases just the entrance of my hole before piercing me deeply with his dick and I cum all over again...!! Hina Kikuchi has just lost her job when she meets a hot daddy who happens to be the owner of the Japanese sweets shop, Fujikawa. She fills herself with sweets and ends up falling asleep. When she snaps back to reality, she realized that Mr. Fujikawa is in bed with her!? Not to mention, he's a sexy, handsome mature guy who pins her down. \"You can just leave everything to me,\" he says has she struggles to come up with a reason to turn him down. He starts to sensually touch her body, hitting every sensitive part of it; both shallow and deep. In the end, he ends up greedily devouring her. The next morning, he offers the most shocking offer thus far: \"Why don't you live with me and you can become my girlfriend?\" \"What's going to happen to my body if I keep having intense sex with this hot daddy every day!?\""},{"name":" Infinity","avatar":"https://mangadex.org/covers/18c74fe4-479b-4236-80c4-f4314243a7b1/8b841363-4a23-4e17-883f-be4afea40ee5.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Oneshot,Comedy,Girls' Love,School Life,Slice of Life,Supernatural"],"nutshell":"A manga about a girl who can see the level of affection each person holds for her, and her friend whose affection for her says \"∞\"."},{"name":" Mabushiku Kagayaku Kagayakanai Kagayaki","avatar":"https://mangadex.org/covers/18cc5332-fede-4765-9142-2352eeb68a19/70a0942f-3489-40f5-bead-8483c566cca1.png.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Oneshot,Comedy,Drama,School Life,Slice of Life"],"nutshell":"Haru, who used to like being alone, now lives her life trying not to be left out by others. One day, Haru was reminded of her past self by Nanase, who was sitting alone in the classroom. She decided to call out to her,  but Haru was disturbed by how Nanase seemed unbothered by her situation. As Haru grapples with her conflicting emotions, what kind of action will she take...!?\nA coming-of-age story that portrays the struggles of adolescence."}]