[{"name":" Vahlia no Hanamuko","avatar":"https://mangadex.org/covers/90a47b16-5060-4ed5-8e85-dec1c87ca04c/64908bf2-de14-4d11-bfdc-cac8594fb4bb.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Oneshot,Historical,Action,Romance,Adventure,Fantasy"],"nutshell":"A collection of short stories:\n\n\nVahlia's Bridegroom (Vahlia no Hanamuko)\nJiru and Vahlia were engaged. But Jiru suddenly went missing! Four years later, Vahlia was betrothed to his younger brother. During the night of the celebration of her second engagement, Vahlia decides to go on a journey… in search of Jiru!\n\n\nLullaby for a Dragon (Ryuu no Moriuta)\nThe dragon child Kito and the priestess Shuen await the day Kito becomes the Heavenly Dragon.\n\n\nThe Snowscape’s Emblem (Ginsekai no Shoumei)\nAlza lives alone on a desolate snowy plain. One day, Leah, a sorcerer from the magical city collapses near his house. Alza forbids Leah from using magic in his presence and shows her how beautiful life can be outside of the magical world. But, why does Alza hate magic, how did Leah get outside the magical city, and what will happen when Leah returns home?\n\n\nThe Brush of a Fairy Tale (Otogibanashi no Fude)\nAt a far away village, there’s a sacred tree where the Water God dwells. It’s Sasara Yuukei’s task to trace the fading letters of the contract between the Water God and the people of the village. One day, while carrying out his task, he suddenly met the Water God herself! And gradually, he found out that what he’s been doing every day is actually…"},{"name":" YuruYuri - Akari Explode! (Doujinshi)","avatar":"https://mangadex.org/covers/90a75dda-04c1-47f2-99cb-3f6928ae21cb/c6f181f0-a7fe-4448-aaae-439c8ec1618b.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Romance,Comedy,Girls' Love"],"nutshell":""},{"name":" Perpltxed Doodles","avatar":"https://mangadex.org/covers/90aa1944-a568-436c-a16b-ddf0031e8d8a/1f3a2213-96fb-47d1-8109-63ac90649008.png.256.jpg","country":"English","stat":"7.51","status":"Ongoing","tags":["Long Strip,User Created,Web Comic,Full Color"],"nutshell":"A series of weird single page doodles created by a wannabe comic artist."},{"name":" Kyou Kara Kazoku, Soshite Koibito","avatar":"https://mangadex.org/covers/90ace779-1e8c-498d-ae79-e90c02ef1cdc/9fcff3da-2a57-48d9-bcfc-dae0237468ea.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Romance,Drama,Slice of Life"],"nutshell":"Taka, yang kehilangan orang tuanya dalam kecelakaan mendadak, dan Hina, yang tinggal bersama kakeknya, pingsan. Dua orang yang tidak dekat satu sama lain akan hidup bersama. Pada malam membersihkan rumah, Hina melihat Taka menangis sendirian dan bertanya apakah dia bisa tidur di futon yang sama"},{"name":" Cotton Candy & Daydreamer","avatar":"https://mangadex.org/covers/90afa622-d4ce-4f2e-9fa4-3322b753fabe/e11d933c-6d5c-4724-82f0-64cd1545be70.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.96","status":"Ongoing","tags":["Sci-Fi,Long Strip,Romance,Drama,Police,Web Comic,Slice of Life,Full Color"],"nutshell":"It was late at night. Bai Yimeng the drama actress went to a ramen restaurant for dinner after a toilsome rehearsal. At that time the news about Wu Suowei was being broadcast on television. All guests present took strong interest in this star of the police force and talked about him. What everyone didn’t know was, Wu Suowei himself was drinking beer in silence alongside Bai Yimeng. Just a story about solving a case, Oh No! This is where the romance begins."},{"name":" Kuroko no Basket - Kise-kun Nemui Desu (Doujinshi)","avatar":"https://mangadex.org/covers/90b352e6-5a17-4a79-aacb-66e2d3c2117b/8de7dac4-f63c-4d6a-8ae9-787f598850f1.png.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Oneshot,Boys' Love"],"nutshell":"Pairing: Kise x Kuroko"},{"name":" Valentine's Day Yuri","avatar":"https://mangadex.org/covers/90b39d4b-847e-4c1d-bb40-4e42985191a4/f6c7914d-20f8-46a3-9638-ae2e21528e80.png.256.jpg","country":"Japanese","stat":"7.42","status":"Completed","tags":["Oneshot,Girls' Love,Full Color"],"nutshell":""},{"name":" Drump","avatar":"https://mangadex.org/covers/90b4ac2b-77ea-4a61-a97d-3f6417bd7dfa/62e84d21-a28e-4147-8a26-ec5acc29bff1.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Oneshot,Fantasy"],"nutshell":"A brand new card-game one-shot, written by Kazuki Takahashi - Yugi!Oh's author"},{"name":" Nukoduke!","avatar":"https://mangadex.org/covers/90b88312-18b2-4a87-99fd-ccca64288e7b/2030c2c1-ccb1-45e5-8fcf-dd0daedb1d04.jpg.256.jpg","country":"Japanese","stat":"8.81","status":"Ongoing","tags":["Comedy,Drama,Slice of Life,Supernatural"],"nutshell":"A heartwarming story about the daily lives of a freeter named Yuuya and his two little pets.\nNote: Chapters follow the Tankouban (book) order and numbering. The chapter number in (Ex Ch. No.) specifies the original chapter number (when first released on HanaLala Online & MangaPark) before the chapters were compiled into the book.\nWikipedia"},{"name":" Honky-Tonk Hustlers","avatar":"https://mangadex.org/covers/90b9ae43-4acd-4bdb-aa55-e519aca9c606/26ca627b-9309-4c7f-9bc2-353209aee151.jpg.256.jpg","country":"English","stat":"7.97","status":"Hiatus","tags":["Action,Adventure,Drama,Music"],"nutshell":"The modern vibe of hip-hop culture merges with the timeless aesthetic of the 1920's in a brand new webcomic about ambition. Inspired by the unique sound of Japanese electronic-swing rap, HonkyTonk Hustlers tells the story of two men from completely different worlds, taking on the big city and it's music market in the midst of the Great Prohibition of Rap Music in the 1920's era. Set in an alternate universe, the history of our world is irrelevant- however, the musical history of the past manifests itself in it's own ways\nJin, a hard-working country boy born to overseas immigrants, has known nothing but honesty and dedication his entire life. Raymond, the wealthy heir to a politician, finds himself penniless after a mysterious fire destroys his peaceful existence. The lives of these two men collide in the most electrifying of ways- right in the heart of the big city of Neumoney.\nHAVE YOU EVER DEVOTED YOURSELF TO ANYTHING?\nThen follow us."},{"name":" Jinzou Ningen 100 (Pre-Serialization)","avatar":"https://mangadex.org/covers/90c12eeb-af02-43d4-aafd-d9aa5aafcaba/9113ffba-876b-4ea7-a018-08ca1505f957.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Award Winning,Zombies,Mystery"],"nutshell":"An award winning Oneshot in the 15th Golden Future Cup and featured in Shonen Jump issue 46, 2022.\nFully serialized in Shonen Jump issue 1, 2023."},{"name":" SHWD << Pseudo>>","avatar":"https://mangadex.org/covers/90c15eec-393e-4099-a38c-0851f626cb85/fe5d5119-0b40-4cd8-97fc-1938194a9a47.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Sci-Fi,Monsters,Action,Romance,Office Workers,Girls' Love,Drama,Web Comic,Supernatural,Mystery"],"nutshell":"Manga serialization of the doujinshi work with the same name."},{"name":" Treasure Hunter","avatar":"https://mangadex.org/covers/90c54641-756e-4eeb-8c9f-b0e424cca6db/cdbaaa34-b3f4-4d5e-ad9e-5664d7cbd24f.jpg.256.jpg","country":"Korean","stat":"7.84","status":"Completed","tags":["Action,Long Strip,Comedy,Adventure,Fantasy,Supernatural"],"nutshell":"Kim Jinho and Heo Chundo are trying to find ways to spend their lazy summer days. Suddenly, two women appear before them with a job proposition for them. Details? None, except that they will be \"treasure hunting.\" With nothing better to do–and no other choice available to them–they are forced to accept. And so begins their journey of exploration, adventure, gags, dungeons, magic items, and guardian beasts."},{"name":" Dog's Love Way","avatar":"https://mangadex.org/covers/90d169e6-5415-49b4-9112-38eadd85bb2f/d8dee9a6-2c61-4ad4-b2f8-011d3ae4b511.jpg.256.jpg","country":"Korean","stat":"8.10","status":"Ongoing","tags":["Animals,Long Strip,Romance,Boys' Love,Office Workers,Drama,Web Comic,Full Color"],"nutshell":"The sweet office romance unfolds in a world that has been animalized ♡\nDaeun, who works as usual, hears the rumor that an employee from another company will come, and that they will carry out a project together. The employee who attracted the attention of people in the company with his handsome looks, was none other than Daeun's long-time unrequited love, Junhyuk. Can Daeun capture Jun-hyuk now that they met again?"},{"name":" Money Virus","avatar":"https://mangadex.org/covers/90d4370e-d4ac-403c-8dd9-bf17e07be7a2/0dc3f973-92fa-4d1d-bd35-9c94872692bf.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Romance,Comedy,School Life"],"nutshell":"Eun Band Wool, a girl who would do anything to earn money meets Choi Tae Won an arrogant, handsome school president. Why is Eun Band Wool desperate for earning money?"},{"name":" Matataki suru Tabi, Koi o Suru","avatar":"https://mangadex.org/covers/90d4c5a1-a52e-4193-8bad-1c616b3c35ba/2a77f8f4-582b-4271-ab8e-d1617de55328.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance"],"nutshell":"Ao moved from Tokyo to the country. She's not used to rural life, and leads a boring school life.\nShe's collapsed often from a headache, and each day is filled with troublesome things…\nThen there is Araya-sensei, who encourages Ao's true intentions. After meeting sensei, slowly she is fitting in. But even so, do you know that Ao's mind withering away?"},{"name":" I Can’t Believe You’re Hard! The Fierce Gay Man and the Virgin With Low Self-Esteem","avatar":"https://mangadex.org/covers/90d58688-db80-4229-83cb-2b44ad26ee74/6dd48e70-76f4-4102-a0ed-9fa5ff716d40.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance"],"nutshell":"It's because he sucks and squeezes my boobs...no, no, no! Yuki, who has zero experience with men, falls in love for the first time in her life with her senior at work, Kashiwagi. One day, Yuki happens to witness the scene of Kashiwagi's love affair. What's more, the other guy is a man! No way, Kashiwagi-senpai is a onee-san! Yuki, who still can't give up her feelings for Kashiwagi, offers Kashiwagi a certain condition, and they go beyond \"love\" and have a very sexual relationship..."},{"name":" Dragon King Awakening","avatar":"https://mangadex.org/covers/90d71522-0c0d-46b3-a92d-0f0016c0374f/1438fb3b-762d-4352-8b85-56a7f844f730.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.72","status":"Ongoing","tags":["Action,Martial Arts,Fantasy"],"nutshell":"During a time of war, I pretended to be a girl in order to recieve a better life. In the end however, I was simply tricked into being a sacrifice to appease the local river god! Though who would have thought that as I lost all hope that I'd live after being thrown into the river, that I would inherit the powers of the water god! The rise of the dark forces, the return of the ancient demon gods, see how Yang Shou is able to use his newfound power to save the world!"},{"name":" Nier: Automata - Awakening of 9S (Doujinshi)","avatar":"https://mangadex.org/covers/90da6e38-3844-46d9-bec2-a7d621c8519d/e933dc88-c41e-466a-a8f5-1fec0f0dd015.jpg.256.jpg","country":"Japanese","stat":"8.30","status":"Completed","tags":["Oneshot,Video Games,Slice of Life"],"nutshell":"Artist’s Twitter"},{"name":" Karneval","avatar":"https://mangadex.org/covers/90e418d5-9204-454b-92c7-8b9840db739e/d04e4ac5-4edb-4b18-8409-a3a568b94567.jpg.256.jpg","country":"Japanese","stat":"8.31","status":"Completed","tags":["Action,Fantasy,Supernatural,Mystery"],"nutshell":"While in search of his precious friend, a young boy named Nai falls captive to a beautiful woman, whose looks are matched only by her taste for human flesh. Meanwhile Gareki, a clever thief, is in the midst of robbing her luxurious home. After causing a distraction, Gareki agrees to help Nai escape, but they are discovered upon the woman's return. As she transforms into a ghoulish monster, the boys flee.\nOn the run, Nai and Gareki are found by \"Circus,\" a government defense agency that deals with criminal activity too difficult for the police to handle and protects civilians from \"varuga\"—terrible monsters that devour humans for sustenance. In the hope that it will lead Nai to his missing friend, he and Gareki decide to join Circus. On their perilous journey, they face dangerous varuga and begin to uncover the secrets behind a shadowy organization known as Kafka."},{"name":" Taking Photos","avatar":"https://mangadex.org/covers/90e4d3f4-4694-4b9b-a623-298d722e47e3/ec4b354e-77df-4c2b-833e-2524f0b0a6d8.png.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Oneshot,Romance,Girls' Love,Slice of Life"],"nutshell":"A short Bandori doujin with Misaki and Kokoro.\nArtist's Twitter: https://twitter.com/chiharu389\nArtist's Pixiv: https://www.pixiv.net/en/users/3418020\nOriginal Post: https://twitter.com/chiharu389/status/1302179342231904257"},{"name":" Wolf's Kiss","avatar":"https://mangadex.org/covers/90e7b3d4-243c-43b9-971f-f245cd50f7ba/bd81a8d8-a245-4337-84d4-51fb75636cb0.png.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"Ye Xun, an editor, unwittingly kissed Lu Yao who is a popular actor, making their lives complicated\nBut Lu Yao has a curse on him that no one must know which resulted in giving Ye Xun wolf ears\nThey pretend to be a couple for the camera, but romantic interactions make their situation worse"},{"name":" My Bad Younger Man","avatar":"https://mangadex.org/covers/90edb7ef-a812-48e4-bc72-164f703f2027/1e406e13-3a9d-432d-a8cc-a3740c40f902.png.256.jpg","country":"Korean","stat":"8.05","status":"Ongoing","tags":["Romance,Comedy,Drama,Adaptation,Full Color"],"nutshell":"When Sol receives an engagement party invitation from Minji, the girl who stole her first love, she's determined to attend just to prove how great she’s doing. But she needs to find a hot boyfriend first, when her dating life's been nonexistent! The only viable candidate she can find is her younger brother’s friend, Joohyuk, who has had a major glow-up since his scrawny teenage years. “I’m not a little kid anymore. You’d better watch out.” The tall, sexy Joohyuk seems like trouble…but desperate times call for desperate measures. As long as she can see Minji’s jaw drop in shock, Sol is willing to put up with his demands. Little does she know that Joohyuk is actually out to get her for ruining his life in high school! Will Sol be able to make this rocky partnership work in her favor, or will the plan backfire on her?"},{"name":" HOLY avenger","avatar":"https://mangadex.org/covers/90f33e13-6bfc-485b-9759-3963429174d1/ab0f7976-cada-4eeb-b18e-3aa0ed842815.png.256.jpg","country":"Portuguese (Br)","stat":"7.99","status":"Completed","tags":["Award Winning,Official Colored,Monsters,Action,Comedy,Adventure,Magic,Fantasy"],"nutshell":"Lisandra is a charming and innocent druid that can speak with animals and have magical healing powers, goes to Valkaria, the largest metropolis of Arton, in search of the famous adventurer Galtran. She needed his help to steal one of the Rubies of Virtue, to bring \"someone\" back to life. The resurrection candidate in question, however, was the Paladin, this world's greatest hero, who was unconscious in a cave and needed those magic stones embedded in his armor to fight evil again."},{"name":" Kingdom Hearts: Chain of Memories","avatar":"https://mangadex.org/covers/90f33e51-c6e9-4d8f-8f6d-a461b954ac0a/a7aa5152-8b87-4b10-99e4-0c88f553848f.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Thriller,Monsters,Action,Demons,Animals,Comedy,Adventure,Video Games,Magic,Drama,Fantasy,Slice of Life,Supernatural,Mystery,Adaptation,Tragedy"],"nutshell":"The door to Kingdom Hearts was sealed, dealing a blow to the heartless and restoring the worlds to normal, but Riku and King Mickey were trapped inside! Now Sora, Donald, and Goofy's search for their friends leads them to the mysterious Castle Oblivion, where a hooded figure tells them, \"Ahead lies something you need, but to claim it, you must lose something dear.\" What could be more dear than their very memories themselves? And what do the shadowy members of Organization XIII want with them?"},{"name":" Tread Lightly on Thawing Ice","avatar":"https://mangadex.org/covers/90f794a0-9ddd-4e8a-a0ff-f632665aca07/47d48e2e-fc3e-41ba-8b66-f975e1433ab1.jpg.256.jpg","country":"Korean","stat":"7.84","status":"Ongoing","tags":["Historical,Long Strip,Romance,Boys' Love,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"Ye Kang-Oh is nothing short of royalty in the world of Jianghu. He is the third and youngest disciple of Ye Jin-Rang, the very man who rules over the entire Black Force of Jianghu. Despite being Jin-Rang's favorite disciple and owning promising skills, Kang-Oh intentionally keeps a low profile to keep distance from politics over which disciple will inherit his master's position. One day, Kang-Oh is mysteriously attracted to a humble servant named Woo (Foolishness). Not knowing that their destinies have been tied together since long time ago, Kang-Oh cannot help but continue to get intrigued by this mysterious servant...\nWoo is a servant serving Jin-Rang, master of the entire black force of Jianghu. Despite being known as a fair man, Jin-Rang seems to intentionally neglect Woo getting harassed for years by officials of the Black Force. Woo seems to accept such inhumane treatment as his own fate. One day, Woo unintentionally attracts the attention of Kang-Oh, Jin-Rang's youngest and favorite disciple. Woo tries his best to evade Kang-Oh's kindness but at the same time finds it hard to repel the attention of the man he has missed for so long... ever since Kang-Oh was a little boy and Jin-Rang was known as Dan Woo-hyo, the most powerful swordsman in the entire White Force."},{"name":" Danganronpa - Forget Me Not Zero (Doujinshi)","avatar":"https://mangadex.org/covers/90f89a75-a6e7-468c-9b5c-bba34fa381e0/dca1525d-31af-4942-b317-17d33c91a2da.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Psychological,Romance,Drama"],"nutshell":"A Doujin containing 3 tales about the main characters of Danganronpa/Zero and there relationship."},{"name":" Oneshot","avatar":"https://mangadex.org/covers/90fb0403-7df4-4c85-8969-77abf46be546/338166b0-1ca3-4dfb-9f80-d39306e1fca0.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Oneshot,Boys' Love"],"nutshell":""},{"name":" Sekai wo Sukutta Eiyuu o Sodateta Saikyou Yogensha wa, Boukensha ni Natte mo Sekaijuu no Deshi kara Shitawarete Masu","avatar":"https://mangadex.org/covers/91035716-0ad6-4cd7-8847-d11a118ae35a/1fdabd32-8c1d-4517-a017-b5f4d24bc9c8.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Ongoing","tags":["Action,Comedy,Adventure,Fantasy"],"nutshell":"The sequel to \"The Greatest Prophet who Nurtured 100 Heroes, Even if He Becomes an Adventurer, His Disciples Throughout the World will still Yearn for Him\", which became extremely popular in both the Novel and the Manga is now available in Yawaraka Spirits with a newly written original story!\nEnjoy to the fullest the new journey of the beloved, adored, and dependable adventurer Eisen Otis!"},{"name":" Cat & Master Dog","avatar":"https://mangadex.org/covers/910502a9-b147-4dea-86d7-18ee899b3ebc/c00f6cab-5c77-4c25-a134-2634dcb51ebc.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Oneshot,Action,Romance,Comedy,Boys' Love,Police,Slice of Life"],"nutshell":"The grandson of a commissioner absconds and forces a police officer to take him in."},{"name":" Who Am I? (Anthology)","avatar":"https://mangadex.org/covers/91069df8-f3d4-4a0e-90c2-5a13bf5e120f/b0abc3de-bb2a-4c44-8bda-c5b8d1c92bf6.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Oneshot,Anthology,Boys' Love"],"nutshell":"CONTENTS:\nSeason1\n「After a year and a half」Pii\n「やっかいな友だちたち」Yoha\n「丸ちゃんと俺のはなし」Katashina\n「猪爪家の幸せ家族計画」」KABANO Sakadachi\n「4年後のクリスマス」Moriyo\n「あばれんぼハニー～愛の結晶編～」TOBIDASE Kevin\nSeason2\n「久藤さんちの息子さん」Sachimo\n「堤家の幸せ家族計画…？」KABANO Sakadachi\n「マイペースマイハニー」TOBIDASE Kevin\n「そのあとの、またそのあとの」AZUMI Tsuna\n「『怪盗アンナ』と『うみと愉快な仲間たち』」SATOMARU Mami\n「キミのことをおしえて」SANEMORI Tabane\n「大切な時間 / Precious Time」ICHIKAWA Ichi\nSeason3\n「たまには」Moriyo\n「これから、」YAREYA Umako\n「首輪をちょうだい 」Toube\n「なみだ枯れるな－それから－」ANDO Romeda\n「痕からはじまる」AKIMOTO Yoshi\n「僕たち○○します。」Hachisu\n「オチはだいたい単純」Omaru"},{"name":" Have You Heard the Rumors About Mizuki?","avatar":"https://mangadex.org/covers/9108cd58-5da6-4f03-b94d-29951b4d8d9b/9c05d5b9-0673-4b2b-b630-e49c9d96590c.jpg.256.jpg","country":"English","stat":"7.56","status":"Ongoing","tags":["Long Strip,Romance,Comedy,User Created,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"Have You Heard the Rumors about Mizuki? Read this webtoon to know more about Mizuki."}]