[{"name":" The Prince of the Afterschool","avatar":"https://mangadex.org/covers/27e62003-e44a-4271-93da-c808e497791e/495337dd-ccda-4bc9-9ef4-976364284df8.png.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Comedy,Sports,4-Koma,School Life,Slice of Life"],"nutshell":"A parody of the popular Prince of Tennis series, it chronicles the daily school life of various characters.\nWritten by Sakura Kenichi and based on characters by Konomi Takeshi."},{"name":" Two Saints Wander off Into a Different World","avatar":"https://mangadex.org/covers/27ea199f-a993-4a0a-a571-cb254bed72af/145d8022-1db8-47cc-87a8-1a4b366d4089.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Ongoing","tags":["Action,Romance,Comedy,Adventure,Isekai,Fantasy,Adaptation"],"nutshell":"Chiharu and Maki have worked at the same company together for three years. They were both unceremoniously dumped this spring. As they were drowning their sorrows with sake, they were both summoned to another world. They were given the very simple job of cleansing miasma.\nWell, there's no way around it. Thus they begin their quest for alcohol, delicious food, and if possible, a faithful boyfriend.\n\n\nOriginal Web Novel"},{"name":" Koi no Material","avatar":"https://mangadex.org/covers/27f0b690-d77f-4c68-83c4-b67dca56c53e/ebd37e60-53df-4e3d-9347-01913ff62e66.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,Boys' Love,Supernatural"],"nutshell":""},{"name":" Darenimo Ienai!","avatar":"https://mangadex.org/covers/27fc5273-f856-4079-9449-fcbdbfed7cb6/c841524c-6173-4488-af4f-21feb9ec7237.jpg.256.jpg","country":"Japanese","stat":"7.69","status":"Completed","tags":["Oneshot,Romance,Crossdressing"],"nutshell":"Akane has a crush on the princely Yuu, but when she finds out he's living with super attractive Kei, she makes a deal with the other girl to move out of Yuu's house. But Kei insists on moving in with Akane, and is now running her ragged with demands! Will Akane get any chance with Yuu or will all her time be spent with Kei?"},{"name":" Stranger","avatar":"https://mangadex.org/covers/2803b664-f047-48e7-a4e1-6bc27836e604/4d23dd7b-7404-4985-96bc-f557d83f7f78.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Sci-Fi,Action,Animals,Romance,Survival,Adventure,Philosophical,Drama,Aliens,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nA college boy, Ari Yamato, is dragged into a giant ant hill in the Tottori Sand Dunes. He is saved by an old man, Jari, and a young lady, Lilith, and wakes up to find that he is not on Earth, but on an underground world on Mars where insects rule. However, it is not the Earth, but an underground world on Mars ruled by insect men. After pretending to be controlled by the attacking insect people, Ari and his friends are taken to a building that looks like ruins. There, they discovered a time-space transfer device. They activate the device on Jari and travel through space with Lilith. ......!?"},{"name":" Far Away From Eden","avatar":"https://mangadex.org/covers/280a69cb-4cd4-4246-ba97-f47deb145dcf/6f6e4229-5419-4b6a-969f-152b21ba91fe.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Boys' Love"],"nutshell":"This is only a partial of the artbook which numbers about 100++ pages in total."},{"name":" Dr. Kiriko - The White Shinigami","avatar":"https://mangadex.org/covers/280cfda5-15f3-4495-a841-bce03c8087c1/513e6f28-892b-44ec-9f59-65ad5bcbe0f3.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Action,Drama,Medical"],"nutshell":"The story centres on Kiriko, Black Jack's nemesis who specializes in euthanasia form the Author of BM: Nectar and El El and Artist of Houkou! Shimazu Juuji"},{"name":" Amuro and I","avatar":"https://mangadex.org/covers/280e8370-c95b-4516-b049-5fc677e59037/07ff472a-0e1c-47fd-95e9-6d8f290aa30d.png.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Slice of Life"],"nutshell":"A manga centered on Osamu Wakai's childhood and his love for the Gundam franchise."},{"name":" Kagome","avatar":"https://mangadex.org/covers/281bb6a5-0aee-4cb4-ac39-dbdcd7dbe3fc/23348b22-1faf-4842-9ceb-8962f108ea87.png.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Oneshot,Psychological,Boys' Love"],"nutshell":"When a young master's father unexpectedly passes away, he knew he wouldn't be free from the madness his father left behind. His father's eccentric tastes led him to buy and raise his very own lover and now that he has died his father's lover is to be his responsibility. Old wounds are torn open and the painful past resurface once again."},{"name":" Kamakura Monogatari","avatar":"https://mangadex.org/covers/28238fa4-0450-4224-af72-64333e71dc08/84b18743-16e0-410c-878a-246da35537a0.png.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Thriller,Monsters,Demons,Ghosts,Romance,Comedy,Drama,Horror,Police,Slice of Life,Supernatural,Mystery"],"nutshell":"Isshiki Masakazu, a mystery writer living in Kamakura, is also a skilled detective. Together with his wife Akiko, he interacts with the demons, spirits, gods, buddhas, and aliens of Kamakura. His acquaintances and friends range from affiliates of the Police to mysterious animals. Adults and children will enjoy this work of mystery as he solves difficult and strange cases with a variety of characters as his side."},{"name":" The Forest of Wool and Steel","avatar":"https://mangadex.org/covers/2825798c-5c32-458b-959b-ac8f5c4ab434/54ae0b4b-6f24-46eb-8125-043847547e30.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["School Life,Slice of Life,Adaptation,Music"],"nutshell":"A high school student meets a piano tuner and seeks to become one himself.\nAdaptation from a novel."},{"name":" Eyeshield 21 - Midsummer Miracle (Doujinshi)","avatar":"https://mangadex.org/covers/282a8dd3-ff00-4a81-86b0-8c9ac4271bdb/13e4896d-2285-4a70-b8d5-72ee9ea57329.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Comedy"],"nutshell":"An Eyeshield 21 gag anthology."},{"name":" Amaenaideyo!! R","avatar":"https://mangadex.org/covers/282bbbb2-3e67-4fdd-81ea-c0dae4142334/77117c56-7000-4ff4-a57e-50723659c606.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Comedy,Harem,Supernatural"],"nutshell":""},{"name":" Flowers Find a Way to Bloom","avatar":"https://mangadex.org/covers/283a7d01-1379-4406-a66e-88c7284cc407/ae2e61e0-1cd0-4b0b-8012-2a6994262777.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Reincarnation,Historical,Long Strip,Boys' Love,Martial Arts,Web Comic,Full Color"],"nutshell":"The second son of the martial arts family, Nan Gongruan, was a concubine child who had a weak body. He hadn't been able to understand the healthy body of Bai Mulan since he was a child, and tortured him in every possible way. In an accident, Nangong Ruan traveled 10 years to the past, and his soul actually entered the body of Bai Mulan, who he found extremely disgusting! Although he now has a healthy body, he had to face the bullying from \"Nangong Ruan\" and regretted his actions. 10 years later, everything was reverted back to its original state, can Nan Gongruan be able to regain a new life?"},{"name":" Galaxy Express 999 Another Story: Ultimate Journey","avatar":"https://mangadex.org/covers/283f8818-43c4-4c1d-9b9e-52a2529414f7/5b921072-626a-471e-8bcd-9202080a7362.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Sci-Fi,Adventure,Philosophical,Drama,Fantasy"],"nutshell":"Galaxy Express 999 Another Story: Ultimate Journey is a retelling of the original manga. The story of the manga follows a young orphan named Tetsuro as he travels with a mysterious woman named Maetel through the galaxy on a space train, in the hopes of obtaining a cybernetic body. The train stops at many planets along the way, often leading to adventures for the two."},{"name":" Wolf Girl and Black Prince","avatar":"https://mangadex.org/covers/28425868-a1bf-4eda-be9c-3ad77ec37649/122fdc8b-4ed5-45d7-a54e-286bcad443bc.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"Erika lied to her friends about having a boyfriend by showing a picture of an anonymous guy who turned out to be a schoolmate of hers and was shortly recognized by her friends. Their conversations then was overheard by the guy, Sata Kyouya. Erika went to explain and proposed her idea of faking as lovers. However, Sata who gave off the nice-charming feelings guy turns out to be a black prince and used her reasons to blackmail her instead.\nIncluded one-shots:\nVolume 2: Junketsu Lullaby\nVolume 3: Pierrot ja Nee yo\nVolume 8: Kamatte-chan de Gomenasai!!\nVolume 11: Kimi wo Suki ni Natta Riyuu (The Reason I Love You)"},{"name":" THE iDOLM@STER - Sadness, Hello (Doujinshi)","avatar":"https://mangadex.org/covers/2847472c-e4f0-4280-8b13-06cba7d4bb7f/467d63cb-b296-428c-8f0b-3c148db3f5a3.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance"],"nutshell":""},{"name":" Hai ni Mabataki","avatar":"https://mangadex.org/covers/2848e436-78d2-4031-9124-9d4c3592a75c/8f9b7651-d0cf-4dab-9127-f66efd645cf2.png.256.jpg","country":"Japanese","stat":"8.01","status":"Hiatus","tags":["Boys' Love,Drama,Slice of Life"],"nutshell":"When city slicker Aida Torajirou suddenly collapses on the side of a country road due to a heat stroke, he's rescued by the son of a local hair salon owner. With nearly unknown background information, apart from being from Tokyo, the young man doesn't want his father to call the police on the stranger; but instead, the salon owner takes interest in Tora-san and offers him a job."},{"name":" Re-Blooming","avatar":"https://mangadex.org/covers/284c1452-cddf-4fd0-b12e-272100608b4d/7d9ae101-45a4-41c8-b2d7-e79723f58c70.jpg.256.jpg","country":"Korean","stat":"8.06","status":"Ongoing","tags":["Long Strip,Girls' Love,Drama,Web Comic,Slice of Life,Full Color"],"nutshell":"Dinner with friends takes a turn when Yeonji’s coldhearted college ex shows up. After all those years, Ava wants to try again… and to date like they used to. Should Yeonji give it a second chance, when all Ava did was leave her broken and humiliated? And why is Ava reaching out now, just as their old college friend, Mojoo, has returned from abroad? The timing’s peculiar, but something’s different about Ava. Will the two rekindle a broken love? Or will dark secrets of the past stand in their way?\n\n\nOfficial Simplified Chinese Translation"},{"name":" Ichigo to Anzu","avatar":"https://mangadex.org/covers/28501b32-5d9f-4926-a484-ca775a2b063b/b8f6db36-d5d9-4734-a497-cacf8f7928d5.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,School Life,Slice of Life,Supernatural"],"nutshell":"Identical twins–and they couldn't be more different. Friendly outgoing Anzu is in love with Makoto, but can't work up the nerve to confess. Shy withdrawn Ichigo (the one with the glasses) was a stalking victim and now hates men. But they're going to need each other to cope with a huge change in their lives. Their mother has remarried and the twins discover they've gained a brother as well; clever and carefree Kenta. And Kenta (with Makoto) has a plan to help Ichigo–just make the twins trade identities!"},{"name":" When I Woke Up with Amnesia, I Had a Girlfriend","avatar":"https://mangadex.org/covers/285c4ff6-1d28-4d1f-958e-b896d1fc3047/dfebedb2-dfea-4ec5-8f6e-b6502eeee774.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Romance,School Life,Web Comic,Slice of Life"],"nutshell":""},{"name":" Danshi Kinshitsu!!","avatar":"https://mangadex.org/covers/285f612f-d71a-4e7d-8ed6-4bc3ed3b4a91/b71b4c7b-8a03-4218-98cb-a65cbbb41b93.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Comedy,Crossdressing,School Life"],"nutshell":"For all of Mao's life, she has longed to be girly and have tea parties with beautiful girlfriends. And finally, she has that dream right in her reach, until she walks in on three boys changing at her private all girls school… What's a girl to do when another girl she admired turns out to be a guy?!"},{"name":" Kannou Sensei","avatar":"https://mangadex.org/covers/2862555d-a54b-4ece-92a0-aabfaaa472ae/7561ca3c-dae5-4f8a-8b85-1122bbb38a45.jpg.256.jpg","country":"Japanese","stat":"8.68","status":"Ongoing","tags":["Romance,Drama,Slice of Life"],"nutshell":"Narumi Rokurou is still adrift in life in his forties, unmarried, and working as an editor at a publishing company while writing hardly lucrative literary fiction. His days enjoying life at his own pace are brought to an end one summer night, when a strange twist of fate brings Rokurou together with a mysterious beauty, beginning the story of their crazed love.\nAs once was spoken by Zarathustra: \"Everything in a woman is a riddle.\""},{"name":" Senketsu Oujo, Minna Korosu","avatar":"https://mangadex.org/covers/2864b22b-7268-4335-909c-6a847cb2fd1d/3c3f880b-246f-4437-be09-f48ae46efe3a.jpg.256.jpg","country":"Japanese","stat":"8.31","status":"Ongoing","tags":["Action,Girls' Love,Fantasy,Adaptation,Tragedy"],"nutshell":"Mary, a failure princess, cannot use magic.\nA political marriage has been arranged for her..\nFinally, she's useful as a member of the royal family――Mary thinks positively. However, she's arrested at the fiancé's unveiling party for ridiculous crimes and sentenced to execution.\nBetrayed by her parents and even her brother, Mary flees with her older sister, the only ally she has.\nHowever, she's unable to escape and has been killed along with her sister by the most powerful magician, the \"Arcana User\".\nHowever, at the edge of death, Mary's power awakens.\nThe power she gained was the Arcana of \"The Death\", which allows her to eat corpses and strengthen herself.\nWith this ability in hand, Mary decides to take revenge on all those who killed her sister.\nBased on a web novel by Kiki."},{"name":" Precious girl does not shed tears","avatar":"https://mangadex.org/covers/2866b6f0-4570-4d29-8f36-023237f4a9f9/f41e0ccd-6095-4a65-ba76-6f38561fcb13.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Thriller,Historical,Psychological,Crime,Isekai,Mystery,Full Color,Tragedy"],"nutshell":"This is a story about the life of a “girl with jewels”, trapped in a death trap. Ingrid, crying beautiful precious tears, is abused, to ensure the prosperity of her family. In the end, she was killed, because “tears of death are the most powerful gems”. But the power of the last jewel turns back time for her. During the period of her return, she was repeatedly killed until she was told, “Die for my happiness, you hate me, sister. Ingrid discovers that she is being killed because of her sister's selfishness, and says: “I don't want any more unwanted tears”... using the true power of the gemstone, Ingrid enters her final reincarnation."},{"name":" Gakkou no Sensei","avatar":"https://mangadex.org/covers/28672d1b-ee4a-46ef-a8b6-54240682fb15/4fdac570-1665-4888-a7f6-24b37ec293f1.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,School Life"],"nutshell":"Sakura, Akane, and Yuriko have been friends ever since they met in high school. They all wanted to become teachers and now that they've grown up somehow agreed on living together. The story depicts their lives as teachers."},{"name":" Shoujo Fight","avatar":"https://mangadex.org/covers/286da3e0-4981-42b1-9f8f-c59a7e91d3de/26efc14c-484c-4e8f-9306-94db49c24840.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Ongoing","tags":["Sports,Drama,School Life,Tragedy"],"nutshell":"The story follows the women's volleyball team from a certain high school, especially one girl's fight to become the best."},{"name":" Ohime-sama Navigation","avatar":"https://mangadex.org/covers/28701466-2838-40c2-9e6e-1b8cd8ee9288/9a2e63d0-1746-4653-b847-ce3970063413.png.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Action,Adventure,Fantasy"],"nutshell":"Three girls are the only members of the Fortune Telling department at Sakumigaura School where they each pursue their own style of tapping into their energy to find answers. Hoshikawa Crystal uses her crystal ball while Nano Kari uses meditation and chi and Kaguyama Hime uses ancient spirits. The three are always together helping each other hone their abilities, but they never forget to have a great time."},{"name":" Captain Tsubasa (Weekly Shonen Jump 40th Anniversary)","avatar":"https://mangadex.org/covers/2874635c-54c8-43a3-ad46-b901ce6714af/31da4eb9-3765-4448-b435-9d9b461a353a.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Oneshot,Thriller,Sports,School Life,Fantasy,Slice of Life"],"nutshell":"A special oneshot story of Captain Tsubasa as part of the celebration of the 40th anniversary of the magazine Weekly Shonen Jump. This story occurs between the end of the juveniles soccer championship and the middle school soccer tournament of the original Captain Tsubasa series. Tsubasa is depressed after Roberto left him behind and his friends Genzo and Taro are going overseas. In order to cheer him up, his friends organize a friendly match with all his rivals from the juveniles soccer championship."},{"name":" Negai Kanae Tamae","avatar":"https://mangadex.org/covers/2874a302-600c-467d-b869-7dceb13c6fe1/21e35781-5117-4e64-8eab-ec005ff526a4.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Action,Psychological,Boys' Love,Mafia,Drama,Music"],"nutshell":"Kinukawa Yuusuke is a second-class pianist who earns a living by playing in small clubs. Things become complicated when Fukami, a yakuza boss with mesmerizing looks, becomes a regular at Yuusuke's piano bar. As Fukami's appreciation for Yuusuke's piano playing grows, so do Yuusuke's feelings for him. Although Yuusuke knows he shouldn't be attracted to such a dangerous man, he finds himself unable to stop thinking about Fukami. And so, one night in a desperate attempt to get Fukami's attention on something other than music, Yuusuke spills a drink on him…"},{"name":" Cantarella ~Ao no Dokuyaku~","avatar":"https://mangadex.org/covers/28775d39-989e-4216-9adb-2a2327b45afd/0fb08f73-ece7-4aa9-8a25-059a586cbb8e.jpg.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Historical,Romance"],"nutshell":"Based on Kurousa-P's popular Vocaloid song Cantarella.\nCesare (KAITO) is the first born son of the House of Borgia, while Lucrezia (Hatsune Miku) is his younger sister. One day, Cesare receives a poison from his father that has been handed down in the family called, \"Cantarella\".\nThe House of Borgia gained prosperity in the 15th century Rome. Cesare, who is in line as the next head of the family, has a sister who he has never met. Her name is Lucrezia. The story unfolds after the moment the two first meet…"},{"name":" A Sadic Civilian's Gangster","avatar":"https://mangadex.org/covers/287b2c6f-1a56-43b6-9c0c-d11758ca5c2b/b88d0dc5-8c9d-4670-82e0-3c305bd9e00c.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot,Boys' Love"],"nutshell":""}]