[{"name":" Capella no Genkou","avatar":"https://mangadex.org/covers/6499da23-d7b4-47df-a39f-80f4068c59df/4fa9e1e2-f864-4abc-87e3-03e4b8f53070.png.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Drama"],"nutshell":""},{"name":" This Is My Justice","avatar":"https://mangadex.org/covers/649a2780-ca82-442d-8b23-5088b9c9d5c7/6bcc7279-463f-424d-af89-b31f0656367f.png.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot,Comedy,School Life"],"nutshell":"From Futari wa Pretty Anon:\nWhen evil is afoot at school, it’s up to Kakeru-kun and the Justice Club to take care of it once and for all! But Kasuga’s sure that him and the villanous Kuroda-kun are up to something behind the scenes, and is determined to reveal them for what they are!"},{"name":" Kaii Bokumetsu Minchi-chan","avatar":"https://mangadex.org/covers/64a0e593-ec96-499a-8967-5b116e61a07c/43b174eb-4db1-49a9-9676-d3f9c5a2bc6c.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Action,School Life,Supernatural"],"nutshell":"Kira is in love with her classmate Minchi, a beautiful and cheerful girl. But one day he sees her fighting a monster and discovers her secret: she possesses supernatural powers which she uses to exorcise evil spirits. However, that is not the only thing that she hides, since it also turns out that she's an aggressive and dominant person who now blackmails Kira to accompany her on her missions.\nKira está enamorado de su compañera de clase Minchi, una chica hermosa y alegre. Pero un día la ve peleando contra un monstruo y descubre su secreto: ella posee poderes sobrenaturales con los que exorciza espíritus malignos. Sin embargo, eso no es lo único que esconde, ya que también resulta ser una persona agresiva y dominante que chantajeará a Kira para que la acompañe en sus misiones."},{"name":" Sleeping Princess and Dreaming Devil","avatar":"https://mangadex.org/covers/64a36e9e-5d10-4397-9f92-d4c82dbaafb0/62046da6-d02b-4e39-8b58-875917eb049f.jpg.256.jpg","country":"Korean","stat":"8.12","status":"Completed","tags":["Psychological,Long Strip,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"One day, a devil appears to a student and proposes a game. She tempts him with one wish if he wins. But if he loses, she takes his soul. He begins a dangerous game with the dreaming devil in his desperation to save his sleeping sister."},{"name":" Honey Lemon","avatar":"https://mangadex.org/covers/64a4bc38-cb78-4df6-999b-a52a011de1b8/d8479b0f-c6b2-464c-a148-700fe2e6cc6d.jpg.256.jpg","country":"Korean","stat":"8.05","status":"Ongoing","tags":["Long Strip,Romance,Drama"],"nutshell":"Kyoungmi and Sora have always had a difficult time letting people in. Together they’ll discover that new friends can make life messy but beautiful. Sour, but sweet. Come aboard and make a beeline for the felines!"},{"name":" LiLy","avatar":"https://mangadex.org/covers/64ab62c3-2edd-41cd-a4da-96cbf0907e03/6ce83de2-ed57-432b-928a-2ea16efab897.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Cancelled","tags":["Romance,Comedy,Crossdressing,Drama,School Life"],"nutshell":"Sou Kagura is enjoying his life as a new high school student until one day when his parents abandon him due to a large debt they had amassed. To get rid of their debt, they essentially sell him to Mikoto Ouzuki, a wealthy land developer who wants Sou as his sexual pet. However, Sou's older sister Ui intervenes with a proposal: If Sou can pay back the debt in one year, he's off the hook, to which Ouzuki agrees. What Sou only finds out later on is that Ui's plan is to open up a maid cafe with him as one of the maids under the name \"Kanade\"."},{"name":" Digimon Story: Cyber Sleuth","avatar":"https://mangadex.org/covers/64ad9366-67e4-4bd0-a4cc-c1e9cdb057cd/1d7b1860-7a6a-498b-8383-0dd76c397094.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Sci-Fi,Monsters,Action,Video Games"],"nutshell":"One-shot manga for the PS Vita game Digimon Story Cyber Sleuth."},{"name":" Kudan Sakashita Chronicle","avatar":"https://mangadex.org/covers/64bd87e1-0f64-4ebf-8e9f-943715740582/2c00a285-139b-4eb8-be43-7c0fe9e93ae9.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Anthology,Slice of Life"],"nutshell":"A collection of four works all telling stories of different eras."},{"name":" Omniscient Reader's Viewpoint - Another Stories (Doujinshi)","avatar":"https://mangadex.org/covers/64beeb43-c3fd-4392-a45d-e688ba5e0ade/0c3b5e63-d77e-4264-a820-ba8f35dcd345.png.256.jpg","country":"Korean","stat":"8.14","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Survival,Adventure,Post-Apocalyptic,Fantasy"],"nutshell":""},{"name":" Modern Villainess: It’s Not Easy Building a Corporate Empire Before the Crash","avatar":"https://mangadex.org/covers/64c59add-698a-4260-8671-848356f26eab/7cd54fbf-2db8-4937-9bb5-33aaf7975589.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Ongoing","tags":["Reincarnation,Video Games,Isekai,Drama,School Life,Villainess,Adaptation"],"nutshell":"In the tough times after the Japanese economic bubble burst, a career woman suffering through the aftermath reincarnates as Keikain Runa, the villainess of an otome game with a modern setting! However, not long after reincarnating, she realizes just how dire a situation her family is in due to the ongoing financial recession. Using knowledge from her previous life, Runa sets out to rescue her new family from crisis and stand against the tide of 'the times' that caused her past life to end in misery."},{"name":" Karen","avatar":"https://mangadex.org/covers/64c59f0d-d034-46c9-97b9-baf39fc324ac/7d4e31ae-ea76-4688-adcb-5f75e5dc5b0a.jpg.256.jpg","country":"Japanese","stat":"7.72","status":"Completed","tags":["Boys' Love,Drama"],"nutshell":"Brothers Masaki and Kai are reunited after 7 years apart when their father passes away. With their reunion brings the question: who will be the one to succeed the family?"},{"name":" An Angel's Space-Time Boat ― The Legend of Leonardo da Vinci","avatar":"https://mangadex.org/covers/64cd9c32-63ff-4bcc-9392-f2e676262804/6cef8693-b7e5-4db2-94a2-e082fee5d341.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Thriller,Reincarnation,Sci-Fi,Time Travel,Historical,Monsters,Action,Psychological,Romance,Comedy,Survival,Adventure,Post-Apocalyptic,Military,Philosophical,Drama,Aliens,Tragedy"],"nutshell":"(from ebookjapan):\nLeiji Matsumoto, a giant star of the SF manga world, takes on the enigmatic life of the genius Leonardo da Vinci! Centuries in the future. The great galactic system in which human beings live has encountered a \"collapsed section\" of the universe. If it slips and falls, it will be swallowed into the \"darkness of nothingness\" and all will end...\nOnly 30 years remain before the end of the world! The only person who can save the world is not Einstein, Curie, or von Braun, but the genius Leonardo da Vinci! In the summer of 1452, a project to regenerate \"him\" from the blood sucked by a \"mosquito\" flying over the cold village of Vinci is about to be carried out under the direction of Professor Minami.\nMamia Luna Hotaruko (Keiko, the Japanese word for firefly), who opposes Professor Minami's idea, destroys the Replicator Pandora just before the project is to be carried out, and travels to the time of Leonardo da Vinci's life in a time cruiser. She says she will learn all about it by Leonardo's side and return to the future once more..."},{"name":" Chicago","avatar":"https://mangadex.org/covers/64d34544-bd5d-4467-b818-d61f809c4c6b/cf2f6a5a-57d9-4631-895e-3761401b41fb.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Sci-Fi,Action,Survival,Post-Apocalyptic,Delinquents,Mystery"],"nutshell":"It is the middle of the 21st century and Tokyo is expanding more and more, filling Tokyo Bay with landfill to make room for the bursting population. But suddenly Tokyo suffers one of its greatest earthquakes, and the landfill liquefies, creating untold damage in the newly-made urban area. The members of Self-Defense Force Rescue Squad Four are sent to help. But what they dig up is a plot of murder and destruction–one that wipes out nearly the entire squad and leaves its two surviving members, the fierce Rei and her cool, handsome partner Uozumi, in a fight for their lives.\nThere is only one place where they can find the work that keeps them alive, and the support so they can start uncovering the mystery that killed their squad: that's in the south-Shinjuku bar called Chicago."},{"name":" Test Flight Girls","avatar":"https://mangadex.org/covers/64d4255f-8381-4077-926e-bec9c0cf740d/5c329e9a-984c-435f-aa2c-ad1799e7170c.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Oneshot,Action"],"nutshell":"Two girls play a video game on gliders in a virtual world."},{"name":" Mousou Bakari de Gomennasai","avatar":"https://mangadex.org/covers/64d4bcb5-9848-4f93-8fbb-ff4a5763919b/8854dd65-9adb-4ac6-8801-47238218a917.png.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Office worker Komazawa Arashi makes it through the day by escaping into delusions about his favorite café clerk."},{"name":" Yumemiru Taiyou","avatar":"https://mangadex.org/covers/64d554d2-1ae8-49ea-8136-896eff558ac1/acaaf029-46ef-4666-9b89-1af3f7db9fe6.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life"],"nutshell":"While loitering in the park, Shimana Kameko, who intended to run away from home and skipped school, meets a suspicious man in a kimono. This man, who had been locked out of his house, offers Shimana a place to stay. However, he requests she fulfill three conditions in exchange for her tenancy?!"},{"name":" Ruri no Namikaze","avatar":"https://mangadex.org/covers/64d72790-a450-4554-ab00-632057dafcf5/ec828d71-5ac3-4987-9273-f112795eb6bb.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Drama,School Life,Slice of Life"],"nutshell":"The boat leaves the island with a big dream of a boy on top of it.\nTo make my dream of becoming a photographer fulfilled, Etsuko is a girl who lives strongly all the time. Shiro who was shaken by her dedicated mind strongly thinks that she wants to protect her. However, Shiro who faced the painful reality to block Etsuko 's dreams knows that there are things that he can not win yet with his power. And what is the dream of Shiro himself found? ── The origin of Shihoda Shiro, a man beyond Shanghai, is here."},{"name":" For Every 1 Like, This Flatty's Breasts Will Grow By 1mm","avatar":"https://mangadex.org/covers/64db1124-1abf-46ab-b302-2235a6cb54df/0c564868-7249-4ae7-8fb5-3025805509ce.jpg.256.jpg","country":"Japanese","stat":"6.71","status":"Completed","tags":["Oneshot,Comedy,Web Comic,Full Color"],"nutshell":"Titties are love\nTitties are life\nTitties can be larger than life and your house…\n…Or can they?"},{"name":" Living with the Emperor","avatar":"https://mangadex.org/covers/64e4a2fa-98ed-40f6-a51b-368648e27970/0b81ec72-c53b-4260-a7b8-d43d76a4e943.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.92","status":"Ongoing","tags":["Historical,Long Strip,Romance,Drama,Web Comic,Full Color"],"nutshell":"Heartache, competition, and the behind the scenes battles of the imperial harem; an ancient story based upon revenge.\nFrench : Être en compagnie de l'empereur équivaut à vivre avec un tigre.\nUn jour, Ling Su'er a sauvé le prince héritier qui s'était évanoui à la suite d'une blessure grave en pleine forêt.\nComme elle avait besoin l'aide du prince héritier sur une autre question, Ling Su'er était prête à le protéger des autres princes.\nMais tout n'est pas si paisible. Entre les combats dans le harem, la vengeance et les luttes pour le trône, Ling Su'er peut-elle rester innocente ?\nVictime de traitrise et de préjudice, Ling Su'er regrettera-t-elle d'avoir sauvé le prince héritier ?"},{"name":" Neolith Girl","avatar":"https://mangadex.org/covers/64e87c04-821e-4bc0-a091-cab9b0ac0901/aa5e7b05-746a-411a-a87c-7664cfd854d7.jpg.256.jpg","country":"Korean","stat":"7.57","status":"Completed","tags":["Action,Long Strip,Romance,Martial Arts,Adventure,Medical,School Life,Fantasy,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"Once, there lived a fearless girl who could defeat even the strongest of beasts with her bare hands. She was the strongest person living. Thousands of years later, the same girl from the stone age has lived to learn what romance is. Will her strength scare everyone away, or will it let her fall in love?"},{"name":" A World Worth Protecting","avatar":"https://mangadex.org/covers/64eb46ed-8939-4a13-86a6-ae4d16845716/15e796ce-e8cc-46bd-b6a6-d888cb4a5fc2.png.256.jpg","country":"Chinese (Simplified)","stat":"7.85","status":"Ongoing","tags":["Monsters,Action,Comedy,Adventure,Wuxia,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"By the year 3029 CE, Earth’s technology has developed rapidly, borders no longer exist, and Earth has been unified, marking the beginning of the era of the Federation.\nAt that time, a huge sword flew from the heavens, piercing the sun and causing a huge sensation on Earth.\nPerhaps because the scabbard of the sword was already in tatters, countless shards have broken off from it following the collision with the sun and spread across the universe. Many of these shards have landed on various places across Earth.\nWith the arrival of the bronze sword and its shards, a new unlimited energy source has suddenly appeared on Earth. This energy source has since been named Spirit Qi.\nSpirit Qi is like air, thick in some places and thin in others. As the Federation and other factions gather more shards, they discover more information on cultivation, pill refinement, Spirit Stone refinement, and other techniques. The words on the shards have an ancient feel to them, making it a trend for people to use ancient language.\nThe appearance of Spirit Qi rapidly makes the original energy sources obsolete and has completely changed people’s lives. Not only has the Spirit Internet been formed, Spirit Qi has also changed the course of Human Civilization, causing the world to enter a civilization of cultivation. This would later come to be known as the Spirit Inception Era."},{"name":" Ame to Kimi to (Webcomic)","avatar":"https://mangadex.org/covers/64edb636-7dd5-406e-90ae-98796f38f00a/c81806ba-a6cd-438c-8d01-bdb968e3b90b.png.256.jpg","country":"Japanese","stat":"8.84","status":"Ongoing","tags":["Animals,Comedy,Web Comic,Slice of Life"],"nutshell":"On one rainy day, she had picked something that looked like a dog… Let's see how tricky a dog it can be…\nOfficial LINE stickers from author"},{"name":" Hanamai Koeda de Aimashou","avatar":"https://mangadex.org/covers/64f98e25-f7c1-4ca7-aa5f-ed386d22bb12/b2f6444f-a6c9-42a1-9e7c-8f120ce39e98.png.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Boys' Love,Crossdressing,Drama"],"nutshell":"Ever since he was young, Mizuki's mother raised him up as a girl and forbade him from being close to other kids. Always dressed-up in a female kimono, this youngster is actually a successor to a wealthy clan. His mother hid his existence from Mizuki’s own father to prevent him from being caught in the crossfire of succession."},{"name":" Senki Zesshou Symphogear - Verbotene Frucht (Doujinshi)","avatar":"https://mangadex.org/covers/64fcddad-47ea-4076-b681-ed9469a59a0d/1f62815b-c0a6-43a7-b622-fbf74e1744aa.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Oneshot,Girls' Love,Drama"],"nutshell":""},{"name":" Road Song","avatar":"https://mangadex.org/covers/64fd779c-2886-46f6-aa82-bd61a9e10ea4/7d173619-0f12-4740-8877-0049742a5f78.png.256.jpg","country":"English","stat":"7.98","status":"Completed","tags":["Adventure,Drama,Mystery,Music"],"nutshell":"Monty and Simon are soon-to-be brother-in-laws who collaborate on a song for the upcoming wedding. But things go awry when an explosion devastates the wedding and blame is placed on the two boys. An adventure ensues as the boys go on the run, in which music becomes their way of life"},{"name":" Chef Mitsuboshi","avatar":"https://mangadex.org/covers/64ff0ae0-a438-40fb-aa6a-156ca594f948/a8765cf9-5f93-4f85-9ee2-3cccefea5c84.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Slice of Life,Cooking"],"nutshell":"Nakahara Mitsuboshi is a young man who holds many part-time jobs to pay for her mother's hospital fees. His world changes when he mistakenly gets a job at a French restaurant. Feeling challenged and intrigued, he sets off to delve into the world of French cuisine."},{"name":" Touhou - envy doll (Doujinshi)","avatar":"https://mangadex.org/covers/650bb1fd-98a8-4c7a-9b91-8839bd88d2df/c07b023a-dc82-4c72-a153-e522f6aaa631.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Comedy,Girls' Love"],"nutshell":"An Alice x Reimu doujin."},{"name":" Captain Tsubasa - Toushizumenka no Ranhansha (Doujinshi)","avatar":"https://mangadex.org/covers/650dfa49-4d2f-45a3-bc95-eec52f46ee66/eefe85db-50b5-478a-9044-713ff6506011.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":"The art style is Captain Tsubasa, with just a touch of Zetsuai. Very soft and round. The story is mostly the schoolboy angst of Wakashimazu crushing on a reluctant Hyuga, with soft smuttage intermingled with the story.\nIncluded in doujinshi anthology Dokusen Yoku vol.1 (1992)."},{"name":" Naruto: Sasuke's Story—The Uchiha and the Heavenly Stardust: The Manga","avatar":"https://mangadex.org/covers/65125892-8584-4938-b45c-7a4cd9ad67d7/5258b18b-ec0a-45a4-969b-6324ccf4c00a.jpg.256.jpg","country":"Japanese","stat":"8.40","status":"Ongoing","tags":["Action,Ninja,Martial Arts,Adventure,Drama,Fantasy,Adaptation"],"nutshell":"Uchiha Sasuke heads for an astronomical observatory far from the Land of Fire where he joins up with Sakura and dives into an undercover investigation to search for traces of the Sage of Six Paths! There, they discover a plan that goes beyond life and death… Where will the battle take this husband-and-wife team?"},{"name":" GIRLS und PANZER - Gekitou! Maginot-sen desu!!","avatar":"https://mangadex.org/covers/6513c799-aedc-445f-9218-5409928ad6f7/b414d533-a3ef-4cd3-8ae9-bc60a36fba11.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Action,Comedy,School Life"],"nutshell":"Part of the series GIRLS und PANZER."},{"name":" Penetrating Vision","avatar":"https://mangadex.org/covers/6514e61f-3712-4ebf-8046-056ddc584c69/721c6549-3494-414b-8ea4-7cf170dec844.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Completed","tags":["Long Strip,Web Comic,Full Color"],"nutshell":"He's an internationally renowned martial arts grandmaster and an unstoppable killer. He's a suave antique connoisseur who gambles on stones and possesses wealth that can rival an entire nation. He's a famous master of mystic arts, who is not only skilled in geomancy and fortune-telling but also commands respect among Buddhist and Taoist followers. On top of that, he's also a divine healer, king of detectives, and an investing genius. He is none other than Zhang Jun. Through a chance encounter, Zhang Jun acquires the sacred relic, Eye of the Buddha. From then on, women all over the world begin succumbing to his charm."},{"name":" Did Yuanbao Make Money Today?","avatar":"https://mangadex.org/covers/6517f65f-0e8f-4bcb-b6f9-23a48486bfe8/d344b3ad-8ddd-4872-a3c9-4eaa77fa7161.png.256.jpg","country":"Chinese (Simplified)","stat":"8.06","status":"Ongoing","tags":["Historical,Long Strip,Romance,Web Comic"],"nutshell":"(From Solstice Translations)\nOu Yuanbao is the eldest Miss of the extremely wealthy Ou family who is always giving her grandfather a headache. She deliberately gained notoriety to avoid marriage. One day, her grandfather unexpectedly brought home an illegitimate son and forced her to choose between competing for inheritance and marriage!"}]