[{"name":" Hazel & Gretel","avatar":"https://mangadex.org/covers/860c7fbe-7aae-40a8-95da-18d0845d7c3f/94c5f7af-2ade-4a90-ab0f-db5f1bc0a710.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Oneshot,Full Color"],"nutshell":""},{"name":" Kimi ga Koi ni Ochiru","avatar":"https://mangadex.org/covers/8618bc9c-ddeb-4163-8b79-60e1d9c3b8ba/056962eb-35b5-4f7e-86d9-56c943a790c5.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Boys' Love,Sports,Drama,School Life"],"nutshell":"Painful, heartbreaking memories suddenly surface for Haru when he agrees to fill in as teacher for the high school archery club. In his youth, Haru was a brilliant archer who competed for the national championship. But uncontrollable urges for a male rival forced him to give up on his archery dream and run away from his true feelings. Now that he's back in the bow-and-arrow game, Haru becomes drawn to the brother of his long-lost love – and he must find out if desire has taken on a new, seductive aim…"},{"name":" Lords of Avalon: Knight of Darkness","avatar":"https://mangadex.org/covers/8624e8ee-b741-4662-82d4-088ec4b46e46/9e6315ae-3d00-4fe8-85b6-9962db1e890d.jpg.256.jpg","country":"English","stat":"7.97","status":"Completed","tags":["Action,Drama,Fantasy"],"nutshell":"Varian duFey may be the son of evil Adonai sorceress Narishka duFey, but he turned his dark heritage to the side of good, acting as Avalon's most deadly assassin. Though hated and mistrusted by the other knights whose cause he shares, when someone begins killing Grail Knights, Merlin sends her darkest knight on a quest that leads him directly to his mother's door… and to a hag named Merewyn, who is more than she seems."},{"name":" Fairy King","avatar":"https://mangadex.org/covers/862b6afc-3917-4c2b-8a6d-48941aa60fac/096f0fd1-270a-42e5-b196-b4eec5bae9ea.png.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Thriller,Monsters,Action,Demons,Psychological,Animals,Comedy,Survival,Adventure,Magic,Drama,Fantasy,Slice of Life,Supernatural,Mystery,Tragedy"],"nutshell":"A boy moves to Hokkaido from Tokyo because of an illness. There, he has a brush with the world of the fairies.\nIn the original 5 volumes, the following one-shots are included:\nVolume 2: Ochikubo Monogatari\nVolume 5: Dream"},{"name":" THE iDOLM@STER Cinderella Girls - Honjitsu no Idol-san","avatar":"https://mangadex.org/covers/862d0ab6-06d7-4207-b617-b628a4740ffb/66562256-946f-42d5-a22b-6f0911b977eb.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Comedy,Slice of Life,Music"],"nutshell":"A spin-off from the mobile game's \"The Idolm@ster Cinderella Girls.\" Featuring different idols each chapter."},{"name":" Onna no Ie","avatar":"https://mangadex.org/covers/863514aa-ab15-4538-b74c-9877c87649a6/740e79de-28c6-481e-aa42-54326e9186fc.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"The story centers on 29-year-old Yuuka, who was just dumped by her boyfriend, and her 25-year-old younger sister Sumika. The two return to their mother's hometown of Osaka since their mother has a serious illness. Her mother suddenly gives Yuuka a \"mother's order\": Yuuka must move with her and Sumika to live together in Tokyo. The manga tells the story of the \"women only\" household of two sisters and their mother. [ANN]"},{"name":" I Know All About It","avatar":"https://mangadex.org/covers/863645b0-6911-4f19-9d55-cbc87b8206b0/17a5218f-724d-4704-90b6-66ba66cff509.png.256.jpg","country":"Japanese","stat":"7.81","status":"Ongoing","tags":["Comedy,Incest,Girls' Love,Web Comic"],"nutshell":"A little sister knows all about what her big sister did last night..."},{"name":" The Tattoo Artist","avatar":"https://mangadex.org/covers/863715d5-06d2-4a81-97c2-f77d0bf6b6a4/6a4d2823-ed3f-4843-8613-48d10b39bd25.jpg.256.jpg","country":"Korean","stat":"7.89","status":"Completed","tags":["Official Colored,Long Strip,Drama,Web Comic,Slice of Life,Full Color"],"nutshell":"Oh Jun Hee is, to put it simply, a loser. He's the only one in his friend group that's still living as a NEET after graduation. After an altercation one drunken night, one of the people involved shows up at his house the next day, informing Oh Jun Hee that he broke something of his, landing him in hopeless debt."},{"name":" Kill No More","avatar":"https://mangadex.org/covers/8640fe03-5f28-416c-9ed1-a98a3f793626/b930e1ce-cf05-473b-9acd-821b505693ea.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.96","status":"Ongoing","tags":["Historical,Action,Martial Arts,Adventure,Fantasy,Supernatural"],"nutshell":"An assassin who swore never to kill again - Liola, was being chased by an assassination organization when he accidentally dropped into a parallel universe. In this chaotic, unorganized world, Liola continues to honor his promise. He tries his best to live the life of an ordinary person, but after a series of events occured… He suddenly realized that actually, being an ordinary person is harder than being an assassin!"},{"name":" Flutter","avatar":"https://mangadex.org/covers/864333b4-d0c8-4d67-a7ef-b0c5e8c147d9/5d18296a-0a3f-4d25-9019-db5090cac5fd.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Boys' Love"],"nutshell":"Asada is hypnotized by a handsome co-worker he sees on the street nearly every day. So when the two men are paired up for a high-pressure project, he can't believe his good luck! But what will happen when Asada's defenses are shaken by their immediate, undeniable connection?"},{"name":" Married Couple","avatar":"https://mangadex.org/covers/86453173-dac7-4b05-bffc-6069ab8a58f1/69801014-e93f-4b9e-813c-98de7386bb3a.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Ongoing","tags":["Comedy,4-Koma,Slice of Life"],"nutshell":"A 4-koma series about a couple's married life.\nLinks:\nNico Nico Raws - https://seiga.nicovideo.jp/comic/37635\nPixiv Raws - https://www.pixiv.net/user/5236024/series/68420\nAuthor's Nico Nico - https://seiga.nicovideo.jp/manga/list?user_id=22440292\nAuthor's Pixiv - https://www.pixiv.net/en/users/5236024"},{"name":" Milk Crown","avatar":"https://mangadex.org/covers/8648dcf9-09e8-4487-8ac0-2cc171b93803/77c7b9ec-3c69-496e-94c9-0c7215b5732a.png.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Comedy"],"nutshell":"Oto Tachibana, a 17-year-old, good-natured and caring girl, decides to earn her own school fees from now on, so she takes a job at her new school as a dormitory maid for \"Class Z,\" an elitist class full of people with special talents. As such, she starts her new life away from her family in the dormitory, surrounded by (mainly) boys that are all a little different. Among them is Jin, the dormitory head, a boy who is amazingly strong and who keeps a \"cuddly\" pet at the dormitory's swimming pool - a pet shark! The quite charming and funny story revolves around the daily lives of the people in the dormitory, and in the middle is the relationship that Oto and Jin are starting to build."},{"name":" A Story About a Girl Who Doesn't Hide Her Love and a Boy Who Doesn't Notice","avatar":"https://mangadex.org/covers/8651042f-c2d2-422d-a672-9f13b8cb0f1f/84d8ca0e-40d9-44cf-9ba8-994a2ae1e280.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Hiatus","tags":["Romance,Comedy,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"It's about a girl who doesn't hide her love and a boy who doesn't notice.\n Artist’s Twitter\n Artist’s Pixiv"},{"name":" Baby Blue","avatar":"https://mangadex.org/covers/8651e393-4b99-4ba0-a02d-dd4c94237408/dd717782-2f71-4378-8122-d8e599eacac2.png.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Drama,School Life,Slice of Life"],"nutshell":"Harumi's your typical grade 9 girl. Sure, she still sleeps with her stuffed animal that she dubbed \"Umetaro,\" and her ability to sense snow before it falls is labelled as just plain \"weird\" by her friends, but otherwise, she's your average girl just like any other.\nWhen her mother accidentally ruins her stuffed animal though by accidentally spilling coffee all over it, it sets the ball rolling for a series of events that changes her outlook on life.\nShe even meets a young guy working at a local knick knacks shop who reminds her of her beloved Umetaro! As she gets to know him more, she begins to realize that there is someone out there in the world who'll accept her for who she is.\nAlso contains an extra story:\n・10 Nen mo 20 Nen mo (10, 20 Years from Now)\nKonashi is a hard-working swimming buff who's focused on becoming good enough to land himself a spot in the upcoming summer swim competition. One day while heading to the pool to swim as always, he spots a guy he's never seen before standing on the jumping board with his clothes and shoes still on.\nAs it turns out—he's Eguchi, the resident class \"mystery\" who's only ever attended one of his classes. As they get talking, Konashi realizes he's nothing like the rumours made him out to be—and so began a quirky brief friendship that leaves a strong impression on him even years later."},{"name":" Uruwashiki Shuuen","avatar":"https://mangadex.org/covers/86544828-e3f7-49f5-b0ac-46fb05bd1dc0/d5af3b85-d42e-4450-b2ce-25d77b720113.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Psychological,Boys' Love,Zombies,Drama,Tragedy"],"nutshell":"Doujinshi. Two highschool boys struggle to survive in the middle of a zombie apocalypse."},{"name":" Sei-chan Capacity Over desu!","avatar":"https://mangadex.org/covers/8661740e-6b47-4956-a496-152b228f7fe5/d75feaa6-e4a5-42c0-992b-a6887ba22940.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"When my favorite childhood friend Sei-chan moved in with us, he started teasing me such as pushing me over, sneaking into my room, and taking other liberties! The daily flirting attack from the handsome Sei-chan is too overwhelming!"},{"name":" Pastoral Battle Hymn: Pioneer in the Fantasy Realm","avatar":"https://mangadex.org/covers/86626ad5-7ac5-4d38-8dd2-900379bade79/7c185d0f-d88c-4edd-8bee-438174e35ddf.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.85","status":"Ongoing","tags":["Long Strip,Romance,Adventure,Isekai,Fantasy,Web Comic,Full Color"],"nutshell":"I finally bought a house, but found that the door of the house connects to another world? In the not-too-distant future, Alien Development is developing as an emerging industry. The resourceful but cautious and timid Hong Yinzhi, and Li Bingya, a sports genius who has been repeatedly targeted by corrupt referees, began to open up their own gardens in other worlds for the stability, prosperity and glory they pursued. Warsong QQ group: 718597187"},{"name":" Micro power uniform girl","avatar":"https://mangadex.org/covers/8663fd36-85b5-4a98-ab85-ccf6ffe8d280/33cc5aaa-6525-4a7a-b108-c0b369109030.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["School Life,Web Comic,Slice of Life"],"nutshell":"Nagomi Tachibana, she has the ability to read people's minds just a little. But that's why she can't make friends. Worried about his daughter, her father encourages her to enroll in a certain school. Private Seigyoku Jogakuen - She dreams of living a normal school life there...!?"},{"name":" Saber Marionette J","avatar":"https://mangadex.org/covers/8670f812-0cce-44b7-889b-a26fd49b8671/79225127-914e-433e-88d6-6415b7c7828c.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Sci-Fi,Action,Romance,Comedy,Adventure,Post-Apocalyptic,Harem,Adaptation"],"nutshell":"On a world with no women, the surviving men have reintroduced the female in the form of an android. Called Marionettes, they are built to serve men and are limited in their interactions with humans. That is until a poor boy named Otaru Mamiya encounters a Marionette named Lime. Lime is a Saber model with a special circuit that gives her emotions. When Otaru awakens two more Saber Marionettes, his life as an 'average' man quickly becomes as extraordinary as the lives of his eager, busty new friends.\n\nLinks:\n\nArtist's Twitter"},{"name":" Joushi no Atsu ga Tsuyo Sugite Koi ga Dekinai","avatar":"https://mangadex.org/covers/86798356-a6c6-47af-bdec-d10177c7250a/0e541b24-e165-46e9-8776-628a8e954f67.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Ongoing","tags":["Romance,Comedy,Slice of Life"],"nutshell":"With a bouquet, wearing suits and cool...woman?! --Hikaru Kasuga, a poor student, meets Aya Sumino at his new part time job. A sweet talker who loves suits and wears them just as well; she is a woman with masculine appeal. Although just boss and employee, the unusual closeness they share takes Hikaru for a ride from beginning to end as he is unable to keep up with his heart. It can’t be romantic... but she’s coming on to me! A classic romantic comedy of unset boundaries that’ll keep you on the edge of your seat."},{"name":" Shoujo Jump","avatar":"https://mangadex.org/covers/867db122-adc8-4e30-a0ae-bd1c852ad956/bac400a1-0fd4-4bda-aad9-ee3586074ab2.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Sports"],"nutshell":"Michika has lost her triple jump, so she begs Nagayama, a former Ice-skating prince and old acquaintance, to train her to regain her ability to jump. But he refuses to train her…? What could be the reason behind his rejection?"},{"name":" Maou Kyoudai","avatar":"https://mangadex.org/covers/8684d6c3-90dc-4091-bfcf-c303eebf4eca/5689a68b-ccf4-41d8-abbf-41930926f015.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Comedy,Fantasy,Slice of Life"],"nutshell":"After a fierce fight with the feared Great Demon King, he has been reborn as 12 small Demon Kings!\nGod has appointed the youthful Byron as the hero to keep the peace of the world and raise the Devil Brothers into good children.\nHe has the hard-fight of housekeeping and child-rearing!"},{"name":" Show Me the Lucky-Boss!","avatar":"https://mangadex.org/covers/86883bbd-562a-49c3-b0ca-8ed84e725bc1/23f83419-094f-44ff-94e2-25e2146ffd1d.jpg.256.jpg","country":"Korean","stat":"8.04","status":"Ongoing","tags":["Action,Long Strip,Drama,School Life,Delinquents,Web Comic,Full Color"],"nutshell":"Kang Geonma, a man who made Busan kneel down on him at the mere age of 18 years old. Something appeared that made his dry heart completely on fire, that is ‘Hip-hop’! How to make Seoul united in order to become a rapper! The man Kang Geonma! Today, he is beating people again to become a rapper! For your reference, both of the authors don’t know a thing about what is rapping exactly is!"},{"name":" Brave 10 - Hazama  (Doujinshi)","avatar":"https://mangadex.org/covers/86893b2d-2cdd-4608-bb58-fee359e48a49/6aef69d9-fbd4-4863-833f-77fa6c079dd5.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":[""],"nutshell":"An official Brave 10 doujinshi by SHIMOTSUKI Kairi. A collection of of short comics taking place from Brave 10 to Brave 10 S."},{"name":" CCC","avatar":"https://mangadex.org/covers/8689738b-6ff1-4a56-a80b-1cba9dd5e2b1/ec2f4a32-919e-48c9-8638-c345ad94b707.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Romance,Comedy,School Life,Fantasy,Supernatural"],"nutshell":"From Shoujo Manga Maniac:\nKojima Mitsu (a.k.a. Honey) is in middle school (She's 12 years old) but she's so small that she looks like she's in elementary school! One day while she is is changing into a maid uniform for a school event (with not much success…the uniform is too big for her), she find a little bat blocked by the window and helps it. Suddenly an awesome guy appears in front of her! He is a vampire and as thanks for saving his \"toy,\" he helps turn her into an adult (with a kiss)…"},{"name":" Boku no Relieur","avatar":"https://mangadex.org/covers/868b9596-ef2b-476f-9557-9425e28cff44/a98810bb-7700-4820-b45e-a74fbefdad42.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Drama"],"nutshell":"\"Relieur\" is a term that came from the bookbinding culture that first blossomed in France. Each and every piece is taken the time to be carefully hand-bound into a full volume.\nHirai Moto is a quiet relieur and Mitsuba Maki, the high school boy who is helping with the shop's management has fleeting feelings for her.\nThe two are actually distant relatives and it seems that today is another day where a book with special circumstances has been brought to them.\nA story about the beautiful craft of bookbinding and fleeting and painful love."},{"name":" Second Departure","avatar":"https://mangadex.org/covers/868c603e-8096-4973-bc26-8e63f77aedc3/19dbc927-fd8b-4f2b-9be9-6fe7d27cae86.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Oneshot,Boys' Love,Drama,Slice of Life"],"nutshell":""},{"name":" Tomohiro Hasegawa's Struggle With Digital Drawing","avatar":"https://mangadex.org/covers/868f8836-f338-4998-ab7d-ea96ebf6f83f/3d8d84b4-b2d2-428a-8b6e-933c333b64f7.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy"],"nutshell":""},{"name":" Omae wo Ore no Suki ni Suru","avatar":"https://mangadex.org/covers/86932ec3-e77d-402d-8df1-a7018f9a723d/60c6cd41-1130-4e6f-8721-fc0994208ec6.png.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance"],"nutshell":"\"Do it for your family and marry him!\"\nTo save her family's traditional Japanese confectionery shop, Yuki agrees to go on a date with the heir to a big enterprise. Yuki's never had a boyfriend, but she decides that helping her family is more important. At first, she's nervous to meet this man who's eight years older than her, but once they start talking, things go pretty well. That is, until his attitude suddenly changes and he drags her into a hotel room… \"What do you think you're doing!?\" \"If we're getting married, we should make sure we've got good chemistry.\""},{"name":" This Man","avatar":"https://mangadex.org/covers/869aaf28-4709-483e-b145-09cca99144fc/815bd720-e32d-4683-9145-620c09bc06ab.jpg.256.jpg","country":"Japanese","stat":"7.56","status":"Completed","tags":["Action,Romance,Drama,Horror,Mystery"],"nutshell":"The manga is based on the \"This Man\" urban legend, which supposedly began when a woman living in New York told her psychiatrist in 2006 that she had been seeing the face of a man she had never met before in her dreams. Supposedly, more than 3,000 people all over the world have claimed to see \"This Man\" while dreaming. In present-day Japan, Hakaru Amano, an investigator who works with facial composites, is asked by a mother and daughter to draw the face of a man who illegally trespassed on their premises. He comes up with the face of \"This Man\".\nThe story of a serial killer begins to unfold.\nNew Weekly Shounen Magazine series from the Artist Megumi Kouji who brought to you Bloody Monday and Acma:Game"},{"name":" Barom-1","avatar":"https://mangadex.org/covers/869dbbc9-7330-49e4-a1a2-b2ade4a14f1d/72f5ee73-5b0f-49b4-927b-398588ccb729.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Sci-Fi,Action,Superhero,Adventure,Drama,Fantasy,Aliens"],"nutshell":"From ebookrenta:\nTakeshi and Kentaro are two friends who have been together since they were infants. They were born in the same hospital on the same day, have shared every class in school and even vie over the same girl. However, soon the two friends become closer than they'd like when they discover they are the Chosen Ones that will defeat the powers of an evil being and his minions who are currently wreaking havoc on mankind. Together, the two merge and become a super fighter known as Barom One, capable of taking down monsters with ease. Can Takeshi and Kentaro band together to save the world?\nSerialized from 1970-1971 in Kodansha's Weekly Bokura Magazine. It was collected into two tankobons."},{"name":" Monstrous Heart","avatar":"https://mangadex.org/covers/86a19e80-e6d6-4afd-8042-ddea780de827/7cf00975-f735-40f8-9157-e5ec4263c239.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.29","status":"Ongoing","tags":["Action,Demons,Long Strip,Romance,Comedy,Boys' Love,Drama,School Life,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Su Yuan, a poor student, in order to not place any additional burdens on his family, accidentally got himself enrolled into a college named, Ogus University. But soon he discovered that this institution was actually established for the protection of monsters (demons); and the physically weaker humans, in order to protect their lives, had to form partnerships—called PAL—with those monsters. Furthermore, as a result of his unique scent, many are drawn towards him in hopes of becoming his PAL; and at same time, he is also subjected to various attacks. That was, at least, until the day he rescued a fox covered in blood from head to toe, only to then discover…"}]