[{"name":" Chihaya-san's Fine that Way","avatar":"https://mangadex.org/covers/7da19097-b08e-4335-9d37-dc984ab1176e/1a9a920e-8fa3-4723-a552-1e5d5b071d8b.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Romance,Comedy,4-Koma,School Life,Slice of Life"],"nutshell":"Chihaya-san wa Sonomama de Ii (Chihaya-san's Fine that Way) follows the life of an average high school girl, Chihaya, who thinks she is overweight and wants to lose weight. Unfortunately, its impossible for her to keep her appetite in check, especially with her childhood friend, Shima constantly bombarding her with food. Can Chihaya resist her urge to eat and succeed in her diet?"},{"name":" Kikaider 02","avatar":"https://mangadex.org/covers/7da1a192-9d4d-451a-a954-15ee5acf0f51/d929869c-8883-4c2d-b03c-492ef9d72fc2.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Sci-Fi,Action,Mecha,Adventure"],"nutshell":"Mitsuko Komyoji is a cynical and distant college student studying robotics who received an email from her thought to be dead father Dr. Komyoji about her younger sister Hinano Komyoji who has amnesia and a robot modeled after her late older brother, Jiro. Jiro later reveals himself to be the powerful android Kikaider 02 created with a special Conscience Circuit that gives him emotions and free will. Jiro must combat forces of both DARK and later SHADOW while coming to terms with his identity and his incomplete Conscience Circuit."},{"name":" Fire Emblem Awakening: Comic Anthology","avatar":"https://mangadex.org/covers/7da3a22b-151c-43c6-97df-0e86a71ea2ce/cc168ce7-354b-4ebb-85d6-f3aa1467c52f.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Comedy,Anthology,Fantasy"],"nutshell":"A collection of short vanilla doujins written and drawn by FE fans based on the Nintendo 3DS game.\n\nVolume 1\nCover: Fujiwara Ryou\nBack Cover: Risuno\nTitle Page: Katsura Ichiho\nIllustrations: Shirataki Nako, Yamashita Renton (山下レントン), Arata Toshihiro (あらたとしひろ), Hayase Reku"},{"name":" Sweet and Cold","avatar":"https://mangadex.org/covers/7da4e119-058f-4fe8-8847-d477fec2be85/8ae645bb-f8b7-4015-9630-ada2b63344f0.jpg.256.jpg","country":"Korean","stat":"8.04","status":"Completed","tags":["Long Strip,Romance,Boys' Love,Web Comic,Full Color"],"nutshell":"There’s nothing more beautiful and dangerous than you.\nEugene doesn’t have time to finish his homework since he spends the night trying to find Juan who is only attracted to strangers looking for a good time.\nJuan, who is used to sleeping with strangers that he doesn’t even know, has a smile that overwhelms Eugene. Eugene, who can’t stand his smile anymore, has a goal to wipe that filthy smile off his face."},{"name":" Soul Gadget Radiant","avatar":"https://mangadex.org/covers/7da529a1-5808-4a16-89a4-bf36cf8ce6f7/77f35937-96d3-45f0-af9a-d314f744566c.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Action,Adventure,Fantasy"],"nutshell":"Lyle is a young man who lost his memories when he was young, and doesn't know who he is or where he came from. His only connection to his past is his Soul Gadget, \"Czerny\". Lyle was adopted by Gio, and has a sister-in-law named Sheska. These three work together on special thieving jobs to make end's meet. Read along as Lyle uncovers the secrets of Czerny and his past…"},{"name":" Noir - Rosa Bouquet (Doujinshi)","avatar":"https://mangadex.org/covers/7da85916-df7e-4e83-8fd1-9a538a5cebad/71ee339c-20b4-47b4-9903-97ea4e2e84c2.png.256.jpg","country":"Japanese","stat":"7.42","status":"Completed","tags":["Girls' Love"],"nutshell":"Kirika x Mireille"},{"name":" Ai no Konseki - Yajuu Gunsou to Aigan Guni","avatar":"https://mangadex.org/covers/7dacaff6-6cc0-4207-a380-8d43749abc33/6ed21742-3f76-40a4-86d1-f9278adce23f.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Historical,Action,Ninja,Boys' Love,Military,Drama,Supernatural"],"nutshell":"From Fantasyshrine:\nPassionate love that burns the body!!\nAlso included raving, popular ninja series “Kirigakure no Koi”!!\nStory 1) \"Kirigakure no Koi\" (Love in the Dense Fog)\nRookie ninja Mozu was entrusted with a dangerous mission– to assassinate his master's master, the rumored ninja defector, Tobimaru! To help Mozu with this impossible mission, his master, Kirimaru, must teach Mozu how to lure Tobimaru with sex!\nStory 2) \"Ai no Konseki - Yajuu Gunsou to Aigan Guni\" (Scarred with Love)\nArmy physician, Misono, was stationed in the southern frontline when he first met the wild Sergeant Kizaki. One day, the infirmary was bombed and Misono wouldn’t have survived if not for Kizaki. However, while Misono was delirious with malaria fever and shock, Kizaki preyed on him!"},{"name":" Baby Love","avatar":"https://mangadex.org/covers/7dad0f72-02a7-45fc-9a66-9bf73a5f81f2/b2047a57-3bfc-44e4-9670-4baa7af1aae7.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Comedy,Drama"],"nutshell":"As a little girl, Seara fell in love with Shuuhei, an older boy, but he looked down on her. Years later, when her parents temporarily relocate to the US, Seara takes the opportunity to move into the same house as him. Since Seara looks alot older than she actually is, Shuuhei doesn't recognize her right away. Will he ever recognize her?\nLink:\nAnimeNewsNetwork (OAV)"},{"name":" Heartbeat Inaccuracy X","avatar":"https://mangadex.org/covers/7db0001d-8513-42df-8c27-6c0a5f628577/accbe180-0c35-4e27-9474-d1cd5dbe1cd0.png.256.jpg","country":"Chinese (Simplified)","stat":"7.76","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Girls' Love,Full Color"],"nutshell":"An incidental situation led Yuan Qiuyu, a teenage girl, to fall in love with the actress Chu Yan. When she changed herself for love and became a top idol, the person she once liked had already disappeared from people's sight."},{"name":" Tako Musume to Tangan Musume ga XX Suru Dake. ~Natsu~ (Doujinshi)","avatar":"https://mangadex.org/covers/7db06d78-7d48-4bc7-962f-4cc2012dd905/a7458b80-8b19-4f46-8aae-3537454cc0e8.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Girls' Love,Slice of Life"],"nutshell":""},{"name":" Bara to Lion","avatar":"https://mangadex.org/covers/7dbf493a-b544-4cc4-be45-2f6ff7f80a9f/934d0844-3134-4fd4-9903-c6a86672a5af.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life"],"nutshell":""},{"name":" Horobi","avatar":"https://mangadex.org/covers/7dc0155e-2b7c-4651-97d9-cdbf72c5b566/cae02711-81bf-42bb-b880-de4bd449d317.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Action,Horror,Supernatural"],"nutshell":"Two laborotory-assistants, Zen Amako, Shuichi Aiga and their daughters boss Shoko Yobuno are connected with the triangle edged sacred animal mirror.\nThey are also pure-blooded demons and siblings off each other, allthough they are unaware off these facts.\nThis mirror will connect with two pure-blooded male demons. One (Zen) off them will cause Horobi (world destruction) and the other (Shuichi) will save the world and destroy Zen."},{"name":" Kuchizuke no Yukue","avatar":"https://mangadex.org/covers/7dc2c6c8-37b9-42aa-aa94-983151a1829c/af4bcd3e-c591-4d96-9ab1-c8e8ca0ac9d6.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance"],"nutshell":"Handsome, eligible ranch owner Stuart York was not one to mince words. Ivy Conley, his younger sister's best friend, found out the hard way. During a night's stay at his Jacobsville ranch, Ivy wound up in Stuart's arms. The resulting fireworks singed them both…and knowing she was too young, Stuart closed his heart to her.\nNow, years later, Ivy is determined not to be treated like a little girl anymore. Although still an innocent, Ivy knows she has to fight her own battles, but for some reason Stuart is always fighting them for her, and keeping her from harm. And, safe in Stuart's arms, Ivy feels like a woman–a woman who belongs to him."},{"name":" Don (MOTOMIYA Hiroshi)","avatar":"https://mangadex.org/covers/7dc542ed-93eb-4ffc-9da6-35c0673e3bd2/921e9a08-3f9e-4820-bb87-d744eadd81b6.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Action,Psychological,Comedy,Crime,Survival,Mafia,Adventure,Office Workers,Drama,Delinquents,Police,Slice of Life,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nThe Matsuyama Date family is one of the most prestigious families since the Edo period. Takekichi Date, the head of the Date family, single-handedly attacked the Akaiwa clan and destroyed their office.\nAt the same time, in Osaka, Kenzo Shimaji, a.k.a. Ken Hyoro, fires a pistol that he wrested from a police officer at a member of the Osaka Nissui clan who was accusing him of a crime. Two reckless young men meet in a convoy.\nThey are transported to the Asahiichi Prison in Tottori, a prison for loners and violent criminals who have single-handedly taken on the gang...\nAn Otoko Roman that clashes with grand dreams and ambitions!"},{"name":" Daikirai no Saki Kara Miteru","avatar":"https://mangadex.org/covers/7dc80161-f03b-4261-9804-5cbb3c1e8bf3/bd9554b0-cab6-4b44-a2b3-fef61698dfa6.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Boys' Love,Office Workers,Drama"],"nutshell":"Ogata, a serious salaryman, is said to have had a blemish free life throughout his school years and into his working life. He was an honor student who would pay attention to his surroundings and, without exception, would not allow for prejudices to be made as he believed that one’s hands should be extended to save the weak.\nHis co-worker, Ayase, feels irritated by this. His hatred becomes stronger as Ogata waves his ideals of justice over his head. He uses a new employee (and prostitute) recruited by the company's president, named Kamiya, and devises a plan to deceive Ogata."},{"name":" Binan no Dendou DX","avatar":"https://mangadex.org/covers/7dce3b52-430d-46a0-a924-1324e955b5f4/1ee1625f-7b66-4ea2-a57f-1374d8908219.png.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Comedy,Boys' Love"],"nutshell":"Jyunya ran away from home in hopes to becoming a musician. While singing on the street a super gorgeous man known as \"Denka\" appears!! The apartment that's run by Denka is known as \"Binan no Dendoh\", and it is filled with a bunch of beautiful men…?! Love troubles one after the other! Chain reaction of beautiful men are sure to be feared!!\nBinan no Dendou DX is combined with 2 volumes (Binan no Dendou and Binan no Dendou Z) and Extra Mini Book (Ura Binan)"},{"name":" Shinizokonai Agape","avatar":"https://mangadex.org/covers/7dcf0c15-aded-45c2-9eb1-69360424cae9/12116810-f2f8-48eb-90da-3d735dd5977e.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Hiatus","tags":["Genderswap,Romance,Comedy,Slice of Life,Supernatural"],"nutshell":"After waking up from a coma due to a traffic accident, 2nd year high school student Setouchi Hiromi finds himself in the body of an unknown girl called Nishimura Sayu. However Nishimura suggests that they spend the rest of their lives in their new bodies..? A tale of how two people cope with the ups and downs of youth, while in each other's bodies!"},{"name":" Doraemon Plus","avatar":"https://mangadex.org/covers/7dcf815a-8484-4a52-8cd6-37096ea70dd5/74266cfe-0b15-4ac3-afdc-10c705e417df.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Sci-Fi,Comedy,Adventure,School Life,Slice of Life"],"nutshell":"A collection of short stories that were not published in the original 45 volumes of Doraemon.\n\nOfficial Release:\n\nIndonesian release by Elex Media Komputindo as Doraemon Plus"},{"name":" Mobile Fighter G Gundam Side Story: Flying Dragon Legend","avatar":"https://mangadex.org/covers/7dd437d2-6f93-46e6-a946-e2f26ce5cdee/752c21e6-c042-4f72-8f64-58a22466f1ef.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sci-Fi,Action,Comedy,Mecha,Drama"],"nutshell":"Sai Saici, the Gundam Fighter for Neo-China participates in the 13th Gundam Fight. He learns that there were weaknesses in his fight between Neo Japan's Gundam Fighter Domon Kasshu and himself and is determined to correct those weaknesses, by going on a journey to learn the final secret of the Shaolin Temple, the Meteor Butterfly Sword move."},{"name":" Usagi no Mori","avatar":"https://mangadex.org/covers/7ddb90cc-b690-4ba4-b674-91d20bc66b03/be614d18-72cb-466c-aa34-e539f2754641.jpg.256.jpg","country":"Japanese","stat":"8.62","status":"Ongoing","tags":["Psychological,Romance,Boys' Love,School Life,Slice of Life"],"nutshell":"Shunta and Tamaki are childhood friends with a year of difference, but Shunta feels something different towards his friend, an impure, not correct, dirty feeling.\nAs this feeling grows stronger, will the relationship between the two friends also change …?"},{"name":" Noroi Factory","avatar":"https://mangadex.org/covers/7ddd43c2-917e-4aad-8703-8ed584eb1815/ff8cfc1d-a568-41a8-867e-14bfd815de5f.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Ongoing","tags":["Horror"],"nutshell":"Horror Omnibus"},{"name":" Girls und Panzer - Record of Rosehip's Bloodshed","avatar":"https://mangadex.org/covers/7de0bea2-c263-44b6-8b27-7ef125eb617f/bf0e639e-3921-49a0-a666-e06f277237da.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Ongoing","tags":["Comedy,School Life"],"nutshell":"Rosehip from the Girls und Panzer series causes havoc."},{"name":" Touhou - Higashi no Kuni no Nemuranai Utage (Doujinshi)","avatar":"https://mangadex.org/covers/7de43a9a-f3aa-4e89-8a79-fd4e636a22c7/9565156e-27a9-482e-ac91-1cc324d11a87.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Girls' Love,Fantasy"],"nutshell":""},{"name":" Virtual Hero","avatar":"/cover-placeholder.jpg","country":"English","stat":"7.98","status":"Completed","tags":["Sci-Fi,Action,Full Color"],"nutshell":"An epic story, full of action, inspired by the world of videogames: Minecraft, Pokémon, and more… Imagine being trapped in a video game universe! Your fate is in the hands of a villain! Friends in danger! Become the VIRTUAL HERO! Rubius, a well-known gamer and Youtuber, is one of 100 players selected to try a new experimental virtual-reality device, the ORV. Directly connected to the brain’s neuronal network, the ORV thrusts one into a vast virtual universe of video games called the Gamers Worlds and in which everything seems just as real as life itself. Something goes wrong and Rubius finds himself a virtual hero, trapped, he must fight to free himself, rescue the girl of his dreams and overcome the enigmatic evil troll mask that holds their fate and that of the Gamers Worlds in his hands! An adventure full of unexpected turns, treachery, friendship, video game worlds of all kinds and, last but not least, love!"},{"name":" Touhou - Nani mo Dekinai (Doujinshi)","avatar":"https://mangadex.org/covers/7de6cb2b-f0f9-4b70-b3e9-19f7f1b27b5e/d4dfa3b4-25c4-4b68-8988-9293de682d47.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Oneshot,Drama"],"nutshell":""},{"name":" Gokuraku Café","avatar":"https://mangadex.org/covers/7de8ba96-c5c8-4bc0-87e4-d665d1e0b077/e28eb209-1f7c-4db2-a45a-5e0f3cbaf2a6.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"Yuto works as a waiter at the Rainbow Forest Cafe. One day, he sees a guy who looks like he wants to throw himself from a bridge. Yuto tries to save him, only to find out that he's none other than the famous former baseball player, Esaki."},{"name":" S no Yuiitsu M no Zettai","avatar":"https://mangadex.org/covers/7df491c5-01ee-48a5-a555-7d0269054d6f/0f8a8b9a-17ab-4d95-8334-e06628de9425.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,Comedy,Anthology,School Life"],"nutshell":"Solely S, Absolutely M\nJitter Bug\nMy Dear Cat\nBet!!\nLove Planetarium\nM's Dejection\n\n[PL] Zbiór oneshotów autorki Reimei no Arcana.\n\nOfficial Release:\n\nIndonesian release by Elex Media Komputindo as Solely S, Absolutely M (2022)"},{"name":" THE iDOLM@STER - Inside the Snow Dome (Doujinshi)","avatar":"https://mangadex.org/covers/7df51a51-b8a5-485d-b187-2fb5c97ebd65/0e0e97fd-66cb-4fca-a46a-5a795cc1c3b8.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":[""],"nutshell":""},{"name":" Voice","avatar":"https://mangadex.org/covers/7df73ea2-a801-46aa-9c97-58a7fab61002/22725e6a-4f5b-446e-bb3d-3b3423cd1c95.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Oneshot,Psychological,Supernatural"],"nutshell":"A young man wakes up one morning to find himself without a body, and someone else sitting in his bed."},{"name":" Clover","avatar":"https://mangadex.org/covers/7e0dcfbc-501c-487a-b08b-9d6150196d63/fa5f8506-af0f-491a-b9f0-5f8f616c5030.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life"],"nutshell":"Suzuki Saya, age 21, is an office lady who's never been able to forget about the guy she liked in middle school. She carries on each day now getting reprimanded by her accomplished supervisor, Tsuge Susumu, and she's not interested in having any romantic relationships… Until out of the blue, Tsuge confesses love to Saya, and brings a new prediction of love for her!?"},{"name":" Bocchi to Waiwai Cape","avatar":"https://mangadex.org/covers/7e0e1504-a784-42f5-be5e-cc5e1c7dffc1/2969817f-0821-45a6-9286-7c86fdad6144.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy"],"nutshell":"Bocchi's mother has gone to heaven, and his father, Bocchi, who is on an adventure around the world, has moved to Cape Waiwai with his family! ! How can a little boy live alone? No, Bocchi, the answering machine, can do anything from cooking to washing. The mysterious tool \"Souvenir stone\" that grants various wishes is also very useful! Have fun every day with your strong ally next door, Ichiro, and Misaki's friends!!"},{"name":" Kami-sama no Takarabako","avatar":"https://mangadex.org/covers/7e0ee05d-b5c6-4e50-bf4c-348cab552115/eb0a970a-3c5c-486c-b535-32218c0b24b1.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Oneshot,Long Strip,Adventure,Drama,Fantasy"],"nutshell":"This is the story of a lonely boy, that one day received a mysterious book that changed his life."}]