[{"name":" Love and Sweet Drugs","avatar":"https://mangadex.org/covers/9549cd14-0dff-4222-8e45-59216f466da6/10b02b8b-c84f-4c9a-8c93-95b7366bd27a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.95","status":"Completed","tags":["Long Strip,Romance,Comedy,Drama,School Life,Web Comic,Full Color"],"nutshell":"One day, I couldn't eat sweets and became weaker to the point of making my heart nearly stopped beating; until I met someone who could make my strength stronger and longer for a period of time - a patissier!\nBut, after his girlfriend's death, he wouldn't make any sweets anymore and opened a café instead, selling the bitterest coffee ever.\nSo, to save my life, I'll definitely make sure you return to making sweets again!\nPlease, please~"},{"name":" Okukoi Escape","avatar":"https://mangadex.org/covers/954dc8ee-a588-49f5-97ed-22dcff3736a4/b9720c3e-30c3-4406-90bf-eac5fbabfddd.jpg.256.jpg","country":"Japanese","stat":"7.57","status":"Completed","tags":["Romance,Boys' Love,School Life"],"nutshell":"In order to live by his principles of never losing a fight, high schooler Kanzaki Ryousuke will run from everything to win! …or at least that’s what he wants to do. Even though he always tries stay away from trouble, he saves his classmate Ikasa Kaede from a fight. Will Kaede be able to steal Ryousuke’s heart with his piercing gaze…? Suddenly, the transfer student Amano Fumi who made a promise to marry Kaede appears?! A heart pounding school love story about their unripe love! A second volume about Fumi and the playboy Zono’s perverted times together and rough sketches included!"},{"name":" Little Witch's Diary","avatar":"https://mangadex.org/covers/9552f227-b3db-4e6c-8d54-60197d439d94/50a27526-f731-4674-b5b8-c22bb6f435e6.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Completed","tags":["Romance,Comedy,Adventure,Fantasy"],"nutshell":"A failed youth pill turns the pretty Pozsi, a resident witch of FairyLand, into a little girl. She is dating the handsome and kind Prince Yvrin, but how will he react when he sees his beloved Pozsi as a child? Is there a cure?\nThis series references many popular fairy tale stories by mixing in its own little twists and showing these popular tales from a whole new perspective, the perspective of a witch!"},{"name":" Tough Mate","avatar":"https://mangadex.org/covers/9555fda6-fab4-4264-a342-04206de86a52/6893004f-5c0e-4edb-b80f-c1f8ff109f96.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Long Strip,Romance,Comedy,Boys' Love,School Life,Web Comic,Full Color"],"nutshell":"Kihyun ends up in the school dorms after his family loses all their money. But his dream of being successful studying silently is destroyed by Go Seungjo, who always leads a group of journalists. Go Seungjo is the son of the president and the little brother of a celebrity. Due to Seungjo's uniqueness and superiority, Kihyun faces all kinds of suffering, shame, insults and problems...\n\n\n\nOriginal Webtoon <Lezhin>\n\n\nOriginal Webtoon <Naver>\n\n\nOriginal Webtoon <kakao>\n\n\nOriginal Webtoon <BookCube>\n\n\nOriginal Webtoon <Bomtoon>\n\n\nOriginal Webtoon <Comico>"},{"name":" The Wonderful Wizard of Oz","avatar":"https://mangadex.org/covers/9559c725-0b3e-441f-998e-be9c3a184cf1/95b0fee0-e93f-483f-9c4b-b48ef6cf97f4.png.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Adventure,Fantasy,Adaptation"],"nutshell":"Igarashi sensei (Candy Candy, Lady Georgie, Akage no An) delights us now with this wonderful tale.\nOfficial Release:\n\nIndonesian release by Elex Media Komputindo as Wizard of Oz (2008)"},{"name":" En garde Prêt Allez!!","avatar":"https://mangadex.org/covers/955ab795-8d3a-4367-8a9c-8d52c98a8b06/69a0fab0-9d57-4e3a-bd43-90d86ef50184.png.256.jpg","country":"Chinese (Simplified)","stat":"8.06","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Boys' Love,Sports,Web Comic,Slice of Life,Full Color"],"nutshell":"The story of a love-sick fencer who only wanted to stand atop the champion podium and embrace the runner-up. Part of the Solo Universe danmei series by Dr. Solo\nLing Xiao x Qiao Mai"},{"name":" Shirahime-Syo","avatar":"https://mangadex.org/covers/95649ab7-d699-445d-bde4-2bcc5313f5fb/8f30aeb7-396e-41af-92b2-1021f9ae66d2.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Historical,Romance,Drama,Fantasy,Supernatural,Tragedy"],"nutshell":"Legends say that when it snows, it is because the snow princess is crying. A collection of five tragic tales, all connected by the bond of snow. Shirahime-syo is CLAMP's tribute to traditional Japanese form and storytelling."},{"name":" Pink Napoleon Fish","avatar":"https://mangadex.org/covers/956b2b24-c712-4fe6-be00-9c3d5bfc932d/4580fa21-fe74-4678-963f-410b66444ff3.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"Chappy's only strong point is his cooking. While working at a hotel on a quiet island he meets Natsu, who shows him a whole new world in Diving. Together they search for the Pink Napoleon fish that is said to bring happiness.\nIncludes \"Moonlight Gigolo\" oneshot."},{"name":" Funky Yobikou","avatar":"https://mangadex.org/covers/956e7c1c-9be3-4863-a106-dd9a68c87645/6b58fd51-287d-4026-ba59-a0f4f03411b3.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Romance,Comedy"],"nutshell":"A collection of oneshots.\nStory 1: Funky Prep School\nKobayashi fails to get into her college of choice and decides to take a study course to overcome this failure. There, she meets the man of her dreams, and a man with an afro. How is the study camp going to help her out?\nStory 2: An SM Chick Girlfriend\nStory 3: Thrust it in More\nStory 4: The Hula Dancer of Flames\nStory 5:\nStory 6: He's a Latin Type\nStory 7: The Hage Family\nStory 8: My Dear Next-Door Neighbor\nStory 9: Dress-up Doll Boyfriend"},{"name":" Saigo no Seifuku","avatar":"https://mangadex.org/covers/95780c38-d2b9-4973-8659-52d721533acc/4ae0d90d-daf7-42d0-81de-8cd38d70df8b.jpg.256.jpg","country":"Japanese","stat":"7.45","status":"Completed","tags":["Romance,Girls' Love,School Life,Slice of Life"],"nutshell":"Everyone at the Tsubakigaoka Girls High Dorm stays in two person bedrooms. Tsumugi and Beniko, Ai and Fuuko too, are also spending their school lives like that. But Tsumugi and Ai, have each fallen for their roommates who are unaware that they are no longer just friends…"},{"name":" Kami-sama no Sonata","avatar":"https://mangadex.org/covers/95795da2-a00d-4a02-b856-25c89abd784f/887bc2a5-9ef2-437a-9805-56dd4d382396.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Romance,Anthology,Drama,School Life,Supernatural,Music"],"nutshell":"A collection of oneshots:\n\n\nKamisama no Sonata\nA lonely ghost finds another deeply tortured soul with her love for the violin. Despite the years separating them, they both know the pain of being different which causes their bond to become stronger. But is there a happy ending for someone living and a ghost?\n\n\nMahoroba no Yobigoe\nA boy she always knew from afar is about to be crushed by the train before her very eyes, but not before he looks directly at her, causing Maomi to drift and land… 2000 years into the past! Historical references to Yamataikoku and Queen Himiko.\n\n\nIpaasha\nA playboy prince of a small country needs to win over a frivolous princess of a successful kingdom for the sake of his country. What he didn't expect was his feelings for the princess's timid maid. What will happen when the princess finds out about them? Will the prince forsake his country all for his forbidden love?\n\n\nTaiyou mo Wasure Sasete\nSaho fall in love with the chairman of a gardening club - Togusa Shui, and now she has to work hard to get his attention."},{"name":" Senaka Gurashi","avatar":"https://mangadex.org/covers/957a2d3f-0283-472d-b3a4-59133febe0ab/88a59200-39d1-44c5-a458-2a34b2302537.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life"],"nutshell":"Watami Meguru pleaded to his mom to let him move out on his own to experience being independent. She finally agrees to let Meguru rent out a room for the summer. But his sadistic mother makes the wall between him and his neighbor out of glass, meaning there is no privacy between the two rooms. If living openly with a stranger wasn’t insane enough, his neighbor is a cute girl his age, Kana. They immediately get off on the wrong foot and this isn’t what Meguru imagined it would be like at all."},{"name":" Showa: A History of Japan","avatar":"https://mangadex.org/covers/957a54aa-b37c-4136-9e95-34f47dce188f/b91faee2-b9fa-4e1c-ba77-df0efc9722a8.png.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Thriller,Award Winning,Historical,Action,Psychological,Ghosts,Animals,Comedy,Crime,Survival,Mafia,Adventure,Office Workers,Military,Philosophical,Drama,Medical,School Life,Horror,Delinquents,Police,Slice of Life,Supernatural,Tragedy"],"nutshell":"From Drawn & Quarterly:\nShowa: A History of Japan is a work of Shigeru Mizuki's meticulously researched historical portrait of twentieth-century Japan. This series deals with the period leading up to World War II, a time of high unemployment and other economic hardships caused by the Great Depression. Mizuki's photo-realist style effortlessly brings to life the Japan of the 1920s and 1930s, depicting bustling city streets and abandoned graveyards with equal ease.\nWhen the Showa era began, Mizuki himself was just a few years old, so his earliest memories coincide with the earliest events of the time. With his trusty narrator Rat Man, Mizuki brings history into the realm of the personal, making it palatable, and indeed compelling, for young audiences as well as more mature readers. As he describes the militarization that leads up to World War II, Mizuki's stance toward war is thoughtful and often downright critical―his portrayal of the Nanjing Massacre clearly paints the incident  as an atrocity. Mizuki's Showa is a beautifully told history that tracks how technological developments and the country's shifting economic stability had a role in shaping Japan's foreign policy in the early twentieth century.\nOfficial English\n\n\nWon the 13th Kodansha Manga Award for Seinen/General in 1989"},{"name":" Childe Jiang, Would You Marry Me?","avatar":"https://mangadex.org/covers/957a894a-99c3-41d0-a0d8-0bdd758e9ee8/ce034524-2a44-4689-bca8-9ee0f9ebbc71.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Web Comic,Full Color"],"nutshell":"My dad says that if I'm still unmarried after 25, I won’t get my inheritance? Well, my dad really makes trouble for me, his own daughter!—Let's see how the CEO, a pet lover, flirts with the medical examiner. In this contract marriage, who will fall in love first? The CEO has lots of pets: a teacup poodle, a crested dog…and even an alpaca?\nOfficial source\nhttps://m.ac.qq.com/comic/index/id/632357"},{"name":" Mob kara Hajimaru Tansaku Eiyuutan","avatar":"https://mangadex.org/covers/95801a6e-1e69-4876-b7ed-41d92c9853e3/ec4f8283-d506-4107-a773-52fac10591e3.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Ongoing","tags":["Action,Adventure,Harem,Fantasy"],"nutshell":"Takagi Kaito, a low status high schooler, your typical Mob character so to say, was just a normal everyday explorer who hunted slimes every day in the dungeons that appeared in Japan, earning pocket money while admiring his childhood friend, the class queen, from afar. One day, a golden slime he had never seen appears before him. After he defeats it, he obtains an extremely rare item worth hundreds of millions as a drop, a servant card that can summon mythical beings!! After he makes up his mind and summons it, a warrior maiden with unparalleled beauty appears. Rise above being just a mob explorer Kaito! A modern battle fantasy story has begun!\nweb novel  (jp)"},{"name":" Missing Piece","avatar":"https://mangadex.org/covers/9581822b-0c17-45ce-a0a4-f5dfcc529733/16d20ccf-203d-4fd9-805a-8a93d0914ce8.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,Drama,School Life,Fantasy,Supernatural,Mystery"],"nutshell":"Sawatari Ai is an insatiably curious high school student. One day, she notices that a boy named Akizuki Tooru has joined her class, but according to her friends, he's always been around! He was a childhood friend of hers, so why doesn't Ai remember him? But the weird thing is…Ai's memory lapse isn't the only weird thing. She's about to be faced with hyper psychic action!\nNote: Volume 2 only has one chapter that deals with the main story; the rest of the volume consists of unrelated oneshots.\nDusk Is Twittering (Tasogare wa Sasayaku) - Is a school story about a boy–who draws–that transfers to a new school for follow a girl he has a crush on. Unfortunately for him, she already has a boyfriend.\nThe Sound of Melting (Tokeru Koe) - Is school life story about a girl that dislikes her own voice due to being compared to her mother, who is a singer. Despite this, she loves to sing. So, there is a boy the sends her slips of a love letter after her voice lessons based on her voice.\nMidsummer's Criminal (Natsu no Ran) - About an adult that tutors a 6th grader, who looks like an adult."},{"name":" Sora ni Haeru","avatar":"https://mangadex.org/covers/95833cbf-be5c-41c6-b5a4-8c80b99ffdd3/3d9bde17-02cb-4e9e-a00f-78721f6e2ebf.png.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Romance,Drama,School Life"],"nutshell":"One day Mitsuya Aiji sees the door to the rooftop is unusually open. As a painter, he's attracted to the blue color of the sky. A person showed up all of a sudden and falls on Mitsuya. Who is this girl? Why does she have rumors circulating around her? See how Mitsuya and her get closer in this short romantic oneshot."},{"name":" Love Yume Mix","avatar":"https://mangadex.org/covers/9584c446-4c65-4028-aaa1-b02f1ab91afa/c96bb1d1-f4bc-4390-b9ca-650e24af61a7.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Comedy,Harem"],"nutshell":"Kensuke is your usual high schooler. He's unattractive, unreliable and leads a very boring life. This all changes in one night, when a goddess granted him his wish and make him a popular boy. And soon after that girls start flocking to him like there is no tomorrow. The first dramatic change in his life came from his sister and the second was a childhood friend that he had no idea existed. Things don't just stop there, soon all sort of weird girls come knocking at his door. These girls ranged from Nekomimi, Magical Shoujo etc. His love drama filled life is about to begin…"},{"name":" Kodomo x Otona no Houteishiki","avatar":"https://mangadex.org/covers/9585fed2-e5c8-4832-943c-f715b49231bb/d4160707-186d-4ab3-8c95-b486d4cb9620.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Boys' Love,School Life"],"nutshell":"Nanjou is a divorced father with a child, Chiharu. Chiharu's teacher from the childcare center, Aiba, ends up staying at the Nanjou family's place to take care of Chiharu as his 'mom.' How does the relationship between Nanjou and Aiba progress?"},{"name":" Cypress Vine Tales: Oneshot Collection","avatar":"https://mangadex.org/covers/958f9ab1-7a05-4442-9942-77957792e51b/201cf98b-eac0-4439-b5d4-7f64492e2531.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.16","status":"Ongoing","tags":["Oneshot,Long Strip,Girls' Love,School Life,Web Comic,Slice of Life"],"nutshell":"Cutlet Warrior's yuri oneshot collection."},{"name":" Dero Dero","avatar":"https://mangadex.org/covers/959ac289-6dd1-4418-aa79-5e43938326a0/8d33d1c2-5376-43a2-8d91-699088900b44.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,School Life,Horror,Supernatural"],"nutshell":"DeroDero is the story of a juvenile delinquent, Hino Mimio, who happens to also be a psychic. His ability to communicate with the spiritual world as well as his demeanors caused him to constantly interact with supernatural beings – usually ending up with Mimio beating the crap out of the monster or spirit."},{"name":" Kuroyuri Gakuen Ooku Gakka","avatar":"https://mangadex.org/covers/959d917f-4fa2-464d-bba5-94cfa75289a1/1363112d-9ff2-4367-817e-e161cc87c3a4.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Girls' Love,Harem,Drama,School Life"],"nutshell":""},{"name":" Beware of Demons","avatar":"https://mangadex.org/covers/95a0a5d7-e658-4b2f-88b2-bbfa8681ad76/5cb57509-d6da-447b-849b-90514719ec27.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.95","status":"Completed","tags":["Long Strip,Romance,Boys' Love,School Life,Supernatural"],"nutshell":"A small and weak bookworm gets into trouble with a domineering and handsome werewolf!\n\"Anyone who messes with me will be punished!\" sneered the werewolf.\nDuring what was supposed to be an unexciting game of punishment, unexpectedly, the completely ordinary little bookworm transforms into a handsome and alluring incubus!\n\"You're my type, doggy.\" the incubus smiled wickedly."},{"name":" Smash It Girl!","avatar":"https://mangadex.org/covers/95ab0ebd-5da4-4cf7-aeab-e53cc69cb607/520d1490-b64e-4a27-b834-40281556d12f.png.256.jpg","country":"Korean","stat":"8.20","status":"Completed","tags":["Monsters,Action,Long Strip,Romance,Comedy,Martial Arts,School Life,Web Comic,Supernatural,Full Color"],"nutshell":"This is a story of a \"monster hunter\" girl who moves to the city and meets a boy."},{"name":" Midnight Sadistic","avatar":"https://mangadex.org/covers/95b1dc1f-fe96-4eb4-bfd4-5cffd8b6bfa0/1c76621c-8760-4c87-ad93-610b6846e492.jpg.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Boys' Love"],"nutshell":"\"You know what you look like right now?\nYou have that look on your face that says, \"I'm happy to be teased.\"\nAs retribution for his debtor's nocturnal escape, Takuma now works for a loan shark company and eventually freeloads at his company President, Koujina's storage room. But then, one night, he was offered to give the president fellatio in exchange for money, which led him to realize that he was an \"extreme masochist\"!\n\"I want to be satisfied by the President's teasing again...!\"\nA story of the company's extreme sadist president and a taciturn, loyal dog, extreme masochist underling's sweet, randy, and erotic SM exploits ❤."},{"name":" Touhou - Kimi to Issho (Doujinshi)","avatar":"https://mangadex.org/covers/95b3e9f6-edc9-4d6b-8cbf-4246912c0b98/b830e4f8-ed88-4d01-b94c-cd58c59da116.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Oneshot,Action,Girls' Love"],"nutshell":"A Seiga x Yoshika doujin."},{"name":" I Am a Small Kitten","avatar":"https://mangadex.org/covers/95b8b3b5-27d4-4c10-844b-111301ec0936/4157be9e-dfeb-4cba-85a5-d8b2dc1dc5ae.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.15","status":"Completed","tags":["Animals,Long Strip,Comedy,Web Comic,Slice of Life,Full Color"],"nutshell":"Somewhere within a family of three, lived four cute pets: three balls of purrs and a little puppy. Not a moment goes by without something interesting happening with these four adorable pets each and every day…"},{"name":" Boku no Ibitsu na Rakuen","avatar":"https://mangadex.org/covers/95ba5fff-7470-4aed-964f-f6d0452f4a91/8b1827c6-dd11-4b1e-8312-4740fe7bb6f0.png.256.jpg","country":"Japanese","stat":"7.85","status":"Ongoing","tags":["Boys' Love,Drama,Tragedy"],"nutshell":"Shuuhei y Yakumo solían vivir juntos atrapados en la casa del \"señor\" , donde les enseñaron a tener conductas inmorales como \"pareja\". Al ser arrestado el \"señor\", estos dos no vuelven a verse hasta después de 12 años cuando se reúnen por coincidencia. Sin poder dejar a Yakumo, quien parece estar siendo presionado para tener sexo por su verdadero hermano, Shuuhei decide llevarlo a casa. Un amor inmoral de apego y dependencia comienza.."},{"name":" White Farruca","avatar":"https://mangadex.org/covers/95c93047-ca26-4894-8e18-c81e67439d4d/1d2e4d0d-9112-4827-8e53-0fab48e00280.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Sports,Drama"],"nutshell":""},{"name":" Senpai 4koma.","avatar":"https://mangadex.org/covers/95c9358e-63f0-4ff4-bed5-6793595f5889/0e82f4a8-80a5-4dce-a429-7aa0243e01b5.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Official Colored,Comedy,Girls' Love,School Life,Web Comic,Slice of Life"],"nutshell":"Yuri 4koma about a senior and her juniors who love her so much.\nIn 2016, Tankoubon version published by KADOKAWA titled 「Senpai Ai」\n\nLinks:\n Artist’s Pixiv\n Artist’s Twitter"},{"name":" Good Morning Kiss","avatar":"https://mangadex.org/covers/95cf1f96-5c5a-41be-b4f5-d1d633f588a0/ec9e6d92-e071-4830-8e8e-d9fec73ff71c.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Ongoing","tags":["Romance"],"nutshell":"The sequel to Good Morning Call. The series takes place a few years after GMC. Nao and Hisashi are in college and are living in across from each other in an apartment complex. When Nao's father pays a visit and learns of Hisashi he takes Nao back to her family. Hisashi realizes how much he hates being away from her and proposes."},{"name":" A Happy Couple","avatar":"https://mangadex.org/covers/95d39aae-8660-4ec9-9ab0-1057b3ad2f9c/8abb54f1-d25f-437c-b3e6-089f6e591af2.jpg.256.jpg","country":"Japanese","stat":"8.76","status":"Ongoing","tags":["Romance,Comedy,Web Comic,Slice of Life"],"nutshell":"A story about a happy couple."}]