[{"name":" Renai Anagram","avatar":"https://mangadex.org/covers/e93e890e-2722-41e1-b927-4c6a1f37be88/2c9f5a80-c4c2-4937-bda1-77bc12a58bf0.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Psychological,Romance,Drama,Slice of Life,Tragedy"],"nutshell":"Scarred by domestic violence and the sudden departure of her mother and her younger brother, Satsuki doesn’t know how to trust people. Renai Anagram is the story of a young woman’s struggles to overcome her past and learn how to accept and value herself."},{"name":" Itsumo Anata no Koto Bakari","avatar":"https://mangadex.org/covers/e94287a1-79ca-47ee-b19a-1ba944ec2d3a/d24ecf7c-0a5d-4104-b6b4-a734075cbc96.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"This volume delves into the relationship between restaurant owner Takehisa and Yuichi from Suki to Iu no ni Naze Kashira."},{"name":" Nweho","avatar":"https://mangadex.org/covers/e9483d5f-2bf7-4f2a-845a-1a3cb5a0b182/28c6b89a-413d-4f66-84c8-9e1990b8befb.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Long Strip,Romance,Comedy,Adventure,Drama,Fantasy,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"A girl is saved by a fox and goes on an extraordinary adventure."},{"name":" Love Doesn't Talk","avatar":"https://mangadex.org/covers/e94d0d45-41a8-4692-8d27-d7af3cb1ae62/ef6d25b5-daf0-4630-bf19-94fa13f15ba4.jpg.256.jpg","country":"Japanese","stat":"8.26","status":"Completed","tags":["Long Strip,Romance,Comedy,Drama,School Life,Web Comic,Full Color"],"nutshell":"No words needed to convey all of the feelings I harbor for you. A full-color, textless webtoon of sweet, innocent love…"},{"name":" Tenshi Girl","avatar":"https://mangadex.org/covers/e94d4138-945f-4868-9fdf-d7a088232d94/3677d22e-d542-4d5b-b39a-b82729b825ac.jpg.256.jpg","country":"Japanese","stat":"8.21","status":"Completed","tags":["Oneshot,Romance,Comedy,Magical Girls,Magic,Philosophical,School Life,Slice of Life,Supernatural"],"nutshell":"Aho Girl's spin-off manga."},{"name":" I'm Banging My Rival in a Parallel World!?","avatar":"https://mangadex.org/covers/e94d804d-f6e1-49b6-830e-4eb0f7d842a2/ca653510-c1c2-4e28-89a0-ea8d0788b246.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Boys' Love,School Life"],"nutshell":"Amatatsu is a brash, but normal high school student until he wakes up in the middle of doing it with another guy!! To make matters worse, the culprit is his biggest rival, Sen! Is it really possible he's come to a parallel world where he and Sen are a couple…!? In addition to the main story, there are other complicated love stories about a guy with a voice fetish, a boy with a crush on his best friend, and a chubby chaser. Also has previously unpublished material."},{"name":" Hatsukoi Kaoru","avatar":"https://mangadex.org/covers/e94dbe86-535e-464b-bc38-4180099b8597/34d7984d-7fe8-44d4-8948-7207db6d22c1.png.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"When the quiet Ishida finds herself in trouble on the first day of school, a sparkling Egami-kun is there to help her. They have to work together after school for a week, but his fragrance seems to linger and doesn’t go away. What will happen after one week?"},{"name":" The Cat Doesn't Seem Lonely","avatar":"https://mangadex.org/covers/e954eddb-0bdc-41f5-8921-2432fbe3635d/049d2bf9-552d-48c2-b04d-4ee2898dbe37.png.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Oneshot,Incest,Girls' Love,Slice of Life"],"nutshell":"BanG Dream! - Hikawa Hina x Hikawa Sayo\nHina goes out of the country for a few weeks. Before leaving, she gives Sayo a cat to keep her company.\nAuthor's Doujin E-book Store: https://id-hc.booth.pm/\nAuthor's Pixiv: https://www.pixiv.net/en/users/8013671\nAuthor's Twitter: https://twitter.com/hamc9162/"},{"name":" Record of the Dead","avatar":"https://mangadex.org/covers/e9571041-4804-47f1-a6df-77eca5d0843a/79d1f6b7-e552-473d-88de-0bcd1a8c1172.jpg.256.jpg","country":"Japanese","stat":"8.39","status":"Completed","tags":["Oneshot,Psychological,Zombies,Drama,Horror,Supernatural"],"nutshell":"A young woman contemplates life in a world where the dead walk."},{"name":" Next Door Country","avatar":"https://mangadex.org/covers/e9595a7c-6699-41a0-9ed0-94ef835a2e51/43f30595-e843-4d4e-96ec-fbd14014a3c5.jpg.256.jpg","country":"Indonesian","stat":"8.00","status":"Ongoing","tags":["Long Strip,Comedy,Web Comic,Slice of Life,Full Color"],"nutshell":"A silent comic about foreigners who visited Indonesia. How did they react to seeing the state of this beloved Indonesia?"},{"name":" The Lady and the Beast","avatar":"https://mangadex.org/covers/e959ee87-cae7-4903-82b3-fa8800bb8ce6/9c5ca4e6-9817-4a20-a803-840e1a77b0c1.jpg.256.jpg","country":"Korean","stat":"9.06","status":"Ongoing","tags":["Reincarnation,Historical,Long Strip,Romance,Comedy,Magic,Fantasy,Web Comic,Supernatural,Adaptation,Full Color"],"nutshell":"100 years after her death, Empress Martina, the founder of the Carabella Empire, reincarnates as Astina Lette, the daughter of a count. Her peaceful, everyday life as a noble lady, a stark contrast to her past life, is short-lived, however.\nWith the bankruptcy of her father's failed trade business, her family falls into great debt. Astina decides to sell herself off to marry Grand Duke Thereode in place of her sister Kanna to save her family from their financial crisis. But Thereode is forever cursed to take on the form of a beast, and no one expects her to survive the night with him…\nStill, defying all odds, she fights the beast with her impressive swordsmanship, and miraculously survives. Over time, a slow relationship begins to kindle between them as she tames him as her pet.\n\nFollowing a life of bloodshed and heartbreak, the great Empress Martina is reborn as Astina, the genius daughter of a humble count. But her peaceful world is shattered when bankruptcy forces her father to marry her off to the dangerous Archduke Atalenta. All of high society knows him as \"Theriod the Beast\" because of a family curse that turned him into a wild monster. Luckily, even the deadly beast of Atalenta is no match for the former empress's mighty sword.\nEveryone is shocked when the new archduchess tames her husband all too easily and takes over as the family head. No one's more surprised than Astina, however, when her casual kiss returns Theriod to his human form. Not only does he resemble her past life lover, but he has no memory of her from his wolf days. Despite these awkward circumstances, can the new power couple join hands to rule over the archduchy?\n\nOfficial English Novel Translation\nOriginal Webtoon: Daum, KakaoPage\nOfficial Translations:\n\nEnglish\nFrench / Français\nGerman / Deutsch\nIndonesian / Bahasa Indonesia\nJapanese / 日本語\nThai / ภาษาไทย"},{"name":" Announcements Will Be Made in the Security Room","avatar":"https://mangadex.org/covers/e9662f3b-7444-4df2-9c63-865fffd4f3f6/71c9d8ca-a2b5-4f69-adf4-a01ec08e66a5.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Psychological,Long Strip,Drama,Full Color"],"nutshell":""},{"name":" Nonke Joushi, 30-nichi no Kaihatsu Method","avatar":"https://mangadex.org/covers/e9686b6d-7e84-4b7e-ad41-e8100c541566/f9b0fbe0-0963-4cf1-b6e9-956934b7fbbc.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Ongoing","tags":["Romance,Comedy,Boys' Love"],"nutshell":"For 30 days, I'll make him mine…! This is a battle-filled love between a gay subordinate and his straight boss (who has already been trained)."},{"name":" Ro-Kyu-Bu! Half Time","avatar":"https://mangadex.org/covers/e969bac8-3675-419a-b606-cd72ea37e30c/dd613365-4073-4bf7-b491-585aea5368bc.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Comedy"],"nutshell":""},{"name":" Shachiku to shoujo no 1800-nichi","avatar":"https://mangadex.org/covers/e96b9209-2f0f-423b-9736-0c5d3a9788ba/a0cbc3c0-1f12-4b5f-b467-be3d0c638b13.jpg.256.jpg","country":"Japanese","stat":"7.35","status":"Completed","tags":["Drama,Slice of Life"],"nutshell":"The corporate slave lives with a teenage girl …! Single old man x teenage girls junior high school student, under one roof! Masahiko Azumane is a man who works all night even on holidays and almost never catches a break from working, it is normal for him to return home in the morning. One day, a girl named Yuri, came to visit him, saying that she was the daughter of a former high school classmate. The two started living together under the promise of \"until her mother comes to pick her back up”\nalt. Raw"},{"name":" Parallel Lines","avatar":"https://mangadex.org/covers/e96f6e90-8182-4de9-a242-58cc095fe9c8/42912cfd-c08f-4fdc-83fe-60b862590f6b.jpg.256.jpg","country":"Japanese","stat":"7.62","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"1-2) Parallel Lines + Rise Line\nIchiya, a young gay man, falls in love with the adorable Minato as soon as he enters fashion school. Alas, next to Minato there's Jirou, an annoying guy with a goatee!\nThe competition between Ichiya and Jirou to get Minato's favor begins! Or that's what they thought… But as they keep spending time together and bickering, Ichiya starts to think he's the only one allowed to criticize Jirou. Are the two rivals falling in love with each other…?\n\n\nIf You Say My Name…\nA high school junior discovers a freshman practicing boxing in his favorite quiet place in a park. Since then, the two boys meet up at lunch time… without knowing anything about each other – not even the other person's name. One day, the freshman kisses him. Suddenly, there's a growing urge to know more about each other… and to call the other's name.\n\n\nFly Straight to the Sky\nMakita Shou has a problem, and that problem is Nakanishi Yuuichi. Yuuichi is smart, hot, and good at pole vaulting. Shou likes having a rival, but he can't catch up to this one! When Shou fails a test and Yuuichi suddenly offers to help him study, the two begin a friendship… until Yuuichi kisses him?!\n\n\nCaffe Latte Letter + Extras\nTane-san owns a cafe and makes a superb cafe latte that looks as good as it tastes. One day, a man named Kotarou walks into the cafe and Tane has feelings again after a year of being apathetic…."},{"name":" Code Geass - Love Is A Strong Word (Doujinshi)","avatar":"https://mangadex.org/covers/e9745440-7b0e-4985-ad14-073add178447/8800ae11-0ee6-4e9c-8468-3baa7a6aff63.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Comedy"],"nutshell":""},{"name":" Star Children","avatar":"https://mangadex.org/covers/e976b06f-6e78-4206-aa1c-dcba61424c08/af179e3d-2885-416a-9a02-c00c8ea087d9.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Action,Adventure,Drama"],"nutshell":"In a near future where humans have safely traveled to Mars, the space program is looking to go to Jupiter for the first time in history. For Subaru Yuuto, Amami Kosei, one of the elite astronauts of the crew of Jupitonia (the ship heading to Jupiter), is not only a person that he looks up to but is also a dear friend of many years. But tragedy strikes and a malfunction causes an explosion in Jupitonia and the ship goes missing in deep space, most believing the crew to be dead.\nEven with the devastating loss of a friend and hero, Yuuto joins the Core Space Academy to become a super class astronaut (aka Sirius) just like Kosei once was and explore parts of the universe that has not yet been known to man. The competition is cutthroat and he has to become the best of the best if he wants to be where his hero once was. Although the fear of the unknown is immense, Yuuto must learn to overcome it and become the hero for the next generation."},{"name":" Station","avatar":"https://mangadex.org/covers/e97803d8-2da9-40f4-a440-9da235b2c143/8844c988-898a-4d95-92db-ab20914c7309.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Psychological,Comedy,Office Workers,Philosophical,Drama,Police,Slice of Life,Tragedy"],"nutshell":"(from ebookjapan):\nNakamura, a new Shinjuku station attendant, is always cheerful and kind, but a screw-up. Rationalist Chief Isoyama is not happy with him and wants to send him to Iwate, but the stationmaster refuses to budge and says he will let him \"participate in the creation of an ideal station\".\nThen the news of the breakdown of the automatic ticket gate comes in. Nakamura stands at the ticket gate and demonstrates his brilliant handiwork, despite Isoyama's dismay."},{"name":" Mahou Shoujo Lyrical Nanoha - Fu-Rin Box-ing (Doujinshi)","avatar":"https://mangadex.org/covers/e97d3a26-b296-4c99-b8c7-e7f3335b47cb/4b0982d9-c681-4076-be1e-9e7e8d37b943.png.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Oneshot,Girls' Love,Slice of Life"],"nutshell":""},{"name":" Working!! Re:ORDER","avatar":"https://mangadex.org/covers/e9852611-4f11-4a76-ac6c-fd9fafc41793/f4f8bf6a-6616-49c2-af97-45473b135005.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Romance,Comedy,Slice of Life"],"nutshell":"Continuation of the Working!! series."},{"name":" Daughter of Heaven","avatar":"https://mangadex.org/covers/e9885e39-48c4-4977-9c44-3c711a470da0/6a3f79f4-d33c-4fec-8819-70ca382d2983.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.91","status":"Ongoing","tags":["Historical,Romance,Fantasy"],"nutshell":"He is a small country’s crown prince; born in the cracks of privilege, maturing on a bloody path, duty-bound to never turn back, to continue forward on his king’s road with hardships beyond compare. She is the daughter of a sinner who had fled the city, who slowly changed her role as she grew up. Was this pushed forth by fate, or caused by human nature? During troubled times, the predestined man and woman met, mutually fell in love, oppressed, and killed. Is this a choice between love and virtue, or is it up to fate to decide? In this feast of kings, who exactly is the victor? (Moon Bunny Cafe)"},{"name":" Ghost Heights Management Association","avatar":"https://mangadex.org/covers/e993775d-c4dc-4186-a5e9-0e1100a04427/ec4e19ec-8a7a-4f63-aacc-3755257719a9.jpg.256.jpg","country":"Japanese","stat":"7.53","status":"Completed","tags":["Oneshot,Comedy,Horror,Supernatural"],"nutshell":"A oneshot that appeared in Comic Flapper 2015-02."},{"name":" Nikujo no Susume","avatar":"https://mangadex.org/covers/e995212b-f1b2-4ced-a7d4-a26ae58406da/0610ff00-be52-4ce5-a29e-9af3f8b82ebe.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Comedy,Slice of Life,Cooking"],"nutshell":"Women who love meat more than a job or love… they are called \"meat women\".\nMeat… the sole oasis for unmarried office ladies around 30 who are desperate both in their work and love life. Stuffing your face with tonkatsu, yakitori, gyudon, and all those yummies without caring about the calories is the ultimate bliss of life. Neneko Kobato’s delicious gourmet manga follows these office ladies as they eat through all that juicy meat!"},{"name":" Shokuba no onna no ko ni toushi suru hanashi","avatar":"https://mangadex.org/covers/e9959d65-4b80-4199-aa82-77bb22789096/d6b31f17-224e-4d67-bee7-24ea7839c904.jpg.256.jpg","country":"Japanese","stat":"8.56","status":"Ongoing","tags":["Romance,Office Workers,Web Comic,Slice of Life,Gyaru"],"nutshell":""},{"name":" Tokage","avatar":"https://mangadex.org/covers/e99cb7f4-cfb9-491c-9fe6-a429d4989432/175eec8c-7cd2-4bd0-8fa1-72cf9d6a84b9.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Genderswap,Action,Supernatural,Mystery"],"nutshell":"Tokage, a soul cursed to forever wander the world, unable to rest nor to join the reincarnation cycle, is now looking for its release. This time Tokage enters the body of a newly dead girl named Yuuka, a shrine maiden. This body requires continual recharging from a highly spiritual person, whom the dead person must have had an attachment to. This person is Shinobu, a younger boy, who also lives in that shrine. Thus starts the adventures of Tokage and Shinobu in a world gone mad, amidst the chaos and carnage that gravitates to an unsent soul draw."},{"name":" Mortal Kombat","avatar":"https://mangadex.org/covers/e9a43274-52cc-425e-9871-877894200b00/99c73bd8-caa4-4213-b335-44190fb9780f.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Action,Martial Arts,Adaptation"],"nutshell":"Mortal Kombat manga based on the 1995 movie by Paul W.S. Anderson as it takes iconic movie scenes in manga format.\nFrom the 1996 issue of Comic BomBom."},{"name":" Kagijin","avatar":"https://mangadex.org/covers/e9ab336a-46a9-4952-aea4-cd42c79c6d4a/ce19f3f6-5a5a-4e1d-a5d9-94a0ea650e86.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Action,Adventure,Fantasy,Supernatural"],"nutshell":"To be free like a swallow out of its bird cage, thats what Tsubame sees in his eyes. In the East Asian Desert, #13 Salvage Camp, Tsubame works as a metal scrap collector as he tries to earn enough money to travel on his own, like a free swallow. But one day a girl was found buried inside sand and she has a key hole on her wrist, the symbol of a Kagijin, one who posses demonic powers that can withstand that of an army. The empire who kept her as a slave arrives to retrieve her, however Tsubame refuses to hand her over and promises her that he will free her. How will he do so? And what significance is there to the key that hangs around his monkey's neck? Read and find out!\nFrom the one shot in Akamaru Jump Winter 2009 issue (1/10/09)."},{"name":" Goddess Above","avatar":"https://mangadex.org/covers/e9abb13e-ad2b-4681-b83a-37275fe2406a/ee8382a4-2714-4082-b0b3-2d71468a4057.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.76","status":"Ongoing","tags":["Historical,Long Strip,Adventure,Drama,School Life,Slice of Life,Supernatural"],"nutshell":"The scion of the Jiang family, Jiang Jiang, unexpectedly inherits the legacy of her ancestors. The Feng Shen journey of a new generation begins!"},{"name":" Mobile Suit Gundam N-Extreme","avatar":"https://mangadex.org/covers/e9adf937-bc19-4d94-8b34-88fd74615737/6bf9ec59-ff54-4458-971d-e4b67e0863eb.png.256.jpg","country":"Japanese","stat":"8.09","status":"Ongoing","tags":["Sci-Fi,Action,Mecha,Isekai"],"nutshell":"One day, Amagi Sai and Ebihara Chikage are transported to another world by a mysterious woman who wants them to save the world.\nThe first volume of the collaboration comic for the popular arcade game \"Mobile Suit Gundam EXVS.2 XB\" is now available!"},{"name":" Satou-san wa PJK","avatar":"https://mangadex.org/covers/e9b550d1-e2d5-4f69-b63a-7c58b13736c6/baed71d8-9670-4924-9c0e-9e904f626cb0.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["4-Koma,School Life,Slice of Life"],"nutshell":"Chiharu had to transfer to a new high school in her third year. She was seated next to Sato-san, who calls herself a PJK, a professional high schooler who does every school assignment and activity perfectly! But what's the mysterious beauty's persona really like? Follow along with the exciting life of a PJK!"},{"name":" Naze Naze Kanojo","avatar":"https://mangadex.org/covers/e9b5b839-014c-4a0f-8d4e-60b07808f934/ee76910e-b4cb-4b45-9d42-1e7bb5a374b5.png.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life,Web Comic,Slice of Life"],"nutshell":""}]