[{"name":" Akiiro Bousou Biyori","avatar":"https://mangadex.org/covers/26e59cd1-48fd-4f18-88bf-9748f91da1e3/1c11fb4f-4638-46f6-aa36-36a9d6438099.jpg.256.jpg","country":"Japanese","stat":"7.34","status":"Completed","tags":["Oneshot,Official Colored,Romance,Comedy,School Life,Full Color"],"nutshell":"Aki is head over heels in love with a classmate but doesn't know how to confess."},{"name":" Killing My Love","avatar":"https://mangadex.org/covers/26e8a6d9-0081-4823-9116-a7b8040df4cb/1c4840ee-1a4c-4052-9dc1-58cd8a7d2b0d.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.74","status":"Completed","tags":["Action,Romance,Drama,Fantasy,Web Comic,Supernatural,Mystery"],"nutshell":"Certain lovers are selected anonymously, only to find a strange symbol etched to their necks. Once those who are selected get too close to each other, or within the “Danger Zone,” one of them will die an explosive death. Suspicion, scheming, and murder… Once star crossed lovers, now enemies, willing to kill each other without hesitation…\nNing Yuan, a young emotionless man, is suddenly thrust into this cruel game of death. How will he protect his “Soulmate?”\n\nLovers have been dying in the cruelest way possible. Victims were sliced up into pieces, as if their bodies had exploded. Andrea and Ian were mere bystanders to this spectacle until a misunderstanding throws them into “Killing My Love” (KML)!\nThis is a game that uses love to fuel murder. Each team of pairs are given targets that they must kill… or else. All the while, a sadistic gamemaster watches from the shadows.\nKML is a game with no end in sight, but one thing’s for sure… this hell is just getting started.\n\nOfficial Translations:\n\nEnglish: INKR, Tapas\nKorean / 한국어"},{"name":" Kono Te o Hanasanai","avatar":"https://mangadex.org/covers/26e9eb17-f52a-47b7-b8c3-0fed97900a7d/8719c4ba-31a3-4b87-b196-a065b87054d8.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Drama"],"nutshell":"Kou and Yukako have been friends since elementary school but over the years Kou has fallen in love with his childhood friend and when he found out that she was moving as a result of her family mounting debts he was devastated at the prospect of losing his best friend and the woman he loved.\nThat was back in junior high. A few years after their separation, Kou and Yukako meet again. Kou is happy to see her after so many years apart but at the same time shocked at how frail and thin she has become. The strong genki little girl he knew was gone and in her place stood a half-starved homeless girl forced to steal to eat."},{"name":" Chou Chou Chou Daimahou Touge","avatar":"https://mangadex.org/covers/26f0cb27-721a-42ea-b9bb-f0116bc1bb8a/8d38bd89-e03c-4cfb-86cb-9d2cb475bbe0.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Magical Girls,Magic,Fantasy"],"nutshell":"Punie is next in line to become queen of Magical Land. However, she must spend a year on Earth before she can inherit the throne, so she transfers into a school in Japan. She's usually a sweet and gentle girl... that is unless someone does something to displease her, then she'll drop the act. She won't hesitate to whip out her magic stick and cheerfully rain bloody destruction down on the hapless fool, or barring that, simply use brutal wrestling moves to punish them. Accompanied by her animal mascot Paya-tan, who makes regular attempts on her life (still bitter about being defeated and then forcibly recruited from Waku Waku Mascot Village), and forced to fend off random attacks by various people from her Kingdom who all have different reasons for wanting her dead, she must complete this year of training on Earth without fail.\nThis is essentially the fourth volume of Dai Mahou Touge."},{"name":" Koucha Ouji","avatar":"https://mangadex.org/covers/26f24d58-e548-446d-af80-c7cd38a44da7/fc5d9897-b592-44b7-99a9-e97b2f3064e4.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Supernatural"],"nutshell":"According to a legend, at midnight during the full moon, if you mix a cup of tea in a white china cup with a silver spoon in the reflection of the moon, a tea prince will appear to grant you three wishes! Well, as it turns out, the legend is true, as Taiko and Haruka of the Tea Association soon discover. Earl Grey and Assam appear ready to grant the wishes of those who brewed their tea but they can't really grant big wishes.. nor can they go back to their world until their summoners use all three wishes…"},{"name":" The Boulder","avatar":"https://mangadex.org/covers/26f5d899-8acd-4117-8b7e-82398bab0c3e/32df0b4d-b2fa-4104-839d-4a88c2586c7d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sports"],"nutshell":"Author's Twitter"},{"name":" Golden Print","avatar":"https://mangadex.org/covers/26fd7925-f4d7-43af-bcc3-19d93677975a/dd87e035-b54d-45ed-863e-1a9c6a79b064.jpg.256.jpg","country":"Korean","stat":"8.00","status":"Ongoing","tags":["Time Travel,Long Strip,Drama,Fantasy,Slice of Life"],"nutshell":"I wanted to design!\nA dream I have had since I was 12 years old and have nurtured since then. For thirty years I worked hard, not missing a single day, but the reality is that I'm a construction site manager constructing buildings for other people. If I hadn't made that choice back then... Would I have become an architectural designer? Thirty years after all that, a miracle happened to me.\nI went back to my university school days 20 years ago, in 2010.\nI'm 22 years old, but with 20 years of field experience, I'm going fulfil my dream of being an architectural designer and make world famous designs of my own!"},{"name":" An Angel Fell Into the Garden","avatar":"https://mangadex.org/covers/2700c93d-4b11-46f9-82a5-5a2341ab3180/1b8a0c6c-351d-42a1-afeb-12e294b8d336.jpg.256.jpg","country":"Japanese","stat":"8.40","status":"Ongoing","tags":["Web Comic"],"nutshell":""},{"name":" Yasuraka Monsters","avatar":"https://mangadex.org/covers/27020aad-ab31-4792-9a5c-26658b23c012/f789a9d2-4769-4931-9794-f3fa37786927.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Monsters,Comedy,Supernatural"],"nutshell":"Not everyone wishes for a peaceful afterlife... least of all Bonzo Scalobania, whose dearest wish is to find a case for a skeleton detective like him to solve! Along with his unreliable assistant, Vampy Vinegret, and zombie frenemy/bounty hunter Nero Lichman, Bonzo swears to solve the problems of Limbo City! But does it still count if the problems he's solving are ones of his and his friends' own making?? A wacky, weird, heartwarming tale for the undead in us all. [Kodansha]"},{"name":" Tsukiyo wa Ecchi na Okubyou Ookami","avatar":"https://mangadex.org/covers/270437c8-4925-4a57-8228-9c5db995d684/cda06b31-2164-43bd-ad86-ba0eadc7733c.png.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Oneshot,Romance,Comedy,Boys' Love,School Life,Fantasy"],"nutshell":"In a world where monsters are common in the human world, an unlikely friendship develops between a werewolf and a regular high-schooler over their love of sweets."},{"name":" Hotman","avatar":"https://mangadex.org/covers/270e95b1-6b6f-4a19-9030-9ba9d4626088/ab382561-771a-4d9c-8eec-b092353a1d9a.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life"],"nutshell":"Enzo Takaya, character inspired by Jean Reno, is a teacher and the oldest son of his family, as such, he takes care of his siblings like a father. One day, a 5 year-old girl is found on their doorstep with a note: she is the result of Enzo's former life of crime and luxury as a gang member. Although he ignores who the mother is, he decides to take in the little Nanami. She unfortunately suffers from a skin disease due to sensitivity to pollution and certain types of food. So, Enzo becomes a health freak…"},{"name":" Sea Son","avatar":"https://mangadex.org/covers/270e9e50-b13f-4c4d-880b-12316972423e/aa76acd1-5858-468a-b2cf-c8bfff7acc06.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.17","status":"Completed","tags":["Oneshot,Historical,Adventure,Fantasy,Cooking"],"nutshell":"A young man's stubborn obsession with strange foods."},{"name":" Office Lady Who's Bad With Kids and a Quiet Grade Schooler","avatar":"https://mangadex.org/covers/270f39b2-ab4a-4900-93fd-6df5da534a34/94afc17f-0ca3-465f-8045-29b98772b14f.png.256.jpg","country":"Japanese","stat":"7.53","status":"Completed","tags":["Oneshot,Web Comic"],"nutshell":"||They don't match their appearances.||\n Artist’s Twitter\n Artist’s Pixiv"},{"name":" Juusan Nengo no Kimi","avatar":"https://mangadex.org/covers/271065e1-6c71-4dae-86cd-f1842ddb0d54/75a0b33f-d014-4857-bced-6835b9404c94.jpg.256.jpg","country":"Japanese","stat":"8.21","status":"Completed","tags":["Reincarnation,Romance,Comedy,School Life"],"nutshell":"13 years ago they were boyfriend and girlfriend; now they are student and teacher.\nThirteen years ago, Tatsuomi died in an accident and is then reincarnated as middle school student, Fushimi Arata. And then one day, a new teacher comes who was his previous life's lover, Midorikawa Utako. A heartwarming story of reincarnation that weaves hopes into the past, present, and future!"},{"name":" Joshikousei no Mudazukai","avatar":"https://mangadex.org/covers/27179c2f-72d7-4a49-a577-2fa6eaf9df4d/639801e3-3d73-43d4-a04d-56ede38709fd.jpg.256.jpg","country":"Japanese","stat":"8.78","status":"Ongoing","tags":["Comedy,School Life,Slice of Life"],"nutshell":"One day out of boredom, Tanaka decided to give her classmates nicknames based on their quirks. Her friend Kikuchi became “Ota” for her nerdy interests, and her other friend Saginomiya became “Robo” because of her expressionless personality. In retaliation, her friends decided to name Tanaka “Baka”. These are the ridiculous days of three high school friends claiming (or not) the height of their youth."},{"name":" Touhou - Babanbabanki (Doujinshi)","avatar":"https://mangadex.org/covers/2717a72b-713e-4da0-a847-942671154b00/8bbd6c9b-b027-4bd8-a60e-5be92eecd93a.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Oneshot,Comedy,Drama"],"nutshell":""},{"name":" Hikari no Umi","avatar":"https://mangadex.org/covers/271b44b8-9b6f-4c0d-a1d0-1b162c5df8d4/0838efde-4559-453f-a785-9f819b175526.png.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Romance,Drama,Slice of Life,Supernatural"],"nutshell":"Collection of five short stories revolving around mermaids and mermen.\n\n\nSea of Light -\n\n\nThe Moon on the Waves -\n\n\nThe River Family -\n\n\nSayonara, Spangles -\nNatsuki and Ecchan are friends with a mermaid who dreams of growing legs. With the help of a spell book and Natsuki's crush, Mizuno-sempai, the girls hope to fulfill her dream; unfortunately, the plan brings some unwanted complications.\n\n\nThe Residents of the Water Kingdom-"},{"name":" Shinsouban Clover no Kuni no Alice ~Wonderful Wonder World~ Deluxe Edition Booklet","avatar":"https://mangadex.org/covers/272876ae-2bc0-49d1-aa3b-e80a2bff9d2b/f80f0040-ed3c-4047-946f-0858abca7b20.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Fantasy"],"nutshell":"This deluxe booklet was packaged with the deluxe version of the Shinsouban Clover no Kuni no Alice otome game, which itself is a remake of the original Clover no Kuni no Alice game. It contains, among other things, several short stories."},{"name":" Obscure Love","avatar":"https://mangadex.org/covers/272c6caa-f253-46cb-acc2-b608bfa770cf/7d63d254-548f-4df6-abda-2b27fd22fe4b.jpg.256.jpg","country":"English","stat":"8.08","status":"Ongoing","tags":["Thriller,Psychological,Romance,User Created,Horror,Villainess,Tragedy"],"nutshell":"A 20 year old innocent college girl experiences her first crush becoming obsessed and tainted with obscure thoughts, getting rid of competition between her and her crush."},{"name":" Nidur","avatar":"https://mangadex.org/covers/272d99f6-b7a6-4aa9-bf14-4ca741882977/7bcb4920-1fc0-49ca-94be-79b4b8d0e4f0.png.256.jpg","country":"Swedish","stat":"8.07","status":"Ongoing","tags":["Historical,Action,Long Strip,Adventure,Magic,Fantasy,Web Comic"],"nutshell":"Haldur lives with his family in a small village called Vikfrost. Through his dreams, he feels as if someone is watching him. And when a group of magicians comes to Vikfrost threatening to take their homes, the pieces start to fall in place.\nTapas version\nWebtoon version\nChapter 1 Print Copy"},{"name":" Seito Kaichousama no Pet","avatar":"https://mangadex.org/covers/273e8fab-bd25-469c-b1ae-784e4dd65052/db2dc097-dbe0-412a-8072-099e7b6252dc.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life"],"nutshell":"From Attractive Fascinante:\nNizaki Eito was just about to sneak back into the dorm after finishing his part-time job when he ran into the student council president, Fujima. Because it was against the school rules, Nizaki agreed to become Fujima’s pet. When Nizaki started to get really popular, Fujima got jealous and decided to let go of him. However, Nizaki threatened Fujima instead and wanted Fujima to become his pet. Was it for love or for revenge?\n\nTenohira no Ondo (Temperature of Palm)\nDaisuke's been acting troubled at work lately, and is always being called to the HR department. His childhood friend Motoki wants to find out why, but when he asks he receives an answer he wasn't expecting: Daisuke asks Motoki, \"Can I kiss you?\""},{"name":" Loveology","avatar":"https://mangadex.org/covers/27406c35-6cab-44ca-8078-cc60f7316f20/1231c5b3-14e0-4886-9318-62ef16e166cc.png.256.jpg","country":"Korean","stat":"7.94","status":"Completed","tags":["Long Strip,Romance,Slice of Life"],"nutshell":"Dating was my easiest feat(?). The story of a date-virgin bidding farewell to his life as a single.\nKo Jangga, a 29-year-old office worker who has never dated anyone, gets coached by his childhood friend and colleague, Sun Jichan, on love and on life."},{"name":" Soredemo Kamawanai","avatar":"https://mangadex.org/covers/27429207-52ce-43d5-90f5-339070ae8307/3c4951df-3e1e-480a-81f1-ae09ea1d8ead.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Romance,Comedy,Boys' Love,Office Workers,Drama,Slice of Life"],"nutshell":"Okumura's first impressions of his new coworker were \"hardworking but untrustworthy\" – but he didn't realize, he was actually helplessly cute…"},{"name":" Youjo Senki - General Staff Headquarters Record of a Crying Little Girl Incident (Doujinshi)","avatar":"https://mangadex.org/covers/27456a35-575c-4597-aa06-1fb7e1a02c7b/95772549-08cd-4f45-8d4b-17bbf7d72ac7.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Reincarnation,Historical,Magic,Military,Isekai"],"nutshell":""},{"name":" Shikushiku Shikushi","avatar":"https://mangadex.org/covers/27460a35-aa42-4764-8f8b-51e47df59762/3780a737-8321-4513-96d7-4d08e39ed9f8.jpg.256.jpg","country":"Japanese","stat":"8.28","status":"Completed","tags":["Comedy,4-Koma,Supernatural"],"nutshell":"Tsukushi is a deity of weather, and based on her mood the weather will change. With her being a bit of a crybaby, however, it seems to rain a lot near her. Together with her friend Inari—a fox mask—she travels throughout Japan in hopes of becoming a first rate deity."},{"name":" Wicked Mega Man","avatar":"https://mangadex.org/covers/27472687-8e66-4abd-b940-655b426623b1/0298d108-e35d-477c-99e3-d9eb2ec2899c.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Oneshot,Sci-Fi,Action,Comedy,Mecha,Survival,Adventure,Video Games,Adaptation"],"nutshell":"A parody of Ken Ishikawa's Lethal Weapon and the first Mega Man game. Done in Ken Ishikawa's style.\nArtist's Twitter"},{"name":" THE iDOLM@STER - GANAHA Style (Doujinshi)","avatar":"https://mangadex.org/covers/27473a00-9b47-4106-afbf-7709e4b46299/8d4917f4-66c4-47ad-ab94-d891fd37bfa0.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot"],"nutshell":""},{"name":" BanG Dream! - Jukunen Fuufu Joshi Kousei (Doujinshi)","avatar":"https://mangadex.org/covers/274cdd0c-8c10-4c7b-85c1-14fbd1976fc7/ce3ec231-16e5-4b56-9a8c-404ea290cf6e.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":"Link:\nThe Doujinshi & Manga Lexicon"},{"name":" Wizard and Brat","avatar":"https://mangadex.org/covers/275056e1-221e-4c8e-8fb6-e2ce2b1b6457/f35df229-23ff-41fb-a0b8-c178bbda4d04.jpg.256.jpg","country":"Chinese (Traditional)","stat":"7.99","status":"Completed","tags":["Sci-Fi,Action,Demons,Comedy,School Life,Horror,Fantasy,Supernatural"],"nutshell":"A young superhuman has precognitive dreaming, a demon-summoning experiment goes wrong, and a fantastic schoolyard battle for the fate of humanity begins.\nA wildly imaginative tale, Wizard and Brat rolls action, science fiction, fantasy, romance and plenty of humor into one entertaining series."},{"name":" Osananajimi wa Onnanoko ni Naare","avatar":"https://mangadex.org/covers/27578f15-e6c5-4378-b07f-8bbdeac90b39/d4326d28-bbea-4bc5-9066-e183bfa16cf0.jpg.256.jpg","country":"Japanese","stat":"7.64","status":"Completed","tags":["Genderswap,Comedy,School Life,Supernatural"],"nutshell":"On one particular day, a high school student, Shuichi, saves a magical fairy Sylphy from drowning in a pond. When Sylphy offers to grant one wish out of gratitude, Shuichi immediately asks for a “cute childhood girlfriend.” Sylphy then turns Shuichi’s childhood male friend, Iori, into a girl…! The newly female Iori is surprisingly cute…!"},{"name":" Ooedo Shitamachi Komoridou","avatar":"https://mangadex.org/covers/275b5836-7e49-43ab-8427-5a162ddc8ccf/0da7e8c2-6898-418a-b1b2-b6cec2544d49.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Comedy,School Life,Supernatural"],"nutshell":"Hana is a pretty serious young woman who is not interested in love and who lives in a religious sanctuary in Japan. One fine day, she finds a baby in the garden of the complex. Abandoned at the foot of a cherry tree, it holds out its arms to him; the young woman then collects it to take care of it, and suddenly, the charming Koba also appears at the temple.\nHana, not really gifted with feelings, does pretty well with the young child, but can she really pretend to be in a relationship with Koba to raise him?"},{"name":" Kuroi Kaze","avatar":"https://mangadex.org/covers/275c1fd1-3b52-44d8-870f-9bd6c2e442d7/89fc26c3-105c-49b8-87ea-4c764ef54f61.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Historical,Action,Psychological,Ninja,Comedy,Survival,Martial Arts,Samurai,Adventure,Military,Drama"],"nutshell":"(from ebookjapan):\nThe year was Genna 2. One year had passed since Toyotomi's forces were destroyed by Tokugawa Ieyasu. In the midst of all this, there was a man who was attacked by the enemy and lost his memory. His name was Kozuki Kazenoshin, a ninja known as \"Black Wind. In addition to the title story, \"Kage of the Ninja\" depicts the exploits of the Koga ninja, \"Yuka\" was published in \"Bessatsu Margaret,\" \"A Confrontation\" describes the ruthless world of revenge, and \"Kaze wo Kakeru\" is a short historical action drama collection that includes five works: \"Kaze wo Kakeru,\" a death struggle between father and son who share blood!"}]