[{"name":" Mae yori mo Dare yori mo","avatar":"https://mangadex.org/covers/baaf5843-6897-4ef4-9b2b-49af13da9ff0/e8b4f2ad-c945-4d81-ae5b-0c8d3b59815a.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Romance,Comedy,Boys' Love"],"nutshell":"The first three stories are about 3 brothers.\n\n\nMae yori mo Dare yori mo\nThe eldest brother, Shunpei, picks up a prostitute boy in order to refuse an arranged marriage by his grandfather\n\n\nNo one but you\nThe middle brother, Takashi, makes his old temporary lover enter his father's company\n\n\nBody guard\nThe youngest brother, Tomoaki, loves his manservant.\n\n\nThe other three stories are unrelated:\n\n\nBluish spring\nThe professor who invented the medicine of \"rejuvenation\" tells his student of his feelings\n\n\nSea turtle ping pong tale\nRomance in the high school ping-pong club.\n\n\nFamily\nA homosexual couple with a kid looks back over the past of their youth.\n\n\nAdditional story (extra from the first 3 stories): new year's family reunion, from the grandfather's point of view."},{"name":" Datte, Douse, Demo, Kitto","avatar":"https://mangadex.org/covers/bab615ed-469a-4ab5-b3b0-f948387e4290/dcac727b-119f-48fc-9f68-0c255ea228bb.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Oneshot,Romance,Comedy,Drama,School Life"],"nutshell":""},{"name":" Counterstop Yuusha no Over-raise: Shouraiyuubou na Maou to Hime wo Deshi Nishite Mita","avatar":"https://mangadex.org/covers/bab788c3-33e0-44da-b3e4-c81d54a586f3/5d4bc3d4-7e06-451f-9c71-85d004b96d65.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Ongoing","tags":["Action,Comedy,Fantasy"],"nutshell":"Kiri, a summoned hero, has acquired amazing strength as a result of 300 years of training out of caution. In order to return to his original world, he has taken Eimu, a naive girl who is the daughter of the \"Demon King,\" as his apprentice to train her to become the most powerful along with the addition of May to train, a beautiful sword princess who has her very own problems, Kiri begins a journey where they will do whatever they want, no matter what kind of monsters they face in their path ."},{"name":" Isekai Cheat Magician","avatar":"https://mangadex.org/covers/babc3f06-f618-487b-be06-c213ea75f489/eeab3bb1-165d-471b-8d44-d50bc118f318.jpg.256.jpg","country":"Japanese","stat":"5.49","status":"Ongoing","tags":["Action,Romance,Adventure,Isekai,Fantasy,Adaptation"],"nutshell":"As regular high school students Taichi and Rin disappeared in a beam of light. When they came to, the two of them were already in a world of swords and magic. Finally getting away after experiencing an attack by monsters, following the suggestion of adventurers they headed on the path towards the guild. In the guild, the two of them found out that they possessed unbelievably powerful magic. Thus the regular high school students transformed into the strongest cheats…"},{"name":" Beyond the Sky","avatar":"https://mangadex.org/covers/babe48ea-f0d1-481c-a285-8bb13166ba0d/aa95896f-b035-40b1-ba92-8b29d82e168e.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.29","status":"Ongoing","tags":["Sci-Fi,Action,Mecha,Drama,Full Color"],"nutshell":"Han Qingyu lived peacefully for nineteen years, and never thought that one day he would become one of the main characters in an epic. An accident occurred out of the blue. The boy was forced wield a knife and began to face everything he knew nothing about: the invasion of civilization, the Azure Alliance, the mobile energy suit, the unique witness corps; the blade of exile, the sharp streams... He is narrow-minded, he is \"The Qing Major\" painted on cars and high-rise buildings in the era of full-scale military conscription; he will make the first cut in the Zenith War."},{"name":" Toumei na Usui Mizuiro ni","avatar":"https://mangadex.org/covers/babf0a8a-fd67-48c2-8a3c-a898e44ef411/baf58fec-7a48-424b-a6e1-c6be66f35891.png.256.jpg","country":"Japanese","stat":"7.57","status":"Completed","tags":["Romance,Girls' Love,Drama"],"nutshell":"The manga follows a love triangle between Ichika and her two childhood friends Ritsu and Shun."},{"name":" Le Masque","avatar":"https://mangadex.org/covers/bac1e4c1-aa13-454d-abee-9394fb215726/614d0693-db95-474e-adbf-3a9eb5020c94.png.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Psychological,Drama,Slice of Life"],"nutshell":"A man spends his day with a big smile on his face. Eventually, he goes out to the ocean and takes his mask off..."},{"name":" Non-chan to Watashi","avatar":"https://mangadex.org/covers/bacf6a9f-daeb-426b-b2bf-ad17ae2ddd95/45cb5032-f462-4743-8d1a-40ee25bbc683.jpg.256.jpg","country":"Japanese","stat":"7.68","status":"Completed","tags":["Oneshot,Romance,Drama,School Life"],"nutshell":"Risa and Takumi are childhood friends, but due to a fight in the past, they stopped talking to each other. Now university students, Takumi is a famous playboy who goes out with a different girl every day, and Risa still regrets not having been able to apologize for what she did six years ago…"},{"name":" You're so Playful","avatar":"https://mangadex.org/covers/bad0da58-7352-4e00-a234-d09f9adb19b8/74d9d746-4a5c-4047-b438-a0081986bef1.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":""},{"name":" Time Goes By and Love Never Disappears","avatar":"https://mangadex.org/covers/bad0ee89-f661-4aed-a4d9-d603b9295a84/22613220-6203-46f2-89a3-2db247780241.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.92","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Fantasy,Web Comic,Full Color"],"nutshell":"There shall always exist heavenly and earthly beings. Creation is never-ending. A lifetime is like a white steed flitting past a crack. It happens in the blink of an eye.\nAll beings in this universe are ever-changing.\nEverything flows and nothing abides.\nA lifetime is but a fleeting ray of sunlight.\nIt goes by in the blink of an eye.\nZhou Luoyang reunites with Dujing, who left three years ago without saying goodbye. He soon discovers that Dujing is working at a dangerous private investigation firm. They accidentally obtain the watch of the Eye of Forseti, which holds the power to look back upon time, and fall into a perpetual cycle of time… During these countless cycles, they keep each other company and save each other’s souls…"},{"name":" The Vampire and the Bachelor Next Door","avatar":"https://mangadex.org/covers/bad14a5f-dffc-4589-b0ab-e0a2b5f3a897/ca1c2949-7428-47c5-8db8-1e745100b0ad.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Cancelled","tags":["Long Strip,Romance,Comedy,Drama,Vampires,Web Comic,Supernatural,Full Color"],"nutshell":"An unemployed bachelor meets an enigmatic vampire. What will happen? Find out in this hilarious webtoon."},{"name":" Marriage in a Heartbeat","avatar":"https://mangadex.org/covers/bad2a52f-c5de-4099-aa19-f5e661187c35/99beb2c2-f3e7-4cf9-8c98-3bfebd323c20.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.52","status":"Ongoing","tags":["Long Strip,Romance,Drama"],"nutshell":"Due to an accident, he was raped by a woman he had gone on a blind date with!\nWho was he? The crown prince of the capital! Rumor has it that he attracted countless socialites and ladies to bow down to him, but he was pure and did not get close to women.\nWho was she? The eldest daughter of a wealthy family who was not loved.\nHe said, “Marry me and our marriage will be your best protection.”\nShe said, \"I don't want to use you as a tool. Plus I don’t have feelings for you.”\nHe smiled at that and said, \"I’m rather fond of you. \""},{"name":" The Other Side","avatar":"https://mangadex.org/covers/bad308cb-c96e-4d87-8e9d-49e593850dbb/1664023e-57bd-4259-a601-4f81336bdecb.jpg.256.jpg","country":"Indonesian","stat":"7.85","status":"Completed","tags":["Long Strip,Horror"],"nutshell":"A collection of horrific fiction stories about mythical creatures that haunts everyday lives. Anyone can be their target. In fact, one of them probably lurks among you."},{"name":" Merry Marbling","avatar":"https://mangadex.org/covers/bad92115-4108-4de1-a2af-6db815230c80/2f4e4c61-d972-473f-beed-7fccf607a10a.jpg.256.jpg","country":"Korean","stat":"7.43","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Drama,School Life,Web Comic,Slice of Life"],"nutshell":"When he was young, Lee-ahn found and returned a large bag of money and garnered fame as a \"Christmas Angel.\" Since then, Lee-ahn has been very conscious of how others perceive him. Yugeon, who has just moved into Lee-ahn's building, could care less about the gazes of people around him. He acts out at school and even ditches classes. When she learns of Yugeon's arrival, Lee-ahn's mother hopes that he will take care of the outsider for the sake of his reputation. Reluctantly, Lee-ahn obeys his mother. However, Yugeon realizes that Lee-ahn used him for his own image. When Yugeon threatens to tell Lee-ahn's schoolmates about it, Lee-ahn gets defensive... \"I don't care if you tell them. Just know, whatever happens next is not my responsibility.\" I was just going to end things with no regrets... Just wait! Do whatever you want!! Like a beautiful marbling that doesn't mix with water, these two create a beautiful dissonance."},{"name":" Katsuragi-san wa Tori Tsukare Yasui","avatar":"https://mangadex.org/covers/badb8d13-014f-4a57-9646-14d5ac11a8d7/d5bed010-d290-40e0-a75b-df160c096bb0.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Ghosts,Boys' Love"],"nutshell":"Katsuragi, a very friendly office worker, is still working overtime to help his colleague's work today. His recent worries are the mysterious handsome convenience store clerk Mizuki. The customer service is unfriendly, but for some reason their eyes meet and his shoulder can be touched at the cash register.\nHowever, what Mizuki was seeing was a ghost possessed by Katsuragi !!\n\"It's too defenseless for you to forgive ghosts.\"\nMizuki doesn't seem to be able to leave Katsuragi and worried about even the ghosts he possesses !?"},{"name":" Mamacolle","avatar":"https://mangadex.org/covers/bae119f6-977f-406a-b443-c3bb380edd2d/861f567a-1f10-4438-a2f1-8e261e454c92.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Drama"],"nutshell":"There's a new pet that has been found! It's called a baby, and Asahina Tamae is the only one in her class that doesn't have one. She finds three babies one day that seem to be special. They can do things that other babies can't! But before Tamae can keep them–she has to prove herself to her mother. Out of all her siblings, she gets the worst test scores, and the last thing she needs is another distraction."},{"name":" Mahoutsukai no Neko","avatar":"https://mangadex.org/covers/baebe4db-9d17-4515-9fc1-798cb263171e/55a4e0f5-d370-47ac-8268-daa73a240eca.jpg.256.jpg","country":"Japanese","stat":"7.46","status":"Completed","tags":["Action,Animals,Adventure,Magic,Isekai,Fantasy,Supernatural"],"nutshell":"Rio is a 14 year old boy with no particular special traits, except his burning love for books. He’s awkward and considered odd at best by his peers. Rio also has a twin brother, Mao. Although they look alike, they couldn’t be more different. Mao is good at everything, popular, and has future plans to have a big, happy family. Despite their differences, the brothers are close.\nOne day, when Rio attempts to retrieve a cat that wandered into the street, he is hit by a car right in front of his brother’s eyes. Everything fades to black. In the darkness, a voice offers a choice: to live or to die. Fading rapidly, Rio gives the obvious answer: to live! Turns out this was quite the loaded proposition.\nRio awakens in a world filled with foreigners and strange animals he’s never seen before. That’s not the only odd thing–Rio now has the form of a black cat! He quickly learns cats are revered in this world because of their special role as familiars of wizards."},{"name":" Kensei no Shougou wo Motsu Ryourinin","avatar":"https://mangadex.org/covers/baebe61b-5864-4fcb-a705-3a5f3573e371/def01ae6-188e-4df6-84a1-b73c0a46f8a8.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Ongoing","tags":["Reincarnation,Action,Adventure,Office Workers,Isekai,Fantasy,Monster Girls,Cooking,Adaptation"],"nutshell":"The chef Haruki Shindo was involved in an accident and was send to a different world.\nThere, he gains the skill of \"Kensei\" who can master the sword technique of the sacred level, but that triggers him to get caught up in the torrent of another worlds swirling crisis …!\nWhat happens to Haruki's chef life !? The strongest different world cooking fantasy, opening !!!"},{"name":" Tenisaki wa Kusushi ga Sukunai Sekaideshita","avatar":"https://mangadex.org/covers/baece9f5-6383-4d5a-b6e0-3676fe0b2d5b/828edd8a-cb87-451d-8e04-bae09a6a503b.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Ongoing","tags":["Demons,Romance,Adventure,Isekai,Fantasy,Adaptation"],"nutshell":"An airhead God mistakenly killed the female MC and to make up for it decided to teach her his craft of potion-making and sending her to another world filled with magical creatures and the like.\nA knight seemingly enchanted with the girl decided to join her in her new life as a potion-seller!"},{"name":" Forced to Be a Princess After Reincarnating in Another World","avatar":"https://mangadex.org/covers/baf0f410-61ae-4f92-84f2-63ae3d2d0aa9/73800a78-0707-4b0e-ab23-3b309aed05a6.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.45","status":"Ongoing","tags":["Reincarnation,Official Colored,Long Strip,Romance,Adventure,Isekai,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"She is a police officer who has been living independently and accidentally crossed into another world on her way to work. What kind of story will she tell in this completely unknown world?"},{"name":" Rin to shite Karen na Hana no you ni","avatar":"https://mangadex.org/covers/baf350e8-55f6-48c9-9f0f-a095a5dbe8e6/40e7a5da-67b6-44ce-9a62-15264385923e.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Ongoing","tags":["Action,Girls' Love,School Life,Supernatural"],"nutshell":"Childhood friends Isuzu Rin and Yuuki Karen are always together, but every time they open their mouths they get into a fight…. But they are connected by a secret. In truth the two are fighting day and night against a enemy - the Fatals - beings that manipulate emotions to drive people into despair. But now there's a mysterious transfer student, an enemy that knows the secret of Rin's body, and someone at school has taken an interest in Karen?! With many ups and downs, the stylish action duo Rin and Karen begin their story!"},{"name":" Lapis Re:LiGHTs","avatar":"https://mangadex.org/covers/baf5b3ce-17b2-4c85-bd8d-0c1c0c8787e4/2ef8d0a1-f8ba-4473-9dd6-eacda475d15d.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Magical Girls,Magic,School Life,Fantasy"],"nutshell":"The \"Idols\" don't only sing, they use magic too. Do you believe in Idols?\nIdols in the world of Lapis Re:LiGHTs use magic too!\nTiara aims to be an Idol (Witch) that makes everyone around her smile! Will she be able to fulfill her dream at Flora High, a school that trains witches?"},{"name":" Yokosu Inu, Mekuru Yoru","avatar":"https://mangadex.org/covers/baf5d83f-f876-4d40-b05b-9e6ed957b903/b019ef92-7575-4706-abcf-c631e1229f82.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Ongoing","tags":["Psychological,Boys' Love,Drama"],"nutshell":"The setting is a yakuza-run casino. Part-timer Kikuchi is a hoodlum and a dealer. He's being punished for getting Shintani involved in an embezzlement scheme. The one who ordered the punishment is the boss's \"woman,\" Sudou. The order is \"Rape Kikuchi on video.\" Shintani steadfastly refuses this arbitrary command, but with the promise of Sudou taking him in his mouth, he might see his way to raping a sobbing Kikuchi… Raise the curtain and jump into the middle of a messy, underworld, three-way relationship!"},{"name":" How a Single Gold Coin Can Change an Adventurer's Life","avatar":"https://mangadex.org/covers/baf680e9-07b2-40df-a737-0852f912f0bf/0abb7e01-3148-4757-a431-937f3e2d65b9.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Ongoing","tags":["Monsters,Action,Comedy,Adventure,Drama,Fantasy,Adaptation"],"nutshell":"Istolfa is a ruffian - permanently poor, his primary struggles are finding food and a place to sleep at night. One day, while picking weeds in order to try and make money, he comes across a gold-ranked adventurer. The adventurer, surprised at his fortitude, gives him words of encouragement and a single gold coin.\nWith this single coin, Istolfa’s life would permanently change."},{"name":" Tokyo Snow White Project","avatar":"https://mangadex.org/covers/baf901b1-38f4-427b-a984-098e4ae08725/1fe87567-d630-4395-aa22-bd4f52261c7d.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Sci-Fi,Monsters,Action,Comedy,Mecha,Superhero,Martial Arts,Office Workers,Slice of Life,Cooking"],"nutshell":""},{"name":" Lost Girl wa Koi o Suru","avatar":"https://mangadex.org/covers/bb0076af-e984-4e47-bd82-730d451ad546/0606f7a7-9b32-4439-9971-5745a8ba86a5.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Comedy,Slice of Life"],"nutshell":"Nakajima Hiromi was born into an ordinary family and raised under ordinary circumstances. Working at a medium-sized company, she hopes that one day she'll be able to attain some sort of happiness. With the fear of being isolated, Hiromi isn't sure how to interact with her introverted coworker, Katsuma Yukihiro. But in order to help things along, somehow Hiromi has entered his home… and will be living with him?!"},{"name":" Deep Insanity Nirvana","avatar":"https://mangadex.org/covers/bb0e0b80-113a-4516-8c9e-0df47e004590/8fb67632-740e-4a5b-8817-c1707aac9d34.jpg.256.jpg","country":"Japanese","stat":"7.71","status":"Ongoing","tags":["Sci-Fi,Monsters,Action,Adventure,Horror"],"nutshell":"One day, a large hole named Asylum is discovered in Antarctica. At the same time, the mysterious coma-inducing illness Randolph Syndrome begins spreading around the world. Many countries sent an investigation squad to the asylum, believing it to be the cause of the disease, but not a single person safely returned. Sergiu Sol, a boy with a special resistance to the disease, and Antarctica's jack-of-all-trades Hildegard Olympiada Yamada, decide to take on the challenge of the large hole without a map, but…!? What is the cause of the coma-inducing disease? What in the world is the Asylum? Go down to the deep, jet-black bottom, one with insanity."},{"name":" Cooking Papa","avatar":"https://mangadex.org/covers/bb0ec1d7-2606-4ff6-9e6e-a4a87901d85f/f011cf5f-91cf-46cf-91b6-4f620b2160f9.jpg.256.jpg","country":"Japanese","stat":"8.50","status":"Ongoing","tags":["Award Winning,Romance,Comedy,Office Workers,School Life,Slice of Life,Cooking,Mystery"],"nutshell":"Araiwa Kazumi is your run-of-the-mill salaryman and father. He’s also secretly an amazing chef! While his coworkers at Kanemaru Industries all eat out for lunch, he pulls out his lunchbox… It’s time for this cooking papa to show off his pro-level cooking skills!\n(from Manga Helpers):\nAraiwa Kazumi is an energetic salaryman who is able to perfectly manage his responsibilities at work and at home. Kazumi is also a fantastic chef, though many of his coworkers are unaware of it.\nHis wife Nijiko, who works as a journalist, has a bit of trouble making time for her home life. However, she tries to always be a cheerful mother.\nWith their son Makoto, who is 7 at the beginning of the story, they have a very happy family. This is a story that follows the Araiwa household and their delight with delicious food. Cooking instructions are also often included throughout the story.\n\n\nWon the 39th Kodansha Manga Award Special Prize in 2015"},{"name":" Ningyo Desu ga Daite Kudasai!","avatar":"https://mangadex.org/covers/bb0f6565-5da1-4ed1-bf23-10ebb023dbca/45d8af39-3ccd-4f21-8c6a-13a65b8603a8.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Fantasy,Web Comic"],"nutshell":"A mermaid wishes to become human in order to design shoes. She goes to the surface as a human but if she gets wet she turns back into a mermaid. At school, she meets a guy who also makes shoes and they become close. He eventually finds out her secret but he still likes her. She slowly begins to fall in love with him. However, a shark boy from the sea wants her to be his so bad that he followed her to the surface and tries to force her to be his!\nNote: Only vol. 1 is published as print."},{"name":" Bastard","avatar":"https://mangadex.org/covers/bb169078-7289-4f95-948f-9315960e6905/754567a4-754f-4bc5-988c-c387a95e4b6d.jpg.256.jpg","country":"Korean","stat":"8.86","status":"Completed","tags":["Thriller,Psychological,Long Strip,Romance,Crime,Drama,School Life,Horror,Web Comic,Mystery,Full Color,Tragedy"],"nutshell":"\"There is a murderer living with me.\"\nGeneration discord thriller."},{"name":" Trattoria Yamiichi","avatar":"https://mangadex.org/covers/bb20fffc-5d61-4563-97df-c8898f25fca8/254d1736-b6e5-4c9b-9490-fd617b1bd5c7.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Historical,Romance,Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"Quando o tenente Giovanni lidera o exército italiano na ocupação do Japão, o que ele sente mais saudades é da comida da sua terra natal, a autêntica cozinha italiana, que nenhum chef japonês consegue reproduzir. Mas Kento e sua Trattoria desafiam seu paladar… E o tenente Giovani encontra algo mais saboroso que a comida italiana… Não percam esse romance cheio de comédia e com cardápios italianos de dar água na boca."},{"name":" Touhou - Shoujo-tachi no Spécialités - Spécialités Filles (Doujinshi)","avatar":"https://mangadex.org/covers/bb225b85-4342-402f-aac1-72f5f061c645/b1c823aa-8ec7-446c-9805-be8f4ac39919.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Anthology,Slice of Life,Cooking"],"nutshell":"An anthology, with 9 stories of the Gensokyo girls presenting their own food and drinks of choice.\n\n\nMuenzuka Sweet Pickled Ginger - Komachi gets the Three Fairies stealing ginger buds, and gives them both work and a lesson for that.\n\n\nBaked Cheesecake and Pu-erh Tea - The Crown Prince wants to take a courtesy gift to Eientei. She initially wants to take a dessert of heavenly virtues, but ends up settling for a earthly one with probably even greater virtues."}]