[{"name":" Daikanojo","avatar":"https://mangadex.org/covers/8fab81da-d9cc-48a9-a737-65039b541724/247a8638-6db8-44c1-8e98-e4aecc6f3535.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Completed","tags":["Comedy,School Life,Supernatural"],"nutshell":"Heartthrob is going to save the world?! From a life-size high school girl, a new girl of the century has finally appeared. Mitsushima Hikaru (15) is a run-of-the-mill freshman who holds an unrequited love towards her senpai (a sophomore) from the astronomy club. But one day, after she makes a wish upon a falling star, she becomes fused with the star (alien) for some reason. Hence, she obtains the strange ability to grow into a giant. That is when Hikaru's life goes for a complete change, as she begins to do battle as a giant heroine?!"},{"name":" Saisei no Phantasma","avatar":"https://mangadex.org/covers/8fb46b58-2e53-4d44-9a73-3227dc34232a/b6d52ea0-26e5-48ff-92ae-f8d2621dd865.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Action,Supernatural"],"nutshell":"The battle fantasy manga revolves around a criminal's daughter, Shumari, and the young man who became her bodyguard, Tougo. When Shumari is attacked by human-eating ghouls, Tougo, a super-powered \"adept,\" appears."},{"name":" A Demon Wanders at Night","avatar":"https://mangadex.org/covers/8fc0f4fc-f43b-4f6d-9333-9b4e36fa2880/5981cc06-0f2b-499f-8193-97919bb71350.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Historical,Drama,Horror,Slice of Life,Supernatural,Adaptation"],"nutshell":"Adaptation of a popular novel.\nFive years after the Tokugawa shogunate collapsed—- Kizou is the dour, misanthropic owner of a used-goods store. One night, out of the blue, the demon Koharu wanders into his house, having gotten separated from his group of wandering spirits. Koharu impudently assumes he can stay there for free, and Kizou unwillingly relents. The two of them wind up getting involved in the affairs of various spirits… A story of empathy among spirits during the Meiji era that will move you with kindness."},{"name":" Ouji-sama Sama no Jijou.","avatar":"https://mangadex.org/covers/8fc575e5-fd84-46ce-b18c-62e4bf53acc8/4250eb07-5963-4667-bbc9-cd839b5bc826.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"Popular boy Kagami is horrified when his secret is sniffed out by the infamous anime club President, Tsukishima. Tsukishima agrees to keep his secret, as long as he submits to her terms…"},{"name":" Hiki","avatar":"https://mangadex.org/covers/8fc927b5-b3d2-45e0-bc11-c04ea35f299d/f9f531e0-0b49-4f72-9619-ce4f18498749.jpg.256.jpg","country":"Japanese","stat":"7.37","status":"Completed","tags":["Psychological,Ghosts,Horror,Supernatural,Mystery"],"nutshell":"While searching behind his desk drawer, Rin finds a hand drawn map of his neighborhood with a big X marking a specific spot. He doesn't recognize it, because he must have drawn it a long time ago, but he's curious to see what he marked with that X. Three childhood friends join him, and they discover an abandoned chest of drawers at the X location. Wondering if there might be something inside, Rin pulls open the drawers and unknowingly unleashes a horrific chain of events…"},{"name":" Ookiku Furikabutte - Mizu no Naka (Doujinshi)","avatar":"https://mangadex.org/covers/8fc9f82b-3cea-4866-bea7-47041a751ec7/d253c0ef-2edd-49cb-9930-bc7cc5c3c302.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Boys' Love"],"nutshell":"Pairing: Abe x Mihashi\nRating: PG-13"},{"name":" Rules / Hydra - If Winter Comes, Can Spring Be Far Behind? (Doujinshi)","avatar":"https://mangadex.org/covers/8fca7098-b42c-44db-b591-e638e271c318/116504b2-1dcb-43a1-9c99-ef0a45474f98.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Boys' Love,Slice of Life"],"nutshell":"Follows directly after the events in Rules volume 1 Chapter 6 & Extra this continues the tale of Hikaru, Yuki, & friends. A glimpse into Hikaru's life, past, and feelings."},{"name":" Fate/hollow ataraxia - Root Mitsuzuri (doujinshi)","avatar":"https://mangadex.org/covers/8fcaf6e7-1dbc-4837-adef-1eb2958aa4c6/7752393e-da44-4710-a398-7a24b7f4e5b6.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Romance,Fantasy,Slice of Life"],"nutshell":"Yet another fanbook. No waifu - no laifu."},{"name":" The Great Venerable Demon Has Returned","avatar":"https://mangadex.org/covers/8fcbfd66-bdcd-4f6a-9f34-09e134843a90/c13624bd-e58d-4a9b-a7ee-df1e0016f9b8.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Ongoing","tags":["Reincarnation,Official Colored,Action,Long Strip,Martial Arts,Adventure,Drama,School Life,Fantasy,Full Color"],"nutshell":"Read The Great Venerable Demon Has Returned Translated by anshscans\nZhang Yi was a tragic teenager Robbed of his girlfriend by Hu Tianhua, he was even swindled into taking on millions in debt so that his father had no choice but to sell off their family property. Finally, his father died of cancer, overworked to death.\nBut when Zhang Yi abandoned all hope and committed suicide, not only did he not die, but rather encountered a blessing in disguise:\nHe transmigrated into the Ancient Immortal Continent and was born with great abilities. His rise was unstoppable. With heaven-defying cultivation, he rose to the position of the most supreme Demon God in just a few years. Trampling on the 18 layers of asura hell while wearing the 36 layers of heaven on his head like a crown, he still met his doom. Since he was in possession of an immortal treasure, the heavenly book of transformation, the so-called righteous people ganged up on him in a surprise attack. Finally, it ended in mutual destruction.\nBut after his death, Zhang Yi returned back to Earth, back to the time when he was attending university."},{"name":" Do as you please","avatar":"https://mangadex.org/covers/8fccaebe-e622-40e9-aa17-02ba0e26919b/985f4ee6-6571-4a0e-9da0-8f57ed13f936.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Ongoing","tags":["Long Strip,Romance,Comedy,4-Koma,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"A story about a young man and a neet doing whatever they please. A Doraemon parody\nhttps://twitter.com/kanengomi53"},{"name":" Lip Line wa Kiss de Midashite","avatar":"https://mangadex.org/covers/8fd71883-31de-4829-8ad6-daaa913b3ad0/1c032919-d5bd-4898-886a-50c61c21251c.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Ongoing","tags":["Romance,Boys' Love"],"nutshell":"Yuzu works as a makeup artist in the entertainment industry. One day, while doing work as usual, he witnesses a female makeup artist getting scolded by the director. Unable to leave her all alone, Yuzu helps and ends up doing makeup for Kai, a member of the new idol group TREY…"},{"name":" Highly Skilled Doctor","avatar":"https://mangadex.org/covers/8fda13b2-5aad-4f1c-91ed-086c127a4918/b7da327a-aebc-4004-9193-38753931c95d.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.10","status":"Ongoing","tags":["Action,Harem,Fantasy,Web Comic,Full Color"],"nutshell":"The poor student (Shi Li) was expelled by the dean of the college, in (Shi Li) decided to drop out of school and return to the countryside! Then he fell and died, and he mistakenly obtained the inheritance of the divine doctors, and since then, he has been saving people and punishing the evil, his life has changed, and beautiful women have begun to gather around him …"},{"name":" Touhou Bougetsushou ~ Silent Sinner in Blue.","avatar":"https://mangadex.org/covers/8fe61dfd-ca48-4aba-94fc-dbe8d3cb490a/f7b25c27-e217-4de4-9fc0-e1b2dbd2fe61.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Action,Drama,Fantasy"],"nutshell":"東方儚月抄 (romanized Touhou Bougetsushou, meaning Eastern Ephemeral Moon Vignette) is a loosely interconnected storyline about the Lunarians that includes Silent Sinner in Blue, Cage in Lunatic Runagate, and Inaba of the Moon and Inaba of the Earth.\n\nOfficial Release:\n\nIndonesian release by Elex Media"},{"name":" Osu Mama","avatar":"https://mangadex.org/covers/8fe98de3-fe4c-47bf-a726-a77395c2938f/6c987a4b-6ff4-424f-8c17-b8ed98ac44e6.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Boys' Love,Full Color"],"nutshell":"The birth rate is falling sharply in 21st Century Japan. To combat the decreasing numbers, there's only one option left: get men pregnant. Yuki and Ryu are chosen to test a new drug that makes conceiving possible for men and are randomly paired up for the experiment. Yuki has to have sex with Ryu every day, even though he doesn't like him. However, the experiment has a condition: you can't leave the experiment until you give birth to a child. Reluctantly doing their best to get pregnant, Yuki and Ryu slowly start growing closer,but their time's running out! Then there's a new and embarrassing experiment with a loving couple, Ren and Rui, that gets them in the middle of even more embarrassing action!"},{"name":" Claymore - The Warrior's Wedge (Doujinshi)","avatar":"https://mangadex.org/covers/8fea2354-ba0e-41cb-aeb1-18e33d972dfb/3c3615df-fd83-4d47-bf04-0f3213810ca3.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.06","status":"Completed","tags":["Action,Fantasy"],"nutshell":"A Claymore doujinshi about the Rockwell massacre. Featuring Teresa, Hysteria, Rosemary, Irene, Europa, and a variety of OCs."},{"name":" Tales of Crestoria","avatar":"https://mangadex.org/covers/8feb3dfa-7ccf-4065-9295-ab145abbf4a2/b3edb46a-9e11-486b-b4b2-441b34f3989a.png.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Action,Adventure,Adaptation"],"nutshell":""},{"name":" Wicked Cupid","avatar":"https://mangadex.org/covers/8feb8e3a-9ba1-4b57-82b0-613f8ca7915e/abb31fc4-acfc-44ba-af30-9b7b4709a3b7.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Demons,Romance,Comedy,Mafia,Magic,School Life,Supernatural"],"nutshell":"The Koinobori yakuza family's souls are expensive commodoties, a source of great pride to those of the demon world's soul bank. But when the Koinobori heir, Ryuji, is born with a pure soul engrossed with fairies and angels, it's up to Maria to become his personal cupid and reform him so that he continues the Koinobori's lascivious family line!"},{"name":" Their Weekend Situation","avatar":"https://mangadex.org/covers/8fec9bbb-a96c-4fd7-afb0-4a3a768bb5b2/e5e7da85-7b06-4739-808d-ff14918e7356.jpg.256.jpg","country":"Korean","stat":"7.95","status":"Completed","tags":["Long Strip,Romance,Comedy,Boys' Love,Web Comic,Full Color"],"nutshell":"Woojoo attends college in order to chase after his unrequited love! But as soon as he’s admitted to that college, his crush gets enlisted in the army! As Woojoo loses his first love, he gains a new love at the same time who's his senior, Leehyun. In order for Woojoo to stay by Leehyun’s side, Woojoo proposes a part-time job for 200 won per month. That part-time job is precisely for Leehyun to play with Woojoo all weekend!\nWill Woojoo be able to succeed with his presumptuous strategy?"},{"name":" Tenshi-chan to Akuma-kun","avatar":"https://mangadex.org/covers/8ff245e6-df38-41ac-86db-886126c1910d/e9143ff0-ae7e-4fee-b426-cc34f73c6b9c.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"Have you ever heard of names that are read in an unusual way or have strange meanings? You know the ones that'd make feel like you could die of embarrassement if you were to be called by them? Those are known as uber fail names. This is the story of two people who carry such a burden. (From: MU)"},{"name":" I Spy","avatar":"https://mangadex.org/covers/8ff5119a-1bd4-4f07-a34c-5a891356e009/cb06bf09-f9b8-4f7e-b8c2-cc95b3f6bcd5.jpg.256.jpg","country":"Japanese","stat":"8.30","status":"Completed","tags":["Action,Romance,Comedy"],"nutshell":"The one-shot was originally published in the February 2018 issue of Jump SQ on February 2, 2018. The one-shot was later reprinted in Shōnen Jump+ on November 29, 2021, in place of a normal SPY x FAMILY chapter, with extra content describing its connection to the manga series."},{"name":" Dungeon Meshi - Glimpse (Doujinshi)","avatar":"https://mangadex.org/covers/8ff5a93a-9bee-44df-85c5-df3b141aa37d/c10ba82f-6431-4c22-94a5-baea98e6eaea.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Oneshot,Comedy,Adventure,Fantasy"],"nutshell":"Artist’s Pixiv"},{"name":" Foxy Foxy","avatar":"https://mangadex.org/covers/8ff8bfd4-994e-47ae-8e08-9b1f1042bb7c/ee2e45a6-7f01-43c4-8423-607f0ef1a98e.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Hiatus","tags":["Boys' Love"],"nutshell":"Our dramatis personae: a mysterious girl named Rin; an hobo and his precious bag, contents unknown; and an insane gay man? A brand new world with her trademark intriguing characters, unfurling before your eyes."},{"name":" SLASH/DOG","avatar":"https://mangadex.org/covers/8ff999ee-2734-45bf-b97a-1b041dda90d5/338c337f-450e-4926-96a8-dcd569b633a8.jpg.256.jpg","country":"Japanese","stat":"7.68","status":"Completed","tags":["Monsters,Action,Romance,Comedy,Magic,Harem,Fantasy,Adaptation"],"nutshell":"Caught with a severe fever, Tobio Ikuse, a second-year high school student, was forced to miss his school trip on a luxury liner with his schoolmates. Four days later, Tobio hears the news about the disappearance of the teachers and second-year students from his school, and it devastates him. A few months after the incident, Tobio, having slowly recovered from the sudden loss of his friends, accidentally encounters one of them again. Chasing after his missing friend Sasaki, Tobio finally manages to catch upto him, but is shocked to see Sasaki alongside a Lizard Monster who attacks him together with the monster. Cornered by the monster, Tobio is rescued by another survivor of the missing luxury liner, Natsume Minagawa, who then hands him an egg before parting ways. Later that night, Tobio finds himself under attack, again, this time by two people with monsters. Amidst all the ensuing chaos, out of Tobio's shadow, came out a Puppy that rescues him. After fending off the two monsters, Natsume once again approaches Tobio before finally deciding to take him to their hideout."},{"name":" My Street","avatar":"https://mangadex.org/covers/8ffad6d7-b345-4781-b40d-5f35170dc3ed/a9681536-b8ba-47c2-ad95-dd3a8849c2f4.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Completed","tags":["Sci-Fi,Romance,Drama,Fantasy,Slice of Life"],"nutshell":"What to do when you're a young Asian immigrant, living in a European slum, with no choice but to hit rock-bottom?\nOn the usual menu, blackmailing, theft, prostitution…until one day, enough is enough. But the mafia won’t stand for that!\nNarrowly escaping the people who wanted him dead, Maoye is then picked up by a bizarre old woman. Taken care of in her hut filled with killer bees, he must listen to the strange stories she tells him every day. A story of wild young kids, even wilder and younger than him. They're on the run as well…but ready to do anything to find love and peace, no matter the price!"},{"name":" My Secret Boyfriend","avatar":"https://mangadex.org/covers/8fff8d2b-37b2-4f84-a031-5544b27d79bc/f7fc44a9-76e5-4876-b3a0-6dcceb7aba0a.png.256.jpg","country":"Malay","stat":"7.98","status":"Completed","tags":["Long Strip,Romance,School Life,Delinquents,Full Color"],"nutshell":"Black and Molly are now a couple, but their relationship spells trouble for Black Storm. In an attempt to avert anything untoward, Benjamin decides to take matters into his own hands. Is Benjamin really acting out of loyalty to Black Storm? Or are his intentions selfish in nature? An action-packed romance begins..."},{"name":" 100% Gokuama Kareshi!","avatar":"https://mangadex.org/covers/900279dc-9b15-4edc-83c3-5979e66b33d4/94e15b81-8d06-425a-8f43-172e393cc581.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"A sweet love story that will melt your heart!\nA gathering of the sweetest boyfriends.\n“No matter where you are or the time of day, I will protect you.”\nStory 1 Kodomo Jya, Naino (Yoshioka Ririko)\nStory 2 Natsu ga Chikai (Kimura Ayako)\nStory 3 HOLE - Kirameku Sekai (Takahashi Rie)\nStory 4 BURNIN' VALENTINE (Higurashi Kinoko)\nStory 5 Koizaki (Higuchi Megumi)\nStory 6 Mame to Kurasu (Okinoko)"},{"name":" Tetsuichi","avatar":"https://mangadex.org/covers/9005951f-bfb4-49d9-bbca-c68d462ec5d2/b4443591-7750-4f35-a48d-487d083f3524.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Historical,Fantasy,Supernatural"],"nutshell":"Yonagahiko - a god(?) with a human face and a serpentine body - lives on a mountain-side with a small, mysterious boy named Tetsuichi. There is a popular legend about that mountain; a legend which tells the tale of a human who once slew the mountain god and gained possession of his powers…"},{"name":" 100 Strange Nights","avatar":"https://mangadex.org/covers/9006172e-320d-4db8-9153-1bcfd7027389/1a5609ad-fc32-4fcb-ad78-1e6c0b855b61.png.256.jpg","country":"Chinese (Simplified)","stat":"7.40","status":"Completed","tags":["Reincarnation,Historical,Demons,Psychological,Ghosts,Long Strip,Drama,Fantasy,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"A series of short stories from the Republic of China era (1912-1949). Enjoy adventurous settings, ingenious plots, mind-blowing foreshadowing, and surprising plot twists. This series will leave you calling 'encore' a thousand times over. For those of you who enjoy logic and deduction, this is one manhua you don't want to miss!\nAuthor's weibo: AGP崇阳"},{"name":" So Cute?","avatar":"https://mangadex.org/covers/900673ea-8045-4266-80b3-27c1d6d461a0/aacbc33e-5e3e-4667-91f0-306a871184ff.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Historical,Animals,Romance,Boys' Love,Slice of Life,Cooking"],"nutshell":"Morizono is a wine dealer. His daily routine consists of taking pictures of Mon-chan, his beloved cat, to post on the blog and harbouring an unrequited love for Onodera, the chef of an Italian restaurant he's currently working with. As per usual, he goes to the restaurant today but Onodera happened to find out that he's the one running Mon-chan's blog and there goes their fast approach!\nWhen he thinks that his chance has come because he never expected that Onodera would visit his house to meet Mon-chan, he realizes that he loves him so much that he can't bring himself to confess!!"},{"name":" Martini Sweetheart","avatar":"https://mangadex.org/covers/900a1982-c4a6-4f4c-a7b4-b25def358160/4ff11518-464c-4cb2-9fa9-aab49d2aeafe.png.256.jpg","country":"Chinese (Simplified)","stat":"7.91","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Drama,Web Comic,Full Color"],"nutshell":"Before starting work, Jiao Yang, a straight sales intern, discovered that the flirty guy he rejected at a bar a while ago would be his own boss --- famous screenwriter Liyuan Xiao!\nHe navigates this deep river of love with his good friends, and discovers that love is like alcohol, which is actually bittersweet."},{"name":" Love Live! - B78+ Love Centimeter (Doujinshi)","avatar":"https://mangadex.org/covers/900f0769-9318-46e7-bb1f-0346b251d6e8/01814799-67c0-4347-ac30-1a78bc41341d.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":""},{"name":" I Want To See Your Smile","avatar":"https://mangadex.org/covers/901d98b6-0705-4616-814f-6d88187cd9de/5fa224af-0021-44f5-ad49-7097592022ab.jpg.256.jpg","country":"English","stat":"7.93","status":"Hiatus","tags":["Sci-Fi,Romance,Adventure,User Created,Supernatural"],"nutshell":"Takeru Gakusha was a aspiring writer, until the universe exploration missions started, he decides to apply for these, but in the meantime he meets someone who changes his life by taking him in as a \"Teacher\" at the Yokai Carecenter, meets people who he will love for the rest of his life and is sent to space in the meantime, how will he communicate with the people on earth and will he survive this missions?"}]