[{"name":" kamigawa neon dynasty: the manga","avatar":"https://mangadex.org/covers/cb09a1aa-196b-44aa-a8cb-ff385ef1dec1/04f9aafb-374c-494f-b987-9c72cb843403.png.256.jpg","country":"English","stat":"8.07","status":"Completed","tags":["Oneshot,Action,Ninja,Adventure,Magic,Drama,Mystery,Adaptation"],"nutshell":"on a plane of the multiverse known as kamigawa a young boys friend who is also the future emperor of kamigawa goes missing after a man with a metal arm attacks one of the kami in the palace."},{"name":" Kamieshi to Tukiaitai!","avatar":"https://mangadex.org/covers/cb0b819c-e26c-44c0-bf7d-dfa7a397d367/ed22c2f2-c2f6-4c55-a7c9-c38b066754d2.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"Yumi who met at the same person event as Mr. Coreda of the favorite illustrator aims to be a kamie teacher as much as possible to be a friend!\nI don't know The introduction volume of the story This is what happens when you actually go out with a kamie teacher!?\nIt should be noted that the story, various drawings such as illustrators who have twisted too many followers appeared"},{"name":" Accord","avatar":"https://mangadex.org/covers/cb0bfb95-bf95-4396-87c9-d688201ce565/7a2b8783-3fb0-46eb-a090-84530d3542d5.jpg.256.jpg","country":"Korean","stat":"7.99","status":"Completed","tags":["Long Strip,Romance,Drama"],"nutshell":"A music practitioner with a dark past.\nA young girl with the power to create illusions.\nA meeting of fate."},{"name":" Kaze no Stra","avatar":"https://mangadex.org/covers/cb16f10e-ac94-48ff-b421-179bea8c7d60/e5face86-3b89-428f-af2e-b717c7e9f15c.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Drama,Horror,Supernatural"],"nutshell":"The beginning of the end of the world. Humans face not the fate of death, but being enslaved to cruel demons.\nAfter eons of peace in the human realm, a heinous race of demons has suddenly appeared.\nWith the wizards extinct, the only hope against the demons seems destroyed, but from this despair ridden land a mysterious boy has appears.\nCould he be the messiah who’s come to save humanity?\nA magical fantasy woven by the bond between two brothers who’ve been torn apart, be ready to carve the roar of victory in your soul!"},{"name":" Armadillo","avatar":"https://mangadex.org/covers/cb174ea9-4ff7-4c30-870f-83fd76001b9c/55a2b554-84fe-4ed7-a23f-47ae22a819dd.png.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Psychological,Adventure,Mystery"],"nutshell":"A short oneshot by Tsurita Kuniko about a guy travelling."},{"name":" Kanda-kun to Serizawa-san","avatar":"https://mangadex.org/covers/cb1aa721-ec7e-4f72-802e-65690a9b4b22/0d318cba-b96a-4d48-b590-fd0531f3b1af.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life"],"nutshell":"Short story of a Genius kid and the girl who has a crush on him."},{"name":" Bash!","avatar":"https://mangadex.org/covers/cb1aadd6-3518-47d3-9919-064ce16c3303/b466b326-614d-46a8-b1f9-408ee320008d.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Girls' Love,School Life"],"nutshell":"The Doujinshi & Manga Lexicon Links:\nVolume 1\nVolume 2\nThere are other BASH! doujinshi by the same circle that's part of the same universe, but outside the 2 volume series."},{"name":" Sense Zero","avatar":"https://mangadex.org/covers/cb1e4735-4bad-413f-8e59-2121f9f193c7/256d8017-6f48-4bf2-a913-d9482c0d0982.jpg.256.jpg","country":"Korean","stat":"7.88","status":"Ongoing","tags":["Long Strip,Boys' Love,Slice of Life"],"nutshell":"Freshman Yoonchan created quite a spectacle during the welcome party for first years. Ah-in, who just got back to school after taking some time off, somehow got himself involved with this guy who's got absolutely no sense. Things happened and now, they're actually dating?! This kind of relationship that doesn't make any sense at all… will it be okay?"},{"name":" BADON","avatar":"https://mangadex.org/covers/cb21709e-4737-43aa-8524-d26701b5212a/5376125d-8a7c-4fde-bec1-07002c72dae1.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Ongoing","tags":["Drama,Slice of Life"],"nutshell":"Four men befriended each other in prison. After they got released,\nthey moved to the capital Badon to open a high class tobacco shop together.\nThe four are determined to start a new path in life."},{"name":" Story of the Ginko Tree","avatar":"https://mangadex.org/covers/cb24265f-fcd8-4ada-8c89-4c5856541326/28cbdde5-2afd-4fd4-a295-83df9bf61c26.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Drama,School Life,Slice of Life"],"nutshell":"A large gingko tree in the school yard. It is always gently watching over the children. Under the tree, a story of love and tears begins..."},{"name":" Seal Me 900 Million Times!","avatar":"https://mangadex.org/covers/cb2545d5-33b7-4edd-a9fe-c2a6f314f230/c894dd0a-a8d5-4793-8689-7462bc38b2b9.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.99","status":"Ongoing","tags":["Official Colored,Action,Long Strip,Adventure,Wuxia,Fantasy,Full Color"],"nutshell":"Wei Daduo, a genius boy born in the Divine Realm, has always been a headache of the immortals because he can't control his divine power at all! In that case, the Divine Realm would be devastated by Wei Daduo's fart or sneeze one day... That's ridiculous!!! The immortals can't bear it anymore!  They want Wei Daduo's power sealed!\nUnexpectedly, Wei Daduo seals himself millions of times because he has been dreaming about the worldly life and he also plans to start over as an ordinary cultivator in order to fully master his power... So his worldly life begins... with two runaway girls of an unknown sect!"},{"name":" Otogi Taisen Phantasma","avatar":"https://mangadex.org/covers/cb25bbaf-4d22-42b5-ab1f-823609bf4295/989ecd37-e6fb-4675-84e6-2ebcebb81630.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Action,Romance,Comedy,Harem,Drama,School Life,Fantasy"],"nutshell":"Yamada Tarou is living a regular life, until the death of the father he never sees catapults him into the role of the 13th King of the holy Phantasma kingdom. Now that he's king, Tarou has become the target of assassins, and all he has on his side is a mistress, Princess Kaguya, whose goal is to make Tarou a worthy king."},{"name":" Killer Stall","avatar":"https://mangadex.org/covers/cb2989a6-dada-4ca6-a67a-2c5f08c0b96d/e8dca7a5-4d5c-4f01-aa00-7964074223d8.jpg.256.jpg","country":"Korean","stat":"7.99","status":"Completed","tags":["Action,Psychological,Long Strip,Mystery,Tragedy"],"nutshell":"One thing is for certain - if you exercise violence, that violence will return to you in any shape or form.\nThe man who bakes flour-based food and runs an eatery, has a darker past than anyone could ever guess.\n…unless you see the name of his store."},{"name":" Cinderella no Kake","avatar":"https://mangadex.org/covers/cb34d616-87d4-40e7-8a37-3dc947f84ff4/2c073087-52ab-4078-935e-c33c9180af8e.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,Comedy"],"nutshell":"\"You're not the type of girl who can attract a man. If you get proposed to within the next month, I'll give you a thousand dollars!\" Charlotte is a talented graphic designer, who spends her days in baggy jeans with ruffled hair. She knew her best friend, Gabe, doesn't see her as a lady, but if he's going to make such a bet, she can't just take it lying down! Charlotte decides to get back at Gabe by dramatically transforming herself…"},{"name":" Ginen Shounen","avatar":"https://mangadex.org/covers/cb36c723-0f9f-489f-8dc2-3937842e1667/931223d3-2f76-4603-8afa-73dea29d641e.jpg.256.jpg","country":"Japanese","stat":"7.65","status":"Completed","tags":["Romance,Drama,School Life,Slice of Life,Supernatural"],"nutshell":"Matataki is a high school student who enjoys photography. One day, he finds out that he can see the future when he looks through the viewfinder of his camera upon seeing the girl he likes, Mirai, kissing a stranger under a bell that is rumored to bring two people together for eternity…"},{"name":" Weekly Manga Japanese History","avatar":"https://mangadex.org/covers/cb3d31c3-8d35-4068-8cce-ffbb1eea53e8/19803dfb-6cd6-46ea-9cfe-7f15c2306bce.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Historical,Anthology"],"nutshell":"A series of biographical oneshots by various manga artists, published in 2009-2010 by Asahi Shimbun. Each issue focuses on a different notable figure from Japanese history.\nCollection of all titles released under Asahi Publications can be found on their Official Website - Link\nTitle and Author details for each issue can be found at MangaSeek (JP)"},{"name":" Daites Ryou Koubouki","avatar":"https://mangadex.org/covers/cb3ef946-c718-49e1-8f71-15014e15254d/4c88578d-9bd9-4be5-914d-56efc152bd8b.jpg.256.jpg","country":"Japanese","stat":"7.31","status":"Completed","tags":["Reincarnation,Romance,Comedy,Boys' Love,Military,Isekai,Fantasy,Adaptation"],"nutshell":"Milliana, the daughter of a duke in some remote region, used to enjoy a fujoshi lifestyle in her previous life in modern Japan. However, living in another world is pretty inconvenient., and on top of that, there are no BL books! Aiming for moe and pleasant life - including iron manufacture, communication, papermaking, and printing techniques - she begins a period of technological reformation! However, the Black Demon General Matisa busts into her life as the groom. With a bride who can freely use contemporary technology and a groom who unfolds her otherworldly cheat-like ability, here is the long-awaited unique reincarnation fantasy manga adaptation!\nNote: The author passed away in a traffic accident in August 2017, leaving the source material for the manga, the novel incomplete. Vol 8 of the light novel was the last release, in June 2017. Vol 8's synopsis suggests the story was still meant to continue.\n\nOriginal Web Novel"},{"name":" Fuuko in the Cafe","avatar":"https://mangadex.org/covers/cb406a4a-7624-4592-9f44-115b8445ef14/5e48901c-5628-43bc-953a-6ae4ea7babe0.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"Fuuko is a shy girl—so shy that she has trouble talking to strangers. Determined to change herself, she starts working as a waitress at Cafe Rhodos. The people she meets on and off the job will lead her through the often frightful world of adolescence, and beyond."},{"name":" Kuroko no Basket - Night (Doujinshi)","avatar":"https://mangadex.org/covers/cb479983-dd00-4bbc-b51f-00ffbcc67f6e/7b98ddca-6b55-4530-9437-3039ce1d11ae.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Romance,Boys' Love"],"nutshell":"Pairing : Murasakibara x Himuro"},{"name":" You're Under Arrest!","avatar":"https://mangadex.org/covers/cb48732c-c607-4612-b6e8-46318051bcf1/ef836ebf-1b68-47b3-bf90-d500a3d4e8de.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Action,Comedy,Crime,Office Workers,Police,Slice of Life"],"nutshell":"It's babes and badges! Miyuki and Natsumi are two stunningly beautiful policewomen who are, at heart, a couple of girls who just wanna have fun! When they're not getting themselves into wacky situations, they're busy enforcing the law. They're part Cagney and Lacey, part Thelma and Louise, and part Barbie and Skipper!\n\nLinks:\n\nAuthor's Twitter\nAnime Season 1 on ANN\nAnime Season 2 on ANN\nAnime Specials on ANN\nFull Throttle (sequel to Season 2) on ANN\nNo Mercy! (OAV) on ANN\nThe Motion Picture (movie) on ANN\n\nWikipedia\n\nArabic\nCatalan\nChinese (Tradtional)\nEnglish\nFrench\nGerman\nIndonesian\nItalian\nJapanese\nKorean\nMalay\nPortuguese\nSpanish\nTagalog\nTurkish"},{"name":" Stalker Jokers","avatar":"https://mangadex.org/covers/cb4a6957-a5b1-4930-b781-37a82485b95d/09eb0695-f5fe-4d18-8380-46314fcc8224.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Ongoing","tags":["Tragedy"],"nutshell":"\"Stalker problem\" that is overlooked as a serious social problem.\nThe number of incidents that increase rather than fit every time you follow the day.\nPoka Raisque, a wonderfully distorted contemporary Nippon that purifies distorted guys at once, opens !!!\n\nIt is also darkness to purify the darkness.\n\nNote: the title (Stalker Jokers) is a pun on Stalker Jokua (purification) dan (group)"},{"name":" Barairo Emperor","avatar":"https://mangadex.org/covers/cb51656f-7133-407b-958a-83cbd5fefd23/b76dbcd9-9bd7-4125-8a31-12f715bd6c2f.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Sci-Fi,Comedy,Boys' Love,Drama,Fantasy"],"nutshell":"1-4) Barairo Emperor\nKeito, a high-schooler with an odd love of plants, finds a cosplaying babe in the garden. The babe in question is Roze, the reigning King of the Plant Kingdom! Roze is on the verge of extinction due to the lack of human affection. Only sex with Keito can restore his energy reserves and as Roze's kingly gaze heats up, Keito finds himself strangely compelled. \"Join with me,\" Roze says. Why, the audacity of royalty! (from Blissful Sin)\n\nKiss Shite Master\nOne day, History teacher Imazato finally recieves the robot maid he mail ordered weeks earlier. But the wrong robot is sent by mistake, and Imazato finds himself the unexpected owner of a HIMO-TYPE robot designed for single working women to be the ultimate prince charming. Imazato isn't sure how to deal with this robot constantly invading his personal space."},{"name":" Introduction to the Theory of Love","avatar":"https://mangadex.org/covers/cb568c10-f08f-43ba-8796-041c94b0b390/9851e5cf-5452-45b2-84f8-6e495dfaff3f.png.256.jpg","country":"Korean","stat":"8.00","status":"Completed","tags":["Long Strip,Romance,Boys' Love,School Life,Web Comic,Full Color"],"nutshell":"Doyun followed his high school crush Hosu to university! Hosu gets drunk at the welcoming party, and Doyun tries to help him get home, but Hosu's so drunk they end up having to stay at a Motel. Doyun picks up a condom he randomly found, but Hosu just so happens to wake up at that moment…! Will Doyun be able to confess to Hosu despite his shyness?"},{"name":" Uenobon Anthology Booklet","avatar":"https://mangadex.org/covers/cb5b39a5-c8bf-4ad6-89e1-58caf59b5a34/cecc43cd-5666-4334-a589-261daddb8c18.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Comedy,Anthology,School Life"],"nutshell":"Anthology booklets featuring various artists, included with special edition copies of Ueno-san wa Bukiyou volumes 6 & 7."},{"name":" Watashi to Watashi","avatar":"https://mangadex.org/covers/cb5ce043-7a70-4174-9a9b-01e0ba6d7ba6/ab95f387-1d7f-4189-ad02-17a8001828b1.jpg.256.jpg","country":"Japanese","stat":"8.47","status":"Completed","tags":["Psychological,Romance,Drama,Slice of Life,Mystery"],"nutshell":"Collection of stories:\n\n\nThe Prisoner in the Miniature Garden (Hakoniwa no Toriko). He has been a recluse for the past 10 years in that big house overlooking a bicycle parking lot. One day, a girl approaches and confessed to him, disturbing the world he's been cooping himself up in. A oneshot of their story.\n\n\nPinky Promise Princess (Yubikiri Hime). Kiriko is a little girl who makes pinky promises with people who expect her to pay for them, but she looks forward to the day they run out of fingers to make promises with or break their promise. An adorable yet creepy 8 page oneshot.\n\n\nWatashi to Watashi (Me and (the Other) Me). Two girls with the same name; one beautiful and athletic, the other awkward and shunned. But who’s the lucky one?"},{"name":" Watashi to Ren'ai Shiyo","avatar":"https://mangadex.org/covers/cb62dab5-8cf6-46f4-8ea3-8ed53b2c5d49/b84315b7-cf71-424f-a45c-c67ec83d9171.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Romance,Comedy,Supernatural"],"nutshell":"Watashi to Ren'ai Shiyo! is a comedic oneshot about Hiiragi Youma, a freeter who moves into a haunted apartment. The ghost haunting the apartment, Okonogi Kokona, is a love-obsessed young girl who died without ever having her affections returned, and is thus unable to move on. So in order to help her pass into the next life, Hiiragi must teach the young girl about what love really is."},{"name":" Hardcore Santa and the Spirit's Wail","avatar":"https://mangadex.org/covers/cb6372ab-c1af-43f0-8706-0f04bf29cd52/7362c7fe-4c67-4c36-8262-05e296e8008e.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot,Web Comic,Supernatural"],"nutshell":""},{"name":" Yankee no Onigahara-san ga Boku ni Dake Kahogo Sugiru","avatar":"https://mangadex.org/covers/cb65d23e-02c1-463b-bf1d-3e89c4dc97b6/483b8666-1548-4699-b4ff-6d3af9ca94a0.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Ongoing","tags":["Romance,Comedy,School Life,Web Comic,Slice of Life"],"nutshell":"She is the strongest but overprotective. My childhood friend is the strongest Yankee who can shut up even crying children. But in front of me, she's a kind and loving big sister. Wait a minute, aren't you overprotective? The popular manga video that has been played over 2.5 million times on YouTube is now available as a web manga!"},{"name":" Creation: Catalyst","avatar":"https://mangadex.org/covers/cb69396a-3174-4f01-b7a0-ebbe844b7b03/8de40c88-5dd0-4e36-b4a3-6798f47d730d.png.256.jpg","country":"English","stat":"7.97","status":"Ongoing","tags":["Action,Adventure,User Created,Magic,Fantasy"],"nutshell":"Dezuno and Hiroda; two best friends, find themselves in over their heads when they decide to play hero after uncovering powerful relics. What kind of hero would you be? How would you decide upon the justice and judgement you dole out?"},{"name":" Playboy no Hatsukoi","avatar":"https://mangadex.org/covers/cb6e0cf7-db28-4653-bf0b-286f0ffa5550/b722b78a-284f-4b42-8393-ed088c6a5df4.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance"],"nutshell":"When the clock struck twelve, instead of partying hard, wealthy playboy Michael Wentworth was making soft, gooey eyes at a beautiful stranger's newborn. Worse, everyone seemed to think he was the proud papa of Beth Masterson's bouncing baby boy. Heck, he'd only just met the woman when she'd come to his door with information on the missing Wentworth heir!\nWell… To gain his inheritance Michael did need a temporary wife, and the struggling, unwed mom sure could use a man to set up house with – and maybe even a happily ever after. But was marriage-resistant Michael ready to be that man?"},{"name":" Mahou Shoujo Lyrical Nanoha - I Want You!! (Doujinshi)","avatar":"https://mangadex.org/covers/cb77946a-d0f9-41c3-b4c4-c57d89830d6d/26b0df14-6920-484d-906a-f5e5ecb4ae2d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Comedy,Girls' Love"],"nutshell":""},{"name":" Lettuce 2-kobun no Suteki","avatar":"https://mangadex.org/covers/cb78c816-e1d4-46fd-88bf-df852c129ffa/0c390840-6e4d-4c21-81ed-1c9e72ac626e.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["School Life,Slice of Life"],"nutshell":""}]