[{"name":" Bokka","avatar":"https://mangadex.org/covers/8a4faf5c-564c-46fc-8f89-ec0bdd7a441f/0fc828ae-173f-4403-8ec8-447354db7b72.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Slice of Life"],"nutshell":"Forced to compete with each other without having so much as seen one another's' faces in years as a result of their divorced parent's competitiveness, two identical twins long to meet and talk about how they truly feel about these battles."},{"name":" Shoukan Suru Sekai","avatar":"https://mangadex.org/covers/8a500297-2b16-460a-b357-7920ef1ba3cd/30193a29-4133-4021-bf73-114c4191bb5e.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Ongoing","tags":["Monsters,Action,Magic,Drama,School Life,Aliens,Supernatural,Mystery"],"nutshell":"A brand-new series from the creator of Blood Lad!\nWhen creatures, items, and even space itself can be summoned from other worlds, no one should want for anything…right?\nTokoyo, a boy who was abandoned to live with the Summoned in the Fantasy District aims to become a summoner to help all his Summoned friends.\nWhen he arrives in Tokyo to attend the Summoning Academy, he’s told he’ll never make it by the first summoner he meets!\nTokoyo realizes he has a lot left to learn…and finds a new dream: to become the bridge between humanity and the Summoned!"},{"name":" Code Adam","avatar":"https://mangadex.org/covers/8a507b2a-b29e-4ce6-9237-6da23661df1d/af15ef51-80d7-4f03-829e-f639e522f32f.jpg.256.jpg","country":"English","stat":"8.08","status":"Hiatus","tags":["Sci-Fi,Action,Psychological,Long Strip,Post-Apocalyptic,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"They were trained as children to become super-soldiers. Human beings literally created in a lab to fight on the front lines of a bloody war. But when the war ends, what’s to be done with the human-weapons? The subject of brutal experiments, some choose to break free and search for a cure before their own powers consume them.\nFr:||\nEnfants, ils étaient entraînés à devenir de super-soldats. Des être humains littéralement créés dans un laboratoire pour se battreau front d'une guerre sanglante. Mais lorsque la guerre prend fin, que faire d'armes humaines ? Sujets d'expériences brutales, certains choisissent de se libérer et de chercher pour un remède avant que leur propre pourvoir ne les consume.||"},{"name":" The Speckled Band (ISHInoMORI Shotaro)","avatar":"https://mangadex.org/covers/8a52eda3-4d7c-463e-9e28-244ae841c28b/4d52cb76-9168-410c-867c-27f6dd1ac437.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Sci-Fi,Psychological,Comedy,Mecha,Crime,Survival,Adventure,Office Workers,Drama,Police,Mystery,Adaptation,Tragedy"],"nutshell":"Julia died leaving behind the mysterious words, \"a string of speckles.\" How in the world was she killed in a locked room where all the windows and doors were locked from the inside? Shotaro Ishinomori's manga adaptation of Conan Doyle's masterpiece! Other early works by Shotaro Ishinomori include \"The Secret of the Bat House,\" \"The Missing Monster,\" \"Red Catfish,\" \"Miki,\" \"Tobe Q Pitch,\" and \"Mad Robot,\" as well as mystery, science fiction and robots!"},{"name":" Happy Days","avatar":"https://mangadex.org/covers/8a5816fe-35f9-4225-98a6-b4e86fd1926e/f56207e6-2929-45fa-8fab-27972b5364af.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Romance,Boys' Love"],"nutshell":"Two best friends decide to make the leap from friendship to love by navigating confessions, first-times, public affection, jealousy, and misunderstanding."},{"name":" Vampire Beru and Ghost Aki","avatar":"https://mangadex.org/covers/8a5a0db9-53a8-47f4-94a5-e509dfb0919a/52272fd3-1ed0-49a9-8cd6-50ea5f7cef3d.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.11","status":"Ongoing","tags":["Ghosts,Long Strip,Romance,Boys' Love,Adventure,Fantasy,Vampires,Web Comic,Supernatural,Full Color"],"nutshell":"Once on the All Saints' Day vampire Beru and ghost Aki, despite their very different personalities, started living together in a castle. Multiple obstacles and difficulties already waiting on their way. But when they'll know each other better, eventually they'll become the most important companions for one another."},{"name":" 99 Arrows","avatar":"https://mangadex.org/covers/8a5ad8b3-26e6-440b-8ea0-f9cf6af54fdc/c572db7f-000d-4da1-a1d8-44a1450a5ef5.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.99","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Boys' Love,Magic,Web Comic,Full Color"],"nutshell":"Cupido es el joven dios del amor, sus flechas llevan al aumento de amor o a la ruptura. Por alguna razón sólo tienen efecto para el lindo Jia Boai, sólo en él, sólo en él, sólo en él. Los dioses no provocan al travieso de Cupido porque temen que afecte su amor y que este no tenga ninguna dirección."},{"name":" Zettai Zetsubou Shoujo - Danganronpa Another Episode","avatar":"https://mangadex.org/covers/8a5c0f05-8735-4438-b048-6448a7b45bfb/c29f5afc-0d17-492f-b5d4-60f649ed58f6.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Psychological,Horror"],"nutshell":"Naegi Komaru, Naegi Makoto's younger sister, managed to survive despite being outside Hope's Peak Academy. There she meets Fukawa Touko, a.k.a. Genocider Shou. This is the story of their struggle to survive in a world full of despair."},{"name":" Destruction Princess","avatar":"https://mangadex.org/covers/8a5f9c53-616e-46c2-b36d-9561b7ec0bd6/77e471db-57ba-4be3-b8c7-a0ea508ed196.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Romance,Comedy,Fantasy"],"nutshell":"Takashi is reunited with a childhood friend he has not seen in 13 years named Miriko. Miriko, while thought to be missing, became the queen of an alien planet and leader of a strange army corp. To keep a childhood promise, Miriko sets out to take over the world with Takashi. However, Takashi has no desire to do this, so Takashi must stop Miriko's wild behaviors."},{"name":" Tokyo Ghoul (Oneshot)","avatar":"https://mangadex.org/covers/8a67b54d-3719-4af4-8873-9d2eba794ece/0697d501-a972-4ad6-ba5c-524eef7bfc6b.png.256.jpg","country":"Japanese","stat":"7.58","status":"Completed","tags":["Oneshot,Award Winning,Action,Psychological,Crime,Drama,Horror,Police,Mystery"],"nutshell":"The pre-serialization one-shot of Tokyo Ghoul, with Kaneki living as a ghoul…\n\n\nWon the Young Jump 113th Grand Prix Award in 2010"},{"name":" Video Rental Shop","avatar":"https://mangadex.org/covers/8a6ba3db-aff7-4c4f-a16d-0c2087298f9b/5e64575f-2aa5-40bb-956e-1c8477d44071.jpg.256.jpg","country":"Japanese","stat":"7.64","status":"Ongoing","tags":["Comedy,Girls' Love"],"nutshell":""},{"name":" Yuna","avatar":"https://mangadex.org/covers/8a6dc6e3-dca6-4b86-b1ab-8e81e14e0037/a2375e1e-b89e-4358-98a1-338ff1763c65.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Romance,Comedy"],"nutshell":""},{"name":" Boku Dake no Romantist","avatar":"https://mangadex.org/covers/8a73f641-ce89-4164-bfeb-33271054b9b6/a3d429d9-c73d-4069-841a-22bf0efed5b0.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Comedy,Boys' Love"],"nutshell":"Shinobu Aizawa is already in his forties, but he works part-time as a security guard while pursuing his dream of becoming an archeologist. One day, he is sent to work at a party venue and the guy he tries to hold down for making a fuss turns out to be Aldo, the very prince who organized the party. Before Shinobu has a chance to understand what's going on, he's being dragged into the center of the room and introduced as the prince's fiance! This is a romantic love story between a bold and brazen prince and a middle-aged dreamer by the popular manga artist Nerima zim! (From Renta!)"},{"name":" Royal Cinderella Mama","avatar":"https://mangadex.org/covers/8a74e736-3090-4ea5-8ec8-e3147f9ff318/0ad4443a-4963-46c5-b69a-578d35adf10f.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Cancelled","tags":["Reincarnation,Romance,Isekai,Drama,Fantasy,Adaptation"],"nutshell":"Reincarnated as a poor woman…? Or a saint? At the imperial Palace of Dorodoro, I'll use the infatuation of the calm and cool Emperor in order to climb the stairs of royalty!\nI had an ordinary everyday life. I lived a modest single life with gardening as a hobby. I didn't mind the work and wouldn't have changed anything. But then one day, I accidentally opened the door to another world. When I realized what was happening, I was in an open-air bath! I noticed that there was a naked man and it was after I ran away from him that I could finally grasp the situation. It seems like I resemble the daughter of a fallen nobility by the name of ‘Rosalinde’. I have absolutely no money, but if I can grow my favourite plants and make a profit then I don’t mind living in this world. However, because I am of the lower class in society I would get harassed. But a strange man of unknown origin by the name of Alexander came to my rescue and it seems that he cares about me. Who in the world is this person?"},{"name":" Fukinoshita-san Is Small (Doujinshi)","avatar":"https://mangadex.org/covers/8a772862-7d48-4fcd-b39f-bd1da186f1e6/74b30ac3-1ad2-4479-bbea-0b85161b9783.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Ongoing","tags":["Romance,Comedy,Fantasy"],"nutshell":"A romantic(?)-comedy story between a small, cute Girl and a big, but timid Boy!\nNote:\nThis doujinshi is not to be confused with the serialization which has the exact same title and is also drawn by the same author."},{"name":" Mathematical Girls - Gödel's Incompleteness Theorems","avatar":"https://mangadex.org/covers/8a7a0e0a-927e-4b25-b87b-e5f8c6eb1043/71bb506e-5d01-4138-b3c4-db688c4bd970.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Romance,Harem,School Life"],"nutshell":"\"I\" (Boku) love mathematics. Just after the high school entrance ceremony, \"I\" meet a beautiful girl: Miruka. Miruka is a mathematical genius. She gives me many math problems; she shows me many elegant solutions. Miruka and I spend a long time discussing math in the school library.\nOne year later, I meet another mathematical girl: Tetra. Tetra is one year younger than me, and asks me to teach her math. While I teach her, she begins to understand math and to love its elegance gradually.\nIn this third volume (series), we talk about logic puzzles, Peano arithmetic, epsilon-delta, Cantor's diagonal argument, Hilbert's program and Gödel's Incompleteness Theorems."},{"name":" A Story About a Senpai Who Can't Get Better Test Scores and a Kouhai Who Actually Can","avatar":"https://mangadex.org/covers/8a7c02b8-7ac1-41e6-8961-760e92648dd1/a385afad-22f0-4932-b009-9b5340f87b1c.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Oneshot,Romance,School Life,Slice of Life"],"nutshell":""},{"name":" Godseeker","avatar":"https://mangadex.org/covers/8a7dadc7-ca2b-426a-b23a-337a09a574e3/eb1ab90f-6e88-4f9f-9ad0-6d8a01df1892.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Romance,Comedy,Fantasy"],"nutshell":"Many people in this world possess commonplace magical abilities. These are usually things that make their lives a bit more convenient - such as the ability to make a small flame, or to heal slightly more quickly than usual.\nBut the brilliant young lord of Seeker Castle has a little sister with incredibly destructive magical powers, which he uses to kill anyone who threatens his territory. Also living with the lord and his sister is a boy whose powers are still a mystery. Thus unfolds the story of their intertwined destinies…"},{"name":" Konna no Unmei Janai Kara Kanchigai Shinaide","avatar":"https://mangadex.org/covers/8a7f0a9f-95f2-4e73-9135-4dcdb24ba801/35a4c345-dced-4b06-b9ed-c35cdf9bd5c0.jpg.256.jpg","country":"Japanese","stat":"8.47","status":"Completed","tags":["Boys' Love,School Life"],"nutshell":"Yuuzen, Kouetsu, and Ginga have been best friends since preschool, and they're at the top of the pecking order at a prestigious academy for only the most elite alphas. With their good looks, money, and academic prowess, they enjoy life on easy mode… at least, until one day, Yuuzen displays symptoms of being an omega! Unable to resist Yuuzen's pheromones despite the medicine they take, Kouetsu and Ginga give in to their instincts. Taking turns, they force themselves upon a confused and ecstatic Yuuzen… (Renta)"},{"name":" Miyata Shoten e Youkoso!","avatar":"https://mangadex.org/covers/8a806d41-31f1-4660-b808-5be3ed08908e/b630df58-082e-44d9-963d-000bc3bee051.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Comedy,Anthology,Drama,School Life,Slice of Life,Supernatural"],"nutshell":"Anthology of author Mizu Asato:\n\n\nKaerenai Futari\nOn the day of graduation, I am asked out by the man whom I hate most…\n\n\nFamily Restaurant no Juunin\nOriginal doujinshi with a story set in a family restaurant.\n\n\nSeifuku no Shita ni Aru Mahou\nRelated to Mizu Asato's anthology of magical sailor uniform school girls.\n\n\nTaberu-bu\nA girl bullied at school runs into the student council president who has an infinite appetite, on the rooftop of school.\n\n\nMiyata Shoten ni Youkoso!\nMako is a rookie part-timer at Miyata Bookstore. Her late worry is her superior, Takeo, who always looks angry and yells at her.\n\n\nDenki-Gai no Honya-san: Mikan BOOKS no Baai\nExtra episode of Denki-Gai no Honya-san"},{"name":" Osananajimi ja Gaman Dekinai","avatar":"https://mangadex.org/covers/8a8ce2e8-e84c-4f56-98dc-38a95b0bb0c1/8327e92b-7c09-4e87-8c00-919e46a7ad93.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Ongoing","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"【I lost control... because I like you.】 Childhood friends Aoi and Ryouta recently started sharing a room together near their university. Aoi has always been proud of his good-looking and popular friend, while Ryouta is a caring person who always says, \"As long as I'm with Ao, I'm fine with anything,\" with a straight face. Aoi enjoys living with his best friend, who has been with him since they were little and they understand one another. But one day, Aoi falls asleep after masturbating and wakes up to see Ryouta trying to kiss him...?!"},{"name":" Parallel City","avatar":"https://mangadex.org/covers/8a8f92dc-cb73-44b5-a0a8-bdff578419ba/68f783e9-e6e5-4dc9-9a36-6dec70977cca.jpg.256.jpg","country":"Korean","stat":"8.14","status":"Ongoing","tags":["Sci-Fi"],"nutshell":"Can two people look exactly alike? Fear sweeps the city as people report seeing their own doubles. Then the disappearances start. Mere coincidence? Or are the mysterious twins harbingers of bad luck? Whatever they are, if you spot one, you better think fast!"},{"name":" Hikkoshite Kimashita. Otonari ni","avatar":"https://mangadex.org/covers/8a925206-5e61-413d-99ec-29e4c9427267/1347c07c-8389-458e-9775-350a6a64374d.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Comedy,Boys' Love,Slice of Life"],"nutshell":"How Takumi came to live in the derelict apartment building.\n\n2-5) Takumi Kusunose is a man who loves the company of others and simply cannot abide being by himself. When he took responsibility for his company's losses by paying out of his own pocket, it nearly broke him. As a result, he was forced to move into a cheap apartment, but what happens when the sexy blonde guy next door begins making sexual advances at Takumi…?! And what happens when Takumi's former secretary shows up, turning Takumi and his neighbor's potential relationship into a love triangle?!"},{"name":" The Festive Monster's Cheerful Failure","avatar":"https://mangadex.org/covers/8a931d17-c9fb-4620-86ab-a48e57289185/7225247a-3993-4f14-992b-6f69663527e7.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Supernatural"],"nutshell":"Ikuya Magasa is a freshman in high school with no dreams or particular interests, and so he just lets the days pass by.\nOn their way home one day, his friend Kaze Amaba makes a shocking confession.\n\"Truth is, I'm a tengu.\"\nAmaba had longed to live in the world of humans, and in order to remain there, he invites Ikuya to start a band.\nFrom then on, Ikuya's normal days started to become more and more abnormal?"},{"name":" Sonoyo no Dokoka, Tokoyo no Rakuen","avatar":"https://mangadex.org/covers/8a95ed0b-df88-42d3-b1de-945a89a3b67b/30bdb1a9-6f3a-402b-a23f-7df9b1af50fb.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"On hearing some concerning news, the adventurous Prince Shin of the great kingdom of Garche infiltrates the desert kingdom of Tarchia. There, he meets Yashum, a man running a private school.\nWhile he seems shady at first, Yashum is incredibly knowledgeable, and he's accompanied by the youth Amaru, who's so fond of his teacher that he's as protective of him as a knight!\nHowever, in this small kingdom with a tragic history, a drama is unfolding between this odd pair over a \"mystery drug\"...\nA maddening, codependent love blossoms in a paradise where dawn never comes."},{"name":" Teikoku Kyoudai","avatar":"https://mangadex.org/covers/8a9b7068-55c8-4e8d-b246-72aa3e307a08/7816228c-8788-47d8-b036-65dd96ccddad.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Historical,Action,Comedy,Adventure,Fantasy"],"nutshell":"Despite being half-brothers, Robert and Emile met each other just three years ago when they both started working for the Emperor. Robert is the Captain of the Royal Guard despite still being 17, while the younger Emile is a member of the Guard.\nBut things never go smoothly for the newly-united brothers, because the Emperor is always willing to throw troublesome jobs their way…"},{"name":" Romansa & Difabel","avatar":"https://mangadex.org/covers/8a9d1db3-433f-4349-b0cf-c4594037a3e5/39916681-6345-428c-8757-a49d51db000e.jpg.256.jpg","country":"Indonesian","stat":"8.12","status":"Ongoing","tags":["Romance,Drama,School Life,Web Comic,Slice of Life,Adaptation"],"nutshell":"Adapted from a famous story from an indonesian storyboard website \"ffschan\" anonymous users, Romansa & Difabel. tells about Awan, a high school student who has to help Difa, a neighbor who is Awan's classmate who has to sit in a wheelchair due to an accident. this story are focusing to their daily lives."},{"name":" JoJo's Bizarre Adventure - Someone I Miss (Doujinshi)","avatar":"https://mangadex.org/covers/8a9ef434-199c-4738-b590-879dce4c941b/88443c06-9cb9-4687-84bd-7ea9b87a349a.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Ghosts,Slice of Life,Supernatural"],"nutshell":""},{"name":" The Big Apple","avatar":"https://mangadex.org/covers/8aa133b3-8d97-4bd4-8e29-512a08cf5d25/4d2769db-7a02-4a07-ba0a-c37d451042c1.jpg.256.jpg","country":"Korean","stat":"8.31","status":"Ongoing","tags":["Demons,Long Strip,Boys' Love,Office Workers,Fantasy,Web Comic,Full Color"],"nutshell":"Johan, a Swedish gay office worker has moved to New York to work at a small company. Unbeknown to everybody, he's actually an assassin who kills Wizards belonging to a secret society. What happens when he's caught by his lover, Juergen when he fails an assignment?"},{"name":" Shinen naru Renai Tetsugaku","avatar":"https://mangadex.org/covers/8aa2c44e-c167-4c6d-8336-426a52e292a7/7bfd2bf0-5711-422d-a0a0-a6a7e633ace0.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Ongoing","tags":[""],"nutshell":"「集中しろ――私としている淫らな行為に」哲学科大学院生の知美は、ドＳで有名な高槻教授に片想いしている。飲み会の帰り、男子学生に絡まれた所を高槻に助けられた知美は「先生が優しいなんて、これは夢だ」と思い込んで、つい彼に甘える。すると高槻は不意に唇を重ねてきて――幸せな夢を見た翌朝、目覚めると高槻の部屋にいる知美。夢じゃなかった！？と慌てる知美に、高槻は冷厳な微笑で提案する――「君、私と結婚しなさい」"},{"name":" Sakurasaku Shoukougun","avatar":"https://mangadex.org/covers/8aa3031d-0eef-442b-8a83-72c0586f0dd6/f962f1e9-a462-4c44-ae80-8e0b5696a114.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"Childhood friends Wakatake and Kagetora meet again after not seeing each other for more than 8 years.\nWakatake is a boy who takes his studies extremely serious, as he is to take over the medical clinic of his parents one day. Kagetora is an impulsive girl, who spends most of her time fighting outside on the streets, instead of the class room.\nNow that Kagetora decided to enter one of the most prestigious high schools of the country to pursue the love of her life, she needs Wakatake to help her to pass the entrance test…"},{"name":" Childhood Friends Commuting to School by Train","avatar":"https://mangadex.org/covers/8aa94efb-0881-46fb-93d0-667efa862a3c/42a224ed-53ae-4c00-90ce-a8dec2b3f852.png.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Romance,Comedy,Web Comic,Slice of Life"],"nutshell":"A pair of childhood friends have been cold to each other for the sake of appearances in school. One day, as they were riding the train back from school, the girl suddenly fell asleep."}]