[{"name":" H.P. Lovecraft's The Dunwich Horror","avatar":"https://mangadex.org/covers/5fdd5ca0-0d49-4f2b-98dd-8f60637c2497/33ef48f1-368e-4562-9ad2-91dfb00f1f39.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Horror,Supernatural,Mystery,Adaptation"],"nutshell":"In the isolated, desolate, decrepit village of Dunwich, Massachusetts, Wilbur Whateley is the hideous son of Lavinia Whateley, a deformed and unstable albino mother, and an unknown father. Strange events surround his birth and precocious development. Wilbur matures at an abnormal rate, reaching manhood within a decade. Locals shun him and his family, and animals fear and despise him due to an unnatural, inhuman odor emanating from his body. All the while, his grandfather, a sorcerer, indoctrinates him into certain dark rituals and the study of witchcraft."},{"name":" Shiranu wa Omae Bakari","avatar":"https://mangadex.org/covers/5fde65b5-c8c9-4ccb-b005-af35a3eab90b/db1578cb-757a-44a9-8f13-aa6deab57b84.jpg.256.jpg","country":"Japanese","stat":"7.72","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life"],"nutshell":"Shiranu wa Omae Bakari\nYoshikawa Taiki and Komiya Kazuyuki had sex once almost every week, but they were neither lovers nor friends. What started off as a drunken escapade back during a university get-together scaled into something bigger than either of them could have imagined. Though he wished for more, Kazuyuki felt that there was no hope for something deeper between the two of them, because Taiki was as straight as a ruler. For someone like Kazuyuki, who knew that his sexual orientation wasn't generally accepted by society, he planned to give up and stop whatever sexual relationship he had with Taiki. But what’s Taiki’s say in all this?\n\n\nDakara Kao mo Mitakunai\nAfter getting dumped, Kataoka Takeru's best friend Yui confesses to him. But Takeru doesn't know how to cope with this situation. What will become of their friendship?"},{"name":" Hana-chan and Hanna-san","avatar":"https://mangadex.org/covers/5fe0c99f-ea8f-4f48-8b4b-aa34359464fe/a2d3f25c-0f73-4721-8258-a8e72e397365.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":""},{"name":" Country Life With the Sexy Emperor","avatar":"https://mangadex.org/covers/5fe12c7b-7c22-4d98-be55-b8a314b1b803/3f7ef18c-a747-40e6-937c-8eee7fcf285d.png.256.jpg","country":"Korean","stat":"7.92","status":"Completed","tags":["Oneshot,Official Colored,Historical,Long Strip,Romance,Isekai,Fantasy,Full Color"],"nutshell":"The moment my engagement with my human trash fiancé was annulled, memories from my past life returned. I was formerly a hardworking agriculture researcher and a woman who went to farming college! After getting chased out of my family, I decided to stick to my strengths and live a worry-free and comfortable life while farming, but...\n\"That's my sword.\"\n\"No, it's my hoe?\"\n\"It's my sword!\"\n\"I told you, it's my hoe!\"\nSuddenly, a beautiful blond man—who looked perfectly fine on the outside—appeared to take the hoe I picked up from the ground away from me! This is the start of a farming romance where we'll meet our loved ones as well as pick mulberries (kill two birds with one stone)~"},{"name":" Sarou no Ryoshuu","avatar":"https://mangadex.org/covers/5ff417c0-4117-426d-a51a-ede37da3491f/5f4d3805-db0b-4b5f-b69b-e7125c1aabd8.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"A collection of oneshots some which are related with a final chapter linking all the dashing guys together.\n\n\nPrisoner of the Desert\nBusinessman lackey Hibiki thought his one night stand with Prince Zyad in Japan would be the last time he would see the handsome sheik. But when he visits Zyad's country and is falsely imprisoned as a spy, there's only one man he can turn to.\n\n\nEmbraced by Guiltiness\nWhen there's a press leak at the ministry, everyone falls under suspicion. When ladies man Yura discovers Shirase's lover is a man and a member of the press he decides to use the information to get Shirase into bed. But Shirase still has a much more damaging secret…\n\n\nThe Long Night\nPoliceman Kayano is investigating the spy in the ministry. His no. one suspect: ex-college friend and current lover Takashina. Can there be a relationship without trust? What is Takashina hiding?\n\n\nEscort\nWith frequent violent attacks on his person, analyst Asami Shinobu is assigned a 24 hour bodyguard to keep him safe. Unfortunatly his bodyguard is a former one night stand named Saeki Yuuji. With Saeki in his personal space at all times, Asami's feelings are getting more tangled up.\n\n\nSuite Love\nHotel attendant Kuga is assigned to serve Japanese-American businessman Touno. But this isn't the first time they've met, they have a past together as college students in America that Touno isn't about to let Kuga forget about.\n\n\nThe Morning Scene\nEach couple is observed at 6 a.m. from Kayano and Takashina in Tokyo, to Kuga and Touno in Los Angeles."},{"name":" Milkman","avatar":"https://mangadex.org/covers/600d0942-e672-41b4-8015-8cc037e7a512/bbf3161b-c90a-4168-a42e-078518acff4c.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Comedy,Boys' Love,Slice of Life"],"nutshell":"The Milkman was born with the body that gets him mixed up in everything, and no matter where he goes, bad luck seems to follow him everywhere. He who gave up fighting destiny is being yet again bullied by the landlord – yet somehow he seems a bit happy. And in front of him, the \"man who never gives up\", the Coffee Milkman, gallantly appears. Their meeting changes destiny?!"},{"name":" Loli Incubator","avatar":"https://mangadex.org/covers/6015025e-8e12-4f8c-bf93-e768356ed100/1ff925ec-a1aa-448d-9a8c-89bdf3149582.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.06","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Harem,Web Comic"],"nutshell":"When the homeboy Xia Ming drew an egg for cute pets, he thought he would also own a human-shaped cute pet that is desired by the whole world! He didn’t expect that he would hatch a group of trouble devils! But how can these cute pets who want to feed their master be so lovely…"},{"name":" Katekyo Hitman Reborn! - Caro Mio Ben (doujinshi)","avatar":"https://mangadex.org/covers/601d37a5-e7fe-40cd-9665-e5c6507661ea/72a216ec-1f53-43bc-af59-568c882faef8.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Boys' Love"],"nutshell":""},{"name":" Yoru Made Matenai","avatar":"https://mangadex.org/covers/60274985-867e-4846-9ef4-f2a769eeae09/aaf00c7d-5ff5-49b8-99e6-4444a1331d0b.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":""},{"name":" Angel Beats! The Last Operation","avatar":"https://mangadex.org/covers/60294a05-0458-4303-b16c-de2728b09297/357bf2de-103f-45ec-af37-f3467e81fdca.png.256.jpg","country":"Japanese","stat":"8.34","status":"Ongoing","tags":["Action,Comedy,Drama,Supernatural"],"nutshell":"Angel Beats! -The Last Operation- will reveal why the Afterlife Battlefront members came into this world.\nNew Angel Beats! manga series serves as the \"true arc.\""},{"name":" Okuchi no Sensei wa Shojo Danshi","avatar":"https://mangadex.org/covers/602e3141-bc2e-4f4e-9517-2c48f384afd7/59b5bd7c-6957-4fc7-9e85-c47cc44cc12f.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Romance,Web Comic"],"nutshell":"Through a strange turn of events, Tsubasa ended up in a hotel with Sakura, a man that she had just met at a mixer. However, it seems that he is actually a virgin!\nTsubasa then found herself turned on by the gap between his cold demeanour and his innocent reactions and ended up pouncing him.\nAs they didn't exchange contacts, Tsubasa thought that she would never meet Sakura again. But when she went to get her teeth checked the next day, she was surprised to find that the dentist who would be treating her is Sakura!"},{"name":" Blue Sky Rubber","avatar":"https://mangadex.org/covers/6037d330-51e5-4b83-a5a3-46e2432623ce/c658316e-8f97-4343-a61f-adf7bbded381.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,Sports,Drama,Slice of Life"],"nutshell":"Twin boys grew up loving the same things: table tennis and their childhood friend."},{"name":" The Legend of Sword and Fairy","avatar":"https://mangadex.org/covers/603cb020-b83a-4112-a987-d8c751e360ad/2f4ab1ff-08d3-429c-9c42-e25db2a07a09.png.256.jpg","country":"Chinese (Simplified)","stat":"8.02","status":"Ongoing","tags":["Romance,Martial Arts,Fantasy"],"nutshell":"Xiao Yao is a good-for-nothing dreamer who would like nothing more than to own a celestial sword but was raised as a worker in a restaurant. One day he meets a mysterious drunken priest who asks for some wine…\nBased on the role-playing game of the same name."},{"name":" Garasu Bijin","avatar":"https://mangadex.org/covers/60413748-2d4f-40d1-a2a5-3a2500f61d67/b6e2a5a9-e331-45dd-a78c-080cd32ec49d.jpg.256.jpg","country":"Japanese","stat":"7.61","status":"Completed","tags":["Romance"],"nutshell":"In order for Maki to accomplish her goal, she worked hard in order to get rid of her ugly appearance and now that her chance has arrived…?!"},{"name":" Toshiue Elite Onna Kishi ga Boku no Mae de dake Kawaii","avatar":"https://mangadex.org/covers/60449946-9a58-4274-a566-fbe4235414aa/ae014b5b-e34a-4b29-82cc-39d121528f70.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Ongoing","tags":["Romance,Comedy,Adventure,Military,Fantasy,Adaptation"],"nutshell":"Haru is a 16-year-old recruit of the \"Black Hawk\" 4th Cavalry Unit of the Knights' Regiment under the command of Captain Karen, a profoundly beautiful and fierce 29-year-old swordswoman, who, unbeknownst to all the unit except Haru, is a pure maiden with exactly zilch experience with men. Being privy to this delightful side of her, Haru secretly henpecks her and teases her lovingly, which turns her into a flustered and heavily-armed tomato. Watch as he slowly inches his way into her heart as he dodges her longsword!\n\nLight Novel: Bookwalker"},{"name":" Touhou Project - Parallel Universe","avatar":"https://mangadex.org/covers/60473419-003c-4f20-ac91-f1d693199a70/404a3be9-abb0-44f8-9d9d-338af14df1c6.png.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Oneshot,Genderswap,Vampires,Monster Girls,Web Comic,Slice of Life,Full Color"],"nutshell":""},{"name":" Erementar Gerad","avatar":"https://mangadex.org/covers/60491490-017a-4571-bd03-778bb81d92d8/ffd0da38-cf5c-4b8c-971a-ca7b57012d67.png.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Action,Romance,Adventure,Fantasy"],"nutshell":"Coud is a young sky pirate who discovered a girl with mysterious powers on what had seemed like a routine mission. Ren has the ability to lend Coud bizarre fighting capabilities (his arm turns into a giant blade of some sort), being part of a race of beings called Edel Reid, but being the possessor of a stone called the Elemental Gelade, she has powers even beyond the norm.\n[RUS] || Куд, неуклюжий новичок в отряде воздушных флибустьеров \"Красная рысь\", находит главное сокровище своей жизни: представительницу древней расы Эдель-Райд. Рен поначалу кажется беззащитной девочкой, но в ней скрыта сила, за которую многие готовы пойти на убийство. Когда Коу решает оберегать Рен в ее путешествии, юноша моментально приобретает новых друзей и обзаводится опасными врагами.||"},{"name":" Mamama - Mahou Iinchou Mako-chan Mahou Shidou","avatar":"https://mangadex.org/covers/604a5a02-9ac4-448d-83d3-67c5287cc74f/09f9074b-f2a0-44c2-81bf-9d7daa0971cd.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Comedy,Supernatural"],"nutshell":"In the story, Mako excels in the world of magic, but she has a dislike of men and love. As her graduation test she is supposed to go to the human world, but there she accidentally makes a contract with Junji Onodera, a human who is a total pervert."},{"name":" Aoi Kizu to Doku no Ringo to","avatar":"https://mangadex.org/covers/6053c9d6-5235-437a-94d1-aebe49d73421/e50fc500-c37b-449c-8e05-f35e3b4f8e76.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Boys' Love,Drama,Slice of Life"],"nutshell":"Chen, unlucky enough to be born and raised in the slums, unknowingly pickpockets the industrialist and son of a mafia boss, Paul. But instead of being punished, Paul buys Chen a set of expensive clothes!?"},{"name":" Child picked up in the wilderness","avatar":"https://mangadex.org/covers/60571175-b9b4-4450-8860-158168836ea0/9464c94b-91d1-43a2-b38e-80e7c6001ba1.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Oneshot,Fantasy,Monster Girls,Web Comic"],"nutshell":"A love story between a centaur mother and a human son."},{"name":" Kimiiro Shoujo","avatar":"https://mangadex.org/covers/60596604-eb6c-4c71-816c-7230ad62de14/69edb701-1656-4c6a-afac-411b63e5f0ba.png.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Oneshot,Girls' Love,Drama,School Life"],"nutshell":"A collection of stories:\n\n\nThis is a Fake\n\n\nThe Distance of Love\n\n\nA Secret on the Lips\nMizuki is secretly in love with her best friend Honoka, but thinks Honoka is uninterested in love.\n\n\nA Blank Page Day\n\n\nThere Are No Mermaids in This Town\nYoshizaki Erina just transfered into town and is generally avoided by her classmates because of her taciturn nature until Toyoda tries to approach the girl.\n\n\nThis is to Remember Us\nSequel to This is a Fake"},{"name":" Super Mario-kun","avatar":"https://mangadex.org/covers/605ab3ab-c5f4-410c-a246-6ca62e5dba3e/f44647ed-3af3-46a2-94c1-0271af07a6b4.jpg.256.jpg","country":"Japanese","stat":"7.79","status":"Ongoing","tags":["Comedy,Adventure,Video Games,Fantasy"],"nutshell":"As Bowser kidnaps princess Peach, the clumsy duo Mario and Luigi stumble upon Yoshi, and they then become the clumsy trio! This manga follows Mario and his adventures as he battles bowser and tries to save the princess."},{"name":" Alice Gear Magazine Manga","avatar":"https://mangadex.org/covers/605bb2dd-eeb7-45a0-841d-7b4f244f6e0a/96ede4e0-5d46-44ac-99d3-b9c96d3eaecd.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Ongoing","tags":["Sci-Fi,Comedy,Anthology"],"nutshell":"Manga included in the official Alice Gear Magazine"},{"name":" Waltz in A White Dress","avatar":"https://mangadex.org/covers/6063cd06-d14e-4fc5-8246-7390a5d6ee0d/4f190d10-718c-46aa-aaf8-3e42c921474f.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Historical,Romance,Adventure,Drama,Mystery"],"nutshell":"At the beginning of the XX century, the relationship between England and Japan was strained. England wanted to extend its influence over Japan, and Japan wasn't willing to let any other culture pass its borders. Koto, though, a Japanese girl, didn't care if the people she meets have almond shaped eyes or not, or if they wear a kimono or a western dress. Actually, she is fascinated by this foreign way of life that brings so many innovations into Japan. More than anything else, it's the clothing that seems to grab her attention, as she wants to become a tailor and create dresses for women of every culture.\nUnfortunately though, she's a woman, so she knows her dream will end as soon as she gets married. She will have to start acting like a noble and a respectable woman would. In fact, she is betrothed to Masaomi Kidoin, the second born of one of the most important and oldest families of Japan. The day she's told she will marry Masaomi, Koto attends a ball at the British Embassy and meets Sagitto, a half English and half Indian spy that captures her imagination and heart. But can their love story have a happy ending when the British and the Japanese are tracking down Sagitto because they want him dead, and Koto is forced to live a life that doesn't fit her?"},{"name":" Cry for Me","avatar":"https://mangadex.org/covers/60668183-6fb7-4219-9d02-4e08b76f393a/59a1478d-fb25-44c1-8e88-5b3b8cec6a5f.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.87","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Drama,Web Comic"],"nutshell":"Ye Zi And Gao Hang reunite years after their childhood friendship ended. After a misunderstanding, Gao Hang left Ye Zi behind for university and Ye Zi picked up the pieces to become stronger. At their reunion years later, Ye Zi has changed to better fit Gao Hang, all he wants is for times to be like they were before. Can they return to the bliss of the past?"},{"name":" Dark Souls Lore Stories: Yhorm the Giant","avatar":"https://mangadex.org/covers/606a795e-32e5-4628-9a78-9249c4a27c59/075f3f76-b3a0-421d-8a25-91a7bb545b99.jpg.256.jpg","country":"English","stat":"8.04","status":"Completed","tags":["Monsters,Action,Survival,Adventure,Magic,Drama,Fantasy,Web Comic,Slice of Life,Supernatural,Full Color,Tragedy"],"nutshell":"The story of Yhorm the Giant in Dark Souls Lore"},{"name":" Ana, Moji, Ketsueki Nado ga Arawareru Manga","avatar":"https://mangadex.org/covers/606b149c-2510-4a57-81d2-5162f5cdf44b/e5c24858-200e-4ac9-8176-28072b4797ed.jpg.256.jpg","country":"Japanese","stat":"7.57","status":"Completed","tags":["Oneshot,Psychological,Horror,Mystery"],"nutshell":"Collection of one-shots by Kago.\nContains:\n\n\nBatoru Roaiyaru\n\n\nHorie-kun to Horiemon\n\n\nJoshi Ana no Ana\n\n\nShiro no Joukei\n\n\nMan'in Densha\n\n\nSayashiko no Yoru\n\n\nEkimae Ankoku\n\n\nEkimae Hanbun\n\n\nEkimae Gosa\n\n\nEkimae Ichiji\n\n\nShintaro Kago Classic · DRAGON BUSTER\n\n\nShintaro Kago Classic · Shin Nihon Mukashi Banashi Zenshuu\n\n\nShintaro Kago Classic · Testuwan Uran no Koufuku Tokkyuubin\n\n\nShintaro Kago Classic · GODZILLA v.s. GAIGAN\n\n\nShintaro Kago Classic · Taima Senki"},{"name":" 7th Dragon","avatar":"https://mangadex.org/covers/606fdb31-c7bd-4fda-b92f-6e8be05cc6fe/f12f7d16-e13c-435f-b33c-74a3b90ee283.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Action,Adventure,Fantasy,Adaptation"],"nutshell":"\"Lured by the sweet fragrance of the flowers which blanket the earth, with fangs of steel and claws of iron, to the Garden of Eden which welcomed the ages, under the guise of a disaster from the heavens… seven dragons appeared.\"\nBased on the game with the same name."},{"name":" I Raised the Devil","avatar":"https://mangadex.org/covers/60729ee6-3148-47c7-804d-7cec6c78df1e/eb51cbdf-6dd9-4ebe-82e7-d61dc2d478fb.jpg.256.jpg","country":"Korean","stat":"8.01","status":"Completed","tags":["Demons,Long Strip,Romance,Fantasy,Web Comic,Full Color"],"nutshell":"An angel exiled to earth for spending one night with a devil. However... on earth, this devilish dog that I had raised turned out to be a real devil?\nAnd not just any devil, but the very same demon that corrupted me in the first place?"},{"name":" The Royal Prince's  First Love","avatar":"https://mangadex.org/covers/60746565-57c5-4a8a-9147-cb63f9b9c58a/abec2b51-de0a-44d6-8b2b-7e7c975ef152.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Drama,School Life,Web Comic,Full Color"],"nutshell":"In order to consolidate the status of the royal prince, he launched an offensive in pursuit of a plutocratic daughter, but soon he suffered the first critical hit in his life. The campus bully had declared that his daughter was a friend that he wanted to protect. Then, he was hit by a second critical attack on the day he was fighting against the bully. However, he was intimate with the bully in his dreams every night! Everything seemed to be out of control. How should the prince, who had never made any mistakes, face his unexpected first love?\n-Spanish-\nPara consolidar su posición el príncipe heredero lanzó un ataque en busca de cierta persona rica. Pero pronto sufrió la primera crítica de su vida: el matón del campus declaró que era amigo de esa persona y le quería proteger. Luego, fue golpeado por un segundo ataque crítico: durante el día se enfrentaba contra el matón, pero todas las noches, ¡tenía intimidad con el matón en sus sueños! Todo parece estar fuera de control ¿Cómo debería el príncipe heredero, quien nunca se había equivocado, enfrentarse a su inesperado primer amor?"},{"name":" It's Been a While Since the Original Novel Was Completed","avatar":"https://mangadex.org/covers/607ae92a-6b63-4bda-8783-566f56572d4a/ee2918fa-91cc-468d-9ff5-4204344ba5de.jpg.256.jpg","country":"Korean","stat":"7.90","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Isekai,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"Elena Taylor, who played the role of the villain in the original novel, decides not to get entangled in relationships with the original story and establishes a Love Counseling Center.\nElena, after establishing herself a Love Counseling Center and was living a new life, is given a request with the highest difficulty. To safely debut Hugh, who was the second male lead in the original novel, and save his wife! However, Hugh, who was serious about the Urak Village Movement, was a born-to-be single who was not interested in dating at all.\nWill Elena be able to complete the request safely and live happily?"},{"name":" Homeless Tensei: Isekai de Jiyuu Sugiru Jikyuu Jisoku Seikatsu","avatar":"https://mangadex.org/covers/607f0bbc-e36d-46af-9efd-b74a40cbbe9d/9db3088a-1047-4066-820e-8410331a15e6.jpg.256.jpg","country":"Japanese","stat":"6.26","status":"Ongoing","tags":["Monsters,Romance,Adventure,Magic,Isekai,Fantasy,Adaptation"],"nutshell":"Shinichi Tanaka is a homeless man who is good at dumpster diving. Because he's a pennyless bum, there's no help for it. He's going to try and pick up some trash to survive another day.\nWhat is this?\nMonsters and a Dungeon? In Tokyo?!\nA homeless man finds himself suddenly reincarnated in another world. His second life starts now based out of a hidden room deep in a dungeon.\nweird and turbulent adventure of a 56 year old homeless man who reincarnates into a different world."}]