[{"name":" Natsume Yuujinchou Visual Fan Book","avatar":"https://mangadex.org/covers/67b2c907-5085-4e6a-80fc-c15d29c9af41/d015f506-939d-4883-a09b-5a94d23da101.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Romance,Supernatural"],"nutshell":""},{"name":" Fan Service!","avatar":"https://mangadex.org/covers/67b33428-38e3-4ff0-b020-e6a8be1f2b56/9c6d92b7-d4ec-46b7-bfb2-7ba953a07d98.png.256.jpg","country":"Indonesian","stat":"7.98","status":"Completed","tags":["Long Strip,Romance,Comedy,Drama,Web Comic,Full Color"],"nutshell":"Renata is a young girl who quit college to help her mother raise money after her divorce. She wanted to live at Dahlia Boarding House, but she was forced to sign a dubious fanclub admission. The one behind this was Bayu, a handsome and smart man who she encounters more after!"},{"name":" Haomen Qifu de Chuntian","avatar":"https://mangadex.org/covers/67b5ec92-fd7b-4647-ab1a-0915b7714a9e/fd667459-250c-43af-9f3f-341393943b06.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.57","status":"Ongoing","tags":["Long Strip,Romance,Drama,Web Comic,Full Color"],"nutshell":"She fell into the nasty plot of her sister and was humiliated. After many twists and turns, the misunderstandings passed by, one by one… When all the truth was revealed, when the plot was punctured, what would be their destiny?"},{"name":" Dorei no Watashi-shi Mofumofu Shujin ga Toutokute Kyou mo Buji Shibou","avatar":"https://mangadex.org/covers/67be1761-cbd1-4986-8984-f69440ed25fc/f3c7b645-a0cd-479b-a0d5-b11937cf2fa1.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Animals,Romance,Comedy,Fantasy"],"nutshell":"A girl is sold and bought as a slave. She is prepared for a terrible life, but the master who was kind to her is actually a cat! A new life begins now for the unlikely combination of a slave girl and her cat master!"},{"name":" Kill the Villainess","avatar":"https://mangadex.org/covers/67befa8e-adf4-42e3-9958-094e16c86ea7/f7478c5e-ad25-48c0-9d21-4f7f1481e378.jpg.256.jpg","country":"Korean","stat":"8.43","status":"Ongoing","tags":["Reincarnation,Historical,Psychological,Long Strip,Romance,Survival,Magic,Isekai,Drama,Fantasy,Villainess,Web Comic,Adaptation,Full Color,Tragedy"],"nutshell":"Eris Miserian just wants to die.\nBeing overworked and underappreciated in the real world wasn’t great, but living as the villainess in a romance novel is even worse. If Eris can die in the novel, she might be able to return to reality, but the story won’t let her. Desperate to escape a life as the protagonist’s tormentor, she sets off on a journey with the help of a witch, a knight, and a high priest. Can she find her way back to her friends and family, or is Eris doomed to a fictional future?\n\nOfficial Translations:\n\nFrench\nIndonesiah\nJapanese\nS. Chinese\nT. Chinese\nThai"},{"name":" Warau Kyuuketsuki","avatar":"https://mangadex.org/covers/67c0e6e1-b3c3-4048-b061-ded9dfefabe3/c1d36354-2db0-4522-8f7d-9d34db0aec40.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Psychological,Romance,Horror,Vampires,Supernatural"],"nutshell":"Mangaupdates:\nVolume 1 : The Laughing Vampire.\nWhile a young boy, just resurrected as a vampire, commits acts of awful ferocity, the city around him shows all its perversion. The adults abuse their power, the boys degenerate and use all the available means to achieve their goal to give vent to their low instincts. Whoever can't understand and make opposition is doomed to change or becoming crazy. So which is the real horror? The vampire who kills in order to feed himself or the crawling disease hidden in society, which slowy corrupts without being noticed?\nVolume 2 : Paradise.\nFollowing the events narrated in the first volume, Luna and Konosuke are now living together with the old woman vampire as fellows, as lovers, in a diabolic innocence, killing for quieting their thirst for blood, joining death and love under the dream of eternal youth. Meanwhile, a young boy named Makoto is looking for his lost sister Miko, who disappeared years ago in mysterious circumstances. But what really happened to that girl who liked eating grubs and dreamed of becoming one of them? And is there really a terrible secret that someone is hiding? The paths of all the characters will dramatically collide, bringing unexpected consequences after the things are gradually revealed."},{"name":" Boku No Josou To amai mono","avatar":"https://mangadex.org/covers/67c1425e-c690-469c-bcb1-df377fd56b86/dbe11595-030b-4573-a146-820bc393de2b.png.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Comedy,Crossdressing,Slice of Life"],"nutshell":"Karyawan Kantoran, Ketua Amami Menyukai Makanan Manis.\nSeorang junior, Satou-kun memaksa Ketua Amami Agar bisa Crossdressing Dengan Manisan/makanan manis Sebagai umpan"},{"name":" Kusozako Mesugaki Fuuki Iinchou","avatar":"https://mangadex.org/covers/67c5c106-32ed-472f-837b-fd0928909a61/7fa9ef55-c434-4774-a2c7-6cf8804c16db.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Comedy,School Life,Web Comic"],"nutshell":""},{"name":" Yakusoku no Yokan","avatar":"https://mangadex.org/covers/67c94de9-c294-4d27-8136-98b97fcb1fba/98f93331-eff2-4601-bf29-4905b8160a7d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Oneshot,Boys' Love,Drama"],"nutshell":"Can a male escort find love with a needy author?"},{"name":" How to Get Rid of My Dark Past","avatar":"https://mangadex.org/covers/67c97dca-0e54-41f0-9f01-32160da4f7c9/534a8e38-a4ea-41a5-9648-332ab4cd9d34.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Historical,Long Strip,Romance,Reverse Harem,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"During my edgy emo teenage years, I wrote a novel about Reina, the only daughter of the Duke of Solei, who wears an eye patch in one eye and a black dye dragon on her left arm. The ultimate moody emo villainess with skull decorations and black roses on everything she owns... The ultimate symbol of my dark and moody past - and now I am suddenly her?! To make matters worse, even the overpowered minion characters who I made swear their allegiance to me have now started running wild... to the point that I'm the one who feels like begging on my knees. This is enough! Just, why is everything so embarrassingly overdramatic? It's time to clean up my dark past!\n\n\n\nOfficial Simplified Chinese Translation\n\n\nOfficial Japanese Translation\n\n\nOfficial French Translation\n\n\n\n\n\nOriginal Webtoon <RidiBooks>\n\n\nOriginal Webtoon <Naver>"},{"name":" Docchi mo Kizukanai","avatar":"https://mangadex.org/covers/67d74cda-9f34-47e5-937a-ba925f6f505d/e493f23e-a35c-4abe-b59f-fa69bd7029ba.png.256.jpg","country":"Japanese","stat":"8.24","status":"Ongoing","tags":["Romance,Comedy,Office Workers,Slice of Life"],"nutshell":"Uemura is a bit scary, and Morishita is a bit of an airhead. Their feelings always don't reach each other enough. They can feel it, but don't notice it. Their frustrating sense of distance is extremely precious, though.\nNico Nico Raws - https://seiga.nicovideo.jp/comic/48535"},{"name":" Baki Gaiden: Kizudzura","avatar":"https://mangadex.org/covers/67da09e0-e837-4b41-8960-ece3988b33f0/7bd3260f-c2a3-4431-90a8-dcd4f13d1643.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Action,Psychological,Comedy,Sports,Martial Arts,Adventure,Drama,Mystery"],"nutshell":"The Adventures of the most dangerous Yazuka in high school, 15 years old Hanayama Kaoru!!\nThis is a spin-off of the Baki series, showing the school years of the character Hanayama."},{"name":" Shin Elf-san wa Yaserarenai.","avatar":"https://mangadex.org/covers/67daa0c6-84c3-4c37-bdd8-1ada578479c3/ba893159-a6cb-4cf1-b6d5-b2d7ce00ab88.jpg.256.jpg","country":"Japanese","stat":"8.65","status":"Ongoing","tags":["Demons,Animals,Comedy,Magic,Harem,Isekai,Fantasy,Monster Girls,Slice of Life,Cooking,Supernatural,Full Color"],"nutshell":"The sequel to Elf-san wa Yaserarenai (Plus-Sized Elf), set up as the manga switched publishers from Wani Books to Akita Shonen.\nYou know the drill by now - Naoe is a massage therapist whose life is turned upside down when he starts dealing with girls from another world and their weight issues. But this isn’t called Shin Elf-san for nothing. You’re going to get fully-colored pages due to its digital release, as well as new scenarios involving your favorite chubby elf.\nGet ready to get down with the thiccness!"},{"name":" Coffee & Cat","avatar":"https://mangadex.org/covers/67ea72cd-fef8-4c5e-b973-72e0ba773901/ec32216a-e622-48d6-ba6e-8c45fcf4c05b.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Ongoing","tags":["Animals,Comedy,Slice of Life,Supernatural"],"nutshell":"In shock after failing his college entrance exams, Nishikori Kon took his pet cat M'lady and fled. He ended up going from Kyoto to Mount Hakodate in Hokkaido. At his wits end, he was picked up by a young man named Tachikawa Ayakane, who hired him on the spot to work at his and his brothers 'café (though his older brother hates the word 'café') \"Coffee & Cat\". It turns out Ayakane was so impressed with Kon's pet cat's appearance that he wanted him to get the 5 unkempt cats of the establishment in order. Now Kon serves all the cats, but he has a secret that the brothers don't know about. Kon can actually see cats as human beings and understand their speech! Kon and his pet cat's new lifestyle is just beginning!"},{"name":" Shonen Ashibe GO! GO! Goma-chan","avatar":"https://mangadex.org/covers/67eb5fc2-ebd8-4e33-86ec-dc1724ff7c53/90c0c939-b014-4e65-985b-28bd5628e1dc.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Slice of Life"],"nutshell":"Shounen Ashibe follows the daily life of first-grader Ashibe Ashiya and his spotted seal pet Goma-chan."},{"name":" Majyo to Houki to Kurobuchi Megane","avatar":"https://mangadex.org/covers/67f65415-9904-4931-9cf7-21cf766265e6/688faa68-c24a-46cc-a36e-2ff5de3ba3bb.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Comedy,Magic,Girls' Love,4-Koma,School Life,Slice of Life,Supernatural"],"nutshell":"This is the story of two girls. Rhianna and Noriko. One day Rhianna moves in next door to Noriko and they soon become friends. Rhianna comes from a family with a magical background, yet she struggles to do even the most basic spells. This leads Noriko to assume she’s just cosplaying as a witch. She also lacks everyday common sense and knowledge. Noriko on the other hand is pretty level headed, but likes… really likes cute things."},{"name":" VOCALOID - Magnet (Doujinshi)","avatar":"https://mangadex.org/covers/67f8c98f-90d7-4e57-ad0f-23038f27706e/062720b2-174d-4520-91e8-4d1a87122af8.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Romance,Girls' Love,Drama"],"nutshell":""},{"name":" A Sexy Spy","avatar":"https://mangadex.org/covers/67fab937-8244-4f02-9a83-79104b0583e3/e25030c2-51cd-4709-a16a-d5c40085763a.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Romance"],"nutshell":"Heidi just wanted a job. Philip just wanted to get over the death of his fiance by drowning himself with his work. A chance encounter in the elevator leads the two down the path of sexy spy romance!"},{"name":" 1 Only Reason","avatar":"https://mangadex.org/covers/67fbef53-9bf6-4f95-8fc1-ab1084d2d8ea/36b202e0-61ce-4fb6-834d-9720d446bbaf.png.256.jpg","country":"Spanish (LATAM)","stat":"5.90","status":"Completed","tags":["Romance,Comedy,User Created,Girls' Love,Drama,Fantasy,Monster Girls,Web Comic,Slice of Life"],"nutshell":"This is the story of Elishé, an asexual succubus who deals with depression once she's disinherited for the deserting her own race."},{"name":" Dragon and the Phoenix","avatar":"https://mangadex.org/covers/67fca05f-56eb-452c-b325-4402ab8fd544/4b105950-23f6-4673-9065-5802e9ee9d2e.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Completed","tags":["Romance,Comedy,Fantasy,Supernatural"],"nutshell":"A Phoenix egg falls from the sky into the sea dragon realm, there the egg hatched into a beautiful and innocent little girl and when she wakes up there is a handsome (but dumbfounded) Dragon beside her…"},{"name":" Koukou Jihen","avatar":"https://mangadex.org/covers/68054bff-ab52-4ea9-bdd5-9eb9b4abde54/c4f30307-4c00-400e-ab88-533ca536cc60.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Ongoing","tags":["Action,Drama,School Life,Mystery"],"nutshell":"The series centers on Yui Yūri, the daughter of a death row convict imprisoned for enacting the \"greatest terrorist attack in the Heisei era.\" At the time, Yui was nine years old, and was judged not to have been involved in her father's activities. Now she is a second-year high school student at Takekura Kosugi High School, where the Japanese prime minister and his security detail are conducting a visit. But a paramilitary force assaults the school and takes the prime minister and the students hostage, without issuing any demands. In the middle of the crisis, Yui tries to find a way to get out."},{"name":" HENTAI","avatar":"https://mangadex.org/covers/6806d90b-e170-4e31-bf41-e349ccf48781/d1ad26de-dfcc-4723-bcaf-d9f146ab4ac9.jpg.256.jpg","country":"Japanese","stat":"6.74","status":"Completed","tags":["Action,Horror,Mystery,Adaptation"],"nutshell":"Yuko Natsuki, a rookie reporter for an occult magazine, sees a girl's spirit in a \"cursed apartment\" she visited for coverage. Rei Aiko, the spirit of a girl who massacres humans who step into the apartment. In a curse stretched like a spider web, Aiko continues to grow on the death of humans. Is there any way for Yuko to survive the curse!?\nThe manga adaptation of the popular suspense horror novel from the novel posting site estar!\n(Author changed his name in 2018 from 快紗瑠 to 藤白 圭, it's the same person)\nAuthor Twitter\nArtist Twitter"},{"name":" JAGAT RIMBA","avatar":"https://mangadex.org/covers/6807c39d-f395-4f03-a595-1b3e51bcea07/347d3885-d963-4ac5-9e97-07061b65e28e.jpg.256.jpg","country":"Indonesian","stat":"8.12","status":"Ongoing","tags":["Action,Long Strip,Adventure,Magic,Web Comic"],"nutshell":"Badhaka wishes to take revenge over the death of her brother at the hands of the Avian Clan, who are also the masterminds behind the return of the Parangkans to Dwipantara. However, Badhaka must fight to be able to become a Dibody warrior to defeat her enemy. Terribly, she was thrown into the Jungle Realm, a foreign expanse that's been long since left behind by humans. WIth the help of those still remaining there, she must find the final rhino so she can transform into a supernatural Dibody warrior."},{"name":" Aida ni Hatachi","avatar":"https://mangadex.org/covers/6807f710-a21e-46ce-9a44-b7d68ed80609/067dfc34-3aa4-4d3d-982f-424431175968.jpg.256.jpg","country":"Japanese","stat":"7.63","status":"Completed","tags":["Romance,Comedy,Drama"],"nutshell":"Summer of a high school third grader. 18-year-old male high school student Takae Reika who struggles studying for university entrance examination accidentally meets 38-year-old super beautiful Misa. \"A woman seems to have a really good smell\" — Reika who fell in love with Misa who just had broken up with her boyfriend, will pretend to be his 25-year old brother to fill up the age difference between them. I do not know that Mr. Misa also has a secret… A 20 year old difference love comedy \"18 year-old male high school student x 38 year-old unmarried woman\" starting with a lie!"},{"name":" Maria-san wa Toumei Shoujo","avatar":"https://mangadex.org/covers/680845d2-cfcb-4831-9d1c-fab3718e6fb0/4ed28c10-a281-4737-8585-d923604faa70.jpg.256.jpg","country":"Japanese","stat":"7.04","status":"Completed","tags":["Sci-Fi,Romance,Comedy,School Life"],"nutshell":"Maria discovers her invisibility powers when she is 5 years old, but there's a catch – whenever she feels calm or depressed, she starts turning invisible against her will. The only way to turn back or stay visible is to make sure she has heart throbbing doki doki thoughts available at a moment's notice.\nWhat better way to keep her heart throbbing than to hide in her handsome senpai's house, naked and invisible, and watch his most private moments?\nA new scifi work with a slightly(?) hentai heroine by the same artist that brought us Midori no Hibi and Mahou no Iroha!"},{"name":" Crows ZERO II - Suzuran x Housen","avatar":"https://mangadex.org/covers/68095946-ece2-4090-b0df-698f1cdb2a70/017dedb3-ca67-4d09-bd55-f38ea53ed074.jpg.256.jpg","country":"Japanese","stat":"8.26","status":"Completed","tags":["Action,Comedy"],"nutshell":"Crows ZERO II is the follow-up to the manga adaptation of the first Crows ZERO movie. Crows ZERO II covers the events of the second movie, and will see protagonist Takiya Genji taking on Narumi Taiga and the rest of Housen Academy. (Comes out monthly)"},{"name":" Issak","avatar":"https://mangadex.org/covers/680c9fa4-1c12-4838-97c2-765cba78374c/5ffb2be1-abd5-4687-a22e-d078e0a1f3d2.jpg.256.jpg","country":"Japanese","stat":"8.43","status":"Ongoing","tags":["Thriller,Historical,Action,Psychological,Survival,Samurai,Military,Drama"],"nutshell":"In the 17th century, the Holy Roman Empire was ravaged by the Thirty Years' War. In the middle of this chaos appeared a Japanese mercenary named Isaak. His fierce battle begins!"},{"name":" Urban Strengthening System","avatar":"https://mangadex.org/covers/680d2beb-d403-4955-a2dc-3ff9c8db7c1b/79b10905-ea25-483b-acc3-fedc9f05db3a.png.256.jpg","country":"Chinese (Simplified)","stat":"7.37","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Cooking"],"nutshell":"The main character rose from the level of trash to become the top of his class through cooking, demonstrating the fearsome power of gourmet food. As he goes about his daily life, his explosive growth is the norm!"},{"name":" Horror Romance: Cheoyong","avatar":"https://mangadex.org/covers/680ecffc-279a-4ce4-a6b7-eae91c51d265/48b33636-0dce-42b2-be3c-c6cad77a89b7.jpg.256.jpg","country":"Korean","stat":"7.90","status":"Completed","tags":["Ghosts,Long Strip,Romance,Comedy,Web Comic,Mystery,Full Color"],"nutshell":"\"Lee Yeojin,\" the heroine of Cheoyoung's urban legend, is suffering from a strange somnambulism.\nA special man appears in front of her, who was dreaming of a fierce, passionate love.\n\"Won Jaehee,\" a smart guy, is being burdened by the unhappiness called, 'the sixth sense,' but knows how to turn that into good fortune.\nThe way he talks is harsh, but he's good looking, and she happens to fall in love with him, who understands herself, at first sight, but….\n\"If it's alright with you, would you like to try meeting up with me a few times?\"\nWith her, who has too many good things in the world, is his \"horror\" romance, which is the best in the world!"},{"name":" Gensou Suikoden - The Dawn of Morning (Doujinshi)","avatar":"https://mangadex.org/covers/6815ea07-5fe4-4813-971b-b716e1dcec39/74cfa6b9-3c37-4a58-9c65-a11928b44b92.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Boys' Love"],"nutshell":"From Ramsus-kun:\nMainly a Suikoden 1 doujinshi, but characters from Suikoden 2 & 3 appear as well. In one story, we find out what Mathiu really does with Odessa's earring after you give it to him, and in another, Camille will stop at nothing to get back the money Gremio owes her. There's even a whole chapter dedicated to Kasumi, Meg and Millie discussing clothes. And finally, the Liberation Army is getting too big for its castle, and some up the liberators end up having to share beds…"},{"name":" The Days I Was Raised by My Mortal Enemy","avatar":"https://mangadex.org/covers/68190784-0026-402a-ba91-94bb1fe1be02/b23ff118-2fac-4cba-9412-22900c513ffd.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Historical,Long Strip,Web Comic,Full Color"],"nutshell":"“HELP! I’ve been kidnapped by that long and scaly b*stard!” cried a rabbit out of fear and sorrow. But then, a few days later… “Hmph, just because I’m cute and ditzy doesn’t mean you can keep bullying me! Have at you!”"},{"name":" Nekomahime","avatar":"https://mangadex.org/covers/681aae2f-a81f-40c1-8555-499946d093c7/aed5f36c-cfd3-4db5-8279-0ea2217889ec.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Animals,Comedy,Fantasy,Monster Girls"],"nutshell":"An experiment goes wrong, an assistant turns into a cat.\nBut not to worry, it can be reversed… kind of."}]