[{"name":" Nokemono-tachi no Yoru","avatar":"https://mangadex.org/covers/cba4fded-0b17-4740-8f21-95fbec9de47c/30053aaa-27a7-45c7-9953-08984ad839c4.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Action,Drama,Fantasy,Supernatural"],"nutshell":"Wisteria is an orphan girl living in a corner of the British Empire at the end of the 19th century. Her life is desolate and bleak–until she encounters Malbus, a powerful but equally lonely immortal being with a furry appearance, hounded by hunters. Together, Wisteria and Malbus roam the Empire–populated by humans and human-like beasts–in search of a place where they can live together in peace."},{"name":" Xing Dong Tian Qi Xia Xiao XIng","avatar":"https://mangadex.org/covers/cbaa3954-47c5-4634-ae36-98864dd3b150/995c6396-a181-4551-a744-ac10b07588d1.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.88","status":"Ongoing","tags":["Long Strip,Romance"],"nutshell":"Adapted from a popular Chinese novel, protagonist Xia Xiao Xing was saved by Qin Jun who is the heir to the famous Qin Corporation. Due to pressure from his family to get married, he randomly picked a wife – Xia Xiao Xing. Initially, he chose her only because she was pleasing to look at. But, when did it all change??? With the big difference in their social status, they have one rocky relationship ahead…"},{"name":" A Sheltered Girl's Day to Day","avatar":"https://mangadex.org/covers/cbb021cd-0c12-49e8-a95c-049abb37900d/d42dd495-683a-4210-a969-21d3ab3d3a45.png.256.jpg","country":"Japanese","stat":"7.71","status":"Completed","tags":["Oneshot,Romance,Comedy"],"nutshell":"Sawada and Kazumi who has a relationship that is like cats and dogs somehow always find themselves in an erotic situation inside closed and tight spaces."},{"name":" Hirudora","avatar":"https://mangadex.org/covers/cbb64c2d-e2d2-45c1-bf01-3de4e9cdccd8/3d9874aa-371b-4ed7-b47d-cdeb1dc08c28.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Cancelled","tags":["Loli,Traditional Games,Comedy,Drama,Slice of Life"],"nutshell":""},{"name":" Sis Plus","avatar":"https://mangadex.org/covers/cbb99e93-a9cf-41f0-b68d-9731333b0e89/2fee0f3d-7d68-4118-85cb-2b1a2700c36a.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Comedy,Slice of Life"],"nutshell":"Shiho, Cocoa and Himeka are three sisters who live together with their protective older brother. As their parents are off traveling the world, the brother has taken on the parental role as well as taking point in the bakery that all the siblings operate. As a result, the brother has developed a sister complex, becoming, at times, overbearing to Shiho, Cocoa and Himeka. This is a comedic story about their little weird family."},{"name":" Renka","avatar":"https://mangadex.org/covers/cbb9cccd-44c0-4b56-8eb9-a158d15fee00/4626b4ca-9939-4601-9b72-a1c625b56fff.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Historical,Martial Arts,Drama,Fantasy"],"nutshell":"A story set in a unique world of samurai and man-slayers reminiscent of the Japan of old. One man wanders the land with a deep past, a deep secret, and a \"merciful\" right hand…"},{"name":" Touhou - Narakagoku Destination (Doujinshi)","avatar":"https://mangadex.org/covers/cbb9ef85-114e-4d07-a381-d078234f050f/b6d9225e-7264-43f9-88c6-ee856386dbc3.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Drama"],"nutshell":"Shikieiki and Komachi go pay a long-delayed courtesy visit to the Old Hell. Shikieiki unwilling to go at first, But after Komachi give a push. She decide to visit the Old Hell together. many unexpected things might surface, such the reason why Shikieiki isn't willing to go."},{"name":" Hito wa Sore o Koi to Yobu","avatar":"https://mangadex.org/covers/cbc63096-bad4-401e-95d1-d263997a4fef/f9753a13-628f-4a68-9ed6-ec9aed516079.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Boys' Love,School Life"],"nutshell":"His cute appearance always brings trouble to Tominaga Jun. The moment he enrolled in an all-boys high school, he got confessed to by classmates and upperclassmen alike. The manly Jun, whose appearance is totally the opposite of his character, bluntly rejects all the confessions, sometimes having to resort to his fists to make himself understood… but he eventually begins to feel something for the student council president, Sakuma…"},{"name":" Nekogoze","avatar":"https://mangadex.org/covers/cbc6514c-8b45-4458-b2d2-e636ee0d2e58/c71467ba-4fb5-41f3-800c-d85290015bbd.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Action,Martial Arts,Fantasy"],"nutshell":"Set in an alternative catfolk-inhabited post-war Japan, occupied and integrated into the Soviet Union, this is a story about a traveling goze—a blind female musician—and a skilled swordsman Youme, and her guide, buddhist monk Uguisu. Making a living with street performances and taking on dangerous jobs that make use of their considerable fighting expertise, the pair clashes swords with criminals, Cheka enforcers and orthodox religious sects looking for clues to the whereabouts of Uguisu's brother and the mysterious two-tailed Cheka operative."},{"name":" Blazing Fudedama","avatar":"https://mangadex.org/covers/cbc6c6b1-695f-4fc0-af86-88de30b191f4/17e2907e-3750-4eb2-b579-c664e7fcb8d5.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Thriller,Sci-Fi,Monsters,Action,Psychological,Comedy,Anthology,Survival,Martial Arts,Adventure,Military,Drama,Slice of Life,Aliens,Tragedy"],"nutshell":"(from ebookjapan):\nKazuhiko Shimamoto is the mangaka who fist best with the theme of \"flames\" in the world. From among his works, we have selected five short stories that will set your life on fire, including \"Guts Sentai Gutsman,\" in which voice actress Yuko Miyamura plays an active role as the leader of the Guts Sentai Gutsman team to protect the earth!\nA mirror of purification that will test the reader's mind, here it comes!"},{"name":" Caterpillar","avatar":"https://mangadex.org/covers/cbc6ca2c-4982-445c-8019-776975e6233e/029b45f7-c663-4d72-a371-fa282dfe57a3.png.256.jpg","country":"Japanese","stat":"7.38","status":"Completed","tags":["Action,Psychological,Drama,Horror,Mystery,Tragedy"],"nutshell":"Possessing both flexibility and tenacity, Imomushi (Japanese for Caterpillar) is an assassin that does not kill anyone but those who are assigned to her. She seems to have had something happen between her and her older sister in the past, however.\nA new spin-off story from the same author of Arachnid, this story looks at the inner workings of a top assassin within The Organization itself.\nNote: In early 2014, serialization resumed with a new artist. The series had been on hiatus after the sudden passing of the previous artist in 2013\nWikipedia"},{"name":" Koishii Akuma","avatar":"https://mangadex.org/covers/cbc7c4b3-68cc-4122-ab22-90113fecf00b/fdf58d05-78e6-4e5e-8acb-3fee2e8791b0.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,School Life"],"nutshell":"Despite his best efforts, Akiyoshi Tooru has fallen for the very beautiful but sadistic and perverted demon, Naruse Fuuta. Not only do they attend the same university, they’re now living together! Though Akiyoshi has always tried to be careful about their night life, he never expected Naruse to stop touching him altogether, and then all of a sudden, Naruse is in an accident and reverts to his adolescent self!"},{"name":" The Strongest Dull Prince's Secret Battle for the Throne","avatar":"https://mangadex.org/covers/cbce49c7-6311-4955-8b10-1005775d5cee/5b9f3984-2229-4a81-88ac-f9538258fc45.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Ongoing","tags":["Monsters,Action,Romance,Adventure,Magic,Harem,Fantasy,Adaptation"],"nutshell":"The Adresia empire on the Vogel continent. There is a battle over the throne of such an empire that possesses powerful military and vast territory.\nWith the successor undecided, the children of the emperor are vying to expand their power. However, there was one prince that everyone says will definitely not become the emperor.\nThe seventh prince, Arnold Lakes Adler. The young man who was inferior to his younger twin brother in every way, the dull prince.\nIncompetent and lethargic, Arnold wastes everyday just playing around. However, behind the scenes, he is one of the only five SS-Class adventurers called ‘Silver’.\nSeeing the intensifying battle for the throne he decided “I don’t want to die so let’s have my little brother become the emperor…”\nThis is the tale of absurd secret manoeuvres of the prince who is uninterested in the title of the emperor.\n\nLinks:\n\nArtist's Twitter\nOfficial PV"},{"name":" Yukiko's Spinach","avatar":"https://mangadex.org/covers/cbcfb286-a887-438e-82c1-9d28d6412641/a26e064a-87cb-4566-a1ff-6f5b741a5b73.jpg.256.jpg","country":"French","stat":"7.98","status":"Ongoing","tags":["Romance,Drama,Slice of Life"],"nutshell":"From the diary of Jérôme Attal, French writer and singer:\n« - You should have ordered some spinach, then?\n\nSome spinach?\nYes. Like in the wonderful graphic novel from Frédéric Boilet, Yukiko's Spinach. For a French person, the two words \"spinach\" and \"navel\" in Japanese sound very much alike. You absolutely must read that book. It's very French New Wave, very simple and very beautiful. At the end, one can almost touch the texture, the skin and the kimono of the girl. Yukiko's Spinach, it's a painting and a short movie at the same time, hung on several plates of a comic book. »\n\nFrom Pascal Ory, Lire:\n« This is one of the most surprising books in the history of bande dessinée. Nevertheless, the methods he uses are among the most simple […] it's as if the author were telling us in real time about the little adventure he had with Yukiko Hashimoto. »\nFrom Éric Loret, Libération:\n« Yukiko in the hands of Boilet is the most beautiful girl in the world, beautiful like Anna Karina through Godard's eyes, beautiful like Maggie Cheung closely examined by Assayas […] Frédéric Boilet is an intimist, drawing the tenderness, the emotional tie, the loving relationship with a subjective camera, the fleeting moment where one finally grasps it. »"},{"name":" Higanjima - Aniki-hen","avatar":"https://mangadex.org/covers/cbe2c335-5a17-4b26-bfd0-e1778c44eb07/508737bc-8390-4097-9efc-a952bd1a6f34.jpg.256.jpg","country":"Japanese","stat":"7.60","status":"Completed","tags":["Action,Survival,Adventure,Drama,Horror,Fantasy,Vampires,Supernatural,Mystery,Tragedy"],"nutshell":"A short collection of stories detailing what Atsushi was up to on the island prior to his younger brother's arrival.\nIncluded one-shot: Kanojo wa Warau"},{"name":" Touhou - Ohashi wo Motsu Te wa Hidari Te desu (Doujinshi)","avatar":"https://mangadex.org/covers/cbe5a1ac-9a70-447c-9a13-112c4fefbc1f/74f7588a-9d7b-4856-b44b-ff34d0081a85.png.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Oneshot"],"nutshell":""},{"name":" Kiss no Mukou","avatar":"https://mangadex.org/covers/cbe6893f-64b7-4dd0-b5d2-dedca454291c/8fe07510-bc79-44b0-bf66-4ab13179d2bb.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Ongoing","tags":["Boys' Love,School Life,Slice of Life"],"nutshell":"1-3) Kiss no Mukou\nKirio, Shirou and Eita were childhood friends. Kirio had always liked Eita and fell into a state of depression when Eita got himself a girlfriend. Kirio thought that he and Shirou are in the same \"heart-broken\" state as he always assumed that Shirou are also in love with Eita. However, one day Shirou blurted out that it wasn't Eita that he likes, but Kirio himself. Since then, Kirio became more self-conscious whenever he's with Shirou…\n\nEggshell\nThere are 7 months and 15 days until Toya Haruki graduates from high school. Until then his teacher Shiihashi intends to make him wait before he agrees to having a relationship with him. In the end who will win out Toya or Shiihashi?\n\n5-6) The Sky We'll See Tomorrow & Stripe\nHitomi is being transfered to Osaka so he decides to break up with his lover Saki before leaving. It seems that Saki isn't going to just let things end."},{"name":" Bilocators","avatar":"https://mangadex.org/covers/cbf083b0-1d1c-4fea-8337-fe18850511be/ecffaf1e-0e86-45f2-ba3e-b66fbff9de38.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Genderswap,Action,Supernatural"],"nutshell":"One day, a boy named Takahiko Amano (who's very much an indoors type) has an sudden and unfortunate accident. Ever since then, his spirit has called out, \"Release me! From this body, from this lonely isolated life, and from this miserable fate!\" Then, with a crash, a \"spirit separationist\" arrives and puts Takahiro in a situation he never could have imagined!"},{"name":" Strange Detective","avatar":"https://mangadex.org/covers/cbf1d341-9b70-45f9-a1dd-8b94d700ad79/e662c803-f36e-4a9a-8894-bfba865dcf04.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.65","status":"Completed","tags":["Thriller,Action,Psychological,Ghosts,Long Strip,Crime"],"nutshell":"Wang You Cai, who has the abilities of a detective, originally planned to take a break after resigning as a cop; but to his dismay, his friend experienced an unexplainable tragic death. As a detective, he has decided to solve the mystery; while searching for answers, he met the female Mc Zhen Meng, who is part of a mysterious group; confidentially, they start to uncover the truth of many other obnoxious situations. Read to find out more!"},{"name":" Secret Therapy","avatar":"https://mangadex.org/covers/cbf74a2b-0b0a-44ab-830b-d05b0906046e/6d0a191c-b37d-41fd-9981-3c1ee38cf1e2.jpg.256.jpg","country":"Korean","stat":"8.41","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Web Comic,Full Color"],"nutshell":"“Nice to meet you. I’m just a lowly junior to you, right?”\nRich, handsome, and hardworking college student Yoon Jaesung was not fond of the way his senior Lee Hyun returned to school and suddenly took his spot as top student of their department.\nOn top of that, their first impressions of each other were awful!\nCompletely unlike Jaesung, Lee Hyun secretly transforms and lives as a streamer deep in the night.\nMeanwhile, Jaesung who never had reason to envy anyone in the world is still shocked beyond words that he was knocked so easily from the #1 spot.\nWhat will happen when their secrets collide…?!"},{"name":" Touhou - Peaceful World (Doujinshi)","avatar":"https://mangadex.org/covers/cbf804fb-4ee6-4b84-8ac3-6cc5bfd65176/4c4d78a9-be6c-47d9-9c0a-68514c97e31c.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Oneshot"],"nutshell":""},{"name":" Yeohye","avatar":"https://mangadex.org/covers/cbfa1ed3-a648-43e1-8e6d-1ebbb00b9212/5b300bc8-383f-4061-b586-fa2468f11ef2.jpg.256.jpg","country":"Korean","stat":"8.12","status":"Completed","tags":["Official Colored,Historical,Long Strip,Romance,Drama,Web Comic,Full Color,Tragedy"],"nutshell":"Without a sound, a King was killed by his Queen. And on that day, the Queen ascended the throne to become a king. What could be the reason for the Queen to go as far as murdering the King and trying to become a king herself? This an oriental historical story about the heartbreaking and tragic romance of those who crossed path only to miss each other amidst obscured truth and getting entangled in love and hatred."},{"name":" Saredo Tsumibito wa Ryuu to Odoru","avatar":"https://mangadex.org/covers/cbffe705-cc60-43b2-8ae1-3f8fcdbd409a/6428278f-a27a-44d4-a972-d888517d87e8.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Action,Adventure,Drama,Fantasy,Supernatural,Mystery,Adaptation"],"nutshell":"The story revolves around \"jushiki\" (lit. spell equations), the equations that govern the quantum constant \"h\" of action, change the laws of physics at the local scale, give birth to TNT explosives and poison gas, and cause incredible physical phenomena such as plasma and nuclear fusion. Two \"jushikishi\" (spell equationists) who use jushiki in battle are Gayus - who deals with bad luck with tact - and the beautiful but cruel sword-wielder Gigina. These two bounty hunters are caught up in a battle with dragons in the city of Eridana and in the intrigue of great nations.\nSaredo Tsumibito wa Ryuu to Odoru (Alternate Story)"},{"name":" Story about OL-san Picking up a Cat","avatar":"https://mangadex.org/covers/cc05bbe6-3b5a-44c1-84ff-1708660c1ea9/a8a0359a-5d9b-40de-bb22-660c37c310d3.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Girls' Love,Supernatural"],"nutshell":"An OL thinks she's picked up a normal homeless cat, who turns out to have the ability to transform into a catgirl wearing a high school uniform."},{"name":" Poyopoyo Kansatsu Nikki","avatar":"https://mangadex.org/covers/cc077710-3f9a-4acb-8319-a80f80ca4c45/69734b9d-6fc7-4fb2-b5e3-b0e752a9a9e1.jpg.256.jpg","country":"Japanese","stat":"8.53","status":"Completed","tags":["Comedy,4-Koma,Slice of Life"],"nutshell":"Is it a pillow?!?!….no, it's a CAT!!\nOne night, 22-year-old Moe took in the ever-so pillow-like cat, Poyo. No doubt, Poyo is not your everyday cat (doesn't look or sound like one!), but that doesn't stop Moe, her family, friends, and neighbors from loving this adorable spherical cat.\nRu Tatuki brings you the perfect amount of humor and warmth in this delightful feline 4-Koma manga!!"},{"name":" Durarara!! - Aka Tsuyu (Doujinshi)","avatar":"https://mangadex.org/covers/cc0b60c1-b7c0-4ca5-b1dd-241b27ad4378/2a79e5af-96ca-497f-903d-0b36c5c350b6.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Oneshot,Boys' Love,Fantasy,Supernatural"],"nutshell":"Pairing: Izaya x Shizuo\nThis is an AU/Parallel story, where Izaya is a priest and Shizuo is a vampire."},{"name":" Job & Joy","avatar":"https://mangadex.org/covers/cc0cb8f6-344f-43bd-9fbc-ef327c6d84ea/8aeb76a9-40ed-4c43-bbef-8d90e8766ed2.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Slice of Life"],"nutshell":""},{"name":" Kimi ga Koi ni Midareru","avatar":"https://mangadex.org/covers/cc0f421e-3e57-46e7-b207-b2f8b2f87904/05504d51-dce0-4d08-a876-137fd4096cf7.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Boys' Love,Drama"],"nutshell":"After a fairly futile attempt at capturing the heart of Jinnai, Kijima finds himself dealt with a lucky hand once again.\nOne day, dazzled by the pattern of a beautiful kimono, he suddenly finds himself enchanted by the talent behind its simple genius. Just how far will he go for such a lovely masterpiece?"},{"name":" The Greedy Princess: My Husband Is a Warm Baby","avatar":"https://mangadex.org/covers/cc14c2a6-0cea-45c0-8082-bddff702fbb2/ab3000d1-c77e-4e43-81d5-fbe8f9776e83.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.84","status":"Completed","tags":["Reincarnation,Time Travel,Official Colored,Historical,Long Strip,Romance,Comedy,Fantasy,Web Comic,Full Color"],"nutshell":"Ça ne me dérange pas d'être bien habillée, mais je suis la fille d'un criminel ? Mon mari m'ignore, je suis victime d'harcèlement et je suis sans le sou. Attendez ! Regardez-moi gagner de l'argent, obtenir l'amour et le bonheur !\nEnglish:\nIf it was just transmigration, I wouldn’t have minded, but I unexpectedly transmigrated as the daughter of a guilty subject? Ignored by my husband, bullied by everyone who meets me, absolutely penniless. Wait and see! Watch me snatch over affections and make money, make no mistake in both, because feelings of love and business are going to blossom in doubles!"},{"name":" Around","avatar":"https://mangadex.org/covers/cc17f26a-2da5-4000-9fb7-accdc54c8ef9/12bd990e-4999-4479-aa71-26078dd477cf.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Boys' Love,School Life"],"nutshell":"An ensemble cast BL manga telling several stories about how high-school boys found love developing between themselves and unexpected partners, in surprising circumstances."},{"name":" \"Hajimete\" Ageru!","avatar":"https://mangadex.org/covers/cc1a424c-0fe3-475a-a05c-d678576340c8/98f8316a-b6d1-44ac-a898-972565f4fb41.png.256.jpg","country":"Japanese","stat":"7.57","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"Sayu was quite surprised when the popular Yano-senpai told her that he likes her. Nevertheless, she is still happy to go out with him. But when others start asking why would Yano-senpai want to go out with someone like her, Sayu can’t help but also wonder why…"},{"name":" Wake Up Deadman","avatar":"https://mangadex.org/covers/cc1abe01-2a55-4947-9aec-6f9c56185514/659c6b07-7eab-4522-9013-d8efb3b2e8e1.png.256.jpg","country":"Korean","stat":"7.90","status":"Completed","tags":["Action,Long Strip,Romance,Comedy,Adventure,Drama,Fantasy,Supernatural,Full Color,Tragedy"],"nutshell":"Saving his crush's life, Sahu incidentally turns to a zombie. And now he's trying to survive in a stone jungle, believing that one day he will sing for the world."}]