[{"name":" Kiss de Fusaide, Bare naide.","avatar":"https://mangadex.org/covers/199b17a2-1b2c-4383-87b4-4a823681c18a/ef5e96c5-ad2c-4bda-8c6e-3aac9cc022b9.jpg.256.jpg","country":"Japanese","stat":"8.49","status":"Ongoing","tags":["Romance,Office Workers"],"nutshell":"“You’re so turned on for someone trapped in this situation…\"\nMy sensitive spots are getting rubbed harshly over my shirt and a finger is slowly creeping inside of me. How can I suppress my voice so that we won’t get found out…!\nOne night, Kaede was accidentally locked out in the corridor of her workplace. She’s helped by her unrequited love, Shioya, who happened to pass by. He then lets her stay overnight at his house. Surprised by Shioya's roommate, they hide in the closet. Kaede’s thrilled by how close his body is to her… At that moment, his lips touch her chest."},{"name":" Saki - Ichijunsaki No Omoi (Doujinshi)","avatar":"https://mangadex.org/covers/199c587b-0e86-4582-9054-62fcc15ba947/d62c7563-83e6-41bb-a6b5-a4a04dd187f0.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Sci-Fi,Girls' Love"],"nutshell":""},{"name":" Diary","avatar":"https://mangadex.org/covers/199c6cfd-3d5b-4f92-8d10-fc829a5ae889/26e1ea61-aa39-4ee5-8b20-d66d98701bcc.jpg.256.jpg","country":"Vietnamese","stat":"7.98","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Girls' Love"],"nutshell":"L’histoire basée sur le journal de l’auteur."},{"name":" Koe Shika Mienai","avatar":"https://mangadex.org/covers/199d26cf-9511-4950-be16-92508c822acb/89cdd17b-eb80-410b-91b4-1aef02a024e6.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"The story of a salaryman named Fujisawa, who can't speak loudly due to trauma and the one who wants to hear his voice the most, Kishino. Can Kishino cure Fujisawa's trauma?"},{"name":" The Strongest Abandoned Husband","avatar":"https://mangadex.org/covers/199d909a-1478-40ca-90ce-777a5438c48a/b9c8e7a0-0f88-48ce-b3a4-6592f3cde2df.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Action,Romance,Martial Arts,Drama,Fantasy"],"nutshell":"The strongest genius died unexpectedly and was reborn on the weakest waste wood.\nRelying on past life memories and exercises, he washed the marrow veins of the strongest waste wood, reshaped his body, and transformed from waste wood into a cultivation genius.\nEven if you get divorced at the beginning, so what?\nWatch how a genius cultivates immortals, climbs to the top, tramples those who looked down on him in the past, saves beauties, collects money, and reaches the peak of life."},{"name":" I'll Be the Wife!","avatar":"https://mangadex.org/covers/199f67f5-67c3-486f-88c8-333215957ada/ad7974fc-ce4b-48fb-8fa4-6f10fbe4efaa.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Psychological,Romance,Comedy,Anthology,Drama,School Life,Delinquents,Slice of Life"],"nutshell":"\"(from ebookjapan):\nAyuko is surprised when the handsome, smart, and kind Reiji presses her for a kiss. One day, Yuri, a male high school senior who claims to be a relative of Ayuko's, suddenly visits her. He is from a family with nine elder siblings, eight of whom are all sisters.\nReiji is jealous and angry at Yuri for living with him. The gossipy members of the newspaper club notice the reason for his living together with Yuri, who behaves in a feminine manner due to the influence of his sisters....\nIn addition to \"I'll Be Your Bride! Wedding Dress\", \"Confess! Monkey Rock\", and \"Laughing Lover\" are also included."},{"name":" My First Love","avatar":"https://mangadex.org/covers/19ae1fe0-0ca0-42f2-a4e9-6f0164154fe2/ae35f7e4-8eed-4a57-903e-a7cdaaccb522.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Oneshot,Girls' Love,Drama,School Life"],"nutshell":"On the cusp of graduation, love blooms. Where will it lead?"},{"name":" Dekiai Yakuza ni wa Amayakasarenai!","avatar":"https://mangadex.org/covers/19af130c-ffd7-4f8b-b71e-f0e88ec89592/e4e378ff-9331-4eff-9537-18ede80ac906.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Ongoing","tags":["Psychological,Romance,Comedy,Mafia,School Life"],"nutshell":"An age-gap love story between a caretaker who loves a little too much and a young lady who’s a high school girl.\nRiko, the granddaughter of a yakuza family, has a crush on Iori, her overprotective caretaker.\nHe has always earnestly pampered Riko and been around her since long ago, and he has always been with her in everything she does.\nAnd when she found out that Iori has a girlfriend, she decided to break free from Iori and give up her love! Riko tries her best to increase the number of things she can do little by little, but Iori doesn’t seem convinced."},{"name":" Por mi cuenta","avatar":"https://mangadex.org/covers/19b43f8d-57a9-41bc-a055-0a761712ea17/a959bf14-4694-46f1-84d2-74ab9fdf777b.jpg.256.jpg","country":"Korean","stat":"7.85","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Web Comic,Cooking,Music,Full Color"],"nutshell":"El chef genio y propietario de un restaurante, Heemin, odia tanto depender de los demás por lo que le llaman \"Sr. Por mi cuenta\". Ser conocido como un tipo sin mayores emociones, que valora sobre la apariencia es muy bueno en el lugar de trabajo, a excepción de que significa que tiene que ocultar una parte integral de quién es… El hecho de que es un obstinado fan del grupo de K-pop, ¡Emotion! Para ser específico, Heemin está obsesionado con Jeong-woon, pero en un Meet and greet, uno de los otros miembros, Yiyeon, sigue charlando con él. No hay lugar para otro # 1 en el corazón de Heemin… ¿o si?"},{"name":" Touhou - Junjou Eccentric Honey Face (Doujinshi)","avatar":"https://mangadex.org/covers/19b7105c-53c5-46af-bab7-48e9e7283807/3e5cadba-4885-4fab-89b0-1a2ea67f7a3f.jpg.256.jpg","country":"Japanese","stat":"8.19","status":"Completed","tags":["Comedy"],"nutshell":"Don't do drugs, kids.<br />Especially those offered from a certain girl.<br />Very, very delicious."},{"name":" Throne of Ice","avatar":"https://mangadex.org/covers/19bdd622-5b05-4a0d-9d6c-65527e6f84ee/32b8f430-3c3e-4eed-b859-27763ec12d27.png.256.jpg","country":"English","stat":"7.97","status":"Completed","tags":["Historical,Adventure,Fantasy,Full Color"],"nutshell":"A heroic fantasy epic and rite of passage tale set in a mythical pre-glacial Antarctica. Antarctica 12,000 years ago — long before it becomes a frozen wasteland — is a thriving territory, divided into the kingdoms of Antarcia, Leng, and Valusia. When Antarcia's first lady vows to kill Jaemon, the bastard son of King Abarugon, the mysterious Sozer foils the plot and carries the infant to safety. Bearing the mysterious mark of the Atlanteans, Jaemon must unleash his true potential and fulfill both his and the continent’s destinies."},{"name":" Okatai Ouji no Tsuyagoto","avatar":"https://mangadex.org/covers/19be361e-8a4f-4ab9-a7f7-d64a8bab83ab/44c4f4ce-0d1c-44b1-8dc0-fd5f2370612a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,School Life,Slice of Life"],"nutshell":"Mei Hanamaki, a second-year high school student who has transferred to another school for some reason. It was Iku Hinosaka, a handsome sergeant who is the most popular girl in the school, who showed her natural nature and took the seat next to her, who seemed to be floating from the first day of transfer.\nThe cool Iku's de S is mercilessly poured on Mei, and each other's first impression is the worst.\nHowever, the relationship between the two began to change as a result of something …!? The super popular school romantic comedy, which won first place in the magical i Land novel overall ranking, has become a long-awaited comic!"},{"name":" Boss, How About an Affair?","avatar":"https://mangadex.org/covers/19c7f6aa-4938-4fe2-9ba1-679bf25ccb58/90db42b3-f9c7-4a16-9f55-51530beefddf.png.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Romance,Drama"],"nutshell":"More than a boss, but not quite a lover. The current worry of Moe Amamiya, who works at a medium-sized lingerie company, is that her sex life with her husband is practically nonexistent. Whatever she does, whether it’s dropping subtle hints here and there or trying to seduce him outright, nothing resonates with him... But then, on the day she and her husband hit a new record in the number of days without sex, Moe gets called over by her boss and colleague, Shinozaki. The two of them share a “little secret” that's going on in a secluded fitting room area...“If you keep this up, I’m going to cheat on you.”"},{"name":" Kurosaki-kun no Iinari ni Nante Naranai","avatar":"https://mangadex.org/covers/19c8ff73-5282-435f-b0ff-3ba492230150/ce703032-c82b-4f36-aca0-42a4255c689e.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,School Life"],"nutshell":"Yuu Akabane has worked hard to reinvent herself for high school, and there’s only one step left in her plan to leave her plain Jane days behind: asking out her idol, the “White Prince” Shirakawa-kun. When circumstances lead to Yuu moving into the school dorm where Shirakawa-kun boards, she thinks she’s found her lucky break. But unluckily for Yuu, “Black Devil” Kurosaki-kun, the boy everyone at school is afraid of, lives there too— and when Yuu defies him, he’s all too eager to punish her…"},{"name":" Tokyo Game","avatar":"https://mangadex.org/covers/19d1e4ee-94ee-4db3-889a-1bb88a109e33/00273a12-e80d-45e4-9ec4-01b0fd6b2e92.png.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Traditional Games,Psychological,Adventure,Post-Apocalyptic,Drama"],"nutshell":"In post-apocalyptic Japan, a nameless mahjong player ascends a massive tower, facing formidable opponents in life or death gambles."},{"name":" Four Billion Nights","avatar":"https://mangadex.org/covers/19d2baef-34a3-4b9b-9d41-5761d95a85c6/20e6d20d-a440-47a2-bbd1-9d69c000de85.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Oneshot,Sci-Fi,Action,Fantasy,Supernatural,Mystery"],"nutshell":"A collection of Hisa Masato's previous oneshots.\nIt includes:\n\nFour Billion Nights\nTroubled by a strange case, police officer Sasaki seeks the aid of the \"pruning section,\" a special police division that deals with the unusual and unnatural.\nAru Adauchi no Hanashi\nA woman seeks revenge on a crime lord for an assassination he ordered.\nKamaitachi no Hi\nMura Shigeki, a police detective, is reassigned to special investigations and must work with a youkai partner to track down a serial killer before he kills again."},{"name":" The Black Museum: The Ghost and the Lady","avatar":"https://mangadex.org/covers/19e6f7d5-1433-4f20-b1ac-bc19ae00abee/9bbd1342-31f9-42a1-b239-f1214a6f96c9.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Historical,Monsters,Action,Demons,Psychological,Ghosts,Comedy,Survival,Military,Drama,Medical,Horror,Supernatural,Mystery,Tragedy"],"nutshell":"Deep in Scotland Yard in London sits an evidence room, where artifacts of the greatest mysteries in London history are kept. In this \"Black Museum\" sits two bullets, fused together after a head-on collision. This was the key piece of evidence in a case that brought together a supernatural Man in Gray and the famous nurse and activist Florence Nightingale—the only person who can see him. Surrounded by war and suffering, the lady enters into a desperate pact with this ghostlike man…\nLinks:\n\nAuthor's Twitter"},{"name":" Sono Voice, Yuuryou Desu ka?","avatar":"https://mangadex.org/covers/19e74030-8e53-4ce0-af9f-38f9b32191c7/99fa9cae-b7ba-4431-9fa0-c28dabad3cff.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Voice actor otaku Suzuna meets a boy with the ideal handsome voice, Tachibana Waku.\nShe wants to get friendly with him but Waku is acting cold…\n\"So heart melting you can't help but smile!\" A younger tsundere boy and a girl obsessed with him scenes o’ plenty! Whispering sweet nothings, tin-can phones, handsome voices, loaded with moe situations! Settled firmly in the first position of comico novel category, continuously receiving good reviews and high praises from its readers. Now it’s time to raise the curtain on this youthful love started with a voice!"},{"name":" Tied Up in Twins","avatar":"https://mangadex.org/covers/19e8a06f-9866-4d17-b20c-766b22a83946/ce00cd8f-ab1a-4353-87ec-8e22e8277a96.jpg.256.jpg","country":"Korean","stat":"7.89","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"Sarang loves Jinwoo, Jinwoo loves Woojung, and Woojung loves… you get the idea. But after a mix-up of affections and tangled signals, can they find a happy ending stuck between love and friendship, or will even family bonds be lost in heartache?\nOfficial English translation on Comico's Pocket Comics app or Tappytoon"},{"name":" Touhou - Daidara Kenbunroku (Doujinshi)","avatar":"https://mangadex.org/covers/19eacf10-8071-4b7b-89f6-0115409903e6/96c89dc6-923d-469e-a8d5-3b7eb72cf5a2.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Ongoing","tags":["Action,Martial Arts,Adventure,Magic,Fantasy"],"nutshell":""},{"name":" Couple Gaihi Desu !!","avatar":"https://mangadex.org/covers/19eb6288-0187-4398-a0fa-e9a7125d3c9f/0b4d4532-9256-4943-a192-b6c5e1592585.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Romance,Office Workers,Slice of Life,Full Color"],"nutshell":"A beautiful & seemingly perfect secretary is celebrating a VERY spicy Halloween with her work colleague & secret boyfriend"},{"name":" Love Barometer","avatar":"https://mangadex.org/covers/19ec859c-19d5-428d-a11e-eef4e854f4c8/0ef74eac-0c24-490a-ade9-d2febe93b23f.jpg.256.jpg","country":"Korean","stat":"8.21","status":"Completed","tags":["Romance,School Life"],"nutshell":"Chaewoon is back in school after taking 2 years off. She doesn't want any trouble and wants to graduate without any incident but she can't seem to help but get entangled with not only the most popular guy in the department, Sado, but also the hot-blooded freshmen Mingyu! So much for wanting a quiet school year!"},{"name":" Zombie Men","avatar":"https://mangadex.org/covers/19ee000e-4e25-4017-ba2d-68d4d5fcf770/5c470b54-b3f9-4109-b204-083dceda8902.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Zombies,Sports,Horror,Supernatural"],"nutshell":"There's no coming back fron death, right? Of course there is, but there's a price to pay. Follow the story of a violent man who becomes a boxer and then becomes something else entirely.\nSource: Mangamo (Official English)"},{"name":" Touhou - Shoujo Reset (Doujinshi)","avatar":"https://mangadex.org/covers/19f2cbd3-4862-4f58-9ec3-5d2f475d943c/ee796d8d-2066-48ac-b7cd-023623a9482e.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Romance,Comedy,Girls' Love,Fantasy"],"nutshell":"Mokous develops an unusual interest in make-up, but it seems Keine has her own issues with that."},{"name":" Alfheim no Kishi Ballad: Tsugumi no Mori","avatar":"https://mangadex.org/covers/19f57c9c-ea95-4696-b7f9-726ccff02bcf/5d99d5ef-80aa-4135-9831-5d65405dc712.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Adventure,Fantasy"],"nutshell":"After the incident in Harrisburg, Altodias seemed to have regained its peace. However, the beasts have mutated and are causing damage to the people. Robin, who has been treating the beasts in the old castle of Altodias, takes a certain beastmaster's child as his apprentice"},{"name":" Bakumatsu Seishun Hanafubuki","avatar":"https://mangadex.org/covers/19f7161d-e88d-4191-b4cc-3b7441ecf3d3/cac1b349-cde5-447d-9b29-571eef98a249.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Historical,Romance,Comedy,Boys' Love,Drama"],"nutshell":"Follow the adventures of Okita and the rest of the Shinsengumi in this fun romp with a BL twist through ninteenth century Japan. A basic story of love between the various members of the Shinsengumi, focusing on Okita Souji and Hijikata Toushizou. Mostly slapstick humour about the love shared between these two men; and how Hijikata tries his best to avoid the feelings he has for Okita."},{"name":" A Talking Timetable","avatar":"https://mangadex.org/covers/19fadad7-9e6e-47c1-b7ec-5ce442150b32/b5bab9e5-9e44-4319-a3d8-52010f60e262.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,School Life,Slice of Life"],"nutshell":"Oshaberi na Jikanwari is based on Mizusawa Megumi-sensei's own love story. It is the story of how she had a crush on a boy since primary school and the events that took place while she goes from primary school through junior high to senior high."},{"name":" Girlish Sweet","avatar":"https://mangadex.org/covers/19fd79d6-78b6-4483-a755-f1dc29c7a645/75909a1c-075e-456d-a9c5-ec734a22fa3e.jpg.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Romance,Girls' Love,Drama,School Life"],"nutshell":"The distance between lovers, chance-meetings after years apart, the bitterness of youth… Through hurtful pasts, these girls learn to live for the present out of love for their girlfriends.\nPublished in April 2010 by Hakusensha, Takemiya Jin's first volume is a collection of her \"red sailor uniform\" series of original yuri doujinshi (first released between February 2008 and November 2009)."},{"name":" Seven","avatar":"https://mangadex.org/covers/19ff3af6-fa68-4f22-ad6a-a39bf1a78aba/4ac352bf-d144-4609-b229-43aa4dc31be0.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"Nana has no memory of his childhood earlier than age 12 when a store owner took him in and named him Nana, meaning no-name in Japanese. Mitsuha is on a quest to find a missing childhood friend. The two meet when Mitsuha ends up crashing at Nana's place at the insistence of a mutual friend. At first Nana loathes the very existence of Mitsuha. However, he gradually warms up to his sincerity and kindness and finds happiness in awakening beside him."},{"name":" Mahou Shoujo Lyrical Nanoha - HONEYxKISS (Doujinshi)","avatar":"https://mangadex.org/covers/1a072ff3-f3e4-4b4b-9702-d6732bd08800/6beb7a7c-bc2a-4bc2-9d37-a5b4569d0869.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Romance,Girls' Love"],"nutshell":""},{"name":" Baby Diary","avatar":"https://mangadex.org/covers/1a111983-ab86-457d-9f9b-f08c5bac2cfc/d2e4efb7-9bcc-473e-a3e3-c507903a8a17.jpg.256.jpg","country":"Korean","stat":"7.99","status":"Completed","tags":["Official Colored,Long Strip,Comedy,Boys' Love,4-Koma,Fantasy"],"nutshell":"4-koma story about raising the demon king's kid.\nOriginal webcomic: http://www.foxtoon.com/challenge/comic/734"},{"name":" Tensei Danzou Oujo wa Kekkon Aite wo Sagasanai","avatar":"https://mangadex.org/covers/1a151457-bfae-42d4-8562-b2c1df0181d5/184ce22f-bdf4-4696-a7ef-4c88197976b9.jpg.256.jpg","country":"Japanese","stat":"7.32","status":"Completed","tags":["Reincarnation,Romance,Reverse Harem,Crossdressing,Magic,Isekai,Drama,Fantasy,Adaptation"],"nutshell":"Alicia reincarnated into another world based on her beloved BL short novel, and her path to romance begins…!\n\"Until we graduate, become mine. Or even If I do this——\"\nPrincess Alicia hates the idea of a political marriage, so her mother offers her an alternative: crossdress and enter the boys-only magic academy, and choose one of the suitors to be her fiancé! Though it sounds impossible, Alicia fell in love with Lucius, an incredibly handsome gentleman who isn’t even a potential suitor. Yet somehow, Lucius knew right away that Alicia was a girl, and stole a kiss!"}]