[{"name":" KINGDOM OF THE \"Z\"","avatar":"https://mangadex.org/covers/0b7e315e-7977-425e-a601-243ddb9f3126/ec7be67b-00ad-4e82-a8c0-c6dd82064fcc.jpg.256.jpg","country":"Japanese","stat":"5.98","status":"Completed","tags":["Action,Romance,Survival,Zombies,Harem,School Life,Horror"],"nutshell":"Five days after the sudden appearance of zombies… The protagonist, Masaru, who is having it rough surviving at school, is splendidly saved from this predicament by high schoolers Sekigahara Miki and Nakiri Karin. Though Masaru is at first relieved, he ends up realizing their true intentions…!!"},{"name":" The Crescent Scholar","avatar":"https://mangadex.org/covers/0b8a0ba9-3013-493b-a71d-3bb6954084de/96e3f903-bd34-476f-9de5-a27d11316142.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Completed","tags":["Historical,Animals,Long Strip,Romance,Anthology,Boys' Love,Fantasy,Web Comic,Full Color"],"nutshell":"In his childhood, the only son of three generations of only sons, Yoo Weol, narrowly escaped a burning mountain with the help of the wolf spirit. Afterwards, to level the combination of yin and yang caused by change in his demeanor, his name was changed to Yoo Myeong, and his family would each time set up a ceremony of gratitude. Yoo Myeong who has fear of going up the mountain from memories of the incident, rashly went down the mountain, lost his way and met a big wolf. But oddly enough, Yoo Myeong's body became hot…"},{"name":" Record of the Warrior","avatar":"https://mangadex.org/covers/0b8a1c22-4019-417d-8cad-862c642ebbdf/bc1b283a-a102-46b4-806e-1b274efe068e.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Sci-Fi,Action,Romance,Martial Arts,Supernatural"],"nutshell":"After establishing an idealized utopian country, the legendary warrior, Hong Gil-Dong, disappeared without a trace. As time passed, the people of the land began to forget about Hong Gil-Dong, who had been enjoying a peaceful existence of anonymity in a small village. Until one day, when a band of unknown warriors invaded the village, leaving it in utter ruin. Now, Hong Gil-Dong has returned, determined to raise his village from the ashes-but in order to accomplish this he will need funds. And so he finds employment as a bounty hunter, capturing wanted criminals. Then, in a twist of fate, Hong Gil-Dong inadvertently rescues the daughter of a wealthy merchant from a kidnapping attempt. Consequently, he is hired on as her bodyguard, and charged with delivering the girl safely to her father. But evil forces lurk in the shadows, observing the hero's every move-waiting for the opportunity to strike.\n\n\n\nOriginal Book <Yes 24>\n\n\nOriginal <Aladin> Web | Book"},{"name":" Osoto wa Abunai yo","avatar":"https://mangadex.org/covers/0b94a956-d1da-493c-ab04-c858646e889a/ef8d0e9a-31bc-4364-98db-3bde626d83ff.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":[""],"nutshell":""},{"name":" Tongari Root","avatar":"https://mangadex.org/covers/0b9a4361-a332-489a-bdc8-ca58053d83f5/3764e61d-826f-4024-a27d-c4cce668c36c.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"Collection of short stories:\n• Tongari Root\nRuu is a high school student who studies seriously every day, aiming to become like her genius brother, Yoshihisa. At this time, at Ruu's side, comes Kakeru, Yoshihisa's friend, who becomes Ruu's teacher at home. Although Ruu's life has been messed up by the daring Kakeru, she has started to have feelings for him...\n• Monochrome Candy\nIt can't be cast off, it's fascinating, that silver-wrapped candy.\n• Bye-bye Babe\nFlowers will bloom upon the earth.\n• Love Fight\nSo Beautiful! With this thought, my body just moves by itself. I really want them to see him now."},{"name":" Seimaden","avatar":"https://mangadex.org/covers/0b9b3736-4079-4854-a73f-981e8848dc37/06023741-f430-4bde-ab41-1b1824f38e06.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Boys' Love,Drama,Fantasy,Supernatural,Tragedy"],"nutshell":"How far will one man go for love? Find out in SEIMADEN, the tale of Laures, who agreed to become a demon in order to free his one true love Alice from a demon king! Laures became the next Demon King, and Alice was freed — with death. Laures, however, realized that his new inhuman status gave him a rare opportunity: by being the cruelest and best Demon King, he survived long enough to see Alice reincarnated, and then he would effectively be reunited with her. Laures, after living through the centuries, has finally found his beloved reincarnated as Hilda, a dancer who has no memories of her own past or identity. Now he must see if she will accept him as a creature of the underworld…"},{"name":" A Fox Girl Fell From the Sky","avatar":"https://mangadex.org/covers/0b9c5b42-6086-4f61-94fa-2d66d29574bb/cdeb0343-b7c3-48c0-ab65-347b8c9ccea4.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Comedy,Fantasy"],"nutshell":"\"Liu Quanyou’s father was an exorcist from a small mountain village who got into some trouble when he was dealing with a spirit. Combining that with his grandfather owing a blood debt when he was young, Liu Quanyou had been cursed by a spirit since he was a kid. He would not be able to live past 23. Not wanting to let his child walk down this path, his father started to teach him some exorcism techniques. Since Liu Quanyou had the natural ability to see spirits, a lot of talent, and had inherited a special scroll from his father, the fox deity grandpa that died saving him left him with his granddaughter, Qianqian. She was to become his fiancée, being raised along with him and was given the new name, Liu Jie. The fox demon Liu Jie was powerful, she followed Liu Quanyu, who managed to get into a university, to the city and begin their path of exorcism. At the same time, they had to find a way to break his curse, they only had three years left.\n\""},{"name":" Kon'yaku o Haki sa Reta Akuyaku Reijou wa Kouya ni Ikiru.","avatar":"https://mangadex.org/covers/0ba31f01-f1d2-4cc0-9c1e-c53d3c9cdce9/86f14643-41b3-4036-b4d2-0973e1be8d2e.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Ongoing","tags":["Long Strip,Romance,Drama,Fantasy,Villainess,Full Color"],"nutshell":"The Crown Prince Wilhelm suddenly announced the dissolvement of his betrothal to Constance (Connie), the daughter of a marquis. It seems like he had fallen in love with someone else... a saint who had appeared recently.\nConnie grew depressed at the cruel declaration, as she had spent the past two years acting as his consort. But one day, her memory returned, and she realized that she had been reincarnated as the villainess in a romance novel.\n\"Whatever. I don't need a cheater (with the option to become a villainess). I'll live on as the leader of my land!\"\nThis is Connie's story of how she lives her life with strength in the borderlands far away from the capital city!"},{"name":" TV Boy (Shonen Book/Adventure King Ver.)","avatar":"https://mangadex.org/covers/0bb19e31-94f2-484f-b54b-6fc71a0191d2/8afa4388-220f-460e-a628-88e54476d83d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Animals,Comedy,School Life,Slice of Life"],"nutshell":"(from ebookjapan):\nTelesuke is an ordinary boy who loves to play rather than study. Yae-chan, whom he secretly loves, is a TV star chaser. So, aiming to become a star, Telesuke sneaks into the TV station, but ......? (The magazine \"Shonen Book\" version of \"TV Boy Telesuke\").  Teleske is a boy who has a duck that quacks in chicken-speak (?). He sells it himself and heads for a TV station in Tokyo. ......? (The Adventure King magazine version of \"TV Boy\")"},{"name":" Rengoku Deadroll","avatar":"https://mangadex.org/covers/0bb38e0f-6e4c-4fea-a582-10e62ef42271/a3ac7a47-71bc-48f0-a5a6-da471b6fbe80.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Action,Psychological,Survival,Horror,Supernatural"],"nutshell":"Meet Sakai Hiroaki, a high school teenage mastermind with a genius-level intelligence and a lack of interest in anything that is easy to him. During one unlucky day, in an attempt to stop a student from committing suicide, he ends up committing suicide himself. After he awakens, he finds himself not in the real world, nor in heaven, but in purgatory, along with a group of others who did the same: commit suicide. Sakai discovers that he and his peers are subjected to never-ending intense death games in this world for reasons unknown to him, and he tries to find a way to escape."},{"name":" Touhou - Cirno to Reimu no One Two Three (Doujinshi)","avatar":"https://mangadex.org/covers/0bbc4f7b-1ba0-48f4-8d0a-62efae078b44/0e0eb9a1-7d13-45f4-90ef-b1e619e34da4.jpg.256.jpg","country":"Japanese","stat":"8.34","status":"Ongoing","tags":["Romance,Comedy,Girls' Love"],"nutshell":"What happens when Reimu and Cirno start spending some quality time together?"},{"name":" The Red Love Letter","avatar":"https://mangadex.org/covers/0bbfef80-b8ef-4c02-95bf-9feca78a5b78/e2859536-e3ce-4c92-bbbd-0be56418b635.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Oneshot,Romance,Girls' Love"],"nutshell":"The Red Love Letter tells the story of a woman's affair with her sister-in-law."},{"name":" Merry Go Round","avatar":"https://mangadex.org/covers/0bc1dbe7-d54b-41ab-b4df-91bbf1c86bd8/a942fa6b-e31d-430c-9728-07fd779f3660.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Comedy,Boys' Love"],"nutshell":"Masaki's older brother reccommendation landed him in a part-time job at a theme park. But on his first day, a person wearing a bear costume ran up to him shouting \"Maa-kun!\" and hugged him tightly. Masaki has no memory of this bear (Oosawa) at all. As time passes by, Masaki gradually begins to fall for Oosawa, but the 14 year age gap and the scars left from the past put Oosawa in a difficult position."},{"name":" Zoku Konna Koi ni Narunante","avatar":"https://mangadex.org/covers/0bc60900-8234-40e4-afa3-4b2125aeef27/bc76d2ea-ddf6-423e-93c0-fb168b095965.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Office worker Kida loves his private time and prefers silence to socializing. But one day, the previously empty seat next to him is filled by salesman Takamura, turning his peaceful days upside-down! Takamura drags him out to eat lunch every day and chats with him constantly. Plus, it turns out they live in the same company apartment block, and ever since then, Takamura won't stop barging into Kida's place…! Kida would never have taken this lying down before, but Takamura has him strangely charmed… But why…? A puppy-like playboy meets a serious, socially awkward introvert in this tortured, bittersweet office romance!"},{"name":" I Lost the Leash of the Yandere Male Lead","avatar":"https://mangadex.org/covers/0bca50c1-e3ac-4a2e-bc9b-9d8984c81dd3/9af1262b-03cf-4aed-96da-b5e4d5e284f5.png.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Reincarnation,Action,Psychological,Long Strip,Romance,Adventure,Drama,Fantasy,Villainess,Adaptation"],"nutshell":"I transmigrated into a novel and became the villainess, Serina who comes from the noble Ducal Melford family.\nAs a well-to-do character, I tried to mind my own business, but the story had other ideas. A self-proclaimed mother brought back a boy – the duke’s heir and a genius wizard -intent on brainwashing and blackening him.\nThe contents of brainwashing are two things:\n\nObey our family.\nAnd fall in love with Serina.\n\nThanks to that, the brainwashed twisted yandere is obsessed with me… I can’t do this. I have to undo the twisted character’s brainwashing! By the way, what’s this situation?\n“Now that the brainwashing is gone, I’ll do as I please. So Serina, please, let’s do our best.”\nI’ve solved his brainwashing… but why does he seem even crazier than before— Did I make a mistake?"},{"name":" Fading Lights","avatar":"https://mangadex.org/covers/0bcaec95-cb20-4a71-98f2-982a5a849f41/0a392996-2a35-44a3-bd92-88670cf0c210.png.256.jpg","country":"English","stat":"8.72","status":"Ongoing","tags":["Action,Adventure,User Created,Drama,Web Comic,Supernatural,Mystery"],"nutshell":"The year is 2017. After the passing of Joseph Joestar, Josuke inherits the role of CEO at Joestar Enterprises, in NYC, where he resides with his adopted sister Shizuka Joestar. That is, until a mysterious new force threatens not only the Joestar name, but Shizuka's original ancestry as well. She must embark on a trip to take down this new enemy and discover secrets that change how she sees the world completely."},{"name":" KIKI","avatar":"https://mangadex.org/covers/0bce2a64-8f98-4474-a695-16eaf114c472/8ddee987-d222-44b2-89c8-b1e72769327a.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Sci-Fi,Boys' Love,Drama,Fantasy"],"nutshell":"A series of one-shots consisting of boys with horns, priests, etc.\n\n\nPicnic part 2\nDespite everything, Kaname seems to have found a bit of happiness with Kenichirou. But Kaname’s father doesn’t want to let Kaname go and is doing everything he can to keep them apart.\n\n\nIn God’s Hands\nMasato used to be a delinquent that was so naughty he was called the \"Legendary evil.\" However, he has reformed because of his love for Jouji, a priest. But pretty rich boy Kikunosuke has his eyes set on Jouji as well and isn’t about to let Masato have him!\n\n\nDark Gray Heaven, Rainbow-colored Paradise\nKotegawa Hajime has an automata made that is a perfect replica of himself, and plans to have this automata take his place as heir to his father’s company. Unfortunately, just after telling his father’s secretary about his plan, Hajime loses his memories in an accident. Now no one, including Hajime himself, is quite sure which is the real Hajime and which is the automata."},{"name":" Gay Fuuzoku no Mochigi-san - Sexuality Is Life -","avatar":"https://mangadex.org/covers/0bce737d-acea-4917-aadc-aab577dca9bf/02c217da-bff9-44ae-a88c-fa7edcfd2026.jpg.256.jpg","country":"Japanese","stat":"7.01","status":"Ongoing","tags":["Comedy,Philosophical,Slice of Life"],"nutshell":"Comic essays on the gay industry and LGBT issues by Mochigi, who first worked in the industry as a gay prostitute in Shinjuku Ni-chome, Tokyo, and has since worked in gay bars and gay videos.\nWarning: Mature themes and content are sometimes portrayed and discussed.\n Artist’s Twitter"},{"name":" Kuroko no Basuke - First Strike! (Doujinshi)","avatar":"https://mangadex.org/covers/0bce7703-72c6-4e1d-9d6e-61b6eb6bfc5b/d22d9431-8401-4405-b08b-19cf3bd46aab.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love,Sports"],"nutshell":"Kasamatsu is concerned that Kise, Takao Talking can help you?"},{"name":" DevilShot","avatar":"https://mangadex.org/covers/0bcef334-b515-4790-b3b0-16ec7482b798/06a2a18b-4f8e-4775-ad00-903fef4caf87.jpg.256.jpg","country":"Korean","stat":"8.08","status":"Ongoing","tags":["Action,Demons,Long Strip,Drama,Fantasy,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"The moment I looked Death in the eye, I made a contract with the Lord of the Underworld."},{"name":" Public Sex","avatar":"https://mangadex.org/covers/0bd1603c-6161-4836-8030-8206216e7c26/6e626c25-9839-421b-9fc2-1eb6b0055b3f.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Psychological,Boys' Love,Drama,School Life"],"nutshell":"High School was a rough time for Kanao Morimura, as he always struggled to find his domineering father's approval. So one can only imagine when he found the approval of fellow classmate, Sei Mishima, in his freshman year, the two became inseparable.\nNow in college, their relationship starts to move from friends to friends-with-benefits, as they quickly discover their apartment isn't the only thing thats a tight fit.\nWith Kanao's cravings for attention and danger, their activities may be a bit loud for their neighbors.\nTheir neighbor Konno, however, may be a little more interested than annoyed with the couples constant nighttime noises..."},{"name":" Chikita Gugu","avatar":"https://mangadex.org/covers/0bd1bf71-98b4-49a5-9a0c-9be543ccbd86/7b080eb9-3ff3-4c22-9403-b7b4943cb8a2.jpg.256.jpg","country":"Japanese","stat":"8.22","status":"Completed","tags":["Monsters,Ghosts,Romance,Magic,Drama,Fantasy,Supernatural,Mystery"],"nutshell":"After his whole family was eaten as a child, Chikita is the sole survivor of the legendary Gugu clan.\nNow he's a teenager and people are coming to him for help, even though he has no training or ability!\nYet he's not alone. Laa Lam Delal, the yokai who killed his family, is watching over him, waiting for him to ripen…"},{"name":" 1/2 Circled Sun","avatar":"https://mangadex.org/covers/0bd57049-1fc4-4bd3-8841-b4d9bde34ba6/c21351ab-a595-4875-9187-33b44893a4fe.jpg.256.jpg","country":"Indonesian","stat":"7.92","status":"Completed","tags":["Official Colored,Long Strip,Romance,Web Comic,Full Color"],"nutshell":"Arka is a sun to Kayra, shining through the heart and brighten all Kayra school day. But, will that sun smile last long?"},{"name":" Nightingale and the Rose","avatar":"https://mangadex.org/covers/0bd57ae7-6eab-4fdc-a323-2e6c752a217d/6a371e93-f861-4521-89ae-5b02ca3a1190.png.256.jpg","country":"Chinese (Simplified)","stat":"7.80","status":"Ongoing","tags":["Historical,Long Strip,Girls' Love,Isekai,Fantasy,Villainess,Full Color"],"nutshell":"One day, streamer Bai Xinxin is transmigrated into the prince's daughter, Bai Yueguang of the suspense game \"Nightingale and the Rose\". But everyone in this game is hell-bent on killing Bai Yueguang, and Lan Sha—who is controlled by the player—is the only one who can protect her.\nWhilst fighting for her life against enemies known and unknown, in her struggle to survive from the jealousy of a bunch of yanderes, from the killing intent emanating from political opponents who object to the marriage alliance... Bai Yueguang tries to find a way to survive with Lan Sha by her side, too.\nHowever, the main character \"Lan Sha\" doesn't seem to be a mere NPC..."},{"name":" Welcome to Sylvia's Garden","avatar":"https://mangadex.org/covers/0bd7972b-adb4-4708-bcb2-4198f95b6074/4bca87fe-8570-4f84-a5f8-51007e7a4eae.jpg.256.jpg","country":"Korean","stat":"8.00","status":"Ongoing","tags":["Reincarnation,Historical,Ghosts,Long Strip,Magical Girls,Adventure,Magic,Isekai,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"The last thing Jiyhun remembers is looking up and then… BAM! She's was reborn into a magical fantasy world as Sylvia—the empire's most powerful gardener. Everything was fine and dandy in her bustling shop until one day, \"Terran\" appears. Now, her days have gotten all the more interesting."},{"name":" Kiss wa 0-ji wo Sugite kara","avatar":"https://mangadex.org/covers/0bde5c7b-4d71-4db8-992e-2be2afe70ca2/3670703e-2270-4018-9856-4b63ba3b7741.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance"],"nutshell":"Arisu saw a handsome man approach the church to her sister wedding but before she could look at him again she was notified her parents died on the way to the wedding. Wanting to not be a burden to her sister she wanted to stay at the home of their parents. Arisu is soon harrassed by debt collectors until the good-looking man who she saw the day of her sisters wedding appeared. His name is Nao, the son of the head of the Ouzono Group, and he suddenly asks for her hand in marriage…?!"},{"name":" Tonari ni Iru no ni, Tooi","avatar":"https://mangadex.org/covers/0be16317-9541-40ef-81ef-ee2c25bede26/a7459e47-f859-4797-a4c1-646aacb29c36.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Romance,Boys' Love,School Life"],"nutshell":"Nagisa's good friend, Igarashi Taiga, is the popular guy at their university. After being compared to Taiga, Nagisa keeps wondering who would in fact make a better lover. He questions Taiga, who demonstrates his skills with a hot kiss… What will come after that?"},{"name":" The Totem Warrior","avatar":"https://mangadex.org/covers/0be1d042-bf44-41a6-b0ad-b35f5f5de54b/818ffb64-8a1b-428e-b2e9-6b25541be033.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.86","status":"Ongoing","tags":["Action,Comedy,Adventure,Fantasy"],"nutshell":"In the primitive world, all the youths were hot-blooded. The Faith of Totem is the direction for one to chase their dreams! Wits and Courage are our instincts for survival. The life in the Warrior Tower was tough but joyous. Shortly in the future, even if everything had already turned to smoke and mist, our friendship will never disappear…."},{"name":" Himitsu to Kanchigai","avatar":"https://mangadex.org/covers/0beaf5e3-27b1-4476-888c-3c4eee220677/12483dbc-017a-435a-8056-5a8c13abd7ce.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Oneshot,Boys' Love"],"nutshell":"Hijikata X Gintoki DJ"},{"name":" Mukougawa no Masaka","avatar":"https://mangadex.org/covers/0befda9e-a31c-4aa2-93a5-51ad8ee28b92/d351fc4a-e72e-4891-b9c4-5a3b112f9ecf.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Fantasy,Mystery"],"nutshell":"Masaka's just a kid working at a recycle shop… But is he really just a kid and is his job really at a recycle shop? Why, he's a demon and a sword."},{"name":" Touhou - Yokubou no Matenrou (Doujinshi)","avatar":"https://mangadex.org/covers/0bf081bd-2c73-4481-b591-7bcd9231661a/18afe99f-97c1-4956-8bb4-9717ca0fa38b.png.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Comedy,Girls' Love,Fantasy"],"nutshell":""},{"name":" Semelparous","avatar":"https://mangadex.org/covers/0bf0c5f6-349f-4d5e-b691-bf2ada5c3be7/4588bca6-2baa-41ff-92ab-740b33492433.png.256.jpg","country":"Japanese","stat":"8.15","status":"Hiatus","tags":["Sci-Fi,Action,Survival,Girls' Love,Military,Aliens,Tragedy"],"nutshell":"To stop the otherworldly \"Kaijuu\" aliens from invading Earth,\nindividuals wielding special powers known as \"Aegis\" are tasked with the protection of the world.\nAratsugu Yorino is one of the aspiring \"Bastioners\" - soldiers who fight the invaders within the wall between the two worlds.\nYorino and her best friend Haruka were always at the top of their class, and vowed to become professional Bastioners together.\nHowever, when a Kaijuu broke through the wall during one of their exercises, Haruka lost her life saving Yorino.\nCornered by the Kaijuu once again, Yorino was rescued by a Bastioner called Kaminoi Youko.\nAfter asking Yorino to give her Aegis energy, Youko defeated the Kaijuu with overwhelming power.\nWith her heart full of determination, Yorino placed first on the Bastioner exam, all for the sake of saving herself from ever feeling loss again."}]