[{"name":" Summoned by Being Involved?! And I Was \"God\"??","avatar":"https://mangadex.org/covers/71fed45e-57a9-406e-8fd9-2225544ed78d/128d86ca-4071-40cf-ba87-e92044d63019.jpg.256.jpg","country":"Japanese","stat":"6.53","status":"Ongoing","tags":["Monsters,Action,Demons,Comedy,Adventure,Magic,Isekai,Fantasy,Adaptation"],"nutshell":"I was summoned to an unknown world to defeat the Demon King, but my level seems to be very low when compared to the others that were summoned with me…\nWait a minute, my occupation is \"God?\""},{"name":" Touhou - Open Lamented Box of Urashima (Doujinshi)","avatar":"https://mangadex.org/covers/7205c273-5a06-4023-8ddf-3fd0908f03cb/fe22df69-2604-42c4-9ac3-e50c29bbb8b4.jpg.256.jpg","country":"Japanese","stat":"7.47","status":"Completed","tags":["Girls' Love"],"nutshell":"Reimu is alone and bored, so what better than an unsolicited visit by a molesting youkai to solve that?"},{"name":" Mikazuki Mao Can't Choose a Gender","avatar":"https://mangadex.org/covers/7209b470-5c0c-4289-8c2b-34400b754734/03957810-45b5-499f-9a76-5cf95d96b8fb.jpg.256.jpg","country":"Japanese","stat":"8.22","status":"Ongoing","tags":["Genderswap,Romance,Comedy,Boys' Love,School Life"],"nutshell":"“I hate men!”\nMao was harshly dumped by her boyfriend. She fell asleep while feeling totally dejected… and turned into a man the next day! Not knowing how to turn back, it was decided that Mao has to live in a dorm as a guy. However, her roommate, Ryuusei, is extremely curt and annoying.\nHow will her life turn out?!"},{"name":" Am I Invincible","avatar":"https://mangadex.org/covers/72129fb3-c572-4d84-a188-6093df5f17b8/0067bd1d-cee4-4340-b126-14618866430b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Historical,Action,Long Strip,Comedy,Martial Arts,Fantasy,Full Color"],"nutshell":"He always thought he was a mortal, but he didn’t know that his yard was full of divine weapons and the chickens he raised were more like phoenixes! It wasn’t until after five years of living in a mortal village when the system finally allowed him to come into contact with cultivators. It was then that he discovered that no matter how strong someone was, the moment they saw him, they would be so scared that their legs gets numb and call him senior. Some even kneeled down and worshipped him…"},{"name":" Yoake wo Matsu Kimi no Tame ni","avatar":"https://mangadex.org/covers/72165c63-997a-4a8b-a740-5bc7cda30022/afc70618-2517-403f-8082-b94ae5590812.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Nao, a 40-year-old man, goes into a gay club with his close buddies and sees a handsome, young man in his twenties, looking bewildered. He approaches the young man, Touma, in order to help ease him into his first time at the club. After a brief conversation, they leave the club and end up having sex together. Nao realizes how compatible they were and was doubting whether he should call Touma for another meet-up again – until Rei, Nao's son, visits him at work, together with another a boy he is friends with in school, which happens to be… Touma."},{"name":" Digilog Renai Seikatsu","avatar":"https://mangadex.org/covers/7225df7b-15d6-4e1d-9a3f-a82323963254/d584514a-85b6-4abd-9f74-885cfd8ccc17.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,Comedy,Slice of Life"],"nutshell":""},{"name":" Dance in the Vampire Bund","avatar":"https://mangadex.org/covers/72265368-9a36-4270-b91d-ced7f1f92b4d/ecf2cf0d-18f5-4196-9617-3f8282669806.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Loli,Action,Romance,Martial Arts,Drama,Horror,Vampires,Supernatural"],"nutshell":"After millennia in hiding, Mina Ţepeş, the princess of the ancient covenant and ruler of all vampires, wants change. Using the vast wealth of the Ţepeş line, she has paid off the entire gross national debt of Japan and in so doing, gained the authority to create a \"special district\" off the coast of Japan that is to become the future haven to vampires the world over!\nNow, on the eve of the landmark press conference announcing the existence of vampires to the world, terrorists and rival factions are plotting to assassinate Mina Ţepeş before she has a chance to make her world-changing announcement."},{"name":" Good Person","avatar":"https://mangadex.org/covers/722a8e72-bc43-4a5c-b5f6-96413bd3a7b4/70dab84b-a211-4cd6-b6cb-e5ae96542d16.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Completed","tags":["Romance,Tragedy"],"nutshell":"A collection of 3 stories…\n\nThe Good Fellow: What would you do if the person you like was snatched away by your best friend purely because of luck? Would you be able to support their relationship? A nice shoujo story told through the eyes of a male character this time.\nByeok-Hwa-Roo\nIgnis"},{"name":" Mahou Shoujo Lyrical Nanoha - Onee-chan to Issho (Doujinshi)","avatar":"https://mangadex.org/covers/722bb776-2592-446a-9f9a-07ee35bd396f/580b364a-6203-49c2-ad6e-206b2efc6679.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Comedy,Girls' Love"],"nutshell":"A 18 pages long doujin from 2009 about young Nanoha and Fate living in a world where Fate has Alicia as her older sister. This is a cute NanoFate comedy and romance with a jealous Fate and a time skip to Nanoha and Fate's days as teenagers."},{"name":" Baby Maybe","avatar":"https://mangadex.org/covers/722c4fd2-3824-4301-b945-dba1a42b19fc/153b5a7f-dcd1-4820-af65-a33ab4c9d6eb.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"\"Oh God… I want to be happily in love…!\"\nShiba-chan, who was dumped by someone he really liked, is invited to a matchmaking party by a friend. There he sees a boy he likes! But this Yushima-kun is not just a bit weird, he's also a jerk!?\nShiba-chan feels as if this will be a love that will leave him empty-handed again, but…\nA cute love story. Includes chat from after the publication as a gag manga.\nNote: In 'Nikutai Kankei', the third story 'Anti-Dramatic', is a sequel to this story."},{"name":" Urban Harem Path","avatar":"https://mangadex.org/covers/7234e8bb-ae4a-448a-9db3-6f908f383d8b/ed12d5a2-040d-4946-866f-00603e58d047.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Reincarnation,Action,Long Strip,Martial Arts,Harem,Wuxia,Web Comic"],"nutshell":"The strongest ancestor in history re-cultivate in the city, captured beautiful women, and fought against the younger generation."},{"name":" Beelzebub - Digital Colored Comics","avatar":"https://mangadex.org/covers/72378871-9afc-47bd-902f-0d8116adb390/c8b9b385-b7b9-4101-bf71-4f0d66fc35ff.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Cancelled","tags":["Official Colored,Action,Comedy,Martial Arts,School Life,Fantasy,Supernatural,Full Color"],"nutshell":"Ishiyama High is a school populated entirely by delinquents, where nonstop violence and lawlessness are the norm. However, there is one universally acknowledged rule—don't cross first year student Tatsumi Oga, Ishiyama's most vicious fighter.\nOne day, Oga is by a riverbed when he encounters a man floating down the river. After being retrieved by Oga, the man splits down the middle to reveal a baby, which crawls onto Oga's back and immediately forms an attachment to him. Though he doesn't know it yet, this baby is named Kaiser de Emperana Beelzebub IV, or \"Baby Beel\" for short—the son of the Demon Lord!\nAs if finding the future Lord of the Underworld isn't enough, Oga is also confronted by Hildegard, Beel's demon maid who insists he take responsibility as Beel's guardian. Together they attempt to raise Baby Beel—although surrounded by juvenile delinquents and demonic powers, the two of them may be in for more of a challenge than they can imagine."},{"name":" Mahou Shoujo Lyrical Nanoha - Chocolate and Triangle (Doujinshi)","avatar":"https://mangadex.org/covers/7239fcf8-82fa-4fec-b3f8-c77219b64852/f797df6c-e822-47da-a0aa-a2f4df112abb.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,Girls' Love"],"nutshell":"A short comedy doujin in 4-koma format, with strips about Nanoha and Fate during Valentine's day, and the very inappropriate gift of the later one."},{"name":" Cream Caramel","avatar":"https://mangadex.org/covers/723bfec9-9112-4fe4-b8dd-0ea31ca161bb/638726b1-ec6f-4f8e-afc5-29d79140674d.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,Anthology,School Life"],"nutshell":"Cream Caramel\nBecause her parents are transferred away due to their jobs, Mikoto, a grade 11 student, starts living alone on 100,000 yen per month. But the place she lives at is a horribly old apartment… And the one living in the room next to hers is a super cool boy…?!\nWhite Summer\nMana and Shou have to go their separate ways after graduation, will they be able to stay together when they're hours apart?\nThere Are Days Like That, Too\nSonomi has been in love with Ikuta-san since she was in the seventh grade, four years before this story takes place. Ikuta-san suddenly starts working at her uncle's cafe, and it seems like Sonomi might have a chance to be his little sister, since he's been going out with another girl for those same four years that she's loved him."},{"name":" Switch","avatar":"https://mangadex.org/covers/723dd88a-7e94-4180-bef0-6520e735d24e/bfd5fc6b-0516-498d-bef1-1a8dc4f8b6aa.png.256.jpg","country":"Korean","stat":"7.99","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Boys' Love,Drama,Web Comic,Music,Full Color"],"nutshell":"A web novel of the same name! Hanyul, the leader of idol group COS1. Inconspicuous and quiet, in fact, he has long time crush on the popular member of the team, Kwon Woo. Then one day, Kwon-woo wants to leave the group and proposes a deal to Hanyul, who came to stop him with one condition after discovering that Hanyul masturbated to him."},{"name":" Feels Like a Dream","avatar":"https://mangadex.org/covers/723e59e0-54fe-4f6a-86c3-1323a1d740ee/841b71d1-33e8-4932-8b4f-d3c973bd75c3.jpg.256.jpg","country":"Korean","stat":"8.05","status":"Ongoing","tags":["Thriller,Historical,Long Strip,Romance,Comedy,Adventure,Magic,Drama,School Life,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"A one-time dream connecting reagent was made with the intention to meet Daniel, the prince that she has an unrequited love for, even in a dream. However, it was her rival, Kaiden that took the reagent, and it wasn't a one-time thing?\nLizen, who has perfect grades and physical skills, is bright and strong on the outside, but hides her wounds on the inside. Kaiden, a man who is blunt and cold, but more warm-hearted than anyone else. Lizen is connected to Kaiden through dreams every day, and not only gets caught in a huge conspiracy surrounding the throne, but also gets confused with her emotions....\nAn oddly continous meetings in their dreams. Is it because it's just a dream, so it's easy to pass off as a joke, or has it become sincere feelings because of the dream.\n\"There's no point in 'if.' I already have feelings for you. I like you now even if I don't dream about you.\"\n\n\nOfficial Simplified Chinese Translation"},{"name":" Tame","avatar":"https://mangadex.org/covers/723f9b3f-63ba-4531-a731-803ce79e60af/06f08b9c-e3c3-4f9d-a8d9-1823f9c5d49d.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.08","status":"Ongoing","tags":["Long Strip,Boys' Love,Web Comic,Full Color"],"nutshell":"Historia paralela de((Ring)) la historia de dos ángeles"},{"name":" Misaki-kun no Bukiyou na Dekinai","avatar":"https://mangadex.org/covers/7242acf0-248f-4dfd-85cb-0910f9abbba4/b141abf3-80bb-4fa4-bf8f-91fb67e1000e.jpg.256.jpg","country":"Japanese","stat":"8.29","status":"Ongoing","tags":["Romance,Slice of Life"],"nutshell":"A love story that depicts the cohabitation life of Kyouka (27), a beautiful and tight-fitting office lady, and her boyfriend, Misaki (20), who is a handsome college student. At the company, Kyouka does her job with a machine-like expression, but in front of the cape, she always has a spoiled personality. Misaki always has an unfriendly attitude toward her. Kyouka becomes suspicious of his affair because he has never been told that he likes it even after dating."},{"name":" Koguresou Monogatari","avatar":"https://mangadex.org/covers/72440b93-1e1a-49e2-8c14-627ac148ca36/ee33f796-39ac-4040-a894-feb630f94825.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"Kogure-sou is a crumbling old apartment building of just six rooms where four people live. On the first floor are the owner, a very old man who wants to have sex before he dies, and a girl in university who pines in a sad and complicated love. On the second floor are a salary man who finds meaning to his life in spying on the university girl below him, and Mayu whose boyfriend disappeared three years ago. Also involved are the florist from the nearby shop who worries over her husband's infidelity and Mine who is still troubled by a crime committed a long time ago. What all of them strive for is love, but they all find nothing but pain and bitter disappointments. Do they realize that what heals them is actually the run-down little apartment building and the real human warmth that they share with each other?"},{"name":" Kazuki-san no Koi suru Jikan","avatar":"https://mangadex.org/covers/724998ca-77ab-41ed-a855-fe6a19e562af/17efdbc2-e4e2-431b-82d6-4ecee17d9958.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Romance,Comedy,Slice of Life"],"nutshell":"Kotoko is a high school girl who is stubborn, cool and active, but has no experience in romance. Kiyo Kazuki is an adult man with good looks and a soft demeanor. The first love story spun by two beginners!"},{"name":" GIRLS und PANZER - Hajimete no Senshado","avatar":"https://mangadex.org/covers/7249c7c3-9896-4e6d-ad7a-429b4cb81d42/6417cf44-6e81-4244-a87b-a5bf0083cc0e.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Action,Comedy,School Life"],"nutshell":"A collaboration between the Girls und Panzer production team and World of Tanks Asia. Ooarai Girls Academy's Anglerfish team is here to introduce us to the hit tank warfare/senshado simulation game, World of Tanks!\nNOTE: This manga is read from left-to-right, not the usual right-to-left!\nPart of the series GIRLS und PANZER."},{"name":" Three Meals a Day: Lisa's Cooking - Extra Edition","avatar":"https://mangadex.org/covers/724cb698-5f70-4e72-9391-6966ce995807/460fd260-871b-4502-bc6a-2712a5f516c8.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Girls' Love,Slice of Life"],"nutshell":"Chuchu visits Yukina's house to show a video of her band, RAS, but she ends up waiting for a long time. A comfy domestic fluff featuring Yukina and Lisa, with a side of Chuchu."},{"name":" Kingyozaka Noboru","avatar":"https://mangadex.org/covers/7251bcf7-f4e7-433f-8d81-4e16063629b8/dbcbbc82-4257-4d1e-903d-f98f2b974723.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,School Life,Slice of Life,Supernatural"],"nutshell":"The plot takes place in a small town made up of many hills and slopes where Nishiki, a high-school girl,\nhas taken on the title of a Sukuiya trying to do her best to help grade-schooler Akai."},{"name":" Boku to Neko to Hatsukoi Kousa","avatar":"https://mangadex.org/covers/725bf5e3-6b86-4765-a78b-952ebe4c4d69/23c7c947-5c67-4201-aeeb-cf1436751a32.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Boys' Love,Drama,School Life,Slice of Life"],"nutshell":"Kirishima \"Maa-chan\" Masao and Kurokawa \"Tai-chan\" Taisuke have been friends since they were little, both looking out for each other – but when Maa-chan catches his friend being assaulted by a teacher, he can't help but blame himself for always thinking and never acting on his desire to protect his friend."},{"name":" Our Class Idol","avatar":"https://mangadex.org/covers/7266dd12-62c5-48f9-adb6-36850b6f5e24/c2cfd261-6e8c-4c2b-bf2e-069b36d23a2d.jpg.256.jpg","country":"Korean","stat":"7.92","status":"Completed","tags":["Long Strip,Drama,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"THE BOYZ Kpop group official webtoon."},{"name":" Touhou - Sarasouju no Shuujaku (Doujinshi)","avatar":"https://mangadex.org/covers/726d9c1d-3c40-4a1e-b897-8e1e7d4cb042/20559777-996b-4959-8c9a-079493e7b004.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Oneshot,Comedy,Girls' Love"],"nutshell":""},{"name":" A Nyakuza Manga","avatar":"https://mangadex.org/covers/726df179-7bb9-48c1-9410-08f9ebf68e40/d0fa382d-1e23-4359-9433-aa4cf858e77c.png.256.jpg","country":"Japanese","stat":"8.20","status":"Completed","tags":["Oneshot,Animals,Comedy,Mafia,Fantasy,Web Comic"],"nutshell":""},{"name":" Skeeter Rabbit!!","avatar":"https://mangadex.org/covers/7278cb4f-89c2-4e99-b268-6eeadf67f1e9/7be52bba-8626-4499-8501-b7173f439487.jpg.256.jpg","country":"Japanese","stat":"6.77","status":"Completed","tags":["Loli,Comedy,Girls' Love,Drama,School Life,Slice of Life,Music"],"nutshell":"Usa Ayano is a middle-school girl who is kinda-sorta bad at physical activities. One day at gym class, she sees another girl in her grade, Hoshihara Chika, a transfer student who muddles through the dancing lesson like she couldn't care less.\nAyano, intrigued by how mysterious Chika is, tries to approach the new girl, but gets pushed away. That is until she later discovers Chika's secret…\nUran of the \"Mujaki no Rakuen\" fame brings you a story bringing together youth, JCs and dancing!\n\nAuthor's Twitter: @ura_kan (potentially NSFW)\nAuthor's official website: Blog (potentially NSFW)"},{"name":" Gakuen Tengoku - Sore wa Koi Desu Koizumi-kun","avatar":"https://mangadex.org/covers/727babc7-1b48-4aa0-b843-857d3efff645/9343b280-debb-4c84-a1cb-d14fa3e0a35b.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Boys' Love,School Life"],"nutshell":"1: High School Lullaby\nThe popular boy in class and a boy who plays the devil's advocate (has a girlfriend).\n2: Shoujo C\nI'm nothing special, but Koizumi-kun is a very special guy whose looks and personality are seriously those of an angel. He's our idol. This popular pair was introduced in \"High School ☆ Lullaby\" (Gesu BL).\n3: Requirements For Being Trash\nA first-love killer and a pure-hearted boy.\n4: Taisoufuku o Nugasanaide\nA boy wearing the facade of a pristine angel, Koizumi-kun, the class's disliked Kashihara-kun, and their changed relationship since the day they had sex.\n5: Lonesome Neon Tetra\nKashiwabara-kun's identity begins to crumble from (ill-natured) Koizumi-kun's sexual harassment. But will he notice? There's something deeper here at play…\n7: Long Vacation\nA story about two best friends, one straight and one gay, that gradually develop a very close relationship."},{"name":" Nanatsu no Taizai (Fan Colored)","avatar":"https://mangadex.org/covers/727bda2a-d15f-456b-b34e-4daa43ab653c/e49cbb61-4bc1-4463-a7a8-2f8ec8bea2ca.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Action,Romance,Comedy,Fan Colored,Adventure,Drama,Fantasy"],"nutshell":"The \"Seven Deadly Sins,\" a group of evil knights who conspired to overthrow the kingdom of Britannia, were said to have been eradicated by the Holy Knights, although some claim that they still live. Ten years later, the Holy Knights have staged a Coup d'état and captured the king, becoming the new, tyrannical rulers of the kingdom. Elizabeth, the king's third daughter, sets out on a journey to find the \"Seven Deadly Sins,\" and to enlist their help in taking back the kingdom."},{"name":" Gyaru who wants the boy she likes to apply oil for her but is too embarrassed to ask directly","avatar":"https://mangadex.org/covers/727ce177-6e01-42ae-b609-460ee9afa110/db10fa3c-15e0-4755-ade0-90cef436b2b5.jpg.256.jpg","country":"Japanese","stat":"7.33","status":"Completed","tags":["Oneshot,Romance,Comedy,Web Comic,Slice of Life,Full Color,Gyaru"],"nutshell":"Tsundere gyaru at the beach with her crush, doing tsundere gyaru things."},{"name":" Tsundere Yakuza to Chippai-chan","avatar":"https://mangadex.org/covers/727eaf72-bee5-4aea-8a0b-5e442c75ad65/72cea185-3a4b-43e1-a26a-8a19c01cc920.png.256.jpg","country":"Japanese","stat":"8.12","status":"Ongoing","tags":["Romance,Mafia,Drama"],"nutshell":"[Macaron Scans]\nMichi has lived with the belief that \"If you want to be loved, start by believing.” Due to her honest and nice personality, she agreed to be the guarantor of her boss when he loaned money. Unfortunately, her boss ran away and now she has to pay instead of him. At that time, a guy helped her shoulder the debt, but in exchange for him paying, she has to be his pet."}]