[{"name":" Eros/Psyche","avatar":"https://mangadex.org/covers/0c6b00b0-e735-4a2e-9f83-ae353a0c252f/28f9d759-9334-4bd1-900f-57ba09be181e.png.256.jpg","country":"English","stat":"7.69","status":"Completed","tags":["Girls' Love,Horror,Mystery,Full Color"],"nutshell":"From the artist of the bestselling Faithless series...comes Eros/Psyche. The Rose female boarding school is paradise for young girls...but only if you follow the rules. Because, if you disobey them, you can end up expelled, or even worse, dead. Sara and Silje are two students learning the rules of the school, which includes classes by day...and the casting of curses and spells by night. A love develops between the two, which is tender, but threatens to break under the weight of the dark secret society within The Rose. Acclaimed creator Maria Llovet (Faithless, Heartbeat, Loud) brings you a surreal, bewitching tale of love, magic, and tragedy in Eros/Psyche."},{"name":" Date A Origami","avatar":"https://mangadex.org/covers/0c6dcdd4-04f1-47de-b93d-43d1f05abba2/0a64a52d-576e-41bc-8aae-70e313cfd89f.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Comedy,4-Koma,School Life"],"nutshell":"4-koma spin-off from the Date A Live series.\nWarning: Will contain spoilers."},{"name":" Seishun Trickers","avatar":"https://mangadex.org/covers/0c7020e7-923c-40ef-9de0-a90b3faec14a/859229c2-c0ad-445e-a609-848eaf7ef809.jpg.256.jpg","country":"Japanese","stat":"7.72","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"Seto Atsushi, the student council president, is tired of spending his days in the student council where there’s nothing but boys, and decides to recruit new members, but on one condition: they must be girls! Then Ozawa Kanae, a former delinquent, shows up in the screening for the secretary position carrying a bamboo sword…?! This is a collection of five related oneshots with a specially drawn short extra, \"Classified!! Student Council Report!!\"\n[PL] Seto Atsuhi, przewodniczący samorządu szkolnego, jest zmęczony życiem z samymi facetami w samorządzie. Postanawia, że zrekrutuje nowych członków, lecz muszą być to dziewczyny! Wtedy Ozawa Kanae pojawia się z… mieczem bambusowym?!"},{"name":" The Three Kingdoms","avatar":"https://mangadex.org/covers/0c7032d0-6c23-49ef-97c1-3d069a09f7b0/9e4ed754-6d1b-464a-8b4e-db1dd5b33f3b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Action,Long Strip,Romance,Girls' Love,Fantasy,Web Comic,Full Color"],"nutshell":"A special school that cultivates \"kings\" and a jade seal with the power to dominate the world. In order to seize the throne of \"kings\", what kind of tricks will the heroes of the Three Kingdoms Academy do?"},{"name":" I Parted Countlessly From My Beloved Over a Millennium, Now I Shall Become the Wicked Lady","avatar":"https://mangadex.org/covers/0c70814d-4089-4830-b36a-7b2e2dcdb735/1a05916a-57bc-40d5-b816-7472d684ced7.png.256.jpg","country":"Japanese","stat":"7.94","status":"Ongoing","tags":["Reincarnation,Historical,Romance,Fantasy,Villainess,Adaptation"],"nutshell":"From Gourmet Scans:\n\"Swear... that you will never fall in love with me, no matter what.\"\nA thousand years ago, a sad fate separated this pair of lovers.\nNo matter how many times they reincarnated and reconnected, it always ended with his tragic death...\nAnd once again they are reincarnated, as a count’s daughter, Amelia, and a marquis’s son, William.\n\"I absolutely will not let him die this time!\"\nHaving decided this, Amelia swore that she 'won't love him anymore', and put on an act of being a wicked lady.\nHowever, puzzlingly, he is the one trying to get close to Amelia this time, and even sends her a marriage proposal...?!\n\n\nAuthor's Twitter\nArtist's Twitter"},{"name":" Coyote Ragtime Show","avatar":"https://mangadex.org/covers/0c748158-95ca-4ecb-ae38-56071342e8aa/12cd8976-6a6b-46ba-a3eb-183a39a0b805.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Comedy,Adventure,Drama,Adaptation"],"nutshell":"In 7 days planet Graceland is about to be destroyed. The planet, locked in a vicious civil war, has been threatened with termination by the Milky Way Federation.\nBut hidden somewhere on the planet is an immense fortune placed there by the deceased Pirate King Bruce. Bruce bequeathed the fortune to his young daughter Franka, but she’s not the only one looking for the treasure.\nNow a race is on. Bruce’s daughter Franka along with the space pirate Mister and his band of coyotes must battle against the 12 SISTERs led by Madame Marciano. With only 7 days left it’s going to be one explosive treasure hunt."},{"name":" I Ship My Rival x Me","avatar":"https://mangadex.org/covers/0c791a2a-087d-47d0-b891-81dc099c5f23/e1780f89-dde0-4e0d-9e07-f30308d2a353.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.36","status":"Ongoing","tags":["Long Strip,Comedy,Boys' Love,Web Comic,Adaptation,Full Color"],"nutshell":"My rival, Gu Yiliang, a B-lister rookie, has the face of an idol and can act well, while I, Wei Yanzi, a C-lister rookie, has the face of an idol but with mediocre acting skills. One day, I accidentally discovered a magical world, where no matter we sit, stand, move, or stay, our love is more precious than gold. The name of this world that is brimming with kindness is none other than Niangzi!"},{"name":" Tenkei no Arimaria","avatar":"https://mangadex.org/covers/0c7b4b57-340d-4b08-8006-40f44e3a052d/90e4213b-8e40-43a0-9d53-0b511d344c65.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":[""],"nutshell":"Japan: the Gambler's Paradise! The rich and beautiful Maria is well-known as a legendary gambler who will take on any challenge, no matter how unreasonable or impossible! But what happens when she meets a lowly slave who solves her riddle..? Twist after twist! So tense you'll forget to breathe! This five part gambling story will leave you aching for more!"},{"name":" Shingeki no Kyojin - Hey Corporal, Don’t Think You’ve Won (Doujinshi)","avatar":"https://mangadex.org/covers/0c7cdcfd-69db-4b16-8a85-5a8bd7b02dce/509130d3-89a9-4336-8429-b41f63bf202e.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Comedy"],"nutshell":""},{"name":" Yuri!!! on Ice: memories (Doujinshi)","avatar":"https://mangadex.org/covers/0c7e56b2-49da-41e8-b692-1176462c8a4c/b8bb6cef-1bc8-41ef-87d5-826e905dae68.png.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Pairing: Yuuri Katsuki x Victor Nikiforov"},{"name":" Robotics;Notes - Side Junna: Chiisana Natsu no Monogatari","avatar":"https://mangadex.org/covers/0c8337de-d3a0-4a37-9a7c-6271adde707a/bd015fcf-99bf-44e9-9a5e-2710997cff60.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":[""],"nutshell":"Part of Robotic;Notes series."},{"name":" Kocchi Muite, Ai","avatar":"https://mangadex.org/covers/0c8779ad-e0fd-4fa2-88b5-e8f546458dba/825a5b83-eecc-4e8b-b441-43f378bab2cf.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"Includes:\n1-4) Kocchi Muite, Ai (Look This Way, Love)\nSuzuhara lives in a cheap apartment which has way to thin walls; whenever his neighbor Nishino brings home girls for the night, Suzuhara can hear all of it! At first it only annoys Suzuhara but when his long time crush, Nakayama, asks to borrow Suzuhara's a apartment so he can have sex with his new girlfriend, everything changes.\n\nHi Manyuaru Ren Ai:\nFrom Fundash Yaoi\nAkio suffers because of the harsh words that the man that left him used ‘If you only were a woman, it would be a lot better.’ Asking himself ‘Why did you say something like that?’ He runs into a friend in a bar, who also was left by his partner. They’re both uke, but they try to do it anyway. Could it be that one of them has an interior seme? What will happen?\n\n5.5) Zeitaku na Hi"},{"name":" Suzune to Hidarite","avatar":"https://mangadex.org/covers/0c89c499-2c03-440f-8202-65fef7dea53b/b1aa3d93-0b7e-4178-9735-5c7464494160.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Hiatus","tags":["Comedy,Slice of Life,Supernatural,Mystery"],"nutshell":"Suzune likes to pick up strange things. One of them includes a living, disembodied hand she calls onii-chan."},{"name":" Ame Nochi Balloon","avatar":"https://mangadex.org/covers/0c912e1a-3dad-41a7-a401-517840c6b669/cd7bf11c-d0c7-495b-9155-675b7a85cfe2.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Completed","tags":["Oneshot,Romance,Drama,School Life"],"nutshell":"Miko believes that flying red balloons can help grant your wishes… I wish that I could meet him just one more time."},{"name":" Fake Rebellion","avatar":"https://mangadex.org/covers/0c936660-cb06-491b-8b61-15dacad1bfb4/9982d7ae-25f6-4267-9fc1-6552c5e719c7.png.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Action,Adventure,Tragedy"],"nutshell":"The Human Empire fell to ruin, leaving behind a dystopia controlled by the current Machinery Empire. In this wasteland where human life is deemed worthless, a wandering boy meets a princess in hiding. When tragedy occurs, the fallen rise, and a journey begins. Thus begins the story of two children and their fight to restore hope for humanity."},{"name":" Yuku Yuku","avatar":"https://mangadex.org/covers/0c96dec6-6acd-4956-81de-a1750e78bc13/66ddbfb8-d98b-4882-b98f-1f0e221510eb.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"Coming in an omnibus form, it's a side story of Toribako House! The words you longed for, the many things you held dear, everything and everyone, right here!! A girl who has no luck with guys, a weak-spirited otaku boy, a natural lady-killer, a middle-aged couple, a distant relationship – everyone keeps looking for happiness!?"},{"name":" Haikyuu!! - Mellow Mellow (Doujinshi)","avatar":"https://mangadex.org/covers/0c9946ea-a560-4646-b636-88f623c10c10/d52634b2-cf93-4428-a3a6-65e611e702e5.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Boys' Love"],"nutshell":"Yamaguchi Tadashi x Tsukishima Kei"},{"name":" Kemonaa Yuusha wo Otoshitai!","avatar":"https://mangadex.org/covers/0c9a31ff-ab1e-4e2a-b9c8-2bb7b2e501cf/63f1167e-577e-4dd4-bace-fa0f2725fc05.jpg.256.jpg","country":"Japanese","stat":"7.44","status":"Completed","tags":["Loli,Monsters,Romance,Comedy,Adventure,Magic,Fantasy,Monster Girls"],"nutshell":"This fetish is… deep!\nA romantic comedy featuring a hero with an unusual fetish, and his monster girl companions!!\nMisa's childhood friend and inspiration, is a hero, and a massive furry! Misa, a young magician, does her best to try match her hero friend's fetish. Along with a sphinx, kobold and a succubus! Whilst adventuring with many different monster girls, will Misa deepen her understanding of furries!?\nHowever she will face many challenges, such as entering a room that cannot be escaped without getting freaky, or facing off against ultimate supreme monster girls…\nWill she be able to seduce the hero that inspires her!?"},{"name":" Otome Danshi ni Koisuru Otome","avatar":"https://mangadex.org/covers/0c9ec14d-c51f-49aa-b343-2e016c957f83/5897e3af-9700-4ad8-b8b5-e77fb5da8355.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,Crossdressing,4-Koma"],"nutshell":"Minakuchi Mayu, a girl who hates men, fell in love at first sight with a… crossdressing boy?!\nDoes she like \"girls?\" Or does she like \"boys?\"\nFind out in this heart-throbbing pure love comedy!"},{"name":" All Right!","avatar":"https://mangadex.org/covers/0c9f18d0-6d56-4d18-ac6d-7a74907489dc/8e21d66f-5120-4724-bc9a-62969e0872eb.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sports,School Life"],"nutshell":"A high school student, Yohan Morisaki, cuts down the appearance of sweating as “wasted”. One day when I picked up the key chain at the station, I was invited by \"Karibirou\" to \"defeat the monsters\". A high school baseball team that presents new values to the baseball world is here!"},{"name":" Comic M Hayakawa Publishing 70th Anniversary Comic Anthology [Mystery] Edition","avatar":"https://mangadex.org/covers/0ca3d7eb-e6c8-4afb-b2ae-c73d4f5a517b/cdd96c3b-5007-49ef-864d-49f9a9e17f5c.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,Anthology,Drama,Fantasy,Mystery"],"nutshell":"Publisher Hayakawa is celebrating its 70th anniversary with two manga anthology reprints. One collection is dedicated to mystery works while the other compiles sci-fi stories printed over the publisher's long career.\n\n\"Mugen Shinshi (Shutchou-hen) Zashiki Oni\" by Yosuke Takahashi (p. April 2011 issue Mystery Magazine)\n\"Kao\" by Yosuke Takahashi (p. April 2011 issue Mystery Magazine)\n\"Holmes-kun no Himitsu\" by Meiko Komichi (p. September 1987 issue Mystery Magazine)\n\"Holmes Kimi no Tsuitachi\" by Mizumaru Anzai (p. September 1987 issue Mystery Magazine)\n\"Soiukimiha\" by Taku Furukawa (p. September 1987 issue Mystery Magazine)\n\"Holmes Kimi no Iraijin o Sagase!\" by Eiji Yokoyama (p. February 1995 issue Mystery Magazine)\n\"Karera\" by Jun Ishikawa (p. July 1994 issue Mystery Magazine)\n\"Kowarete Iru ka\"\" by Yoshihisa Tagami (p. August 2001 issue Mystery Magazine)\n\"Yuurei Shitsuji Bangai-hen Soshite Dare mo Inakunattari Shinai\" by Yasuko Sakata\n\"Soshite Minna Iru\" by Izumi Okaya\n\"Ai no Machikado\" by Tsuyako Haraniku (p. July 2007 issue Mystery Magazine)\n\"Soshite Dare ka Inaku natta\" by Shinji Ohara\n\"Inu wa Kanjou Shikiremasen\" by Chuuya Chikazawa\n\"Tinker Tailor Soldier Spy\" by Keita Yatera\n\"Koko Chiyoi Basho\" by Asami Shimoda\n\"Seinaru Shinnyuu\" by Masakazu Ishiguro\n\"Mahou Shoujo Time-chan Sono 2 Jiryuuya no Kai Jiken\" by Akihito Yoshitomi\n\"To, Aru Hi no Watashi to Takeru\" by Natsujikei Miyazaki\n\"Mugen Shinshi (Eigyou-hen) Come Mad and Go–Saa Ki Chigai ni Narinasai\" by Yosuke Takahashi"},{"name":" My Student Won't Go Back Home (One Punch Man - Doujinshi)","avatar":"https://mangadex.org/covers/0cad2d89-a02d-455f-a027-74f52f81eb7f/5121c067-a5c2-4cee-ab50-b1f7dfce0e1b.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Action,Romance,Comedy,Superhero,Martial Arts,Drama,Slice of Life,Cooking"],"nutshell":"One Punch Man AU, where everything is the same except Saitama's cyborg disciple Genos is female!"},{"name":" 9 Banme no Musashi - Mission Blue","avatar":"https://mangadex.org/covers/0cb1a60b-0bc2-42fc-8ba3-74b6358a27fc/f05d7add-b544-4684-b6d1-67459bc93e15.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Action,Romance,Adventure,Crossdressing,Drama,Slice of Life"],"nutshell":"UB (Unlimted Blue), a legendary organization amongst the world of intelligence agencies. They do no belong to any country nor individual groups. Whether its the number of members or their whereabouts, all information about them is unknown. A secret organization known as the \"other United Nation\", sworn to protect this blue planet from chaos that threatens to destroy its peace.\nThe story unfolds around one of the top nine agents in UB, operative number 9, Code name: Musashi, and a young man named Shingo."},{"name":" Ib - Garry Took Me to an Amusement Park (Doujinshi)","avatar":"https://mangadex.org/covers/0cba2937-e5a7-4b4a-b1db-7f3c3e5a8703/7e8b6776-be50-4564-8353-54ff6aec1506.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Romance,Comedy"],"nutshell":"A story about Ib, Garry and Mary visiting the amusement park.\nBased on \"Ib\" a really popular survival horror game made with RPG Maker."},{"name":" Brittany Hanayome Ibun","avatar":"https://mangadex.org/covers/0cbce2fa-999c-4c60-b55e-94d4fcfd54a4/bcbe5a70-eaaa-4205-99c2-81bec2125a8a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Historical,Adventure"],"nutshell":""},{"name":" Legend of the Stars - Agartha","avatar":"https://mangadex.org/covers/0cc2744a-9e67-4cb5-94ff-ee5b5d3689d1/7024a6cc-1f26-4411-9535-77942a6403fd.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Sci-Fi,Romance,Adventure,Drama,Horror,Aliens,Mystery"],"nutshell":"Remi Tachibana is a girl who loves mysterious things such as UFOs. One day, she meets Shun Kuroki, a boy who wants to be her assistant, when she is talking with Mr. Ishimori, a SF mangaka; the two SF lovers soon become friends, but then strange things start happening around Remi. Shun, who doesn't talk much about himself, also has an important secret....... A SF Romance that ponders the mysterious ruins and phenomena that remain deep in the mountains of Akita!"},{"name":" Fish","avatar":"https://mangadex.org/covers/0cc2aa24-5a33-4cfc-b277-9443ad2bc3f0/3707fd90-a723-4c7b-9956-a8bb46987104.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Psychological,Drama,Supernatural,Tragedy"],"nutshell":"The sequel to Pet, focusing on the future lives of the story's \"pets,\" in particular Hiroki, Tsukasa and Satoru."},{"name":" Darling in the FranXX - Tanpenshuu (Doujinshi)","avatar":"https://mangadex.org/covers/0cc5a990-cc63-464a-9d68-46d3e71040eb/532fc898-043d-4e98-87b2-646eb34fc3f5.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":[""],"nutshell":""},{"name":" Kimi to Koi ni Ochiru Mahou de","avatar":"https://mangadex.org/covers/0cc9358f-d0f3-42ed-a146-95604b01c7f0/59ad7c3f-f805-4fed-86ca-b3aca39c6bfa.png.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Comedy,Cooking"],"nutshell":"Ousawa Miko is a 16-year-old girl who loves bread. Especially when it's shaped cutely! One day she decides to apply for a job at St. Molly's bread store, but when she gets there, the person who hires her on is a cute boy her age! Although he makes fun of Miko's clumsiness, he seems to be genuinely kind. But when they find out they're neighbors, they grow even closer."},{"name":" Zhe Ge Shen Shou You Dian Meng","avatar":"https://mangadex.org/covers/0cce6b23-0e36-4cc1-9a97-8463bac6e533/74b1fde5-e3e4-4773-931e-c00ee0c3eecc.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Fantasy"],"nutshell":"I was a small and poor girl in my previous life, but in this life, I have become a girl that people love and adore! Meeting with gods one weirder than the other. With the God of the gastronomy of the thin body, with Erlang god who's very talkative in his striking red armor, and the girl Yue Lao who is a pervert. How can I meet a normal god!?"},{"name":" Tramp.","avatar":"https://mangadex.org/covers/0ccf0843-5174-45c4-9487-b99995ebc217/a2f50f91-1e57-42e7-81cf-5a3ca5aabfd7.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Adventure,Drama,Fantasy"],"nutshell":"Alto has always been followed by misfortune and his problems show no sign of coming to an end when he is suddenly kidnapped by pirates. He learns from them that the clover shaped mark on his body proves that he is the descendant of a legendary pirate. Finding the individuals who possess the spade, diamond, club and heart marks is said to lead the way to valuable pirate treasure."},{"name":" Tenshi no 3P! no 3P!!","avatar":"https://mangadex.org/covers/0cd4d75d-f7c0-483d-8b57-6c7370fef113/c267b10a-5e16-47c0-a4fd-b5b7752f7a25.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Loli,Comedy,4-Koma,Slice of Life"],"nutshell":"3 páginas de pura fofura, com 3 fofas lolis!"}]