[{"name":" Michishirube","avatar":"https://mangadex.org/covers/30f47f22-090b-47eb-87aa-bc448a5893ee/60b12ec9-05cd-4a6a-a0b8-96762d9f8ad1.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot,Romance,Drama,Supernatural,Tragedy"],"nutshell":"Wakako has a secret crush for her 2-year-older childhood friend, Chii-nii, but he went away before she had a chance to tell him her feelings. Meeting him again after 3 years, will Wakako finally be able to pluck up her courage and say those 3 simple words?\n[PL] Wakao zakochała się w swoim przyjacielu z dzieciństwa, który jest 2 lata od niej starszy. Niestety Chii-nii odszedł. Czy będzie w stanie jeszcze kiedykolwiek powiedzieć mu, że go kocha?"},{"name":" My Sister Is A Superstar","avatar":"https://mangadex.org/covers/30f53ccb-b77f-4f2a-a0be-2744b56b1821/ced1e424-63f9-491e-811f-b6cd6265c7be.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.01","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Drama,Web Comic,Adaptation,Full Color"],"nutshell":"What? My elder sister, who is lazy, charming, and abusive, is not born of the same parents as me? What? She wants to be a Superstar, but fortunately, I have a system and a cheat. Help remove all obstacles in her way! What? My parents asked me to help solve her single status problem, but I’m still single! Why don’t you guys care for me? ! The system said: I think the two of you are quite suitable, and I will match you guys up. I won’t do it, As a brother, I will protest against it!\n\nLinks:\n\nAlternative Raw (Bilibili)\nAlternative Raw (IQIYI)"},{"name":" S•A","avatar":"https://mangadex.org/covers/30f59ef4-3c30-4c81-b6d6-d835d727282f/758599bd-8c99-48b7-b4ad-ab976ce84579.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Her whole life, Hikari Hanazono has been consumed with the desire to win against her school rival, Kei Takishima–at anything. He always comes out on top no matter what he does, and Hikari is determined to do whatever it takes to beat this guy!\nAt age 6 Hikari lost to Kei in an impromptu wrestling match. Now, at 15, Hikari joins \"Special A,\" a group of the top seven students at a private academy, for the opportunity to trounce the guy who made her suffer her first defeat."},{"name":" Rotting Soulmate","avatar":"https://mangadex.org/covers/31019ee5-79eb-4bd2-a946-af36fd17e46f/a2e3642f-b0ed-4855-8b1f-8194a3256f67.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Completed","tags":["Oneshot,Psychological,Romance,Drama,Medical,Full Color,Tragedy"],"nutshell":"One day, the person that I love caught a deadly disease.\nIt's your choice if you interpret the ending as dream or truth.\n(Yes this is the Teaching Feeling artist)"},{"name":" BanG Dream! - The Rain Brings Us Together (Doujinshi)","avatar":"https://mangadex.org/covers/3103cb5f-3041-4ea7-a323-300fa426abaa/6c5f3200-eda9-490e-bae8-7be72aeaa223.png.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":"An Aya x Chisato doujin."},{"name":" Touhou - Each Shaped Like a Small Golden Bird (Doujinshi)","avatar":"https://mangadex.org/covers/31059b6b-529c-4d40-b701-bdc5abbd9c3b/2818b150-0912-48d7-b546-2e9962c9685f.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":[""],"nutshell":"Part of C73 Yuyuyomu - Touhou Anthology by Pachypodium.<br />A Battle between Youmu and Aya."},{"name":" Ten Miles of Peach Blossoms","avatar":"https://mangadex.org/covers/310acd87-9d84-4658-9bdf-e205cab7480b/e5cf5f59-985a-4673-aa25-ff73f3204d36.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.70","status":"Ongoing","tags":["Reincarnation,Romance,Comedy,Martial Arts,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"Through the course of unlikely coincidences, a man and woman meet again and again in three different lives. What will become of their love in the world of the immortals?\nBased on the novel which plagiarized (almost word for word, yet the author still denies) from a BL novel."},{"name":" Rurouni Kenshin Ibun: Ashitarou Zenka Ari","avatar":"https://mangadex.org/covers/3112799f-b20d-4b83-b7de-b419caae6b38/630b7e68-357a-4095-8675-9ae8d64ac053.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Historical,Action,Comedy,Martial Arts,Drama"],"nutshell":"Young Ashitarou has just been released from prison, serving a sentence from dine-and-dashing. However, it appears he is not completely free of his past, as it is not long after his release he is pursued by a dangerous group of people that seek the \"treasure\" that he possesses. Could there be more to Ashitarou's past and his crimes?\nFollow Ashitarou and his companion, Aran Inoue, as they show you the next stage in the world of Rurouni Kenshin."},{"name":" O Menino Teco-Teco","avatar":"https://mangadex.org/covers/3113c4fb-c63d-4930-9017-4cc0a0c81802/c7585827-331a-4e00-a5e8-64c48f280eaa.jpg.256.jpg","country":"Portuguese (Br)","stat":"7.96","status":"Ongoing","tags":["Action,Psychological,Adventure,Video Games"],"nutshell":"Meco-Teco acorda confuso em um quarto semelhante ao de uma prisão, após sair descobre que está dentro de uma espécie de laboratório voltado por vários mistérios e seres desconhecidos, o que será que lhe aguarda no interior desse lugar?"},{"name":" Ultraman (UMEZU Kazuo)","avatar":"https://mangadex.org/covers/3115a8a6-fbec-4896-af3d-e6495b6bc755/a39389ac-52a5-4a32-a08a-7ddc40f6870b.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Thriller,Sci-Fi,Monsters,Action,Psychological,Comedy,Mecha,Survival,Adventure,Drama,Aliens,Adaptation,Tragedy"],"nutshell":"(from ebookjapan):\nKazuo Umezu's \"Ultraman\" was serialized at the same time as the 1966 TV broadcast!　The fierce battles with popular monsters such as the Baltan and Mefilas aliens are fully recorded along with the color pages from the serialization and the chapter covers!\nKazuo Umezu's very famous manga adaptation of the first Ultraman series."},{"name":" I Raised My Childhood Friend as a Tyrant","avatar":"https://mangadex.org/covers/31164557-2473-4fff-a26f-b9d443c3a905/ec2703b1-3407-4095-9e2d-0ddd080fbd73.jpg.256.jpg","country":"Korean","stat":"7.82","status":"Ongoing","tags":["Reincarnation,Time Travel,Long Strip,Romance,Adventure,Magic,Isekai,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"I was described as the short-lived childhood friend who turned the male lead into a tyrant in the novel. I died on his behalf, as the novel said. I thought I could now return to my original world. …But why am I back to the age of ten? Is there something wrong with the original story? I can’t help it! I thought I would succeed this time and go back to reality… This tyrant dream is too realistic to be true!\n“I don’t care about the throne.”\n“What?”\nWhat is it? Did I say this before my regression?\n“What are you talking about? Becoming emperor…”\nYou should meet the heroine and the original story should go on. That way I can go back!\n“Viche,” Jade was calling me somewhere with a low voice, “I can’t let you go… for whatever reason.”\nThere was a soft smile behind Jade’s bleak eyes. …I think he knows something.\n\nOriginal Webtoon\nOfficial Translations:\n\nEnglish\nChinese (Simplified) / 汉语\nThai / ภาษาไทย"},{"name":" Nanairo Kakumei","avatar":"https://mangadex.org/covers/31216a23-146f-462b-a575-70a617ebc9e3/2c561233-b73b-4335-af0c-e5a14e7c9d90.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Psychological,Drama,School Life"],"nutshell":"Ever since primary school, Nana has never been able to refuse the wishes of her friend, Yuyu, even if they were unpleasant things like matching outfits and hairstyles…She wanted to change herself!\nA story about real friendship and sympathy."},{"name":" Shangxian, lacking a cat?","avatar":"https://mangadex.org/covers/31227b38-e2fc-4cbd-848e-8d06a0d90b98/fbd75d56-581d-4971-95f4-24283138205b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.77","status":"Ongoing","tags":["Historical,Animals,Long Strip,Boys' Love,Fantasy,Web Comic,Full Color"],"nutshell":"Thousands of years ago, Yuxu Shangxian was killed by the demon king to save the cat demon Yingwan and fell into reincarnation. Thousands of years later, Yingwan came to the city in search of Yuxu’s reincarnation, and reconnected with Yuxu, but Yingwan’s life was in danger. Can the two break through the dangers together?"},{"name":" Cross Ange: Rondo of Angels and Dragons","avatar":"https://mangadex.org/covers/31277fc7-9a89-4f53-a379-3f5dd44ddeca/0ddf9937-6e43-4288-bd1a-e2825c76107f.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Monsters,Action,Mecha,Post-Apocalyptic,Girls' Love,Drama,Fantasy"],"nutshell":"All humans in this world can use the power of the light of mana, and those who can't are considered to be subhuman 'Norma.' The world is like a peaceful utopia, and the celebrated princess Angelize leads a happy life. She believes that the only darkness left in the world is the existence of the horrible Norma.\nHowever, in a ceremony on her 16th birthday, the truth is revealed–Princess Angelize is a Norma. Now she is going to learn what her society does to Norma. She is sent to an isolated island full of others like her, who are taught that the only reason they are allowed to live is in order to fight to protect the peace of this world. Now \"Ange\" is part of a squad that pilots Paramails and fights invading extradimensional dragons."},{"name":" Masquerade Lovers","avatar":"https://mangadex.org/covers/3128de7e-75b3-491e-8718-5bd378844e06/d4985fd2-dbec-43c8-83a3-d689d0a04d1a.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"Famous award-winning novelist Asakura is actually an unhealthy adult who rarely steps out of his house. But recently, he's been troubled by the attentions of the hedonistic novelist Segawa, who's infamous for having a new lover every month, age and gender no bar. \"All that will change once you become my lover,\" promises Segawa. Will he be able to melt the cold Asakura's heart?"},{"name":" Ultima: The Quest of the Avatar","avatar":"https://mangadex.org/covers/3129dbc2-f2ef-4e5c-b36d-5e317438584e/03b3568f-4aad-4d1e-adef-1abcaf868d52.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Sci-Fi,Adventure,Fantasy"],"nutshell":"A young paladin, Deane goes on a quest to discover what has become of his older brother, the druid, Shiva, who embarked on the quest of the Avatar some years ago. Along the way he meets a variety of new friends and eventually comes to learn the truth about who he is and what he is fated to become.\nIt is an Ultima-inspired manga which loosely retells the events of Ultima IV."},{"name":" Thirty Years Old","avatar":"https://mangadex.org/covers/312d36a1-6e41-4760-808d-074fec5d2a66/864cb408-298e-4fd4-ae1a-37c21c709277.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.26","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Slice of Life"],"nutshell":"Wei QiuYu, who just entered his 30s, has fine features and a successful career, but he is still single? You may have already guessed the reason…\nIn a forced blind date, the brother who attended in his sister's place turns out to also bat for the same team? This marks the beginning of an ill-fated attraction! The cheerful puppy wolf pursues the difficult general manager. Faced with the pressure of marriage from his parents, will QiuYu be able to drop his facade and come together with his mutual love?"},{"name":" Toutetsu","avatar":"https://mangadex.org/covers/312d3ae6-32aa-4279-8756-5c17f2601c9a/ad193e2b-38d8-41a1-996f-92cdd0f981b4.jpg.256.jpg","country":"Japanese","stat":"7.72","status":"Completed","tags":["Oneshot,Action,Drama,Fantasy"],"nutshell":"Set in a fantasy world based on ancient China, the story is about Fuuren, an armless Defender. Defenders are people who will complete their mission or assignments no matter what. If they accept them, that is. Fuuren has been called to a small town that is about to be taken over by the Ka empire, and they wish to hire him to help their armies defend their little town. However there is a little bit of intrigue within the town itself, and Fuuren accepts a different task altogether…"},{"name":" The Princess and the Ninja","avatar":"https://mangadex.org/covers/31306c1f-51af-49bf-ab04-92e3af325574/7f60c0f3-be36-438a-acac-b64acab2bcc1.png.256.jpg","country":"Japanese","stat":"8.48","status":"Completed","tags":["Oneshot,Ninja,Fantasy"],"nutshell":"Deep, deep in the mountains, there was a village that was skilled at craftsmanship; even the nobility partook in the business of creation. However, their princess is clumsy with her hands. Despite this, she wants to find a way to help the village she loves."},{"name":" Perfect Arrest","avatar":"https://mangadex.org/covers/3133013f-e6be-4a5f-ba65-62c2e85099b2/a261b13a-f657-4aab-b168-774ea40751d5.png.256.jpg","country":"Korean","stat":"8.03","status":"Completed","tags":["Long Strip,Boys' Love,Web Comic,Full Color"],"nutshell":"Alpha Gangseo fell in love with Detective Choi , an Omega at first sight! \"What should I do with this troublemaking Alpha, who's chasing me to death with the desire to have sex with me?\""},{"name":" My Boss Is an Infatuated Monster!? Forceful Sex With No Common Sense","avatar":"https://mangadex.org/covers/31346f56-5f71-4fe6-a913-336f964198fd/c83867b5-4acf-4049-b3c2-f0debc717f8a.png.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance"],"nutshell":"\"You don’t want to be my wife? Even though you’re so wet and are feeling it this much?”Haruka is a 32 years old office lady who is tired from working overtime everyday and has no boyfriend. Turns out, her new boss at work, Susumu, who is extremely arrogant, is the same cheeky boy who went to school with a limousine from her elementary school years! “You’ve become so beautiful. I’ve been looking for you all this time.”He’s as arrogant as always and pisses Haruka off, but they start living together after her house has burnt down. “This apartment was prepared for the two of us. Become my wife.” He suddenly steals her lips and their tongues entangle together… What? No way… Even though I don’t like such forceful sex…! His two long fingers are stirring me inside… No…! I can’t hold it in…!! \""},{"name":" Yotsuba&! - Yanda&! (Doujinshi)","avatar":"https://mangadex.org/covers/313682fc-c512-4a1c-8c66-33ad0121c505/0c436fd4-b2af-4717-bb5e-0e78b2ec6d8c.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Ongoing","tags":["Boys' Love,Slice of Life"],"nutshell":"Yanda x Koiwai"},{"name":" Tsumi to Kuchizuke","avatar":"https://mangadex.org/covers/313eb11a-621a-4f46-9866-590e17bb95fd/5345c613-da1a-4130-bdb3-89fbfe7c28a5.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"1-3) Sins and Kisses\nWhen a gentle young man named Yamato is sent to the lush Fiji islands (in place of his brother, Hikaru) it proves to be the perfect setting for passion as he tumbles into an affair with a world class F1 race-car driver, Kyle, who is his brother (ex-)lover.\n\n\nImpenetrable Lips\nHigurashi (Hikaru) gets kissed by Aaron, a famous lady-killer and F1 racer (same team as Kyle) and then \"kidnapped\" (with Yamato help) to desert island for they \"honeymoon\". Will Hikaru believe in Aaron's love?\n\n\nNude na Egoist\nContinuation of Nude Na Shisen\nNishitaka's birthday is coming and Ritsuya wants to spend them together, but photographers have lots of work.\n\n\nKing's Lesson\nKeita lost his job in modeling agency, but then he's picked up by Tobe Seiichirou (Master) and started lessons to become world class model.\n\n\nSins and Kisses - Extra Story\nKyle and Yamato wearing yukata in caravan."},{"name":" The Inspector's Camouflage","avatar":"https://mangadex.org/covers/3142c0a6-3722-4d19-ab14-a960e6866d0d/668eb481-18b3-4cdc-a08f-eb3e0c6355ca.png.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Completed","tags":["Historical,Long Strip,Romance,Boys' Love,Web Comic,Full Color"],"nutshell":"A disabled inspector finds himself caught in the schemes of a beautiful yet cunning courtesan. Unable to live without the blood of the courtesan, he is forced to take notice of the young beauty. And so begins a love-hate story between two men that's rooted in blood and tragedy"},{"name":" Black Diamond","avatar":"https://mangadex.org/covers/314809c6-589d-452d-a8d7-e4bf768067fd/144c5844-0c12-4ef5-a5f3-1753cf68d386.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"Yuu is a young and handsome executive, a ruthless businessman and a charming party guest ― but at home he’s just a wilful brat. Suffering under the pall of an abusive childhood and a dark family secret, Yuu’s only friend and confidant is his loyal secretary, Asa. Asa is hopelessly smitten with his boss, but no matter the intensity of his devotion, he suppresses it out of obedience. But when Asa’s manipulative university senpai suddenly emerges in the business world, both men must to face up to their pasts and the truth of their relationship."},{"name":" Ojisan to Lyco","avatar":"https://mangadex.org/covers/314a276b-5c06-4c6a-b277-61950a971c8f/44ea165b-1af2-43d1-9133-aca0112ec093.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Animals,Romance,Boys' Love,Drama"],"nutshell":"Yuto works for the International Committee for Migration in a country where therions (animals with human-like features) and humans live in harmony.\nOne day,he is assigned to take care of a young boy rescued from a nearby country that had just ended a war between therions and the humans who were oppressing them.\nWhen he first meets Lyco,Yuto is surprised by how guarded he is,although it's clear the boy is burdened with a painful past…"},{"name":" Honki ni Natta Merryman","avatar":"https://mangadex.org/covers/315ac722-6a0a-4fb6-bb69-f8d137cd615e/54d3cb93-01b1-40a3-8cc1-92d97dd5775e.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Boys' Love,School Life,Slice of Life"],"nutshell":"One evening while hanging out, Oku confesses to his friend and neighbor, Kanbayashi, that he is not attracted to women at all and thinks that he might be gay. One thing leads to another, and the two find themselves between the sheets sharing a night of passion. From that day on, though, the pair act as if nothing at all happened. Kan goes on to date a string of women while Oku begins seeing several different men. Three years on, things come to a head during Christmas break, with secrets laid bare between them. Where will things go from there? Two university students explore love, sexuality and friendship in this gentle coming of age tale."},{"name":" Kurokami no Captured","avatar":"https://mangadex.org/covers/315b6376-5dc2-4270-8999-01755d61fd66/a1726c53-a84f-4e3b-931c-f564b45be51e.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Sci-Fi,Comedy,Adventure,Fantasy"],"nutshell":"Darkhair Captured is an imaginative fantasy story about a young Earthling named Captured and his adventures in a distant universe where he isn't really wanted. When he was really young, he was tormented by the other kids, and when he came across a special ring, he acquired the power of the Spect'master which gave him great power and the ability to change his arm into a weapon. Together with his dad Manji and a willowy gal named Camel whom they met across the way, they hunt for treasure and work toward helping Manji get back to his homeland."},{"name":" Has the Exchange Rate Changed?","avatar":"https://mangadex.org/covers/315cc10f-24e2-4bed-a1ef-9b5da4e161a6/99f9611a-3642-463e-a364-8f1e87d3b44c.png.256.jpg","country":"Korean","stat":"7.79","status":"Ongoing","tags":["Genderswap,Long Strip,Romance,Drama,Full Color"],"nutshell":"“Yool Lee” is a bank clerk with an ordinary life. But she ends up switching bodies with a handsome moneylender…?"},{"name":" Sabita Yoru Demo Koi wa Sasayaku - Azami (Doujinshi)","avatar":"https://mangadex.org/covers/31655e6a-4d5d-4c65-b38d-883181d6a301/a9bfa6d0-ca3e-4901-b7cc-5254d2e00231.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Psychological,Boys' Love,Drama,Tragedy"],"nutshell":"Kan and Yumi just graduated from high school and are living together. Full of enthusiasm, Kan starts working to support his familly…. but there is something seriously strange about his new company?\n\nMulti-work series; Suggested reading order:\n1: Sabita Yoru Demo Koi wa Sasayaku - Main Story\n2: Azami - Prequel to Main Story & Sequels\n3: Renai Rubi no Tadashii Furikata - Sequel #1\n4: Narrow Place Collection - Side story to Sequel #1\n5: Hadakeru Kaibutsu - Sequel #2\n6: Sweet Sweet - Extra Illustrations"},{"name":" Mitsumei","avatar":"https://mangadex.org/covers/31668229-6312-4312-9871-2fe52bc51cb4/dcf75e81-a871-46e3-befb-119cb3c20a51.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love,Drama"],"nutshell":"From Rooftop Love BL:\nIvan, Lieutenant and spy in the service of the Russian army, must investigate the right arm of a mafia boss. But his target is a very close friend he made in the military academy and who he hasn't seen in ten years, Edward. Ivan can't help but wonder, how could such a compassionate man with a passion for art, become a part of the mafia? When they meet again, Edward seems to be as nice to Ivan as in the past and Ivan, facing a dilemma in his mission, is invited back to his home. But, the next day Edward's attitude completely changes and Ivan realizes that he's been kidnapped!\nDive into the frigid depth of Russia, in the heart of St. Petersburg, and discover the exciting story of two men who oppose each other! Will friendship and love be enough to overthrow fate and bring two ruthless enemies together again?"},{"name":" Haikyuu!! - Nyankyu!! (Doujinshi)","avatar":"https://mangadex.org/covers/31673aac-c4dd-454d-9dd6-5d4c811b517a/9882000c-dc68-48a4-baa2-12c5eb8a7d76.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":[""],"nutshell":"Anthology of various authors. Pairing: kuroken."}]