[{"name":" His Girlfriend","avatar":"https://mangadex.org/covers/f4247b21-e8ff-46ae-9f92-fc04f6641188/41132011-8053-4e9b-bd63-60f6902f2b6b.jpg.256.jpg","country":"Japanese","stat":"7.07","status":"Ongoing","tags":["Romance,Drama,School Life"],"nutshell":"It's April of my third and final year in high school... But the beautiful girl I have a crush on is my best friend's girlfriend. Thus begins my year of treading on the dangerous ground...\n\n\nOfficial Oneshot Raw Version"},{"name":" Short Cuts","avatar":"https://mangadex.org/covers/910b9cc3-7f7b-45a6-8ee2-ccf05fc5bd21/df123993-508c-4d15-a282-61440f60db98.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Comedy,School Life"],"nutshell":"Short Cuts is a manga series by Usamaru Furuya, released in two volumes and originally published in Young Sunday magazine. Each volume contains approximately one hundred 'cuts', short comics which typically span only one or two pages. The primary theme of Short Cuts is Japanese kogal and youth culture, which is tackled with a heavy use of visual jokes, black humor and sex comedy."},{"name":" No Longer Human (ITO Junji)","avatar":"https://mangadex.org/covers/48563de8-7669-4cd3-9dc0-7cbc945e8a8a/d860edae-be60-4cfc-a01f-50286fd1b6c9.jpg.256.jpg","country":"Japanese","stat":"8.19","status":"Completed","tags":["Thriller,Monsters,Psychological,Romance,Survival,Military,Philosophical,Drama,Horror,Delinquents,Slice of Life,Adaptation,Tragedy"],"nutshell":"Macabre manga master Junji Ito applys his singularly anxious touch to a manga adaptation based on No Longer Human (Ningen Shikkaku in the original Japanese), a classic of modern Japanese literature written by Osamu Dazai. The poignant and fascinating story of a young man who is caught between the breakup of the traditions of a northern Japanese aristocratic family and the impact of Western ideas. Portraying himself as a failure, the protagonist of Osamu Dazai's No Longer Human narrates a seemingly normal life even while he feels himself incapable of understanding human beings. Oba Yozo's attempts to reconcile himself to the world around him begin in early childhood, continue through high school, where he becomes a \"clown\" to mask his alienation, and eventually lead to a failed suicide attempt as an adult. Without sentimentality, he records the casual cruelties of life and its fleeting moments of human connection and tenderness."},{"name":" Amakute Atsukute Iki mo Dekinai","avatar":"https://mangadex.org/covers/15528503-86c5-4958-b756-7b9f48aa1da9/38b24c62-285c-4fcd-979f-e0e141181d23.png.256.jpg","country":"Japanese","stat":"8.21","status":"Ongoing","tags":["Romance,Boys' Love,School Life"],"nutshell":"”I can't stop the tingling in my body! I've never smelled anything like this before...!”\nAyato, a vocational student who has sensitive olfactory, smells a very attractive scent on the train and for some reason makes his body have an uncontrollable sexual reaction!\nThe scent comes from Hibiki, a good-looking classmate with a scary look in his eyes. Totally not Ayato’s type of guy!\nWhen Ayato gets captivated just by being around him, Hibiki doesn’t waste time and takes advantage of the situation!"},{"name":" Immortal Path Of The Beast","avatar":"https://mangadex.org/covers/5b307737-d58d-4bba-85e9-9ce09721fb48/c614e906-87d6-48dd-a75a-31f4886d9e4f.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Monsters,Action,Long Strip,Comedy,Martial Arts,Harem,Wuxia,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"Talented Chief disciple of the Royal Beast Sect, Xiao Ren, was forming his heavenly beast dan to enter the golden dan realm when he was attacked by the sect master. His Heavenly beast dan stolen, cultivation crippled and yet he was set up and banished to the Thousand Beasts Valley. At wit’s end, he had a chance encounter with an ancient calamity beast. The two bonded over the common goal of revenge, desperate to survive against the odds and kill their way into the Immortal Alliance!"},{"name":" Mairimashita! Iruma-kun","avatar":"https://mangadex.org/covers/d7037b2a-874a-4360-8a7b-07f2899152fd/3a319b70-00c0-4305-8281-59dc0af15054.jpg.256.jpg","country":"Japanese","stat":"9.29","status":"Ongoing","tags":["Monsters,Action,Demons,Romance,Comedy,Crossdressing,Magic,Isekai,School Life,Fantasy"],"nutshell":"Iruma Suzuki, fourteen years old, can’t say no to any request. His irresponsible parents make him work dangerous job after dangerous job to support them, and then one day they sell him to a demon! But, much to his surprise, the demon wants to adopt Iruma as his grandson? Unable to refuse his request, Iruma becomes the grandson of the great demon Sullivan. His new doting demon grandfather enrolls him in Demon School Babyls – where Sullivan is coincidentally the principal. Thus begins Iruma-kun's extraordinary school life among the otherworldly, meeting many colorful demons, taking on daunting challenges, and facing his true self as he rises to become someone great.\nCozy magical slice of life with occasional urban terrorism.\n\nOfficial Manga Twitter"},{"name":" Between Love-Hate and Affection","avatar":"https://mangadex.org/covers/f5afc11c-0405-4928-a19d-1a873d8fe8ae/886e95c1-0283-441a-9f8e-952ce7dff01a.jpg.256.jpg","country":"Korean","stat":"7.85","status":"Completed","tags":["Boys' Love,Fantasy"],"nutshell":"Deravillael, an Academy of Holy Knights, founded to train future knights who are capable of defending the country. Risbel Vendain, son of a Monma, Sabre, and a Paladin Knight, Seong Gi-Sa, summons a Monma Demon, Rovernia, to help him regain his position as Chief. In exchange for manipulating the dreams of Kendon Ayler, Risbel has to offer his body to Rovernia. The only thing missing from this mischievous plan is Kendon Ayler’s depravity but somehow, the way Kendon looks at Risbel is strangely uncanny..."},{"name":" JoJo's Bizarre Adventure - JoJo's Group, Working in India (Doujinshi)","avatar":"https://mangadex.org/covers/849eb10a-7092-40d1-b9e2-bdc450f43109/966ce177-44a8-4eb6-a684-108960ce36a1.jpg.256.jpg","country":"Japanese","stat":"8.39","status":"Completed","tags":["Comedy"],"nutshell":"Part-time job in India!?\nIn the land of India, the Joestar Group experienced a thorough sacred rite of beggars. They were all robbed of every single penny, and they couldn't even contact the SPW Foundation…\nWill they be able to overcome this trial in India safely!?"},{"name":" Pen Pal at the End of the World","avatar":"https://mangadex.org/covers/df6c5e34-ee07-4f63-acaf-d0924027ca2f/9ab26e55-e087-4077-89aa-e079b2714613.png.256.jpg","country":"Japanese","stat":"8.95","status":"Completed","tags":["Oneshot,Adventure,Post-Apocalyptic,Philosophical,Drama,Web Comic"],"nutshell":"In a post-apocalyptic stationery store, a girl and a former animator exchange letters. A dystopian correspondence story."},{"name":" Otome no Harawata Hoshi no Iro","avatar":"https://mangadex.org/covers/9c056c5a-0df5-4e4b-ab07-0dd44f57b881/4a3f8341-68f0-4efc-a16d-4bd0363b0ddb.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Sci-Fi,Romance,Comedy,Harem,School Life,Aliens"],"nutshell":"20 years ago, Weve Aliens arrived on Earth to search for marriage partners. Weve are perverted and love interbreeding. With their advanced technology, they have solved all the Earth's problems to do with the environment, food, and resources.\nGen is a student at the prestigious Human-Weve school Shinryou Academy. Due to his late grandfather's words, he loathes Weve and believes that pure humans will eventually die out if something isn't done about Weves soon. However, Gen meets the Weve girl Mirika, who falls in love with him."},{"name":" Yuki Musume wa Fureaitai","avatar":"https://mangadex.org/covers/fbdae2c5-3446-48fc-89df-fbb47b7684c7/6cc5e380-4dbf-4a39-9695-e2bf436eb2a6.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life,Monster Girls"],"nutshell":"Because he found out that his classmate, Shirayuki Tsurara, is a yuki onna, our protagonist Rei was pressed into spending his time helping Tsurara not melt…Let's begin this “yokai” romcom so sweltering you’ll melt! (Originally published in Young Jump Heroines.)\nUses the same characters as Shirayuki Tsurara Doesn't Want to Melt."},{"name":" Goth","avatar":"https://mangadex.org/covers/53aba86a-ea26-4e7a-bba6-68b15bf76a0a/0634c994-095a-410b-b7d4-df8ee8d89b48.png.256.jpg","country":"Japanese","stat":"7.48","status":"Completed","tags":["Action,Psychological,Comedy,Horror,Mystery,Adaptation,Tragedy"],"nutshell":"A rather morbid, sombre manga about two high school students, Kamiyama Itsuki and Morino Yoru, who have a peculiar interest in deaths and especially in murders that are committed near to them. Due to their strong fascination with murder and highly-developed analytical skills (along with some luck), they manage to solve the murders that have even eluded the authorities. However, acting on their own sense of justice and in self-interest, the murderers are often able to escape with the murders that they have committed. Often, it is Kamiyama that solves the cases even to the most subtle of details, but he is only interested in one thing, and that is the method by which Yoru should be killed."},{"name":" Nekota-kun, come here","avatar":"https://mangadex.org/covers/0d632df9-6ae9-4b6e-be9b-411366343c8b/6d466cd7-752a-4eee-ae8e-3419259d95e7.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Animals,Boys' Love"],"nutshell":"A naughty wandering cat finds true love. Nekota, a stray cat, lives in the house of Kazuma, a young hunter. He eats fish, hangs out on the porch, does naughty things from time to time, and lives freely.\nOne day, Kazuma says, \"I wish I could be your child.\" A warm, heartfelt story about his feelings. Includes the title work and 3 short stories full of happiness!"},{"name":" Tatoe Todokanu Ito da to Shite mo","avatar":"https://mangadex.org/covers/a44362f0-aaf9-4fef-9c60-acf65256705c/b408b8ec-372f-4f4e-895e-f8ff09ebf45c.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Completed","tags":["Romance,Girls' Love,Drama"],"nutshell":"Uta, a teenage girl living with her older brother Reiichi and his wife Kaoru, experiences a feeling of great turmoil and unrequited feelings after realizing the fact that she has fallen in love with Kaoru. Even after consulting her friend a few times, Uta just can't get the thought of Kaoru out of her head and the consequences that could leave their relationship tumbling towards a dark road."},{"name":" A Goddess Becoming Useless Due to an Overly Caring Man","avatar":"https://mangadex.org/covers/2cf2c398-99e6-4e2a-995e-d5763d50046e/c21e29c6-903a-4142-852d-94faa0a7f345.jpg.256.jpg","country":"Japanese","stat":"8.45","status":"Completed","tags":["Comedy,Web Comic,Slice of Life,Supernatural"],"nutshell":""},{"name":" Misunderstandings Gained From Deepened Knowledge","avatar":"https://mangadex.org/covers/8b38b62b-02ea-4516-a2e9-e6d408f3f465/e810bd61-af36-4f24-99ba-3f7209536c65.png.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Oneshot,Sci-Fi,Web Comic,Slice of Life"],"nutshell":""},{"name":" Otonari no Tenshi-sama ni Itsunomanika Dame Ningen ni Sareteita Ken","avatar":"https://mangadex.org/covers/c9146d61-80d0-48f6-a794-de56d728171b/163cdf25-3cd7-48d4-81b1-f673ecd54c03.jpg.256.jpg","country":"Japanese","stat":"8.45","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life,Slice of Life,Adaptation"],"nutshell":"Amane Fujimiya’s neighbor in the apartment he lives in is the school’s number one lovable angel: Excellent and with a level of beauty that can only be described as angelic – Mahiru Shiina. Amane, an ordinary student who doesn’t stand out, is her neighbour, but until now, they didn’t interact with each other. After meeting the soggy angel in the rain:\n“I’m returning what I borrowed. By the way, clean up your room. It’s filthy.”\n“None of your business.”\nA relationship with a slightly sharp-tongued angel begins, starting with handing over an umbrella. From catching a cold and having someone take care of you, to making a meal for someone because they neglected their health, to joint work (cleaning rooms)…'\nThis is a short comic intended to only introduce the light novel. The serialization of the actual manga will be done by 三描子 and 優木すず."},{"name":" Sexless no Kibo ga guigui Semete kuru","avatar":"https://mangadex.org/covers/1fc4ccf7-1301-4554-a127-86b5a52c6cdc/4ac2a1e9-2274-4c0a-ad8c-b3c0f14194a5.jpg.256.jpg","country":"Japanese","stat":"7.20","status":"Completed","tags":["Oneshot,Comedy,Incest,Web Comic"],"nutshell":""},{"name":" Stay Awake All Night","avatar":"https://mangadex.org/covers/82cf0018-d918-46e6-9a61-9893d97b09ac/c41cc205-eb70-4fbf-acb3-4035effb52ed.png.256.jpg","country":"Chinese (Simplified)","stat":"8.12","status":"Ongoing","tags":["Long Strip,Romance,Fantasy,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"Lian Mian is a normal girl, but she has the \"eye of death\" and is able to see people's mortality rate. Suffering from this curse, she tried to kill herself many times, but she just could not die! Upon hearing her cries, a Death God came. However, even his powers couldn't help her. What kind of spark will begin between the girl who wants to die and the Death God who will kill her? What kind of secrets are hidden behind the girl's powers? Can she resist the deadly temptation to dance with the Death God…?"},{"name":" Kimi no Kaketeru Tokomo Suki","avatar":"https://mangadex.org/covers/690540ab-5f55-4b44-910d-4d2ed0a0faa9/47218dc5-3fc6-42ff-8233-6175304e9890.png.256.jpg","country":"Japanese","stat":"8.64","status":"Completed","tags":["Oneshot,Romance,Drama,School Life"],"nutshell":"Haruto, a shy high school student with poor communication skills, who faces a melancholy entrance ceremony, is stunned by a beautiful profile. The profile belongs to Rui, a girl who is also a new student, and she is missing her arm. An encounter between an awkward boy and an amputee girl marks the beginning of a new relationship. A new generation boy meets girl, who looks into the eyes of the heart."},{"name":" Goblin Slayer: Brand New Day","avatar":"https://mangadex.org/covers/0b47248c-1c79-451f-bb95-c6bcc3d2c1b4/49f7553f-1a6d-42c1-9684-4097bd8aa84f.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Monsters,Action,Adventure,Fantasy,Adaptation,Tragedy"],"nutshell":"Goblin Slayer is a man who has been killing goblins in a remote town. A new warrior and an apprentice saint are frightened by him, but ask him to teach them a lesson. A beastman girl tries to get him to eat at a tavern. And the nest of goblins that awaits him… It's a story of adventure, carnage, and everyday life for him and the people around him!"},{"name":" Ikitsuku Saki wa Yuusha ka Maou ka","avatar":"https://mangadex.org/covers/331660d5-a2f4-47d8-8da8-99dfe5277e56/a4e4fb6e-a6eb-4f57-95cb-3116c1965df2.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Ongoing","tags":["Action,Romance,Isekai,Fantasy,Adaptation"],"nutshell":"“I’ve found you!”\nMamiya Yuuto was transported into another world after hearing those words, but all he got out of it were a younger body and the ability to see his status screen at any time — in overwhelming detail.\nHe uses his knowledge and perserverance from playing games and his experience from working as weapons to survive in a world with skills and magic!"},{"name":" Get Out of My House!","avatar":"https://mangadex.org/covers/0aeef1e9-356d-4ffe-8e00-376bbfb7925a/718c1491-a1cc-4767-a0c1-5bf7834297f3.jpg.256.jpg","country":"Korean","stat":"8.91","status":"Ongoing","tags":["Long Strip,Romance,Girls' Love,Drama,Web Comic,Full Color"],"nutshell":"“She's now your “responsibility”!” Cha Hong, a freelancer; heard as soon as she stepped foot onto the set the biggest drama. This job was everything that she wanted but she was only left to become an assistant. She ends up having to take care of Noh Seung-Ah; the nation’s actress with a really stubborn attitude. Hong will have to look out for the actress 24 hrs daily up until the drama is aired. Hong’s daily life routines and dreams are suddenly interrupted by Noh Seung-Ah who is 12 years younger than her.. On top of it all \"I never told you that you can live in my house?!\""},{"name":" Space Exchange Student Moru","avatar":"https://mangadex.org/covers/d79cd1af-c86a-436c-8478-16c7dc6dc548/ba953a8e-1332-441d-a1d4-08b9d469c08d.jpg.256.jpg","country":"Japanese","stat":"8.92","status":"Completed","tags":["Oneshot,Romance,Drama,School Life,Web Comic,Slice of Life,Aliens"],"nutshell":"Tatsumi, a pragmatic boy who doesn't make friends nor goes out for fun, meets Moru, an exchange student from space. And yet, he ends up accompanying her, although reluctantly, when she asks him to show her around the Earth...?!"},{"name":" GYO","avatar":"https://mangadex.org/covers/d831ed75-10fd-4af4-b23f-e732bc759036/5193ff9a-003f-484b-b271-1954b089aba7.jpg.256.jpg","country":"Japanese","stat":"7.44","status":"Completed","tags":["Drama,Horror"],"nutshell":"Something is rotten in Okinawa…the floating stench of death hangs over the island..What is it? A strange, legged fish appears on the scene…so begins Tadashi and Kaori's spiral into the horror (and stench) of the sea."},{"name":" Iwakutsuki Bukken no Yakuro-san","avatar":"https://mangadex.org/covers/a05b5c8c-1095-467e-96ce-a228f66c855b/8a9da5f7-5d67-4a1f-8715-0e6066bebcb6.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Ghosts,Romance,Comedy,Web Comic,Slice of Life,Supernatural,Mystery"],"nutshell":"19 year old Reikan Yuuki moves into an apartment that's supposedly haunted by a female ghost and sure enough said ghost shows up at night to get rid of him, but instead of running away in fear he joyfully introduces himself to the puzzled ghost! After all, the only reason he moved in was to meet his fated (ghost) person!\nA love comedy between a college boy with unusual preferences and a shy ghost, begins!\nAuthor's Twitter"},{"name":" The Nightmare of Fabrication","avatar":"https://mangadex.org/covers/9ba83841-f8f0-4ea6-934a-f3e1df40eb34/e06bb643-cab7-4007-af81-35110e0dff2d.jpg.256.jpg","country":"Japanese","stat":"8.19","status":"Completed","tags":["Oneshot,Sci-Fi,Psychological,Drama"],"nutshell":"The Nightmare of Fabrication is a beautifully drawn full-colour manga from Yoshitoshi ABe. The 18 page short story can be found in the Lain Omnipresence in Wired artbook. It's a bonus story which apparently isn't related with neither the anime nor the PS game. It shows characters who were included in the PS game but not in the TV series (like the psychiatrist), but also determinant characters from the anime who didn't appear in the videogame (like Deus)."},{"name":" Young Boy and Diamond","avatar":"https://mangadex.org/covers/662ce410-d63c-4b67-83f7-7a1d4a38d269/4c677376-0b7f-49eb-81ea-a5f06a286256.png.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Oneshot,Sports"],"nutshell":"This oneshot is about a young boy who hates baseball… until the day a passing stranger teaches him a valuable lesson!\nThis oneshot was featured in Harta volume 70, which released in December of 2019."},{"name":" Tiempo","avatar":"https://mangadex.org/covers/579b778b-bb9d-4f68-a193-4b30118cfbf5/852471de-604c-495f-9dda-9f98b841ff32.png.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Sports,Drama,School Life"],"nutshell":"A high school soccer story begins with a crybaby soccer player spinning a miracle! Yuzuki Seto started playing soccer in middle school and has been living a fulfilling life as it is. However, the situation changed completely when Keisuke Asami, who is one year older, joined the soccer club. Now the days of yelling hell will begin!"},{"name":" Master Villainess the Invincible!","avatar":"https://mangadex.org/covers/15d88ad6-19e7-48b6-b5db-8107fcccb220/1aad9f02-9753-451b-bb5a-1ec608daa5d3.jpg.256.jpg","country":"Korean","stat":"8.90","status":"Ongoing","tags":["Reincarnation,Historical,Action,Long Strip,Romance,Martial Arts,Wuxia,Isekai,Drama,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"Yeoju is a second-rate author living a mediocre existence in modern-day Korea. A tragic accident lands her in the plot of a bestselling martial arts novel and she wakes up as the infamous villainess Haewon Tang. Hoping to save herself from a gruesome death, Yeoju must figure out who to trust, harness Haewon’s inner chi, and learn martial arts as she fights to save the Sichuan Tang Clan. Can she change the outcome of the novel and prove she’s the worthy hero?\n\nLinks:\n\nWebtoon Trailer\nOriginal Webtoon <Webtoon kakao>\nOfficial Traditional Chinese Translation\nOfficial Indonesian Translation\nOfficial Japanese Translation\nOfficial Thai Translation"},{"name":" The Hero Who Returned Remains the Strongest in the Modern World","avatar":"https://mangadex.org/covers/69dcebee-7446-4eb2-8244-d903f12a6712/4c2a9863-dbd5-44de-9302-09186ee4fa6a.jpg.256.jpg","country":"Japanese","stat":"6.54","status":"Ongoing","tags":["Monsters,Action,Demons,Romance,Comedy,Adventure,Magic,Harem,Isekai,School Life,Fantasy,Supernatural,Adaptation"],"nutshell":"Morishita Taiju was transported into another world and became a hero, after wonderfully defeating the Demon Lord, he has returned to Japan. He was satisfied with his peaceful days as he hid his power, but… Hidden yokai and people with powers start to rampage, and the (rare nowadays) academy power battle-ish hidden world unfolds!! And Now He Trains Beautiful Warriors Using Superpowers!?"},{"name":" Hotaru wa Ashita Shinu DJ - Enough","avatar":"https://mangadex.org/covers/5c063063-4616-4f85-aa66-7b5742fbb5d9/a3d9fc09-cbf2-4255-89a4-c2d8b575fedf.png.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Oneshot,Romance,Boys' Love"],"nutshell":"10 Years Later."}]