[{"name":" Mega Man ZX","avatar":"https://mangadex.org/covers/1bd08bdd-4557-4ba5-a247-5f4a9c0b573b/c885f134-f0a1-49ce-9ac0-96796bcb4abb.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Sci-Fi,Action,Comedy,Mecha,Survival,Adventure,Video Games,Drama,Slice of Life,Adaptation"],"nutshell":"Enter an exciting new future with Rockman ZX! Hundreds of years in the future, humans are able to merge with living Live Metals, transforming into Rockmen! But are even the combined powers of the Model Z and Model X Live Metals enough to take down the sinister Serpent Company?"},{"name":" Aitsu no Heart ni Hi wo Tsukero!","avatar":"https://mangadex.org/covers/1bd19781-c36e-4ca3-a675-5243f193fe47/7ed1843b-f125-4f22-9a21-9f06cb9daedd.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Boys' Love"],"nutshell":"Kaduki Haruto runs away from his Old Japanese Court Music family, after he discovered that he likes modern music. His family is opposed to him being involved with anything but traditional music. Amamiya Keigo finds Kaduki singing in front of his apartment building. Kaduki collapses and Amamiya takes him to his apartment and cares for Kaduki, as though Kaduki were a stray cat. Kaduki begs to be allowed to stay and work for Amamiya. Amamiya agrees. What happens next?"},{"name":" Mangetsu no Yoru ni Akuma no Kiss","avatar":"https://mangadex.org/covers/1bd7226f-5766-45da-85fb-59270959a507/abf52bb5-4a8b-4732-b75b-2d79059fd475.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Romance,Comedy,School Life,Fantasy,Vampires,Supernatural"],"nutshell":"Mei Miyama, a second-year student at Saint Anemone Private Academy, is forced to clean the school church as punishment for being late, when she stumbles upon a secret room. She opens up the large coffin inside, and out emerges Aldi Alto. He looks just like a vampire with his red eyes and white hair. From that day forward he claims Mei as his bride and won't leave her alone! This is a heart-racing love story about a demon and an average high-school girl!!"},{"name":" Yellow Bird","avatar":"https://mangadex.org/covers/1bddd18b-471e-46a1-b17a-11b93ab015b8/0df54531-6f44-496b-8ca2-03fc1a85dd95.jpg.256.jpg","country":"Vietnamese","stat":"7.89","status":"Completed","tags":["Oneshot,Slice of Life"],"nutshell":"A light story…"},{"name":" Your Poker Face","avatar":"https://mangadex.org/covers/1be38692-c92d-4d9e-81f5-105112a4ad1c/e44e944d-49ee-4978-8a01-06472cc7d960.jpg.256.jpg","country":"Japanese","stat":"7.56","status":"Completed","tags":["Oneshot,Romance,Comedy,Web Comic"],"nutshell":"At the Landmark Cafe where I, Yoshikane, work, there is a strange colleague, Sawamura. She is calm, good-looking, and good at cooking. But for some reason Sawamura is a tough hit. A pot was dropped on my head when I went to work, I was forced to give my hands and donations during work, and I was slapped in front of customers. If I can't stand it and write a resignation,……!??"},{"name":" Sukini Nattara, Owari","avatar":"https://mangadex.org/covers/1be5941a-4a4a-4f89-b48d-2f32624cd7d8/e5693523-0754-4851-8bf3-cb8f1f7c3dd7.png.256.jpg","country":"Japanese","stat":"7.71","status":"Completed","tags":["Oneshot,Romance,School Life,Slice of Life"],"nutshell":""},{"name":" Green Mechanic","avatar":"https://mangadex.org/covers/1be82b83-41ca-44d8-b358-405c03e0817e/a2aac6f6-f118-49b9-990f-f79ae5d0414b.jpg.256.jpg","country":"French","stat":"7.87","status":"Ongoing","tags":["Sci-Fi,Monsters,Action,Comedy,Adventure,Post-Apocalyptic,Drama,Horror,Supernatural"],"nutshell":"In a world where nature has been devastated and average life expectancy has fallen, humans and robots only survive in a giant city called the Megapolis.\nIn the middle of this, Misha stays away from the crowds because of a strong empathic ability she can't control. But one day, while wandering near a junkyard, she finds a Morphing robot, a machine that can take the appearance of anything. She calls it Reborn and asks it to take the appearance of Mickael, her best friend who disappeared ten years ago.\nBut this encounter soon leads her to be involved in conflicts with Ersatz, humans who were turned into monsters by a mysterious evil, and the Militia, the military force that hunts them down."},{"name":" Star Ocean - Blue Sphere","avatar":"https://mangadex.org/covers/1be9a81f-ff89-40f8-89ce-57a5b6015851/23765825-6baf-479d-b2cd-d6c0c37f1471.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Action,Adventure,Fantasy"],"nutshell":"Galactic Era 366, a malevolent entity, \"The Ten Wise Men\", manipulated the Crest of Annihilation in an attempt to destroy the entire universe. Their aspirations were crushed by the heroes' actions across many planets, and the Ten Wise Men were defeated. The Universe was at peace once again. Thereafter, the heroes decided to go their separate ways. And two years later…\nPrecis and Leon are studying abroad on Earth. Then one day, they received an SOS from Opera and Ernest, saying that they had crashed on an underdeveloped planet. And the both of them, gathering some old friends, set off to Edifice to rescue them. But what they will find there will lead them on another adventure in which they will need to save a planet, and possibly the entire universe once again."},{"name":" Paperweight Eye","avatar":"https://mangadex.org/covers/1bed5dae-a983-48df-a8cf-fffcdf5e327c/e114c5cf-534d-433b-aa0a-12488ac98ce5.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Drama,Horror,Fantasy,Supernatural,Mystery,Tragedy"],"nutshell":"Marie is a shy college student and also a doll maker. Then one day, she is trapped in a gothic mansion by a mysterious young man calling himself \"Kahrel.\" Kahrel demands that she \"Creates the \"people\" that make up the world\" for him if she wants to leave. The terrified Marie then has the dolls she's made in past come to life, and are bearing down on her!"},{"name":" Agnes Mask","avatar":"https://mangadex.org/covers/1bf35610-67d2-478c-ab44-cc700370470a/dc274257-a9d8-48f6-a503-2a222c8da892.png.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Sports"],"nutshell":"Professional wrestler Yamamoto Shingo returned to Japan from a 5 year training trip in the US and Mexico, only to be greeted by his now defunct wrestling company: Yamato. He's come to find out that as soon as the president of the company passed away, the rival wrestling group Imperial Japan Pro Wrestling (IJPW) took down Yamato. Shingo is forced to seek revenge for Yamato by challenging the president of IJPW. One thing led to another, and now Shingo has been half-forced into working under IJPW as the new wrestler from Brazil: Agnes Mask."},{"name":" Koi Ja Nai no da!","avatar":"https://mangadex.org/covers/1bfa56b2-2124-4ee0-875c-689346ddd576/b4e1760f-4222-4ec3-bfe6-c4d47894075e.png.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Because of a strong trauma in the past, Nanno is a coward when it comes to love. When she was in her sixth year of elementary school, the boy she loved threw away her love letter. As a result, Nanno thinks she can't love anymore. But she finds she is interested in the boy who joined the same committee as her…\nHowever, what will she do when she finds out he is Tsuzuki, the one who caused her trauma!?"},{"name":" Ame no Furu Basho","avatar":"https://mangadex.org/covers/1bfa9e48-a4c1-40d0-9008-1ac242e42764/c78390cb-ca0e-4c24-af1a-2607d721a91a.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot,Psychological,Slice of Life"],"nutshell":"Eshikawa is a man who has lost sight of his life and stumbles through it, with no clear meaning or purpose. One day, he is informed that his ex-girlfriend committed suicide, which sets his brain on retrospect mode. Through the course of the 28 pages, he goes on a journey of self-revelation and contemplates upon the myriad of human emotions, the joys and sorrows of normalcy."},{"name":" Geboku-sama no Iu Toori","avatar":"https://mangadex.org/covers/1bfd0674-708c-4840-b575-4e265a56905a/aa8ff7d6-4be2-4d14-a7d8-a534de429993.png.256.jpg","country":"Japanese","stat":"8.19","status":"Completed","tags":["Romance,Comedy,Boys' Love,Fantasy,Vampires,Delinquents"],"nutshell":"''A perverted, masochistic(?) slave x a bluffing vampire''\n''Even thought you dislike having sex with me, you're feeling so good that you can't help it… You're so cute…'' Isn't… he totally an S?!\nIn a period when humans and vampires coexist, being sucked by smart and beautiful vampires means having special status. Shion, who is wearied by the blood of tiresome women, is taken by the delicious smell emitted by a plain salary man called Hajime whom he met on the street. However at the time Hajime, a natural M, had his eyes set on Shion's proud attitude and desired \"master and dog\" play in exchange for blood. It is Shion who keeps refusing his request… However, he becomes aroused by Hajime's words 'my master is just very cute' and without hesitation he lets Hajime embrace him to the point that Hajime gets knocked out?!!"},{"name":" Touhou - Nanamemae no Idol (Doujinshi)","avatar":"https://mangadex.org/covers/1bfd732e-1c45-40d1-9922-a9e965a1d2d5/ee063073-9fec-4eb7-86fc-4f6f3d1ec5c2.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,School Life,Mystery"],"nutshell":"\"Sumireko is your classmate, and sits in front of you.\"\n…the oneshot."},{"name":" The Witch's Heart","avatar":"https://mangadex.org/covers/1bff4e2f-bf06-4be7-aa4d-b0c2ed540243/a9356a7c-b353-4a9a-971b-46c16dd19d76.jpg.256.jpg","country":"Indonesian","stat":"7.88","status":"Ongoing","tags":["Long Strip,Romance,Magic,Fantasy,Web Comic,Full Color"],"nutshell":"Arianna Blackhart is 300-year-old witch. During her life she always felt bored. One day Arianna found a baby who was abandoned outside her door. To get rid of boredom, she decided to take care of the baby. As time goes by, Arianna's heart will change.\n[Official Indonesian Description]\n||Arianna Blackhart adalah seorang penyihir berusia 300 tahun. Selama hidupnya ia selalu merasa bosan. Suatu hari, Arianna menemukan bayi laki-laki yang ditelantarkan di depan gerbangnya. Demi menghilangkan kebosanan, ia memutuskan untuk merawat bayi itu. Seiring berjalannya waktu, hati Arianna ikut berubah.||\n\nThe english translation is uploaded to Mangadex under license obtained from the copyright holder."},{"name":" Yukihime-kun wa Watashi no Yome","avatar":"https://mangadex.org/covers/1c0547aa-2a4f-4a93-857f-2d8a480595bf/ffc45d7f-6fb6-4b5b-99d9-851ca8dd3db2.png.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Oneshot,Romance,Comedy,Web Comic"],"nutshell":"(From Pixiv) A manga about childhood friends."},{"name":" Midori no Uta","avatar":"https://mangadex.org/covers/1c080745-d27b-410f-a190-36bf630c7c30/775c4df7-44e7-40d2-bbf4-d884b2194254.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Music"],"nutshell":"Born on the north coast of Taiwan, the girl Lü moved to Taipei for university. The big city offered many new experiences, but it was also challenging and lonely, until she met a boy playing in a band at the live house Kafka By The Sea. With his music, he helped Lü expand her horizons and find a new purpose in life. And as they spent time together, their feelings for each other gradually grew. But a musical opportunity for him caused a chasm between them that might be too wide to cross...\n(Source: Books.com.tw, translated)\nNote:\n\nA Gao Yan work translated to Japanese by RYUUZAKI Ryou"},{"name":" Night Hag","avatar":"https://mangadex.org/covers/1c0bf450-3538-48a2-85a8-df47d17678a3/3602f75e-245e-4e3b-8f31-fca2e435b672.jpg.256.jpg","country":"Korean","stat":"8.06","status":"Completed","tags":["Long Strip,Boys' Love,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Fairies – the good ones, the mischievous ones, the nightmare inducing ones. Nine is a special incubus and came to the world of the humans only one day ago. Will he adapt and find a way to stay alive, although he doesn’t gain energy from having sex with humans? Then he meets this hot professor… (from Random Fujoshis Scans)"},{"name":" Buchou ni Igen wa Arimasen","avatar":"https://mangadex.org/covers/1c0d2de5-3f3c-4215-9436-1306dcaba4bf/f6aed929-bd34-4e8c-9e91-d7ecf242a814.png.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Comedy,Sports,Girls' Love,School Life"],"nutshell":"Kinosaki Emu, captain of the table tennis club, is a large-breasted high schooler who loves table tennis even if she’s bad at it.\nOpposite her is Yajima Esumi, her one-and-only club member, a sadist who’s amazing at table tennis. Esumi throws insult after insult at Emu like calling her a fat pig or only good for her boobs.\nNot sitting idly by, Captain wishes to restore her dignity. She gives her all in matches and tries to get new members to join the club. But will this be enough? Will Captain restore her dignity?"},{"name":" Tokyo Yabanjin","avatar":"https://mangadex.org/covers/1c0d3bb3-01ab-4c8c-bc5d-0e4ed904a3c8/9723aec7-3820-4615-8e17-4d778c5373b7.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Completed","tags":["Comedy,Boys' Love,Drama"],"nutshell":"Kano Fubuki simply looked too young for his age. That was all well and good, but people found it hard believe that he was a bonafide detective, especially Kagetsuna Daimon, the head of a yakuza group involved in a current investigation. But when Fubuki is kidnapped, he's about to find out that Daimon has more of a personal attachment to him than the criminals."},{"name":" Senpai! I didn't do it on purpose!","avatar":"https://mangadex.org/covers/1c1025f4-3a79-4922-a148-a0fb0654cad5/1b10f9c0-47ba-47c8-9b69-b87a8f76c459.png.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Oneshot,Romance,Comedy,Gyaru"],"nutshell":"As soon as you're in love with someone, you're in a lucky streak...! An erokawa ♡ love comedy about one couple (Weekly Young Magazine, issue 13, 2022)."},{"name":" New York, New York","avatar":"https://mangadex.org/covers/1c109752-50a1-40f0-9125-f33091bf550a/9905a876-e0fa-4e54-b7bb-ffd214b27db6.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Psychological,Romance,Boys' Love,Police,Slice of Life,Tragedy"],"nutshell":"Kain Walker is a New York policeman who is admired and appreciated by all of his colleagues. Scared of disappointing his fellow officers and also frightened of being discovered, Kain hides that he is gay and abstains from any relationships… until the day his path crosses that of Mel Frederics, a calm and soft-spoken young man with a dark past."},{"name":" Shigurein","avatar":"https://mangadex.org/covers/1c19af94-a338-4bae-b950-74c3c81f04a5/5adedfa4-02d2-4f8f-b225-ad8a75015505.png.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Oneshot,Comedy,School Life"],"nutshell":""},{"name":" Aishite Kudasai, Sensei","avatar":"https://mangadex.org/covers/1c1c5d8a-1ea1-4515-ab7e-30796036e588/cb39f4d4-44ba-4cde-9f84-89d6b6df8880.png.256.jpg","country":"Japanese","stat":"7.48","status":"Completed","tags":["Psychological,Romance,Drama,School Life"],"nutshell":"Kitou Hijiri, a student, confessed his feelings to a Chemistry teacher named Nakatani Ayano whom he had fallen in love with 8 years ago. Somehow when he was young, he lived beside Ayano and bear feelings for her. Ayano, in turn, could not resist Hijiri’s determination and strong feelings towards her. What will be the ending of their taboo love?"},{"name":" ManKo Chishin -Baka demo wakaru Koten Bungaku","avatar":"https://mangadex.org/covers/1c1d7b0d-4997-41e8-a6c9-48774f41fe47/a041d01f-19f5-4129-baa1-1a2f4d4baeb7.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Historical,Comedy,Fan Colored"],"nutshell":""},{"name":" Kimi ni Mata Koi ga Kuru","avatar":"https://mangadex.org/covers/1c1da3cb-1aa2-486b-931d-8f0b40273a1e/2e4bc9d5-282e-4167-a43b-95c5d2db7f0e.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love,Drama,Slice of Life"],"nutshell":""},{"name":" Nekogahara","avatar":"https://mangadex.org/covers/1c2716c8-d87f-480f-891e-9285e2183c48/c3be506c-7c1a-4442-afb8-c33328c46b46.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Historical,Action,Drama"],"nutshell":"In medieval Japan, a bell hanging on the collar is a sign that a cat has a master. Norachiyo's bell hangs from his katana sheath, but he is nonetheless a stray—a ronin. This one-eyed cat samurai travels across a dishonest world, cutting through pretense and deception with his blade."},{"name":" Taranta Ranta","avatar":"https://mangadex.org/covers/1c2a90f0-b194-459a-8034-b12df43f51b2/4904bba6-11aa-4612-888e-09cc1d6e6a3e.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"From Shoujo Manga Maniac:\nThe main character is named Hikaru. She misses her dead brother and speaks to him in her mind as she begins her first day of high school. Here she has many ordinary adventures.\nShe becomes fast friends with a girl named Nene, who lets nothing stand in her way and pushes Hikaru to kiss her new crush, Michiya, who reminds her of her brother. He lets her kiss him, which as it turns out is not a good sign. He seems to be a jerk, whose personality is nothing like Hikaru's brother's.\nMichiya's best friend Jun warns Hikaru ahead of time. Later, Hikaru finds out the bad side of her new friend Nene. When Hikaru understandably gets upset about this, Nene gets angry at her and tells her to find another friend."},{"name":" Kyouto Teramachi Sanjou no Holmes","avatar":"https://mangadex.org/covers/1c2bb843-19c1-4062-b33a-b6c7e4ceca6c/27a33706-4807-4cb7-a3d5-1200247d9e2b.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Ongoing","tags":["Romance,Mystery,Adaptation"],"nutshell":"\"Kura\" is an antique shop in Sanjo shopping street of Temple town in Kyoto. The schoolgirl and Moritaka Aoi are acquainted with the grandchild and Taito Kiyotaka of the owner of this shop from a thing. I decided to do a byte in Kura. Aoi, Kiyotaka and two people, who are called \"the Holmes of Sanjo temple Cho\" Sharp intuition I'm going to get a strange request to come to the store unexpectedly..."},{"name":" Otomeza, Spica, Shinjuboshi","avatar":"https://mangadex.org/covers/1c2ceb4d-acab-469a-bdea-fd4831447efc/3687229d-347e-4d91-b692-24e7ebc0a36e.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Ongoing","tags":["Romance"],"nutshell":""},{"name":" JoJo's Bizarre Adventure - Mr. Heartbreak (Doujinshi)","avatar":"https://mangadex.org/covers/1c2d4960-a3fd-482b-94be-ae8f8c16d577/8755c543-86bb-43e4-80ad-f598df8776fd.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Ongoing","tags":["Boys' Love"],"nutshell":""},{"name":" A Song for You","avatar":"https://mangadex.org/covers/1c2d50c9-d2b1-451d-b99d-5945b3f6a9a8/4d26aad8-07cd-4409-9029-ecc66c967e0f.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"After a very public (and humiliating) break-up with her last boyfriend, things couldn't get any worse for 18 year old Emiko. Things start looking up however, when a good-looking guy stops her in the middle of the street to offer her tickets to an upcoming rock concert.\nAs it turns out, he's just one of three brothers from the Kanita family: Gaku - 18, Youji - 19, and Masaki - 23. A chance encounter with his older brother, Youji, leads to a whirlwind romance. He's impulsive, hot-headed, and even a bit self-centered, but she finds his frankness, though brutal at times, refreshing and she ends up falling for him….HARD.\nAn unexpected turn comes her way however when it's revealed that Youji and Yuri, a close friend of hers from back in middle school, knew each other before she met Youji. They don't seem to get along at all—-what happened between them?\nAlso contains one-shot:\n\"I'm Going to Become That Star\"\nSanshiro, a happy-go-lucky 17 year old, gets a serious head injury that lands him in a coma after he jumps into the road to save a girl from an oncoming car! During his comatose state, he's told by a mysterious being (aka his pet turtle that died ages ago) that the girl he saved is actually the reincarnated form of the lover he had to part with in his previous life! Well, that's great and all, but the reincarnated form of his lover turns out to be…a 9 year old girl?!"}]