[{"name":" Duction Man","avatar":"https://mangadex.org/covers/a2098d47-58ff-47e1-88bd-ab218f0418c8/4954cff8-98f0-4c6f-b157-ef60b726aa1f.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,Drama,Mystery"],"nutshell":"Ogi Juugo, a construction worker, separated himself from the the entertainment world long ago. He has a loving girlfriend called Misa Tsukahira, but when he finds out the truth about her, he decides to turn his world upside down.\n–Based on Chapter One."},{"name":" Super Shared Boyfriend System","avatar":"https://mangadex.org/covers/a20bf7c8-9ad6-40a4-a7d7-60ab5a6f4489/b7211bde-e830-49e1-afbc-fc8337d8cf78.jpg.256.jpg","country":"Chinese (Simplified)","stat":"6.38","status":"Ongoing","tags":["Sci-Fi,Long Strip,Romance,Comedy,Virtual Reality,Harem,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"Being friendzoned by different girls for almost a hundred times, the extremely unlucky man, Lin Yi, was chosen by the Super Shared Boyfriend System as a qualified host. As long as he receives the order, he will temporarily acquire all the skills required by the clients! Masculine charm = Charming eyes; Transgender = A man wears female clothing… Wait! Why does a girl want her boyfriend to be a transgender！Hey, system! Don't run away! Make it clear!"},{"name":" So wa Reirei no Yuki ni Mai","avatar":"https://mangadex.org/covers/a21b7120-d822-47a6-90c0-b8041f8320ce/e96b3093-61d7-4e92-ba2e-1b72d5bca02f.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Historical,Boys' Love,Drama,Supernatural,Mystery,Tragedy"],"nutshell":"This story in set in the Taisho era (1912-1926).\nTwo years after the famous author Uro vanished, his last manuscript is found at the house of competing author Otogai, who seems obsessed with (or is it possessed by?) his supposedly-dead rival. By a strange turn of events, three acquaintances; an illustrator, an editor and a stage performer, end up investigating Otogai's odd behaviour. They discover that the writer's garden appears to be haunted by a mysterious camellia bush…and camellia was Uro's favourite flower.\nNote: Watashi no Kakurega e Douzo contains a story, Dancing in the Snow, which also features Minami, Ideizumi and Kuzuha. All these stories about the trio are also gathered in the first volume of Rere Shuushuutan, which then continues with new stories about their involvement in various supernatural mysteries."},{"name":" S, Love & Chocolate","avatar":"https://mangadex.org/covers/a21e7c45-d0d4-45ff-81ec-8094c5bcc712/23078271-7769-4b08-988b-83af19719efc.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance"],"nutshell":"\"Это я скрывал свои чувства. Прости.\"\nСакураи Хиёри работает на фирме, производящей сладости, и хочет придумать такое же вкусное лакомство, как её любимый шоколад \"Park\". Но оказывается, что этот шоколад изобрёл её суровый демон-босс по имени Суго! Каждый день терпя унижения и оскорбления, Хиёри тайно мечтает о Суго. Однако, поговаривают, что Суго встречается с самоуверенной, но доброй девушкой-красавицей… Тайная любовь Хиёри оказалась вовсе не слаще конфет!\nОфисная комедия положений о начальнике-садисте и подчинённой-оптимистке!"},{"name":" Seinen 14-sai","avatar":"https://mangadex.org/covers/a22001d5-c772-4e24-8a7e-92331de717d1/336b085e-8a7e-439c-8e3e-19fe6fd8e30a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,School Life"],"nutshell":"Itou just found out that one of his best friends, Machida, maybe kind-of sort-of likes him. He doesn't say it, but he did orgasm when thinking of Itou, even as he was about to have sex with his girlfriend! Now, Machida has a complex about Itou and even kisses him, and Itou develops a complex about Machida because his first kiss was taken! On the edge of becoming men, will they figure out their feelings?"},{"name":" Yakkai na Hatsukoi wa... Senpai to","avatar":"https://mangadex.org/covers/a2213bd4-45b2-4483-8277-69cdac247f0b/d02b6495-c6eb-4c08-bda7-d983761b0960.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,School Life"],"nutshell":"Yagisawa-senpai aparece frente a Hikari, para quien lo más valioso es la seriedad. Se suponía que él iba a ser un irritante senpai… esta sensación… \"Yakkaina Hatsukoi ha… senpai to\", \"un problemático primer amor… con senpai\" [Te enseñaré cómo es un verdadero romance]"},{"name":" Koukoku Gaisha, Danshi Ryou no Okazu-kun","avatar":"https://mangadex.org/covers/a2229d53-9c96-4667-bdf3-4155c1ca9c4d/d53ac8de-acd7-46e8-9249-e84382759996.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Office Workers,Slice of Life,Cooking"],"nutshell":"Koukoku Gaisha, Danshi Ryou no Okazu-kun is a humorous manga that follows the daily lives of four men, Okazu, Keisuke, Ippei and Masashi, living together in a dormitory. They all work in the same advertising agency and their little pleasure is to meet the four of them every Friday evening after their day, over a good friendly meal."},{"name":" Tomino the Damned","avatar":"https://mangadex.org/covers/a223f16d-7a9d-411e-8246-71880819ef28/a3f897b2-669f-4fab-bb96-8662b650d425.png.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Psychological,Drama,Horror,Tragedy"],"nutshell":"Maruo's newest work, a story of twins being forced to join a travelling freak show."},{"name":" Houkago no! Iruma-kun","avatar":"https://mangadex.org/covers/a2263632-9329-4e3d-95d5-ee9022128581/57ec406a-895c-46c6-b74d-230f2067a80f.jpg.256.jpg","country":"Japanese","stat":"8.45","status":"Hiatus","tags":["Demons,Comedy,Anthology,School Life,Fantasy,Slice of Life"],"nutshell":"An official Mairimashita! Iruma-kun anthology series, featuring stories of Iruma Suzuki and friends's adventures as students of Babyls Demon School.\nChapter numbering is in order of release.\n\nTABLE OF CONTENTS (VOLUME 1):\nCHAPTER 1 - Iruma-sama Caught On Camera!\nMangaka:  Hachi (The Witch's Bloody Paintings)\nEiko and Asmodeus meet in private to share with each other some photos that they've secretly taken of Iruma.\nCHAPTER 2 - I Just Haven't Given It My Best Yet\nMangaka: Saori Muronaga (All Alone in Hyakki Demon Village)\nOpera laments their inability to get a good photo of Iruma, so they decide to train with Iruma in order to do so.\nCHAPTER 3 - Detective Iruma Case File: The Missing Fluff\nMangaka: Nango Kouta (Kojirase Hyakki Dominor)\nAfter playing a mystery game, Iruma and Lied get bitten by the detective bug. But when Elizabetta discovers that her tail scrunchie is missing, can Iruma Holmes and Lied Watson figure out the culprit?\nCHAPTER 4 - As Expected From Kirio-senpai!\nMangaka: Shinobi (Yandere Kanojo)\nA day in the life of Kirio, Iruma’s senpai who secretly has an obsession with seeing people in despair.\nCHAPTER 5 - I Can't Wake Up! Iruma-kun\nMangaka: Rio (Despair Boy and China Girl)\nAsmodeus and Clara come across Iruma sleeping, and compete against each other to see who will wake him up first.\nCHAPTER 6 - Clara’s Seduction Challenge\nMangaka: Sako Misaki (Doki Doki Yokai Love Battle! ~ Great Yokai War!)\nWhen Clara’s succubus mentor teaches her about enchanted chocolate that will make the consumer fall in love with its creator, Clara naturally tries to see if she can make chocolate that will make Iruma act lovey-dovey towards her.\nCHAPTER 7 - Azz-kun's Devilum\nMangaka: Shimotsuki Seira  (Sewaga Yakemasu Hades-sama)\nIruma and Clara ask Asmodeus what he normally does during Devilum balls.\nCHAPTER 8 - Once Again... Please, Opera-san!\nMangaka: Nagi Mayuko (My Student Won't Go Back Home)\nAmelie asks Opera to help her improve her cooking skills.\nCHAPTER 9 - That's a Mythical Creature, Iruma-kun!\nMangaka: Yoshimatsumetsu  (Akuyaku Reijo no Ani ni Tensei Shimashita artist)\nIruma’s class discusses their efforts as children to find the delicacy known as humans - while the human Iruma tries to change the subject.\nCHAPTER 10 - Evade Them All! Iruma-kun!\nMangaka: Kakemaru Kakeru (Shonen Racquet)\nClara decides to put Iruma’s danger avoidance skills to the test with a massive gauntlet of traps.\nCHAPTER 12 - The Irumi in Our Hearts\nMangaka: Fukui Takumi (Shuumatsu no Valkyrie writer)\nIruma’s classmates discuss the mysterious new idol Irumi who suddenly appeared at a concert beforehand.\nCHAPTER 13 - Amelie's Heart-Pounding Grand Campaign\nMangaka: Sakurai Norio (Boku no Kokoro no Yabai Yatsu)\nAfter reading shoujo manga, Amelie seeks to replicate romantic moments from them with Iruma.\nCHAPTER 14 - Iruma-kun and the Cherry Blossom Viewing Party\nMangaka: Itagaki Paru (BEASTARS)\nIruma, Asmodeus, and Clara set up a cherry blossom viewing party.\nCHAPTER 15 - ???\nMangaka: Heriyama (Governess Nazuna-san)\n\nTABLE OF CONTENTS (VOLUME 2):\nCHAPTER 11 - Break them Bones! Bablys Staff\nMangaka: Kawasaki Chuu (Shuumatsu Busou Pancake writer)\nThe Babyls teachers participate in an arm-breaking (arm-wrestling) contest.\nCHAPTER 16 - ???\nMangaka: Abekawa Kineko (Touken Ranbu Anthology ~ Preparations For Departure!)\nCHAPTER 17 - ???\nMangaka: Kobayashi Moriwo (Melancholy Melancholic Melancholinist)\nCHAPTER 18 - ???\nMangaka: Suzuki Iko (One Step!)\nCHAPTER 19 - ???\nMangaka: Kuze Mizuki (Shuumatsu Friends)\nCHAPTER 20 - ???\nMangaka: Utagawa Utako (Jitsuwa: Fukakaidan Kissa)\nCHAPTER 21 - ???\nMangaka: Tatsubon (Tadokoro-san)\nChapter 22 - ???\nMangaka: Saito Michi (The Rising Of The Vibrator Hero)\nChapter 23 - ???\nMangaka: Tachibana Mizuki (Seishun Radio Pinchers)\nChapter 24 - ???\nMangaka: FUKASAWA Neji (He is popular, but he is not good at love)\nChapter 25 - ???\nMangaka: Takewakamaru (Gurenki - Creo the Crimson Crises)\nChapter 26 - ???\nMangaka: Fujino Pochomukin (Kayou Koukyuu no Hanayome)"},{"name":" Anata wa Kawai Hito ~Datsuryoku-kei An'nyui Joshi, Shuuchaku Wanko ni Torotoro ni Aisareru~","avatar":"https://mangadex.org/covers/a22b63a6-6293-4fce-8352-aae63e6ba69a/29b05046-1821-49b9-a3b7-ec6b9acd94ba.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance"],"nutshell":""},{"name":" Suki Kirai Suki","avatar":"https://mangadex.org/covers/a22cf0ba-2612-48dc-8955-86491e1c871c/428b6a54-97ad-4311-b4d3-85d4c99517c3.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"Inoue Azusa's classmate, Saito, is extremely good looking, but he has the worst personality ever. For some reason, he started noticing Azusa and gets her in a lot of trouble. Although he's very annoying, Azusa gradually becomes attracted to him. However, Azusa's classmate, Kou, is not only handsome and is the president, but towards Azusa he is…?!"},{"name":" Kaze Hikaru: Koushien","avatar":"https://mangadex.org/covers/a22ffe50-45b3-4d05-97ce-12ad6ee2cd8c/4008c636-0736-4a20-9e23-40c58af7e85e.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sports"],"nutshell":"Tamagawa high school's baseball team lost all matches in the first round for years. Yutaka is a tiny boy who joined the team as reserve player and he is good at mimicking. The new coach soon spotted his ability and placed him on an important position - the pitcher. The two slowly help the team to build up their strength and spirit."},{"name":" 0 kara Hajimeru Manga Kyoushitsu","avatar":"https://mangadex.org/covers/a2320582-0ccd-4d38-825e-770df2b0fd92/cb48c402-1046-4892-8c94-a4e52308d403.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Comedy"],"nutshell":"Reika is a rich girl who wants to pursue her dream of being a mangaka; and so, she hired a butler, one whom specializes in teaching people how to draw manga. That is how Seba* came here.\nHowever, since his knowledge about manga is vast, he turns into the ultimate Spartan whenever he teaches her! Even today, he whips her still.\nThe secret teaching debut, and the enthusiasm over cool butlers will start soon!\nIt's a how-to-draw-manga thing KURUMATANI Haruko posts on Sho-Comi. There's about 2-3 pages of it each issue. It's not really a story or anything, it just talks about how to draw manga and techniques, etc."},{"name":" Duke's Servant","avatar":"https://mangadex.org/covers/a23bfb5d-8196-44c0-b77e-6c7bf80c6892/e82d891f-bda8-4dd7-8f19-e8511b6dd00e.jpg.256.jpg","country":"Korean","stat":"7.93","status":"Ongoing","tags":["Historical,Romance,Comedy,Crossdressing,Fantasy,Web Comic,Full Color"],"nutshell":"Lindsay is a top-secret spy about to take on her most difficult mission yet: to disguise herself as a man?! Her target is the Duke. Rich, mysterious, and… an infamous womanizer. Cutting her hair, drinking elixirs to hide her voice, as a servant she must infiltrate his manor and investigate the mysterious disappearance of lords and ladies in the area. However, when she meets the Duke for the first time and he kisses her, is it her identity that's compromised or her heart…"},{"name":" Kimi to Watashii no Taiiku no Jikan","avatar":"https://mangadex.org/covers/a23cec6c-3c43-4ce5-9887-1b5bb0f9c302/36fd6696-fcbf-4d07-817b-c2ecdcac634c.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"\"Even though he should be an impertinent, irritating and hateful junior…\"\nAn encounter with an impolite and rude junior in a P.E. class full of boys!??"},{"name":" Raiatea","avatar":"https://mangadex.org/covers/a23f1609-65f4-4016-b865-6ca38c5e6e90/0e00a2a7-e87c-40b3-b7c1-d3a660c7047c.png.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Romance,Boys' Love,Adventure,Drama,Slice of Life,Tragedy"],"nutshell":"Suddenly stricken with lupus, a photographer loses sight in one eye. Faced with an uncertain prognosis, he feels an urgent need to revisit the South Pacific island that inspired his career. Can he convince the man he encountered there years ago, now a medical researcher in Southern California, to accompany him on his journey?"},{"name":" Pokemon Battle Stories","avatar":"https://mangadex.org/covers/a23ff41d-256a-42cb-b4ba-07ef2ce7b82f/c3ff96e2-4107-4361-b53b-4b8e145de0e3.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Monsters,Action,Animals,Comedy,Survival,Sports,Adventure,Video Games,Drama,Slice of Life,Mystery,Adaptation"],"nutshell":"A story about a newspaper reporter, \"Wakaba,\" who travels around the region to report on events related to Pokemon."},{"name":" BUILDER","avatar":"https://mangadex.org/covers/a2465ec2-0c0d-4789-a10f-416405f96894/99468bae-f6db-4b06-a8b2-85eebed41708.jpg.256.jpg","country":"Korean","stat":"7.55","status":"Ongoing","tags":["Action,Long Strip,Romance,Comedy,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"In the near future, humans have created technology to allow them to dream whatever they desire. Those who seek to become gods in this dream world are called \"Builders\". A girl uses this technology for the first time for the same purpose. Why does she want to become a Builder?!"},{"name":" Mutant Sabu","avatar":"https://mangadex.org/covers/a2477d99-35c5-4f79-a4ec-3f71d327b0bf/4b5af358-f5ae-44cb-8f8e-3150575fa168.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Thriller,Award Winning,Sci-Fi,Time Travel,Action,Psychological,Animals,Romance,Comedy,Mecha,Crime,Survival,Sports,Mafia,Adventure,Military,Philosophical,Drama,School Life,Delinquents,Slice of Life,Supernatural,Mystery,Tragedy"],"nutshell":"The loneliness and sadness of a boy, Sabu, who has awakened to paranormal abilities.... In prehistoric times, humans had the mental sensitivity to speak with their hearts and minds instead of words. Following the development of language ability, the ability that should have degenerated is revived!? A transfusion of blood from a girl awakens the psychic powers of a boy, Mutant Sabu, and he is born! The short story series about a hero with unusual abilities, which is considered one of Ishinomori's best-known  supernatural SF works and won the 1966 Kodansha Children's Manga Award along with \"Cyborg 009,\" is now ready to begin!\n\n\nAs mentioned in the description, Mutant Sabu Won the 7th Kodansha Children's Manga Award in 1966, which it shared with Ishinomori's other, very famous, work Cyborg 009"},{"name":" Ru~mu! Room No.1301","avatar":"https://mangadex.org/covers/a24d6347-fae3-4b54-af68-ee3e01cd3475/8435b1de-16c0-4922-8731-0187598b1a04.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Romance,Comedy,Harem,School Life"],"nutshell":"From Operation Boredom:\nHigh school Student Kinugawa Kenichi is one of the members of the class committee and also the boyfriend of the super cute Ooumi Chiyako. However, one day, a new student, Kuwabatake Aya, transfers to their school, and demands that Kenichi be her boyfriend…?! Who exactly is this girl, and how does she know Kenichi?"},{"name":" Christmas Wish","avatar":"https://mangadex.org/covers/a2540a54-279d-499e-841a-e5a357ae11b9/17defb2f-a146-451e-9e5d-2af234225665.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Comedy,Girls' Love,Drama"],"nutshell":""},{"name":" Sorairo Kaigan","avatar":"https://mangadex.org/covers/a258a438-3706-4077-818a-e36fab5229e9/d72c152e-365a-48c7-9dbd-d19545b6535f.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Drama,School Life"],"nutshell":"Sakurai Tomo is a highschool girl who lives in a town close to a beach. One day as she was getting molested on the bus, she gets rescued by a classmate(?!). However, the key holder dropped by her rescuer held the same Agate that she has gotten from a boy in her past?! Is he the same person?!"},{"name":" A Swallow Falling Into the Sea","avatar":"https://mangadex.org/covers/a259fe9f-64ab-40b4-9697-8d1ca4f0e663/a64239c9-27b6-4279-9e96-86355d007224.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Psychological,Anthology,Horror,Mystery,Tragedy"],"nutshell":"Collection of mysterious stories by Chie Shinohara, a great artist of suspense manga.\nStory 01 Part 01 & 02: Umi ni Ochiru Tsubame - Swallow Falling into the Sea\nMasako Minase, a scriptwriter, was murdered by Shiki Morimura, her rival in the same profession. Shiki was sure that she had destroyed evidence completely. However, someone who knew the truth appeared, and tried to get Shiki in his power. Is it a mysterious spot or unhappy desire that lurks in her mind?\nStory 02: Kioku no Ashioto - The Footsteps of Memory)\nThis is the story about Shouko and the almost tragic moment that changed her life and emotions …\nStory 03: Shikeidai no 72-jikan - 72 hours of death stand\nFive young people receives a letter saying that they murdered someone and they must go to the address in the letter if they don't want other people to found out. They all find themselves in a old European house, where a crazy lady tells them that one of them is a murderer and if that murderer don't confess in 72 hours, they will all die."},{"name":" Seijou Kouchakan no Jijou","avatar":"https://mangadex.org/covers/a25a411d-4e97-42f4-a2d1-b32c88c092f2/37cbcb50-2ca4-4765-b80f-34b0f5c67c88.jpg.256.jpg","country":"Japanese","stat":"6.72","status":"Completed","tags":["Genderswap,Comedy,Boys' Love,Girls' Love"],"nutshell":"Shino asks his best friend Akira to help set him up with Maruyama, the girl of his dreams. Unfortunately, Akira ends up taking her for himself.\nDepressed, Shino heads down to a black tea shop run by a guy named Shuuji to drown his sorrow by pigging out on cakes. Sometime in the past, Shuuji had a spat with a friend or something (referred to only as “that guy”) who thinks the best way to make up is send mysterious unmarked packages of randomly selected tea. I guess he has a history of sending dangerous gifts, as Shuuji gives Shino the tea “on the house” to see if it’s poisoned. Well, the tea appears to have been laced with a genie, who promptly grants Shino his desire to be with Maruyama… But be careful of what you wish for…"},{"name":" House of Dolls","avatar":"https://mangadex.org/covers/a25fe2a6-cab5-4a2d-b63b-c3968b17ee00/19646014-0e17-423c-8bae-f56baf605e62.jpg.256.jpg","country":"Korean","stat":"7.75","status":"Completed","tags":["Psychological,Long Strip,Romance,Drama,Horror,Web Comic,Supernatural,Mystery,Tragedy"],"nutshell":"The mysterious woman, and those who are controlled by her. Don’t be fooled by the devilish hidden grin! The legendary hit author, Lee Jongkyu and the god artist Rigeng’s full length webtoon."},{"name":" Maria","avatar":"https://mangadex.org/covers/a260e723-dcf2-4288-896e-4eb8bef07782/18da74dd-5795-4eff-bbb0-cb8991ef520b.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"Maria is a girl attending a Christian private school. Her mother is sick and in the hospital, her family poor. They live off the money of a man whose identity is unknown to Maria. He is called “Daddy Long-Legs” and he supports Maria and her mother with only one fee: Maria becoming his bride. Just who is this mysterious man? Is it the doctor? Someone she does not know? A boy from school…?"},{"name":" Spirit of the Ocean","avatar":"https://mangadex.org/covers/a264ed75-7ef6-4ec4-be3f-f1f9c8695cc7/7fafbb74-a654-456e-980a-c4ff168ac184.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.07","status":"Completed","tags":["Historical,Action,Romance"],"nutshell":"This fantastic story takes place in the incredible Ming Dynasty of Imperial China. Ning Haier is a reckless pirate girl whose father is the leader of Ning Citadel – the most powerful pirate den of the Southern Sea. One day, Haier led a band of pirates and looted a Spanish ambassador ship while her father was away. There she met a very handsome English man named Michael, who was a very talented translator and an extremely intelligent merchant on the ship. Marveled by Haier's beauty and character, Michael attempts to win over Haier's heart but failed! However, opportunity arose when Haier was captured by the new governor named Shao Zhixun, who vowed to annihilate piracy from China's seas forever. Michael was able to convince Shao Zhixun that Haier is just an innocent maiden who was impressed into piracy… and Shao Zhixun arranged a position for Haier in his own household! Even more interesting, Haier's father captured Michael and planned to collaborate with the charismatic and capable young man, and offered Haier as Michael's bride!"},{"name":" Koi Neko","avatar":"https://mangadex.org/covers/a271a9bd-eb46-4c40-b773-a2b0070b3b63/fd508f75-2ed6-483c-aa06-059ba04f75bf.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life,Supernatural,Mystery"],"nutshell":"Shinta likes to play with cats even though he cannot have one for a pet because of his father's allergies. Cats also like to play with Shinta… in more ways than one… including becoming Shinta's girlfriend and generally trying to get him to reciprocate their catcalls, literally."},{"name":" Kokou no Bocchi Reijou wa Hatsukoi Ouji ni Furaretai","avatar":"https://mangadex.org/covers/a277ce15-bc19-43c8-bc93-2c99e95b6ac2/8023ea40-1da5-4a38-bf1e-e0e85500b0f9.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Ongoing","tags":["Romance,Comedy,Fantasy,Adaptation"],"nutshell":"\"I-I'll lift your curse.\"\nThe lonely young lady Lurie was suddenly brought the news of her engagement to the Crown Prince! The ladies who were his highness' fiancée candidates were cursed one after another, so Lurie was offered a contract engagement as a counter measure counter, but... For Lurie, who longs for him and lives a secret life, his existence is too dazzling-?! A romantic comedy about the engagement of a cursed crown prince and a monster-user young lady!"},{"name":" Shin Hyataro of the Ushiro","avatar":"https://mangadex.org/covers/a27b0456-0a48-4765-8cc1-8329f99be820/d04a72b7-f37e-4540-a099-95d7f8efb93b.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Thriller,Monsters,Demons,Psychological,Ghosts,Animals,Romance,Comedy,Survival,Adventure,Magic,Drama,Horror,Fantasy,Slice of Life,Supernatural,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\n\"Hyataro of the Ushiro \" returns with a sequel!\nJunior high school student Ichitaro Ushiro is involved in a series of mysterious phenomena as if guided by his guardian spirit, Hyataro.\nThis time, he is guided by a mysterious girl, Miu Fuka, to visit the \"Parapsychology Research Institute\", which researches spirits, and is again involved in mysterious phenomena....\nIchitaro, Hyataro, and their dog, Zero, a psychic dog. The three of them must work together to unravel the mysterious phenomenon!"},{"name":" Boukenka ni Narou! Skill Board de Dungeon Kouryaku","avatar":"https://mangadex.org/covers/a28036e8-cdd4-4f43-8fa8-1f5469e40d3f/8d502c74-3876-40bb-9e54-1e996dbea026.jpg.256.jpg","country":"Japanese","stat":"7.62","status":"Ongoing","tags":["Monsters,Action,Comedy,Adventure,Post-Apocalyptic,Magic,Fantasy,Adaptation"],"nutshell":"Karaboshi Haruki has no presence as far as can be recognized, and so he became an adventurer with only the desire to \"stand out.\" One day, a dungeon appeared under his home in Hokkaido. Coincidentally, he picked up a \"Skill Board\" with which he can spend skill points to increase his growth rate. Is it possible to become a popular person by obsessively diving into your home dungeon everyday?\nBased on the popular fantasy Light Novel: \"Become an Adventurer,\" winner of the 6th Net Novel Grand Prize."},{"name":" Kaikan Douki","avatar":"https://mangadex.org/covers/a2815930-6fab-46b0-9ee3-c24c34956c61/9f39da0e-d8ea-47a2-a6bc-ee0d39f09cbb.jpg.256.jpg","country":"Japanese","stat":"7.43","status":"Completed","tags":["Romance,Comedy,Harem,Drama"],"nutshell":"Niwa Tasuku working at Sanden Printing Company for 2 years now but still can't get along at all with with Yukino Tsumugi, a female colleague at the DTP department. Their colleagues try to 'break the ice' by inviting them out for drinks but later that night, they ended up in a love hotel. A strange \"connection\" is made between these two, one that would 'link' them during the most private thoughts and moments!"}]