[{"name":" 🍑JK","avatar":"https://mangadex.org/covers/4cb9dc84-3b66-4770-b547-d3b3e7e12f38/aa34f050-6a1d-4115-b461-5a74ea6080e9.jpg.256.jpg","country":"Japanese","stat":"7.41","status":"Completed","tags":["Oneshot,School Life,Web Comic,Slice of Life"],"nutshell":"You can see her ass. That’s the joke."},{"name":" Whipping Boy","avatar":"https://mangadex.org/covers/4cbb8833-5068-4b74-9068-1e8b7e683699/e5861e88-cceb-40ec-be23-505da2c7510b.jpg.256.jpg","country":"Korean","stat":"8.00","status":"Ongoing","tags":["Boys' Love,Drama,Mystery"],"nutshell":"You are the last warrior of the destroyed tribe.\nYou, riding a wolf and running in the mountains and fields, crawled like a dog.\nAnd you become the beaten child (whipped boy) of the youngest son of the family, Ban Ok-yeop Ban, who played a big part in destroying your tribe… … ."},{"name":" Please Don't Call Me Queen!","avatar":"https://mangadex.org/covers/4cbcecbc-e626-44ff-b4c9-934e5f699b5f/b20d3fd9-c7b5-4b1a-baf3-77ead41a75a6.jpg.256.jpg","country":"Japanese","stat":"7.50","status":"Ongoing","tags":["Romance,Comedy,Reverse Harem,Fantasy,Adaptation"],"nutshell":"A recluse becoming Queen?! In a contest for the throne with scions of noble families, I’ll do everything in my power to avoid getting embroiled in it!\nIn the Kingdom of Lindtor, renowned for being governed by a wise ruler, I, Francesca, am the King’s granddaughter ― a homebody who delights in chess and staying indoors. However, in the wake of my grandfather’s sudden demise, it’s revealed that he nominated me in his will as a Queen candidate.\nWhile I was stricken with panic, several young noblemen competing to become sovereign appeared before me: the radiant yet overbearing Stewart, the highly intelligent Cyan, and the captain of the knights, Irvine. “Please choose the King from amongst them!” I struggle hard against it, but my efforts are futile. Furthermore, 「I pledge my allegiance to you, my Queen.」 Is that supposed to be an oath, or a marriage proposal?\nI’ll get back my peaceful and tranquil days!\nWhat will result from this shut-in princess’ desperate resistance――?"},{"name":" Chasing the Wave","avatar":"https://mangadex.org/covers/4cc06a26-6e3f-4e57-97d5-2783aa863df1/1a34cef1-83d4-406e-a50e-c85d31660665.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.92","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Web Comic,Full Color"],"nutshell":"A mature and reliable Leader x A pure and frivolous Bubbly guy\nSui Yi claims that Ning Lan hasn't spoken a word in truth, and later discovers that even his \"I don't like you\" was a lie. He was crazy to consider this person as kind solely based on his pure and naive smile. His clear eyes were just like those of that person's..."},{"name":" Love Stories Between Different Species","avatar":"https://mangadex.org/covers/4cc14713-e34c-456f-a8a1-a07084240199/ef48be68-651f-4843-9a11-c74e5df4da13.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Ongoing","tags":["Oneshot,Romance,Anthology,Fantasy,Supernatural"],"nutshell":"Volume 1:\n\nSekai no Sumi no Operetta (Yoshimura)\nMajo no Naritachi (Aikawa Yuu)\nScrambled Eggs (Tabe Taberi)\nBoku wa Kabutomushi (Yamashiro Umeta)\nWarui Majo no Shiwaza (Nobara)\nSlime ga xx ni Naritasou ni Kochira wo Ikaryaku (Moukon Icchokusen)\nSukoyaka naru Toki mo, Yameru Toki mo, Dragon naru Toki mo (Sanzou)\nDaisy, Mata Ashita. (Nagabe)\nMajo no Suu to Chiisana Mandragora (Shinagawa)\nOwari made (Yasaka Akiwo)\n\nVolume 2:\n\nSekai no Sumi no Operetta (Yoshimura)\nNaminami Kitsune (Tabe Taberi)\nKanojo ga Hoshii Mono (Nobara)\nKinchou suru to Koe ga Uragaeru Sakana no Hanashi (Shinagawa)\nOokami Ningen to Ningen Ookami. (Nagabe)\nCotton no Mahou (Mogusu)\nKuroyagi no Ochakai (Takayama Shinobu)\nKimi to no Nenrin (Kamikou Chizu)\n\nVolume 3:\n\nOlivia to Gryphon (Akutagawa Kazuma)\nWatashi to, Ie (D. Kissan)\nMagnolia (Sumiyoshi Ryou)\nHijoushoku to Gochisou. (Nagabe)\nUzumaki Cosmo to Manager (Sanzou)\nAru Kakan no Omoide (Ogata Tomio)\nCurry no Iu Toori! (Yamaguchi Tsutomu)\nSensei to Onjin-san (Hachi)\n\nVolume 4:\n\nShiraito no En (Akutagawa Kazuma)\nCLAYTURE (Kuma)\nTokage Hime (Kimizuka Shou)\nOnna Kishi-san wa Ookami-san ni Umoretai (Usatoru)\n龍愛でる男 (Sanzou)\nMayonaka no Waltz (Nagabe)\nKoi wa Bouken (Yamaguchi Tsutomu)\nSekai no Sumi no Operetta (Yoshimura)\nJingai-san no Yome: Tsukieda Yoshino no Kekkon (Yasaka Akiwo, Aikawa Yuu)\n\nVolume 5:\n\nFutari Issho ni Milk no Hibi (Yoshimura)\nShoujo to Cyborg (Pepu)\nDefinisi (Tabe Taberi)\nAqua Terrarium (Inukai Bino)\nNanoka no Tenshi (Sanzou)\n魔本のはなし (Ogata Tomio)\nJingai-san no Yome: Tsuchikiyose Tetsushi no Kekkon (Yasaka Akiwo, Aikawa Yuu)\nShiro no Ousama. (Nagabe)"},{"name":" Slope Mansion ni Okaeri","avatar":"https://mangadex.org/covers/4cc28327-2cb2-4727-b1d8-917556260b08/be0ee3ba-7b76-4261-aff5-090818893da2.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Drama,Fantasy"],"nutshell":"“It is said, there are other worlds than the one we live in… One of them is the fairy world.”\nMy parents divorced when I was very young. I didn’t even remember what my father looked like. When I turned 14 years old, Mom finally let me go to Dad’s place. But what I found there wasn’t Dad, but a young man and a garden full of fairies, just like in Dad’s paintings…"},{"name":" Embracing Me Over the Balcony","avatar":"https://mangadex.org/covers/4cc303f9-84d5-4108-913a-25c167abdd0d/58a4bff9-8ac3-4a60-be3e-7ec412eb2b80.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Romance"],"nutshell":"\"I don't have confidence I won't do anything to you if we spend the night together.\" Haru said as he blushed. Yukine was then kissed by Haru's hot lips, making her body melt rapidly!Yukine Arisugawa, a junior from the literature department at university lives next door to Haru Shinonome in her apartment. By chance, they end up having dinner together frequently. The two late-bloomers both enjoy reading and become closer steadily... Yukine feels more and more relieved when seeing Haru. This is the first time she has felt this way... What exactly is this feeling?"},{"name":" Haken no Kouki Altina","avatar":"https://mangadex.org/covers/4cc3324e-f15b-4684-8b99-bc4d0ab495aa/19711a8a-e379-4c0f-b0f9-5929ed37f90c.jpg.256.jpg","country":"Japanese","stat":"7.46","status":"Completed","tags":["Action,Romance,Adventure,Harem,Drama,Fantasy"],"nutshell":"Regis Ulrich is an incapable soldier; bad at both sword and archery, who passes the time by only reading books. While transferring to a remote region post, he meets a girl who turns out be the red hair and crimson eyed princess Altina, the wielder of the great sword \"Grantneil Catoll.\" Despite being only fourteen years old, she was appointed to become the commander of the army in this remote region simply because she was the illegitimate child of the Emperor. However, she continues to pursue her dream of becoming Empress despite the circumstances that surround her. To achieve this goal, she asks Regis to become her tactician and stand alongside her against the obstacles that are sure to come."},{"name":" Sumire Hakusho","avatar":"https://mangadex.org/covers/4cc4db02-7ad9-4d08-a634-f76c604b69d1/a06ba618-403c-415d-ab4e-18b941678a3c.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Romance,Drama,Slice of Life"],"nutshell":"Japan in the sixties, Sumire, a twenty-year-old woman, works as a saleswoman in a department store. She refuses to depend on a man to live and sees her own body as a weapon to create herself a place in society. A contract to guarantee her freedom, to fight against this machismo that hinders women. But can one protect oneself from human nature and one's own feelings?"},{"name":" Watashi no Kidou","avatar":"https://mangadex.org/covers/4ccc3781-b181-4f22-9bf0-ec62874b2fc7/62086e34-74cf-421d-ac0f-9ac4862984e5.png.256.jpg","country":"Japanese","stat":"7.59","status":"Completed","tags":["Oneshot,Sci-Fi,Girls' Love,Drama"],"nutshell":"The end of the world is coming and a bunch of girls gather on the roof to greet their death."},{"name":" Hibike! Euphonium - BYE BYE, See You Next Time! (Rubicon) (Doujinshi)","avatar":"https://mangadex.org/covers/4cce38c8-339d-4f72-8fb5-b23c43cefe01/4276206e-70c4-4b75-88e3-599cd3ec4312.png.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Comedy,Girls' Love"],"nutshell":""},{"name":" Sex=Love²","avatar":"https://mangadex.org/covers/4ccff42d-c02a-4908-aa15-04c5ff119d11/443cb98a-3e24-4ae5-8274-1bb45732ea1b.png.256.jpg","country":"Japanese","stat":"7.54","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"All Kumiko wants is to become a teacher; however her father is dead set against it. He is giving her one chance to prove herself as a teacher before forbidding her from pursuing this career forever. Meet her newest student, Ryu-kun. He has NO desire to LEARN anything from his tutors, rather he is an expert at teaching THEM about…SEX?!"},{"name":" Touhou - Kaze ga Otoshita Kajitsu no You na (Doujinshi)","avatar":"https://mangadex.org/covers/4cdb75e4-2ac4-4fd7-b9d1-74832487fcec/cb9cb3e3-bda2-43e0-8741-b6faabfa4994.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Fantasy"],"nutshell":"Flandre Scarlet wants more stuffed animal. So she went out. But she didn't do it a simple as you think, furthermore considering her power. This will mean trouble"},{"name":" As Christmas Draws Near","avatar":"https://mangadex.org/covers/4cdf6f18-afda-4a38-9b73-2481c2e361c0/ec8913b0-0205-456d-89b4-5a1c8cdf2e69.png.256.jpg","country":"Japanese","stat":"8.32","status":"Completed","tags":["Oneshot,Romance,Comedy,Web Comic,Slice of Life,Gyaru"],"nutshell":""},{"name":" The Story of How I Became a Girl's Dog","avatar":"https://mangadex.org/covers/4ce6a688-e4ed-4544-b351-add295e07622/5e2fe290-3e95-47e6-b878-4ce69d6569f3.png.256.jpg","country":"Japanese","stat":"7.61","status":"Completed","tags":["Oneshot,Comedy,Web Comic,Slice of Life,Full Color"],"nutshell":"Mangaka's Twitter\n Mangaka's Pixiv\n Mangaka's FANBOX"},{"name":" Black Man and White Woman","avatar":"https://mangadex.org/covers/4ce70423-5fa8-41a8-8143-fb986e2b4c2b/0d21df40-2c16-4630-8f49-b492aa969ba0.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Completed","tags":["Psychological,Long Strip,Romance,Drama,Web Comic,Full Color"],"nutshell":"Hyeonu, a man who lives a hermit life because he is afraid of people.\nMong-wol, a woman who keeps away from the gaze of others because of her white hair.\nRelationship Improvement Trauma Overcome!\nNote: Synopsis via Google translate\n\n• Alternate Raws: Comico, Naver Series, Kakaopage, MComics"},{"name":" Anata ga Watashi to Kurashitara","avatar":"https://mangadex.org/covers/4ce7421e-949c-407b-8d47-4dd996763233/88008182-9a6e-4d1c-8d6d-1d511bceb3a1.jpg.256.jpg","country":"Japanese","stat":"7.54","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"From Midnight Scans:\nWhen you’re in a relationship with someone, truth is, it’s a complete necessity to live together with that person. Read this masterpiece that sketches out various couples’ trembling hearts in this “living together”-themed compilation.\nRoom 1\nMomochi, a short haired lass is in love with Kouta, a 2nd year student in her university. However, she found out that Kouta likes girls with long hair and so happened that her friend was able to invite Kouta for the drinking session that she was supposed to go! She bought a long hair wig in order to attract Kouta but when they're making love, trouble arises?!\nRoom 2\nSaki was invited to live together with her boyfriend, Masaya who works as a weekly publication reporter. Although they're living together, Saki doesn't see him much at home and starts to get lonely. One night, she woke up and found Masaya sleeping in the living room…?\nRoom 3\nTsukiyama has a crush on Kanaya and likes him because of his kindness towards her. One day, her roommate kicked her out of the apartment they were sharing because her roommate's boyfriend is coming back so she had to find her own apartment to live in. Tsukiyama went over to Kanaya's apartment and asked if she could stay there for a month. As they live together, Tsukiyama's feelings began to deepen and she had a feeling that she was restricting Kanaya so she decided to move out?!\nRoom 4\nMayu is a designer that works at home. She hired an assistant who then turns into her lover. However, Mayu likes guys who are good with cooking and sadly, Yoshitaka isn't like that. Although she's quite disappointed with that fact, she likes the sex with Yoshitaka. But still, she's quite dissatisfied with \"something\" and decided to look at some vibrators…\nRoom 5\nThis story revolves around Mamiko (Tsukiyama's friend from story 3) who was awaiting for the return of her boyfriend who was studying abroad but her boyfriend cheated on her with a blond chick and thus, they broke up. Mamiko was heart broken and then, she suddenly met a foreigner by the name of Joshua, who needed a place to rent. The last thing that Mamiko wanted to see is a person with blue eyes. Still, she let him rent the room in her apartment and as they live together things starts to change…\nRoom 6\nIn order to help her friend, Midori decided to live in Mai-chan's apartment. Mai-chan decided to leave that apartment because she want to get away from her ex-boyfriend who so happen to live next door as well. When Midori moved in, she noticed the huge hole in one of the rooms and of course, which apparently leads to her neighbor's room next door. As she greeted the rumored ex-boyfriend of Mai-chan, she was captivated with the handsome lad and began to fall in love with him. But why did Mai-chan broke up with this kindhearted guy? Who exactly is he? Midori have to find out, all this through that captivating hole…\nLast Room\nA tiny extra story regarding to the Room 6 story~"},{"name":" Medorism: Fate Tanpen Sakuhinshuu","avatar":"https://mangadex.org/covers/4cebfd41-d231-4e26-968a-6b5807d30488/dd4d8860-1b67-44c9-ac05-f43ddf98bc74.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Comedy,Anthology,Magic,4-Koma,Slice of Life"],"nutshell":"Collection of short stories based on Fate/Stay Night and Fate/Hollow Ataraxia."},{"name":" Seishun Occult Teen!","avatar":"https://mangadex.org/covers/4ceea53b-cf0f-45a3-95fd-34c727fe439b/36bfcd09-e808-4875-a4db-8e00e27b819d.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Ongoing","tags":["Comedy,4-Koma,School Life,Slice of Life,Supernatural"],"nutshell":"Right after the spiritually sensitive Takasago Daidai enters high school, he's haunted by the mysterious ghost Sakuma Jun. They'll solve the mysteries of the school and get Takasago his untroubled school life back!"},{"name":" Katekyo Hitman Reborn! - Tell Him (Doujinshi)","avatar":"https://mangadex.org/covers/4cf3c537-cf86-41f7-b4fe-d90a5fb519a0/6dd88cb0-2ce9-4c61-a2ad-de10cbb21b1e.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":"Pairing: Xanxus x Squalo"},{"name":" Our Red December","avatar":"https://mangadex.org/covers/4cf904fc-5800-4a2b-bf8c-8a1fbf2af2de/72aa07e4-ea58-421f-b182-95bedba9f4dd.jpg.256.jpg","country":"English","stat":"7.85","status":"Ongoing","tags":["Psychological,Boys' Love,Drama,School Life,Music"],"nutshell":""},{"name":" How to Become a Dragon","avatar":"https://mangadex.org/covers/4cf926f6-4524-48d2-9502-154e5f76efdc/42b49fb2-cd4a-4cd3-b535-5b7048eadc05.jpg.256.jpg","country":"Korean","stat":"8.06","status":"Ongoing","tags":["Long Strip,Magic,Fantasy,Web Comic,Slice of Life,Supernatural,Full Color"],"nutshell":"What should you do when a 1000-year-old imoogi named Bari suddenly appears in your apartment and demands you pay for the sins of your ancestors? Help him become a dragon, of course! Young Yoo's life is on the line as he teaches Bari the ins and outs of getting along with humans in order to prepare for the Nakdong River Dragon Exam. Will Young be able to help Bari pass the exam and become a full-fledged dragon?"},{"name":" Hakaku no Yachin","avatar":"https://mangadex.org/covers/4cf957ab-2732-4419-916a-6c5387b38ad5/d9c3913b-6cf2-4bbc-96bc-31f79952f278.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Psychological,Ghosts,Drama,Slice of Life,Mystery"],"nutshell":""},{"name":" The Heart of Red Cloak","avatar":"https://mangadex.org/covers/4cf965d2-2415-4480-8efc-b880b69c8dc8/308d4c85-7149-4b88-b0c7-67b05a1725bd.jpg.256.jpg","country":"Korean","stat":"8.13","status":"Ongoing","tags":["Animals,Long Strip,Romance,Boys' Love,Fantasy,Web Comic,Full Color"],"nutshell":"Centuries ago, wolves were cursed with an endless hunger and the only way to break it is to devour the heart of a Red Cloak.\nEspañol\nHace siglos, los lobos fueron maldecidos con un hambre interminable y la única manera de romperla es devorar el corazón de una caperuza roja, las cuales siempre han sido mujeres. Pero está vez las cosas son diferentes, el lobo se encuentra con un caperuzo rojo. Qué pasará entre estos dos? El lobo será curado de su maldición?"},{"name":" Alice in the Country of Hearts ~Wonderful Twin World~ Deluxe Booklet -Mad Twins Story-","avatar":"https://mangadex.org/covers/4cfe9f13-1ea1-4612-a656-13614b85506b/1859d90b-580e-4596-9397-216225c84e0a.png.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Oneshot,Romance,Video Games,Fantasy"],"nutshell":"This one-shot is meant to be read after having played the Mad Egg Twins' route in the game, \"Heart no Kuni no Alice ~Wonderful Twin World~.\nAlice is in a relationship with Humpty, yet it seems Dumpty hasn't given up and Alice is attracted to both of them. How will these multiple attractions play out?"},{"name":" Gepetto","avatar":"https://mangadex.org/covers/4d01eabf-4991-4548-a7dc-d20771b94a7d/011877ec-b425-436a-8936-94f4b0083b93.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Completed","tags":["Action,Long Strip,Drama,Mystery,Tragedy"],"nutshell":"After a decimating war against the androids they had built, humanity, though victorious, was forced to start living in shelters, isolated from the wastelands of the rest of the world, created by the damage the confrontation brought to the world. Dr Gepetto, one of the brightest android creators of his time, died and left behind an inheritance of untold proportions, the only clue as to how to get it being a blue haired android the old man had built and preserved for as long as possible even after his death. The android was reactivated, and she's attempting to escape the grasp of the new government. And a hunt for the inheritance begins.\nNote: The author has explicitly split the storyline into multiple seasons. These seasons are represented by the Vol.#."},{"name":" My Fiancé is a Monster?!","avatar":"https://mangadex.org/covers/4d04342e-c257-4aaf-86b3-aa76fbd57211/3b111547-d1d8-4ea0-86f3-071d34fd2970.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Comedy,Fantasy,Supernatural"],"nutshell":"Hitomi Miku goes to live in a mysterious house, where she meets Rauto, the young and sexy master of the house. There, she discovers that the house is full of monsters! Rauto gives her a special necklace, and she suddenly transforms and knocks out an evil monster who had possessed a girl! What's going on? Becoming Rauto's maid and fiancé? \"I'll knock out everyone's heart.\"\nIncludes the Hoshi no - W - Oujisama story in vol. 2."},{"name":" Prince of Silk and Thorn","avatar":"https://mangadex.org/covers/4d0c732b-c233-4496-a786-2fd131c11b4c/7d826c7c-b281-4857-85d0-37b0d96e4d3e.jpg.256.jpg","country":"English","stat":"7.85","status":"Cancelled","tags":["Historical,Long Strip,Romance,Fantasy,Supernatural,Full Color"],"nutshell":"Como princesa de Krashna, Maeva sempre fez o que quis. Mas quando a enviaram para se casar com o terceiro príncipe de Jora, Haruk, não teve muitas opções a respeito. Um acordo que impediria a guerra com outro reino, é seu deve como princesa se casar para solidificar a aliança entre Jora e Krashna. Porém, o príncipe mostrou ser pouco entusiasmado, preguiçoso, aparentemente sem emoções e extremamente desmotivado. Ainda assim, Maeva espera ser próxima a ele e ganhar seu amor pelo bem das relações diplomáticas entre os países. Ainda que ela não possa afastar o pressentimento de que algo está errado... Talvez haja algo mais por trás disso."},{"name":" Touhou - The Immortals vs The Black Hole (Doujinshi)","avatar":"https://mangadex.org/covers/4d0cf27b-445e-4bab-b151-61a57fa4ec4a/92aeea08-9885-4a7e-9c12-f95e801d8492.png.256.jpg","country":"Japanese","stat":"8.28","status":"Completed","tags":["Sci-Fi,Comedy,Adventure"],"nutshell":"Mokou and Kaguya fall into a black hole, shenanigans and scientific discussion ensue.\nLinks:\n\nAuthor's Pixiv\nAuthor's Twitter"},{"name":" Dragon King's Chef","avatar":"https://mangadex.org/covers/4d0d1e50-f744-455a-a001-c4015a415f87/29d2725a-3a60-4752-ba51-2bb949c4f3b4.jpg.256.jpg","country":"Korean","stat":"8.48","status":"Ongoing","tags":["Historical,Monsters,Long Strip,Romance,Comedy,Adventure,Isekai,Fantasy,Web Comic,Cooking,Supernatural,Adaptation,Full Color"],"nutshell":"Shim Cheongi threw herself into the sea of Indangsu! What will happen when she wakes up in a lazy dragon's dungeon? Meet many cute monsters while living a delicious, symbiotic life!\n\n\nOfficial Indonesian Translation"},{"name":" Yurucamp △ - Housecamp (Doujinshi)","avatar":"https://mangadex.org/covers/4d0da929-1b1b-48d5-9678-fd43b0cf7d10/0b3f6aa2-d3c6-479d-baf6-69445ebc55a5.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Ongoing","tags":["Comedy,Adventure,Slice of Life"],"nutshell":""},{"name":" Koutei Heika no Osewagakari","avatar":"https://mangadex.org/covers/4d11af03-7cee-4728-bb14-c60cfbd593b7/a1c80dee-c8b9-4d01-9cef-bb5e4200c6ce.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Historical,Romance,Fantasy,Adaptation"],"nutshell":"\"As a court lady, I will do my best!\"\n17-year-old Lin Feng, the daughter of the Right Prime Minister, is forced to participate in the ceremony to select an empress for the 5-year-old emperor. However, her babysitting and musical skills catch the eye of the highest-ranking councellor, Cang Lian, and she is assigned to work in the imperial palace as a novice court lady.\nA Chinese-style palace caretaker fantasy begins!\n\nOriginal Web Novel"}]