[{"name":" Homeless Tensei: Isekai de Jiyuu Sugiru Jikyuu Jisoku Seikatsu","avatar":"https://mangadex.org/covers/607f0bbc-e36d-46af-9efd-b74a40cbbe9d/9db3088a-1047-4066-820e-8410331a15e6.jpg.256.jpg","country":"Japanese","stat":"6.26","status":"Ongoing","tags":["Monsters,Romance,Adventure,Magic,Isekai,Fantasy,Adaptation"],"nutshell":"Shinichi Tanaka is a homeless man who is good at dumpster diving. Because he's a pennyless bum, there's no help for it. He's going to try and pick up some trash to survive another day.\nWhat is this?\nMonsters and a Dungeon? In Tokyo?!\nA homeless man finds himself suddenly reincarnated in another world. His second life starts now based out of a hidden room deep in a dungeon.\nweird and turbulent adventure of a 56 year old homeless man who reincarnates into a different world."},{"name":" Kusakabe-kun Another","avatar":"https://mangadex.org/covers/60809da4-1b9e-4176-86b0-c92cbcf3f1b4/9b5f1d3f-0446-4b27-91ba-aa6392f2b797.jpg.256.jpg","country":"Japanese","stat":"8.43","status":"Ongoing","tags":["Genderswap,Romance,Comedy,Office Workers,4-Koma"],"nutshell":"The scary faced loner Kusakabe who works in sales and the quiet office lady Hoshino accidentally end up in each other's bodies.\nA 4-panel love comedy.\nNote: This series was a doujinshi that is now published in Manga Time Jumbo (Houbunsha)\nAuthor’s Pixiv about this series"},{"name":" Persona 4","avatar":"https://mangadex.org/covers/60846bad-6ab6-449f-98f8-6bd615e99974/7bbc4961-7091-4267-9d40-e76ec8f70c35.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Thriller,Monsters,Action,Demons,Psychological,Animals,Romance,Comedy,Crime,Survival,Sports,Adventure,Video Games,Philosophical,Drama,School Life,Fantasy,Delinquents,Police,Slice of Life,Supernatural,Mystery,Adaptation,Tragedy"],"nutshell":"Persona 4 takes place in the same universe as Persona 3 in a rural town named Inaba. There have been mysterious murders occurring whenever there was fog after heavy rain. There were also rumors about a channel on television airing only at midnight called Mayonaka TV, during which it is said that one can see his/her \"other half\" when staring at the TV screen. After hearing about a recent unsolved murder which occurred during the fog, the characters—the main character, Chie, and Yōsuke—discuss how each of them had attempted to watch the mysterious TV channel and witnessed the murder victim.\nThe protagonist later realizes that during midnight when the channel is on, his body can phase into his television set as a gateway to enter another world infested with shadows. After discovering this, they all decide to explore. When first completely entering the world, dazed and confused, the main character meets Teddie. Mayonaka TV and the town murders seem to have a connection. The murder victims may be merely victims of Mayonaka TV. Everyone decides that they will together try to solve the mysterious murders by exploring the hidden world of Mayonaka TV. After the closing events of Persona 3 on January 31, 2010, Persona 4 starts April 11, 2011, Putting the start of Persona 4 fourteen months after the end of Persona 3, this is also evident by the appearance of an older Chihiro, who is now a 3rd year student."},{"name":" Bakuretsu Tenshi: Angel's Adolescence","avatar":"https://mangadex.org/covers/608ceab6-b924-4d3f-95d2-5a874f543f78/86f85129-5ee6-4b21-8cab-536dc5c0e69e.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Action,Girls' Love"],"nutshell":"Meet Takeru, an ordinary boy who's always bullied because of his lack of self-confidence. What will happen when one day two mysterious girls show up in his room seeking shelter from a group of blood-thirsty thugs? Discover the changes in Takeru's life after meeting two girls that are definitely more than what meets the eye in Bakuretsu Tenshi.\nBakuretsu Tenshi: Angel's Adolescence is a prequel to the anime Bakuretsu Tenshi."},{"name":" Touhou - The Weak One (Doujinshi)","avatar":"https://mangadex.org/covers/60925996-1787-4aa5-94ad-9fefb4fa788e/126f0248-c108-4f4d-b30f-aa0d91ba8cfa.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":"A Murasa x Parsee doujin."},{"name":" Supernatural Yuri Anthology - Nail-chan to Fukadzume-san","avatar":"https://mangadex.org/covers/6097feaf-ecdc-4f99-8833-99d265182c13/bf9401d7-9487-4222-b998-e7b1648a8e13.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Ghosts,Anthology,Girls' Love,Supernatural"],"nutshell":"what the title says. note, the title was translated from the title given by chinese translators."},{"name":" Sonna Kazoku nara Sutechaeba?","avatar":"https://mangadex.org/covers/609ccb17-fd83-4126-876a-5bf8c037b065/f84aa5e5-532d-45ce-9af2-7f5f3fd6d326.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Ongoing","tags":["Drama"],"nutshell":"\"My wife made a rule for our home: 'Don't talk to Dad.'\" \"Isn't that domestic violence? Weren't you sending me an SOS for help?\" Reitarou Shinotani has been long ignored by his wife and daughter, left all alone, and forced to do nothing but eat and sleep in a small, dark, cramped room in the house. What fate awaits him, as he aims to revitalize his family...?"},{"name":" Demashitaa! Powerpuff Girls Z","avatar":"https://mangadex.org/covers/609da7ab-805e-4613-99ec-f486ed56bec9/381576f3-e8e7-469d-a206-6125ad2b6215.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Action,Romance,Comedy,Drama,School Life,Fantasy,Supernatural"],"nutshell":"Blossom (Momoko), Bubbles (Miyako) and Buttercup (Kaoru) are three normal girls, living in a peaceful town. Suddenly, a big ice mountain arrives in Tokyo, and when Ken accidentally breaks it, both good and evil powers comes out of it. When the three girls got hit by this strange power, they turned into transforming super heroes, who promised the mayor to protect Tokyo. However, the black power hits several animals, and they all turn evil, especially the extra smart one, Mojo.\nIt's up to the girls now to save the day! Even if it means that the Powerpuff Boys Z will lift up their shirt or if they'll arrive in mortal danger! Get ready for a big adventure!"},{"name":" Dragon Quest: Tale of Heaven","avatar":"https://mangadex.org/covers/60a00615-d1cb-480b-aec1-83019e00eb76/7baf42a0-d7a2-4cf6-98bc-abcaff1cf119.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Monsters,Action,Comedy,Adventure,Video Games,Drama,Fantasy,Slice of Life,Adaptation"],"nutshell":"Manga based on Dragon Quest V.\nA boy traveled the world along with his father, Pankraz. After the death of Pankraz, he is a slave forced to undergo hard labor in the building of a temple. Ten years later he finally escapes and starts a journey to find his mother, who is said to have died soon after he was born. She came from Elhaven and hence had the power to tame monsters."},{"name":" Kuroko no Basket - Hikari e.p. (Doujinshi)","avatar":"https://mangadex.org/covers/60a4721a-c149-4005-81f5-0762c0a321e9/2de9788f-a37d-421a-a436-b64b9391e2da.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Boys' Love,Drama"],"nutshell":"Pairing: Kise x Kuroko\nKise finally meets Kuroko again after things went badly during their previous meeting years ago."},{"name":" \"Eiji\"","avatar":"https://mangadex.org/covers/60a6a418-cfaf-4078-aa86-0483f58c6337/9462657e-35d5-419f-9368-223026dcb12f.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":[""],"nutshell":""},{"name":" Derayd - Kaikyoutenbin no Tsuki","avatar":"https://mangadex.org/covers/60bc0ef6-6383-4867-92e3-d58e2b2d8caa/35dd243d-2759-4293-bce5-6679db723d86.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Romance,Adventure,Fantasy"],"nutshell":"Once the chaos took shape. The twin worlds were protected by the gods and goddesses. The things that drove the elements, the things that drove the energy and many things were divided. In this world called for twins constantly, and within it, there was time floating with the world of elements imbued with one another. The buoyancy and spirit guides, acted under the power of the gods most powerful to demonstrate the balance of power, the moon, the axis that supports it. Either way, these orders are completely unknown to welcome the world beyond. There is an old story about the two moons, the imbalance between the twins and the two warriors that will come with grace. The spirit of evil has come to break this, the name is the key to the imbalance of power.\nKenichi, a high-school student and member of a kendo club, walks back home when he sees that the moon has split in half! Just after which an earthquake leaves Tokyo in ruins. Kenchi is knocked unconscious, but hears a female voice saying he was the key to ending the demons in \"Twin World\". When he awakes, he finds himself in a parallel world of swords and witchcraft, where he meets the little fairy Bessy and a young swordsman called Ledan. After becoming friends they find they must work to save both worlds from demons and start a quest of two sacred objects that they need to save the world.\nnote: The manga has been reprinted in a normal tankoubon size with only Akiyama Tamayo noted as author."},{"name":" Mahou Shoujo Madoka★Magica - Magi✩cal (Doujinshi)","avatar":"https://mangadex.org/covers/60c11293-adec-4fb1-b5a3-342e99a46a3b/057bb666-abf3-4ce6-82c1-cd729cd3bc62.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Girls' Love"],"nutshell":""},{"name":" Springtime for Blossom","avatar":"https://mangadex.org/covers/60c328b1-98a5-402a-a163-01cf9225af65/9d718f36-5bac-40b4-b4a6-da6ee0bb611b.jpg.256.jpg","country":"Korean","stat":"7.69","status":"Completed","tags":["Long Strip,Romance,Comedy,Drama,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"Blossom is the prettiest girl in school,and she wants to live at my house!\nHas springtime finally come for me at last?\n\nNote: EN Toomics changed Blossom's hair color to blonde to have more appeal to the western audience."},{"name":" Akuyaku Reijou wa Gouman Hakushaku ni Kusshinai Gisu Kekkon de Chouai Nante Ariemasen!","avatar":"https://mangadex.org/covers/60c5a8c7-089d-4c9f-a118-6dffaa789d78/c77d8d05-a4ac-471e-8e9c-54af5974c5ce.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Fantasy"],"nutshell":""},{"name":" Welcome to Religion in Another World!","avatar":"https://mangadex.org/covers/60c8e9c1-d33c-4264-b825-07b99f035276/02b19687-a68f-4b4f-a22a-03cebb74ca5b.jpg.256.jpg","country":"Japanese","stat":"6.90","status":"Completed","tags":["Comedy,Isekai,Fantasy,Supernatural"],"nutshell":"Past the dreams there is a special world, where monsters and demons fight for supremacy, it so happens those same monsters and demons are also the objects of cult for religions in the real world. A victory in the monster world, means the success of a religion in the real world. Wahowaho is a new religion, aiming to the top, and while searching for their god they have summoned a clueless human boy. Toda Yuu was visiting a fan convention with his sister, he was looking forward the event for his favourite game, a phone gacha game with deities, but once he fell asleep things started to change in the real world."},{"name":" Touken Ranbu - First Sentimental (Doujinshi)","avatar":"https://mangadex.org/covers/60ca05c6-54de-431a-bb5a-1b6b15ff2c58/412ef980-2180-4101-a2de-c0bcdb700ba9.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Oneshot,Boys' Love"],"nutshell":""},{"name":" Tensei Seijo ni Isekai Slow Life","avatar":"https://mangadex.org/covers/60cbb5a8-2163-487a-bf21-284bc45e3c2d/bf5cc253-ab27-486a-a15d-6239fc8b5af5.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Monsters,Adventure,Isekai,Fantasy"],"nutshell":"Megumi, a high school student, loses her life when she is run over by a truck while helping a flower shop. Aureola, a goddess of another world, stood in front of the awakened Megumi, and another girl, Suria, who is standing beside Megumi. She was a human being in the world created by Aureola, and she was attacked by a dangerous demon and lost her life. Aureola asks Megumi to purify the world of the demon beast and to reincarnate as Suria for that purpose. Her purification method is \"Do what you like and be happy!\" Aureola reincarnates her into another world by telling Megumi (Suria) that she likes flowers, \"Grow flowers and be happy if your heart is filled. Then you can purify the world.\" Her awakened Suria (Megumi) is worshiped as a saint, and the flowers she grows are touted as miracle flowers. Can Suria, who spends her leisurely growing flowers and enjoying her second life, really be purifying the world...?!"},{"name":" Himitsu ni Shiroyo!!","avatar":"https://mangadex.org/covers/60cd78bd-2205-4d43-8aec-1a525d5302ff/1ed4c9ab-9b08-42bd-a3b5-0cb100421754.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life,Slice of Life"],"nutshell":"High school student Koshika, likes cute things since he was a child. He also has a secret hobby of crossdressing as a girl but was accidentally caught by his classmate Oozeki.\nTo prevent rumors from spreading, he kept him under surveillance by following him everywhere he goes."},{"name":" The Sir Knight Experience","avatar":"https://mangadex.org/covers/60d09b10-c954-4dc8-9567-1502fc41ee99/d31a0ed1-aa10-4fa6-8bde-5fd42e8ff4e7.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Oneshot,Romance,Slice of Life,Full Color"],"nutshell":"The story of an aging Gardevoir who, in an attempt to find love, makes a deal with a particularly dubious fellow."},{"name":" GridYuri Collection 1","avatar":"https://mangadex.org/covers/60d0e72b-6435-47c4-af4c-9561ce058825/dcdb84b3-0a31-4512-a3b8-fad461a5baac.png.256.jpg","country":"Japanese","stat":"7.38","status":"Completed","tags":["Girls' Love,Web Comic"],"nutshell":"Collection of short stories featuring Akane and Rikka from SSSS.Gridman."},{"name":" Tsuda Memo","avatar":"https://mangadex.org/covers/60dcbbb9-6877-4031-bca7-c80cf5e12c03/a9981520-2074-4fd7-b070-d003333fd0a7.png.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Oneshot,Boys' Love,Slice of Life"],"nutshell":"Short extra chapter about Tsuda and Endou from Endou-kun no Kansatsu Nikki."},{"name":" Warito Yokuaru Danshikouteki Renaijijou","avatar":"https://mangadex.org/covers/60e388a2-0561-454e-a2cf-70f57bcfebd0/a073eeeb-12cf-4794-8ede-7a33e95915f5.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"Welcome to Kinsei Private School: a respected, all-boys institution where it's rumored that ninety percent of the student body is gay (or bisexual). For the straight Nanase, this means constantly evading day-to-day advances from his love-struck classmates. Just what is a \"normal\" boy to do in this sea of abnormality? Enter Heiji, who proposes a unique solution to his senpai: namely, that he and Nanase pretend to be a couple, so as to deflect all of the unwanted attention. Sounds like a good plan, except that pretty soon Nanase finds himself performing all manner of embarrassing acts in order to keep up the \"ruse.\" What's wrong with this picture?!"},{"name":" Subete ni Iya Girl","avatar":"https://mangadex.org/covers/60e59633-1357-4a29-b56e-b531967becea/bea80754-f454-4d99-bb6c-2511d01a2c6a.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Hating girl is a manga about a girl with an arrow stuck through her head named Asumi, and the boy interested in her, named Ryouji. It's full of goofy humor and silly storylines, yet the relationship aspect of it touches on real life at times, and ends up quite endearing. Check out this silly-sweet manga and laugh at the insanity that is life with a girl that has an arrow through her head."},{"name":" Catbox Reverse","avatar":"https://mangadex.org/covers/60e976fb-99ee-4d12-9656-ba31662f2bf7/36661c5c-f300-4fcd-931e-f08f2712ff59.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.47","status":"Ongoing","tags":["Time Travel,Action,Adventure,Post-Apocalyptic,Supernatural,Tragedy"],"nutshell":"For the sake of saving her most precious person, the fourteen-year-old girl Ai Wen enters a time machine. However, before she knows it, she has accidentally travelled to the future! There, she meets Ulysses and many other previously unimaginable characters…"},{"name":" Love Live! - Kyou wa 1-nichi Cinderella (Doujinshi)","avatar":"https://mangadex.org/covers/60ea4eeb-40eb-48fe-bb09-3236c250d02b/64c52c9c-3555-499b-8f99-ab2c2905302b.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Oneshot,Romance,Girls' Love"],"nutshell":"Who will be the prince in this new Nozo x Eli story?"},{"name":" The Narrow Road of Inner Dreams","avatar":"https://mangadex.org/covers/60ec9faf-0cd2-4c04-a93c-a9268f3bb2fe/264d3a7e-b582-41ad-8090-686eff05c4f2.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Psychological,Animals,Romance,Comedy,Adventure,Philosophical,Drama,Slice of Life,Supernatural,Tragedy"],"nutshell":"(from ebookjapan):\n--I have been making manga for a long time now. Yes... I must be that kind of Mangaka...\nMy name is... well... my name as a Mangaka is Leiji Matsumoto, a good friend of cats. I am a kind of ordinary human being, but I hear that others see me as a kind of eccentric and weird person. I live a life of cats, telephones, fax machines, and hobbies, but... no matter how many times I draw this story, it is never fun or interesting.\nSo... it occurred to me... to draw the other side of the story. This is my \"true\" story."},{"name":" The B.B.B.","avatar":"https://mangadex.org/covers/60fbf9d1-7404-43c1-9d3c-6c12d1c0bdfd/b2409d36-5754-4b9f-b3b2-dac01cd117cd.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Boys' Love,Slice of Life"],"nutshell":"[From PRISMS] Well well, if Tomomi only knew. When she first saw her new brother-in-law, Shishimaru, at age 10 she at once decided that he looks like a sissy and she has to do something about it! So she got him interested in football, he went to the USA to study football... and now he's back, still looks extremely effeminated and Tomomi falls for him! But what's about this best friend, who came along with Shishimaru, Guy, who acts so extremely protective towards to Shishimaru? Is he Shishimaru's boyfriend? Sort of... just that Shishimaru doesn't know anything about it. And so a really weird love-triangle starts between those three persons."},{"name":" Lottery Princes","avatar":"https://mangadex.org/covers/60fc5cf4-ca5d-4522-b91a-9b8b81d6fd52/29b4e791-2f2b-4ed9-859a-354e62fbe8df.jpg.256.jpg","country":"Korean","stat":"8.17","status":"Ongoing","tags":["Reincarnation,Historical,Long Strip,Romance,Comedy,Video Games,Isekai,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"Shushu has entered the chat: her own chat, that is! This modern-day game streamer turned tragic imperial princess has already lived and died twice, and by the third time around, she's hoping to finally break the cycle of rebirth. But God has other plans for her reincarnation, which involve her returning to the very palace that already killed her once before. Thankfully, she isn't reborn without any plot armor at all. Shushu is now blessed with the ability to interact with reality the way she did in her first life: through an online persona. And somehow, the people around her all seem to be avid fans of the stream that is her life. As elements of Shushu's previous lives collide, she'll try using her adorable charm and clever wit to amass loyal followers, rescue an empire, and ultimately beat the game."},{"name":" Minotaurus's Plate","avatar":"https://mangadex.org/covers/61020b4f-51c2-459a-95f8-8ee4ba6e4145/063709fe-9c8d-4e7a-b35f-b4276a0e4608.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Oneshot,Sci-Fi,Tragedy"],"nutshell":"One-shot about a man who crash lands on an underdeveloped planet ruled by \"cow-men\" who eat humans, and how he tries to save a girl from them."},{"name":" Kid I Ruck!","avatar":"https://mangadex.org/covers/610272a6-d364-4fbd-9643-81b1cdbef87d/c6432beb-ffd4-48fd-b9ee-6819d6c7ddc0.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Comedy,Drama,School Life,Delinquents"],"nutshell":"Kinjiro Yaoi is the terror of his high school. Inveterate and incorrigible hothead brawler, he is the type to let his fists speak generously at every opportunity. At the opposite extreme, his childhood friend, Kuriko is sweetness incarnate. But shortly before his 18th birthday, a tragedy touches the girl, who was attacked on the return of high school. Traumatized, she no longer has the strength to go back to school and lives confined to her home, cut off from the outside world. Kinjiro, meanwhile, is consumed with guilt. He who was not present to defend his friend relentlessly tries to find a way to get out of his depression. His decision was made: to the image of the comic professionals who made the happiness of Kuriko before the attack, he will also become a champion of laughter and devote his life to bring a smile to her friend!"},{"name":" Upotte!! Nano","avatar":"https://mangadex.org/covers/61043eaa-4bfb-4821-abfb-a0c54569363d/2ddb373c-2c79-4806-a11a-50b4d8c58f96.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Cancelled","tags":["Comedy"],"nutshell":"Upotte!! 4-Koma\nNote: Chapter 9 technically doesn't exist, it was skipped when \"Upotte! Nano\" switched publications from Young Ace to Shōnen Ace.\nCancelled due to parent magazine folding."}]