[{"name":" Gensou Gourmet","avatar":"https://mangadex.org/covers/ede48b14-8d83-41cb-9559-c7d859fd23fc/619423f3-d5ed-433f-8eb6-6aa97962ec61.jpg.256.jpg","country":"Japanese","stat":"8.38","status":"Completed","tags":["Comedy,Isekai,Fantasy,Cooking,Adaptation"],"nutshell":"One day, Shunichirou suddenly transferred to a different world.\nHis reason for living in this different world… to see, touch, and smell, -eating unknown food!\nAlong with Sylphin, a Beastman Maid, they have an adventure eating fantasy gourmet in a different world!\n\nLinks\nOriginal Webnovel\nAuthor's Twitter"},{"name":" Infection Zone","avatar":"https://mangadex.org/covers/fae59015-76c4-4807-94c5-22e8b58ebb96/73cfd637-9937-4cf3-8b56-b0a6c030edba.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.94","status":"Completed","tags":["Thriller,Action,Long Strip,Romance,Survival,Zombies,Adventure,Drama,Horror,Supernatural,Full Color,Tragedy"],"nutshell":"Newly weds Nam Gun Woo and  Baek Mei Zhen are living together in a modest apartment on Gun Woo's salary as a news cameraman. One day when they were driving in the rain the couple encountered a beggar. While trying to help the beggar an \"incident\" occurred.\nShortly after, news of the \"infected\" began to spread. Of patients that escaped the hospital. The situation quickly spiraled out of control.\nA story of love and survival."},{"name":" Giri-Giri Saegiru Katagirisan","avatar":"https://mangadex.org/covers/18649fc7-410f-4509-9283-2e5d2a4cf2d4/6c73869f-01c1-4c1c-ad5e-8272e83df37b.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"Okada-kun is a guy who's at the bottom of the school caste. His only reason for living is to someday see his classmate's large boobs. However, whenever he so much as makes an attempt, Katagiri, his flat-chested classmate, is delighted to block his view, relishing in his look of despair. Just where will their battle without honor take them?!"},{"name":" D-Frag!","avatar":"https://mangadex.org/covers/fb1d3464-4160-4339-8a80-dafd86eae398/c6db3701-9a0e-4e4b-91aa-415fbebaeddb.jpg.256.jpg","country":"Japanese","stat":"9.19","status":"Ongoing","tags":["Traditional Games,Action,Romance,Comedy,Adventure,Virtual Reality,Video Games,Harem,School Life,Delinquents,Slice of Life,Supernatural,Mystery"],"nutshell":"Kazama Kenji likes to believe he is something of a delinquent. Moreover, others seem to like to agree that he is. Of course, Kenji's gang finds their way to a group of four not-so-normal girls - Chitose, Sakura, Minami and Roka - and all at once, whatever reputation he may have, is nothing compared to the outrageous behavior of the girls. Shanghaied into joining their club, what will happen to his everyday life from that point on?\n\nSee AnimeNewsNetwork for the anime."},{"name":" Yuugai Shitei Doukyuusei","avatar":"https://mangadex.org/covers/c16a96d3-75aa-4617-a535-4f0ffe1e95c5/edc1cf36-e317-4692-8d06-5890c8028625.jpg.256.jpg","country":"Japanese","stat":"8.32","status":"Completed","tags":["Comedy,Girls' Love,School Life"],"nutshell":"Yatsuhashi Miyako is a diligent class rep while the girl who sits next to her, Miyakonojou Reika, was discovered to not be wearing panties. Will Miyako be able to reform Reika into a normal high school girl?!"},{"name":" Shingeki no Eroko-san ~Hen na Oneesan wa Danshikousei to Nakayoku Naritai~","avatar":"https://mangadex.org/covers/bdfc7777-f1ee-4131-82cb-2fb5861d32e1/d0a147b5-b506-4868-a077-134d0838af65.jpg.256.jpg","country":"Japanese","stat":"8.61","status":"Ongoing","tags":["Romance,Comedy,Slice of Life"],"nutshell":"Shindou Eruko, a glasses, big breasted beauty, found a job as a handyman for the Amaguri Handyman service after her NEET life comes to an end as her savings ran out. She immediately falls for her co-worker Hoshi-kun on their first day working together, but there's a problem: Hoshi-kun is a high school boy, while Eruko is a 27 years old onee-san who has trouble telling reality and delusions apart. She ends up constantly scheming to get close to Hoshi-kun to turn many of her delusions into reality, but after several near-misses, it became apparent to Eruko that Hoshi-kun does, indeed, have feelings toward her...\nThis manga takes place after Vol.14 in  Henjo - Hen na Joshi Kousei Amaguri Senko"},{"name":" A Distant Neighborhood","avatar":"https://mangadex.org/covers/321cbc60-43dc-4a0e-9243-2a75160b3c81/06fd4f7f-dae0-4c07-bc9a-6871564e7b9a.jpg.256.jpg","country":"Japanese","stat":"8.30","status":"Completed","tags":["Time Travel,Psychological,Romance,Magic,Philosophical,Drama,Slice of Life,Supernatural,Mystery,Tragedy"],"nutshell":"Middle-aged salaryman Hiroshi Nakahara accidentally takes a train ride back to his old hometown to visit his mother’s grave. Then for reasons he can’t explain, Hiroshi is transported back in time, and discovers that he’s an 8th grader again, but with all of his adult memories intact.\nCan he, or should he try to change the decisions he made before? But more importantly, can he find his way back to the present day, or is he stuck in the past?"},{"name":" The Hundred Ghost Stories That Led to My Death","avatar":"https://mangadex.org/covers/1c01dcad-8e60-4fdd-8dd4-ddc5c200ba36/a8c256b6-4c00-41cf-b984-ba705ab17c01.jpg.256.jpg","country":"Japanese","stat":"8.69","status":"Ongoing","tags":["Monsters,Demons,Psychological,Ghosts,Anthology,Horror,Supernatural,Mystery,Tragedy"],"nutshell":"Anthology horror series detailing the \"Round of 100 Ghost Stories\", an old folktale believed to originate from Japan retold through the lens of Yuuma, a boy who lives in a troubled household. Often used as a test of courage where participants tell one hundred supernatural stories and blow out one candle then look at themselves in the mirror after they finish each story. When the one-hundredth candle is blown out, it is said that ghosts and demons are summoned to our world."},{"name":" Maou ga Zutto Miteiru","avatar":"https://mangadex.org/covers/aafd1d11-6212-4197-a54a-3a0228fe7392/90bde1b3-3377-47c6-b496-bbde0ee18e28.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Ongoing","tags":["Action,Comedy,Fantasy"],"nutshell":"One day, Reynolds, a demonic youth who worries that the job of \"demon king\" is not suitable for him, finds a purpose in life. That is to support Ellie, a brave girl who is single-mindedly working towards her dream of \"defeating the Demon King\". This is a story about a demon king who can't take his eyes off the hero!"},{"name":" Meido no Koi wa Enma Shidai!","avatar":"https://mangadex.org/covers/ce8e824a-1ad2-47d8-976c-278ea599262d/112aa545-990a-41e9-a673-37b9ba038b55.jpg.256.jpg","country":"Japanese","stat":"8.69","status":"Completed","tags":["Romance,Comedy,Office Workers,Fantasy,Supernatural"],"nutshell":"Tomari, a low-level administration worker in Hell, has suddenly been appointed to Enma Hall to be the aide to the King of Hell himself. There, she finds that she will have her hands full, and the King of Hell will keep her real busy, but not in the manner that she initially thought…\nWhat's worse, she didn't know what she literally signed up for, courtesy of the King.\nA contract love comedy unfolds!"},{"name":" #Zombie Sagashitemasu","avatar":"https://mangadex.org/covers/2194896c-a20f-451d-9e94-1a851886b5f2/e13dbc7d-7b81-4cad-86ff-209e7ed6719d.jpg.256.jpg","country":"Japanese","stat":"8.24","status":"Ongoing","tags":["Thriller,Action,Comedy,Survival,Zombies,Post-Apocalyptic,Drama,Mystery"],"nutshell":"The manga is set in a world where 90 percent of humans on Earth have contracted and died from a deadly, virulent disease; only to then rise again as zombies who only attack people. 13 years after that \"Red Day\" of societal and civilizational collapse, the surviving humans survive away from the big cities, while still hoping to retake them someday. An entirely new generation of people who know nothing of the pre-Red Day world are now coming into their own. The story begins when Aki and her close friends Haru and Natsuki begin a journey to find Aki's missing father."},{"name":" Butler, please!","avatar":"https://mangadex.org/covers/eca1a3a8-881d-4b0c-bbc7-c74169bb1d2d/4be19f3d-0f0d-4dbb-b48f-ba81ec135f33.jpg.256.jpg","country":"Korean","stat":"8.10","status":"Ongoing","tags":["Long Strip,Romance,School Life,Web Comic,Full Color"],"nutshell":"Mari is an outcast in school despite belonging to a rich family and her butler is No. 1 at school...?!Somehow we have to turn the outcast into the queen of the school!Here is a romance between a girl and a boy who are complete opposites!"},{"name":" Kantai Collection - We came to the camp","avatar":"https://mangadex.org/covers/473b2cbe-7a87-4b9f-ad70-a6198e6b8722/f496c497-f287-474c-be70-2e9186220470.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Comedy,Military,Web Comic,Slice of Life"],"nutshell":"A scary face admiral (but with a kind heart) go with his shipgirls to the camp"},{"name":" Summer's Curse","avatar":"https://mangadex.org/covers/87795770-fff6-42b9-8a0d-01c30c8fc988/eabee240-32f9-4b9d-b9dd-85826de04357.jpg.256.jpg","country":"Korean","stat":"7.42","status":"Completed","tags":["Long Strip,Romance,Comedy,Boys' Love,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Hyunsoo falls in love with the campus idol, Kwon Jiwon, at the freshman welcoming party. But Jiwon suddenly disappears a week before summer vacation and appears again… As a cat?! A cute romantic comedy of an adorable couple who struggle to change Jiwon back to normal.\n\n\n\nOriginal Webtoon <Joara Webtoon>\n\n\nOriginal Webtoon <Peanutoon>\n\n\nOriginal Webtoon <RidiBooks>\n\n\nOriginal Webtoon <Bomtoon>\n\n\nOriginal Webtoon <OneStory>\n\n\nOriginal Webtoon <Mr.Blue>\n\n\nOriginal Webtoon <kakao>\n\n\nOriginal Webtoon <Naver>"},{"name":" Houkago No Etude","avatar":"https://mangadex.org/covers/d09326c2-c3ef-4982-98f5-5967c5120dea/5dfd4b17-7a2b-477d-be55-8900ce5455ab.png.256.jpg","country":"Japanese","stat":"7.70","status":"Ongoing","tags":["Romance,Boys' Love,Drama,School Life"],"nutshell":"In a certain School of Arts.\nThe ordinary ballet student Chihiro Minobe meets Shun Ichinomiya, a senior student who is rumored to have a bad personality. He falls in love with this genius dancer\nat first sight.\nThrough the school's unique \"Pair Practice\", Minobe manages to take \"after-scool lessons\" with Ichinomiya, but for some reason Ichinomiya presses him for a \"physical relationship\"...!?\nFull-fledged ballet BL about love and youth."},{"name":" My Fiancé is in Love with My Little Sister","avatar":"https://mangadex.org/covers/a3125acb-3aba-4c29-bd4d-c1b88ec375b2/0c74ddd8-5cd7-49a1-afb9-5f2973333123.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Ongoing","tags":["Time Travel,Psychological,Romance,Fantasy,Villainess,Mystery,Adaptation,Tragedy"],"nutshell":"There my fiancé stood, gazing intently at my charming younger sister. When I saw them fall in love the moment they laid eyes on each other, I was hit with an overwhelming sense of déjà vu. Aah, again?\nMy fiancé had been in love with my younger sister even in my previous life. There was nothing I could do but watch it all unfold. And for some inexplicable reason, I’m the only one who keeps returning to that exact point in time. Trapped by fate. And yet, amidst the turns of the hourglass, I still find myself falling for him…"},{"name":" Maid in a Dream","avatar":"https://mangadex.org/covers/85b726a1-70e7-472a-8e04-fba182939754/b09be778-6409-49a7-905a-673611645be2.jpg.256.jpg","country":"Korean","stat":"7.99","status":"Completed","tags":["Long Strip,Romance,Comedy,Girls' Love,Fantasy"],"nutshell":"Ah-ju lives two lives, a university student and an exclusive maid for the emperor. When she sleeps in one world, she wakes up in another. One day, the emperor asks her, \"Help me with my love!\""},{"name":" There's this junior who always happens to run into me at the end of my part-time job...","avatar":"https://mangadex.org/covers/3e60b9bd-7759-4f3c-a62b-0fcff0f85ff3/5a421c39-cd8d-4a7c-b328-756aee0a7d46.jpg.256.jpg","country":"Japanese","stat":"7.51","status":"Completed","tags":["Oneshot,Romance"],"nutshell":""},{"name":" Inkya Datta Ore no Seishun Revenge - Tenshi sugiru Ano Ko wa Ayumu Re Life","avatar":"https://mangadex.org/covers/04ff2200-7e68-49fe-92e0-d353b3dff2d2/806a0e04-45a1-4fff-871f-39a541563ec3.jpg.256.jpg","country":"Japanese","stat":"8.69","status":"Ongoing","tags":["Time Travel,Romance,Drama,School Life,Slice of Life,Adaptation"],"nutshell":"This is the story of Niihama Shincirou, who collapsed after being ravaged by a black company and woke up to find that he had been sent back to his second year of high school. When he wakes up, he finds himself in a time leap to his second year of high school. His high school life …… was gray and shady, but he’s sure he can start over now.\nThe beautiful girl of his dreams, Haruka Shijouin, whom he met again over time, is even more innocent and cute than he remembered, and above all, she has been staring straight at Niihama.\n“I feel like you’ve changed a lot from the Niihama I knew yesterday. You’re still kind, but you’ve grown up, and that’s wonderful!”\nIf I could change the future, I would definitely save her life after she took her own life after being severely bullied. With the adult mentality and corporate power that I’ve acquired, I’m going to take my revenge on my second youth with her–!"},{"name":" The Broken Ring: This Marriage Will Fail Anyway","avatar":"https://mangadex.org/covers/8ba4426d-9713-4a65-a38e-cf662c7a208c/affc4daa-1e4e-4a23-823d-e21188e0f473.png.256.jpg","country":"Korean","stat":"8.45","status":"Ongoing","tags":["Historical,Long Strip,Romance,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"When six-year-old Inés laid eyes on the handsome heir to House Escalante, she promptly made the boy her fiancé. Since noblemen are all the same, she figured she might as well choose a pretty one. But Lord Cárcel isn't ready for this sort of commitment just yet, and he spends the next decade and a half avoiding the marriage at all costs! Luckily, that's no trouble for Inés, as this marriage failing is exactly what she wants. In fact, he has her blessing to sow his wild oats as long as he stays out of her business. Unfortunately, being a playboy isn't as fun when your fiancée gives you permission. And doesn't this mean she's cheating on him too? Now, Cárcel is determined to change Inés' mind about him and prove he can be the husband she's always wanted.\nNote: The webtoon is released as R15, it's not R19 like the novel.\nOfficial Translations:\n\nEnglish\n\nAdapted from:\n\nNovel"},{"name":" I Will Become the Hero's Mother","avatar":"https://mangadex.org/covers/79cdea01-85bc-40be-b1a2-ff41004cb7bf/19b9cc0c-ef9e-4b5d-a08a-8179a0c8f91d.jpg.256.jpg","country":"Korean","stat":"8.33","status":"Ongoing","tags":["Reincarnation,Monsters,Long Strip,Romance,Survival,Drama,Fantasy,Villainess,Web Comic,Supernatural,Adaptation,Full Color"],"nutshell":"\"You may be my wife but, I won't lay a single finger on you.\"\n\"Really? Then can I touch you?\"\n\"...What?\"\nAbout 20 years later, the world will be in ruins because of the invasion of the beasts. There's only one way to stop the destruction. To marry the duke who is called a monster, and have his child who will become the hero in the future!\nElena who saw a glimpse of the future succeeded in marrying him but...\n\"Are we going to continue to not do anything?\"\nI wanted to get it quickly out of the way, but my husband's impregnable fortress is stronger than I could have imagined!\n\"Take it off! Why aren't you taking it off?! Are your clothes part of your skin?\"\nWill Elena be able to safely give birth to the hero and save the world?"},{"name":" Minami Nanami Wishes to Shine","avatar":"https://mangadex.org/covers/ade4a857-7881-4104-9e4c-b004abbcc7fc/e36e0a8e-7009-493c-b586-4e9de7bb3554.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Ongoing","tags":["Comedy,Drama,School Life,Slice of Life"],"nutshell":"A spin-off/AU manga of Bottom-tier Character Tomozaki centered around Minami Nanami where she does not run for the student council election.\nEveryone has a wish to shine. Minami Nanami is a high school girl with such a wish. One day, a turning point came to her. Her mother introduces her to a modeling job, and she learns about a new world—? A spin-off comic currently being serialized on Manga One, the long-awaited first volume!\n\nLinks:\n\n Official Twitter\n Author's Twitter\n Manga Artist's Twitter\nOfficial YouTube\nOfficial Main LN (JP)\nOfficial Main LN (EN)\nOfficial Anime (JP)"},{"name":" I made a pact with a Succubus for Christmas.","avatar":"https://mangadex.org/covers/030364a6-a2d5-4367-bbd8-a1751d94bfd4/b9d55cc6-f5aa-42ab-a003-20ef1d71fe73.png.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Oneshot,Demons,Office Workers,Drama,Web Comic,Slice of Life"],"nutshell":""},{"name":" Wakusei Closet","avatar":"https://mangadex.org/covers/2be829dc-af2d-4071-89e2-23627a741f30/e7160d7e-01db-4b2c-b21d-e410e833febf.jpg.256.jpg","country":"Japanese","stat":"8.57","status":"Completed","tags":["Sci-Fi,Ghosts,Adventure,Horror,Aliens,Supernatural,Tragedy"],"nutshell":"The protagonist is a girl with the ability to visit a surreal alternate dimension full of monsters in her dreams. One day, she encounters another human girl there and receives a plea for help."},{"name":" Goshujin-sama to Watashi","avatar":"https://mangadex.org/covers/e2eca339-2445-4d6d-8b04-0d3c97fdcf8f/c0ff5b48-9d4f-4264-a4de-d6bc3a4677f7.jpg.256.jpg","country":"Japanese","stat":"8.37","status":"Completed","tags":["Romance,Comedy,Girls' Love,Monster Girls,Slice of Life"],"nutshell":"A collection of Itou's doujins featuring Master and Mel"},{"name":" Isekai Tensei no Boukensha","avatar":"https://mangadex.org/covers/cfca1084-51da-4c97-afd2-344691a5665d/96238bee-b91c-4a43-8969-62417836be69.jpg.256.jpg","country":"Japanese","stat":"6.34","status":"Ongoing","tags":["Reincarnation,Action,Adventure,Isekai,Fantasy,Adaptation,Tragedy"],"nutshell":"Ootori Tenma, who lost his parents and was raised by his grandfather’s and grandmother’s friends who are living in the countryside, loses his life at the age of 25. A god of a different world called out to the ghost Tenma. This is a story about Tenma who, is liked by multiple Gods of reincarnation, receives multiple cheats and lives a second life in another world."},{"name":" Gokinjo Monogatari","avatar":"https://mangadex.org/covers/4272ff6a-dd98-4069-8c86-0dcd34481091/79849b45-aed2-47be-adcc-25b623536d13.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"Ever since he was small, all the girls in the neighborhood have fawned over Tsutomu Yamaguchi, whose name came from a song and whose adorable face closely resembles the monkey character Monchichi's. Even back then, it was enough to make his friend and neighbor Mikako sick. Now that he's a little more grown, Tsutomu looks like the lead vocalist of Manbou, Ken Nakagawa (Midori friend/boyfriend from Tenshi Nanka Ja Nai; we meet main characters from Tenshi on market/fest), and that makes him even more popular with the ladies. But Mikako–now a trendy teen with modern sensibilities–couldn't care less. Or could she…? Gokinjo Monogatari is a sharp-witted and stylish slice-of-life story!"},{"name":" Hazure Skill \"Kinomi Master\"","avatar":"https://mangadex.org/covers/f093706a-f96a-4bef-8ef1-d1db1fa8a7c1/b02b4ba7-dcaa-44a1-a999-e722860b3b5f.jpg.256.jpg","country":"Japanese","stat":"6.45","status":"Ongoing","tags":["Action,Romance,Adventure,Harem,Fantasy"],"nutshell":"Light was a boy who dreamed of becoming an adventurer. He went to the temple with his childhood friend to get a skill fruit. While his childhood friend got the rare Sword Saint skill, Light obtained the Nut Master skill which only improves farming ability. Light is forced to abandon his dream of becoming an adventurer to start working as a farmer. Although warned to never eat a second skill fruit because he will get poisoned and died, Light's unique skill allows him to eat as many skill fruits as he wants to obtain multiple skills.\nThen he gets OP powers and a harem."},{"name":" Love in the Next Life","avatar":"https://mangadex.org/covers/9fd8abfc-5ace-4c27-9f63-1a23b28062cb/dddb2a7d-7725-464e-8b99-ad8b446b7a9c.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Oneshot,Reincarnation,Genderswap,Romance,Comedy,Girls' Love,Web Comic"],"nutshell":""},{"name":" Spirit Sword Sovereign","avatar":"https://mangadex.org/covers/2911ee11-aedf-49fa-a58b-9885343f3fb6/7e478617-a6b8-403e-a411-a188ed37f79a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.46","status":"Completed","tags":["Reincarnation,Action,Romance,Martial Arts,Wuxia,Fantasy,Web Comic"],"nutshell":"Once the spirit sword roars, within heaven, earth and the three worlds, I shall reign as the sovereign! Those who do not submit shall die!"},{"name":" Sunoharasou no Kanrinin-san","avatar":"https://mangadex.org/covers/cb41ec0f-5990-40b2-9293-5168a3cfe16d/eec6bdf8-6799-4d11-83ba-c5797af87280.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,Comedy,Harem,4-Koma,Shota"],"nutshell":"Shiina Aki is constantly being treated like a girl due to his feminine looks so he decides to move to Tokyo to attend middle school in an attempt to change himself.\nHowever what awaits him in his new home, Sunohara-sou, is the kind-hearted caretaker, Sunohara Ayaka. Along with the three female members of Aki's new middle school's student council, Yukimoto Yuzu, Yamanashi Sumire & Kazami Yuri.\nAnd so begins Aki's new life in Tokyo living with 4 girls."},{"name":" Life Going Wild With Plug-ins","avatar":"https://mangadex.org/covers/ebf05959-3d23-4cd1-ba78-498f3fcc6526/bb51d3d2-53c9-4043-a97d-c83d4bab5e15.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Comedy,Boys' Love,Martial Arts,Adventure,Wuxia,Web Comic,Slice of Life,Adaptation,Full Color"],"nutshell":"He was the high and mighty creator of the world, who had his memories stripped away in order to live like other mortals. But unfortunately, he was mistaken for a cutesy little idiot.\nThe world was dangerous and cruel, so to protect himself, he bought a cheap guard, even though the little guard seemed a bit foolish, gullible, and didn't know any martial arts . . . Eh? How come the rumours make the little guard seem like some bloodthirsty and vicious monster?\nCute and fluffy like cotton candy. Underdog shadow guard X Clumsy AF Gary Sue. If it's not sweet then I'll eat my keyboard!"}]