[{"name":" 5Toubun no Hanayome - Magical Girl Raiha with The Quintuplet of Witch","avatar":"https://mangadex.org/covers/f45e72ee-26b8-46f2-b61c-3fe00286ebff/dcf36541-25f8-45ea-b059-45e32f08c6c5.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Ongoing","tags":["Romance,Comedy,Magical Girls,Adventure,Magic,Fantasy"],"nutshell":"Upon meeting The Quintuplets of Witches in an unexpected turn of events, Uesugi Raiha, who lives with her father and her black cat Fuutarou, became Magical Girl Raiha - the protector of peace in her city?!\nFrom The Official 5Toubun Anime Twitter: @5Hanayome_anime\n\nRaws: Raiha Fuutarou Ichika Nino Miku Yotsuba Itsuki"},{"name":" Yumi's Cells","avatar":"https://mangadex.org/covers/f46138f0-491c-45e1-8e99-e59e2a61ad4a/21b5b25a-fc5e-4da4-be97-76f28f731f2e.jpg.256.jpg","country":"Korean","stat":"8.15","status":"Completed","tags":["Long Strip,Romance,Comedy,Drama,Web Comic"],"nutshell":"A story of Yumi and her brain cells…"},{"name":" Tenshi no Hane to Akuma no Shippo","avatar":"https://mangadex.org/covers/f461d33e-96db-4ffb-8305-1cde75e6f02f/46f4654b-3403-4f7a-b77d-41650b70fb26.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Comedy,Fantasy,Supernatural"],"nutshell":"Haruka, a devil who entered a school for Angels, made a contract with a strange angel Haniel, and became a knight of the school. On a mission to stop the prophecy of a “great catastrophe,” he cannot leave the school and instead has to cooperate with others, like Lilith, an angel with red wings to figure out just what is in store for them."},{"name":" The Ready-Made Queen","avatar":"https://mangadex.org/covers/f4659225-6ac3-4d86-88e1-6bff7239b52a/318a933d-07d2-4365-ad22-5654b8b70b0a.png.256.jpg","country":"Korean","stat":"7.46","status":"Completed","tags":["Long Strip,Romance,Drama,Web Comic,Adaptation,Full Color"],"nutshell":"Princess Violetta, who was exiled because she was developmentally challenged, is assassinated by a group of unidentified men. Ebigail, her faithful servant, is waiting for her own death to come when she's saved by Lakiel, the Duke of Edelgard, who says to her, \"I will make you Empress.\" Many destinies are changed that night, as the imperial palace's biggest deception starts."},{"name":" Jun'ai Dropout","avatar":"https://mangadex.org/covers/f46dc19c-3c9c-4153-b2e9-05cac8c00f51/8c603b9e-ec3d-4696-a96d-ac6032a2ccd8.jpg.256.jpg","country":"Japanese","stat":"8.43","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"Kurokawa, a regular at the coffee shop Kishi is running, is a refreshing salaryman. Kishi secretly had sex with Kurokawa on a stormy night …!? He was caught up in Kurokawa's image gap …!\nLa discrétion est conseillée. Kurokawa, un habitué du café que Kishi dirige, est un salarié rafraîchissant. Kishi va secrètement coucher avec Kurokawa lors d'une nuit orageuse…!? Comment diable leur relation perverse va-t-elle évoluer ?"},{"name":" Battle Beast","avatar":"https://mangadex.org/covers/f46e872d-d5c9-4848-96bc-3bcf361b82ea/3cc00c51-0ef8-4269-8963-10358066c1f3.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Animals,Drama,Fantasy,Monster Girls"],"nutshell":""},{"name":" Touhou - Autumn Samādhi (Doujinshi)","avatar":"https://mangadex.org/covers/f472913d-6886-4edc-bf0b-68c632fa07b4/73ec2882-dfcf-4d09-b38c-c3b2f1812a68.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Comedy,4-Koma"],"nutshell":""},{"name":" Yo-kai Watch Jam: Yo-kai Academy Y","avatar":"https://mangadex.org/covers/f473ab8c-957b-4b79-bfd6-f2c67bc5701a/8ebb9ac1-f412-45cb-bdf8-2bc2dcd31cc7.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Monsters,Action,Ghosts,Comedy,Superhero,Adventure,School Life,Adaptation"],"nutshell":"Based on the 2019 movie \"Yo-kai Watch Jam - Yo-kai Academy Y: Can a Cat Become a Hero?' by LEVEL-5.\nMataro Tamada has just been accepted to his dream school, the elite Y Academy, on a scholarship. For years, he had aspirations of becoming a hero—someone that anyone could count on to save them from danger. There, he meets Jinpei Jiba and Sandayu Koma, two best friends who have been accepted to Y Academy on the mysterious new \"YSP\" criteria. Together, they join the YSP Club at school, and make it their goal to solve the school's legendary mysteries!"},{"name":" Akujiki Reijou to Kyouketsu Koushaku","avatar":"https://mangadex.org/covers/f4748873-a2ef-4ecc-973f-1eaa6f596a04/8827d3cd-3c12-44bf-8b1e-d4e4eb32d4d4.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Romance,Fantasy,Villainess,Adaptation"],"nutshell":"It had been three years since her debut in the social circle. The daughter of a count, Melfiera, had been the subject of unpleasant rumours due to her hobby, and was unable to even get engaged. She was told by her father's future wife, who did not think well of her, that if she did not find a fiancé within a year, she would be sent to a convent.\nHearing that, she rushed to attend the autumn party. The truth was, she was not really into it, so she found herself alone at the party where she met the others. In the midst of this, she was attacked by a demonic beast that had been infected by a demonic poison and had gone mad. The man who saved her from the desperate situation was a bloodied man who smiled fearlessly. In fact, this man was the Duke of Galbraith himself, who was also known as the \"Mad Duke.\"\nDuke Galbraith was intrigued by Melfiera, who was not afraid of demons, let alone his bloodied self. Not only did he show understanding for her unspoken hobby of tasting demons and mutant plants—but he also offered to satisfy her incessant need for exploration…?!\nSuddenly engaged! Marriage? I'm being cheated on?!\nAn evil gluttonous lady who eats demons for the sake of her curiosity, and a mad-blooded duke who exterminates demons in his domain. A fantasy romance about two people swept up in malicious rumours and unable to get proper engagements, until they find happiness!"},{"name":" Steps","avatar":"https://mangadex.org/covers/f479be35-c938-4adf-a9f0-44ee31366991/77bf4cc7-6d32-4115-ad69-24a2800fe34d.png.256.jpg","country":"English","stat":"7.90","status":"Completed","tags":["Oneshot,Sports,User Created,Drama,School Life,Slice of Life"],"nutshell":"A ballet student thinks about quitting dancing after a friend has an injury in a practice."},{"name":" Dragon Ball Super - Digital Colored Comics","avatar":"https://mangadex.org/covers/f486a183-6660-492b-b94b-aa80960d8326/1185ac06-e6e8-417f-98bb-e65c3d2b408c.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Ongoing","tags":["Official Colored,Action,Martial Arts,Adventure,Fantasy"],"nutshell":"Dragon Ball Super follows the aftermath of Goku's fierce battle with Majin Buu, as he attempts to maintain earth's fragile peace.\nHaving defeated Majin Buu, Goku is starting to get bored with his life on Earth. His wife, Chi-chi, wants him to get a job, but all he wants to do is train and fight stronger enemies. Elsewhere in the universe, the God of Destruction, Beerus, and his attendant Whis are traveling from planet to planet in search of food and entertainment.\nAfter blowing up some hapless victims, Beerus is reminded of a man from his dreams with the moniker “Super Saiyan God,” or something like that... The God of Destruction sets his sights on Earth to track down this mysterious man! Maybe this will give Goku something to do?"},{"name":" Gabriel The Legend","avatar":"/cover-placeholder.jpg","country":"English","stat":"7.98","status":"Ongoing","tags":["Action,Boys' Love,Adventure,Girls' Love,Fantasy,Mystery"],"nutshell":"Naive young Gabriel Stumbles into a Universe governed by the Hierarchy of the Orders of creation. The species of Gods being the 6th order, rule over the 7th and 8th (humans) order and the entire universe with an iron fist. Having memories of his home on earth stolen from him, he now has to find a way to end this Order of Tyranny. But with 1000's of leagues of Gods in his way to the top, the race to the throne has begun. Little does he know, he doesn't belong to either of the 3 orders of creation. Will he claim the throne and change the future or will HE be the one to destroy the future that he sought to save."},{"name":" Yu-Gi-Oh! - Evil Touch (Doujinshi)","avatar":"https://mangadex.org/covers/f4948dbc-2eea-4e44-9c13-df815b984159/0aa03b7c-c115-4b02-9978-6be5d2e539ae.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Oneshot,Romance"],"nutshell":"Ishizu's birthday is near, so our dear Seto have to come up with an idea."},{"name":" Gigi Goegoe","avatar":"https://mangadex.org/covers/f49c57a5-f3af-47d0-bdea-f5f05cc53517/b9613bee-1ee9-4e3c-a77f-ed10bfdf9831.jpg.256.jpg","country":"Korean","stat":"8.06","status":"Ongoing","tags":["Psychological,Long Strip,Anthology,School Life,Horror,Web Comic,Mystery"],"nutshell":"Series of unusual, strange, and mysterious thriller."},{"name":" The Secret of Scarcrow","avatar":"https://mangadex.org/covers/f4a59c9c-e5eb-4c47-8340-fd59f039a42b/9d7a29b1-4f23-42d5-a900-9faf4c8bba06.jpg.256.jpg","country":"German","stat":"7.97","status":"Ongoing","tags":["Action,Adventure,Magic,Fantasy,Mystery"],"nutshell":"Humans are in constant battle with the crows, sinister monsters resembling giant crows. Legend has it that the Scarecrows once helped them, but one day they mysteriously disappeared.\nEngell, the king's daughter, firmly believes that the Scarecrows really existed and sets out to find them. But when she actually finds one of them, the real adventure begins..."},{"name":" Stand Up!","avatar":"https://mangadex.org/covers/f4a63f5d-6715-497f-8f35-ba6658cd292c/1ac7c509-a0c2-4c51-b064-5c7a235904d0.png.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Thriller,Action,Comedy,Survival,Sports,Adventure,Drama,School Life,Delinquents,Slice of Life"],"nutshell":"Ayumu is a hardworking yet timid kid who is constantly being bullied. After one day of being bullied, he finds himself being punched into the air… and waking up in a boxing gym! Thus, Ayumu's quest to become \"just a little bit\" stronger begins with the two wacky members of the Gold Boxing Gym. Will Ayumu finally stand up for himself or will his timidness get the better of him?"},{"name":" The You Who Descended Into The Universe","avatar":"https://mangadex.org/covers/f4a6c040-1f17-4f4a-8720-ec02fbed079c/bdbcad44-42ae-4f8b-8043-ce63b6d0c5e3.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Completed","tags":["Official Colored,Long Strip,Romance,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"The lonely soldier, Bo Meishu, is a member of the squadron who protects the sea god. One day, an encounter with Xiuli, who fell from the sky, happens. Xiuli, who suffers from memory loss, had the same exact face as Meishu's secret love, but it isn't him. While more disasters occur, Xiuli starts to remember things and not only does he make Meishu feel emotions she has never felt before, but he also brings her a cruel future..."},{"name":" Hot Milk","avatar":"https://mangadex.org/covers/f4ab9476-c5b3-4228-bda7-ece5599b7fe0/d3d017dd-f965-4324-80b4-22ece947410b.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Action,Comedy"],"nutshell":"Saruno runs a bodyguard service company with his assistant, but they hardly have any jobs.\nOne day, a fateful encounter with a girl called Meruo started a whole series of interesting adventures."},{"name":" Spider Sniper Koroshiya","avatar":"https://mangadex.org/covers/f4ac56c6-030d-49bc-8582-0024814f7cbd/86db7976-0466-46b1-a101-171cd9020b6f.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Completed","tags":["Action,Tragedy"],"nutshell":"Enter Shokugyo Koroshiya, an underground website that allows hired killers to bid for the lowest amount to take the paying job that they want. Kumo, the top killer of the agency must keep killing to keep a memory hidden. While he continues to kill, along with Megumi the Mantis, and KEI, the 14 year old owner of the website, what dangers await him and the rest of the team at Shokugyo Koroshiya."},{"name":" Scary Manju of the Dead","avatar":"https://mangadex.org/covers/f4acaf90-ce56-415e-98a1-a409fac70978/e33d13b1-3383-4ff4-a299-9b020a1e0f24.png.256.jpg","country":"Japanese","stat":"7.42","status":"Completed","tags":["Oneshot,Horror"],"nutshell":"A strange night unfolds in Edo…"},{"name":" Material Puzzle","avatar":"https://mangadex.org/covers/f4ad983a-96d9-4517-b1a9-862b01401600/ae772af6-dd50-4770-a8af-44a44d1808c5.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Comedy,Adventure,Fantasy"],"nutshell":"A boy goes looking for the legendary magicians who can save his village from a giant fungus, but he finds more than he bargained for."},{"name":" Brand Peace","avatar":"https://mangadex.org/covers/f4b5e5d4-cb62-4f79-9b9d-f3f2b87d8931/6913e1e0-8b24-45e4-8d5e-c8070834fc67.png.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"8th grader Mii is in a hurry to gain experience with guys. But poor her! The guys and girls in her class are at war with each other, so now she’s not allowed to fall in love. Despite this, she falls for the guys’ leader Yashiro anyway…It’s the perfect academy for love wars!"},{"name":" Oyayubihime Infinity","avatar":"https://mangadex.org/covers/f4b9a559-e83e-4236-933e-3c6bf3f41218/e055b688-bcb2-4790-89a3-ab6e55ef6aa0.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Reincarnation,Romance,Comedy,Drama,School Life,Supernatural"],"nutshell":"Long ago, couple suicides were common, but some left with unfinished business. Now some 'destined couples' have been reincarnated in the present day. Each has a reminder of the past: a butterfly-shaped birthmark on their thumbs. When the marks touch, they catch a glimpse of their shared past, though what they see doesn't always match.\nTsubame insists that he and Kanoko are fated to be together. By the time Kanoko finds out it's not true, it's too late: she's already fallen for him. The \"butterfly\" friends must reconcile their ties to the past with their present desire for fun and romance!"},{"name":" KILLMAX","avatar":"https://mangadex.org/covers/f4be0a6a-8461-4e56-991f-5bdbee605a63/4c341835-06f1-495d-ba21-a24ea8f66c54.jpg.256.jpg","country":"English","stat":"7.88","status":"Ongoing","tags":["Monsters,Action,Long Strip,Superhero,Adventure"],"nutshell":"Born into a bloodline of witches, Max is forced into a life on the run from the witch hunters.\nBut when she unknowingly finds a way to use her magic, her life changes into something she could have ever imagined."},{"name":" Sakuranbo Syndrome","avatar":"https://mangadex.org/covers/f4c75d1e-4266-4b3c-bd34-bfd7ef09a863/a7ff35d8-4d74-41c4-b145-6929ca00767c.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life,Supernatural"],"nutshell":"\"Progressive Rejuvenation Syndrome.\" This is an extremely rare disease causing the inflicted person to gradually become younger. The main character of this story, Munenori Agawa, is the only person who could save Rena Amami from this odd disease. Agawa's saliva is the only thing that can halt the disease from making Rena younger, so they must kiss everyday in order for her to survive. This causes an immense amount of conflict and drama between Agawa and his new girlfriend, Sayako Asou. This triangle relationship story tests the capabilities and limitations of human love."},{"name":" Korosensei Quest!","avatar":"https://mangadex.org/covers/f4c9f9ef-218e-4943-8252-c0d990c538bc/6fab8924-6f72-4d3e-ab2b-2e6ff77441f2.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Action,Comedy,Adventure"],"nutshell":"Spinoff of Assassination Classroom serialized in Saikyou Jump. Story is akin to Assassination Classroom's where students must kill their teacher. However this one focuses around gags and funny situations in a medieval-fantasy RPG setting.\nSee AnimeNewsNetwork for anime (ONA).\nSee AnimeNewsNetwork for anime (movie)."},{"name":" Hell Dogs","avatar":"https://mangadex.org/covers/f4cac440-3b9a-456b-b4ea-a387172e5c75/8aad0c10-af94-4599-b19b-0f525ab65ad6.jpg.256.jpg","country":"Japanese","stat":"8.56","status":"Completed","tags":["Thriller,Action,Psychological,Crime,Mafia,Delinquents,Police,Mystery,Adaptation,Tragedy"],"nutshell":"Can I kill a person as a police officer!? It's been three and a half years since I became a yakuza, and the infiltration never ends.\nKanetaka of the Higashi-Sheath Association is a gangster with a strong arm who has climbed up to assistant young head.\nHe landed in Okinawa at the command of the organization and killed his target, Kino.\nThat night, Kanetaka vomits violently.\nHe was an undercover investigator at the Metropolitan Police Department!\nWhat is the purpose of Kanetaka's actions!?"},{"name":" Untouchable Man","avatar":"https://mangadex.org/covers/f4d8a4b4-d1d4-46cb-8a6d-adc07f57026f/d6001cc8-28fb-4dc9-9723-af4ed977c087.jpg.256.jpg","country":"Korean","stat":"8.08","status":"Completed","tags":["Long Strip,Romance,Comedy,Drama,Web Comic,Full Color"],"nutshell":"Sex can be amazing, not to mention ecstasy inducingly mind-blowing. And Eunsung knows that because 7 years ago, she had good sex (an understatement). She felt the universe crack open to show her its secrets. Too bad she hasn’t had a decent orgasm since. It’s been a long journey, but everyone knows, before you get to “P,” you have to go through “O.”"},{"name":" Mahou Shoujo Madoka★Magica - Sakura Miki 2M (Doujinshi)","avatar":"https://mangadex.org/covers/f4d960ee-b7ca-4898-8692-f5e560fb282e/a038e552-59f0-493c-86cb-64aea6033cd2.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Ongoing","tags":["Girls' Love"],"nutshell":""},{"name":" Gakusen Toshi Asterisk Gaiden - Queenveil no Tsubasa","avatar":"https://mangadex.org/covers/f4dc0410-6293-4af5-87b0-8e842340913c/e59fd7d0-e3f7-40cc-8839-15dee43b1a61.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Action,School Life"],"nutshell":"The city of Asterisk consists of six schools and all of them participate in an annual battle called the Star Wars Festival. Since the winner of the Star Wars Festival will have their wish granted, students strive to train day and night. Main character Wakamiya Minato, the weakest fighter with a 49 consecutive losing streak, continues to fight for a dream."},{"name":" The Wife-to-Be","avatar":"https://mangadex.org/covers/f4deedfa-6ad9-4fdb-9ce8-07f94262db7d/32161868-8553-4be1-938d-1d447b19c1b0.png.256.jpg","country":"Japanese","stat":"7.62","status":"Completed","tags":["Oneshot,Girls' Love,Slice of Life"],"nutshell":"\"Farewell, Kou-chan's home.\"\nThe Wife-to-be is a bittersweet oneshot told as Kou leaves her apartment to take Momo to board a train…"},{"name":" Hanataba ni Te o Agero!","avatar":"https://mangadex.org/covers/f4e553e7-a03a-4e7f-ad6a-e392309f0119/8f678da6-63c3-48f8-921d-9dcb0e720984.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"1-2) Hanataba ni Te o Agero\nFlamboyant doctor who only dates hot guys encounters a shy, bespectacled flower enthusiast who seems quite dull at first glance.\nDoctor Nakatsukawa and his various family members appear again in La Partita\n\n\nFake Lovers\nHarajima and Eita have been pretending to be lovers for a year now. Why? Other people are suspecting something might be up.\n\n\nGive You the Keys to This Apartment\nWhen Wataru wakes up the morning after his girlfriend broke up with him, there is a naked man in bed next to him. And he has keys, so he's not easy to get rid of.\n\n\nBody Talk\nWhen Hasumi collapses in the hallway, the much-admired Yasuki-sensei carries him to the infirmary. His cool hands and voice leave a lasting impression on Hasumi, but does the teacher feel anything more for him than he would for any other student?"}]