[{"name":" Haitoku wa Amaku Mushibamu","avatar":"https://mangadex.org/covers/8e88caab-103b-4871-be58-878922700919/4bf25f9a-f39b-40eb-9d4e-304b26e1ac0d.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Romance,Comedy"],"nutshell":"Anna, a reporter on sweets, likes Toranosuke, a patissier. She wants to develop her love to him, but his twin brother Ryunosuke always gets in the way. Soon, however, she gets aware that she likes Ryunosuke as much as Toranosuke."},{"name":" Kimi no Ashiato wa Barairo","avatar":"https://mangadex.org/covers/8e8b5e4c-6221-4fb5-a70d-1e21da51034a/31b8978f-8a37-41ec-9dd2-752203ff0a61.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Genderswap,Romance,School Life,Supernatural"],"nutshell":"Haruka and Takumi had their bodies swapped when they fell down a staircase at a shrine. After several years of searching for a way to go back to normal, they find themselves increasingly aware of each other as their physical sex…"},{"name":" Don't Make a Wish","avatar":"https://mangadex.org/covers/8e8d0fc8-2860-4bfc-a6cc-814392c3a436/d1c521e0-efa3-4c96-a31b-cd4c9154b384.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.53","status":"Hiatus","tags":["Long Strip,Comedy,Web Comic,Supernatural,Full Color"],"nutshell":"I was an only child, but when I woke up, a younger brother appeared. Even more frightening is that this younger brother can unconditionally grant any wish… for a safe life, for the sake of world peace, as his sister, I sincerely advise you to not to make a wish to my younger brother."},{"name":" Three Cat Cookies","avatar":"https://mangadex.org/covers/8e8d6a7b-9ef5-4006-a0e4-095b1e97de7c/0b6333bc-a9b7-47a5-b35e-01da8b75d465.png.256.jpg","country":"Chinese (Simplified)","stat":"7.95","status":"Completed","tags":["Animals,Long Strip,Fantasy,Web Comic,Full Color"],"nutshell":"During one's ordinary high school life, an average student happens to meet an extraordinary cat and thus their adventure begins."},{"name":" Red Thread of Fate","avatar":"https://mangadex.org/covers/8e8f3676-2102-4703-b829-b5b663731437/287f350a-576c-4c20-a5c8-fb5b403ab29f.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Romance,Comedy,Fantasy"],"nutshell":"Reeling from her latest failed relationship, Jungin curses the god of fate for matching her with such terrible men. Unbeknownst to her, the god of fate is listening, and so is his unimpressed father. Exasperated by his son's incompetence, he banishes him to Earth until he is able to make up for his matchmaking mistakes."},{"name":" Kigurumi Guardians","avatar":"https://mangadex.org/covers/8e91c90d-26ab-4474-94d5-9026cf081716/682704b5-c14e-4beb-80d7-b2f999d09abd.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Hiatus","tags":["Romance,Comedy,Magical Girls,Magic,School Life,Supernatural"],"nutshell":"Hakka Sasakura's life is about to turn upside-down. She comes home from a day of admiring the student body president only to discover that a mysterious creature resembling a man in an animal suit has taken up residence at her home! What’s more, she's been chosen to work with this strange being to fight off invaders from another dimension and save the world… and she has to kiss him to do so?!"},{"name":" Gekibuno.","avatar":"https://mangadex.org/covers/8e9732e7-0d69-43a6-9379-b4693c0c539f/95dcc0dd-b211-428b-8ad3-dee452c39f20.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Comedy,4-Koma,School Life"],"nutshell":"Kuramoto has just transferred to a new school, which has a Drama Club with a touch of mystery around it.\nKuramoto has a retiring personality, and he feels like his existence is barely noticed by others. He wants to change all this, so he joins the Drama Club.\nBut soon… he regrets! Commencement of a stupid comedy!"},{"name":" Seija no Koushin Revenge","avatar":"https://mangadex.org/covers/8e991225-b2b7-47b7-ba09-58c30ab77e02/43aaa365-f422-4d99-8b21-62fea5f71391.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Drama,School Life,Horror,Supernatural,Mystery"],"nutshell":""},{"name":" Joukikou Otome Mame Dakedo","avatar":"https://mangadex.org/covers/8e9a7058-e5c5-4759-8507-82f482aad1ca/85c5bf39-7757-4c1c-a7f4-61a89d7e5de5.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Historical,Action,Comedy,Survival,Military,Tragedy"],"nutshell":"Links:\n\nAuthor's Twitter"},{"name":" Toe Shoes","avatar":"https://mangadex.org/covers/8ea7875c-8a88-4f6d-8f1a-340bd8b10897/52ffe879-abad-44a9-b0fc-155d73eabe8f.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Sports,Drama"],"nutshell":"After watching her first ballet performance, Morino Kurumi aspired to become a great ballerina. She entered Hosaka Ballet School and worked towards being the best of her group. 2 years after starting ballet, Kurumi is still as eager as ever to become a great ballerina. She meets Hosaka Kazuomi, a young man who further motivates her to become the best. But moving up in this world wasn't so easy, as Kurumi soon gained a great number of problems blocking her goal. From the jealously of her fellow dancers to Kurumi's apparent shortness. Will Kurumi be able to become the great ballerina she has wanted to be?"},{"name":" NG BOY x Paradise","avatar":"https://mangadex.org/covers/8eabc51f-d734-4a5d-a434-e67ea65a9a92/85d6090d-4341-498e-9de8-4d3cede1ded8.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Miu is an average high school girl who lives in a fantasy world dreaming about the day she'll find her destined one, just like in the manga stories she reads. What she doesn't know is that her prince might be closer than she thinks.\nOne day after getting punished by running around the school, she gets hit by a motorcycle at the school gate! When she sees it's a guy she thinks it's her so awaited prince. But later she'll find out a secret about this guy and his twin brother…"},{"name":" I Want to Know You","avatar":"https://mangadex.org/covers/8eb35348-b8de-4a7d-9a48-3bb0b497231c/09eedc23-8dd1-48f5-a891-4c322f372f95.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Boys' Love,Drama,School Life,Slice of Life"],"nutshell":"Kujou Akito, rich-smart-scary guy who's actually an otaku, is caught by his friend, Takaya Jin, buying an anime figure. The latter takes a picture and then demands that Akito be with him for 5 days, saying \"I know about you more than you know about me\"."},{"name":" Neon Genesis Evangelion - Asushin Christimas Carol (Doujinshi)","avatar":"https://mangadex.org/covers/8eb41e23-8800-4358-849f-2b50fc88985c/e2df2be8-045e-4834-9815-10a265a52cd9.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Oneshot,Psychological,Romance,Comedy,Drama,Slice of Life"],"nutshell":"A Christmas tale in Germany, light and a little dramatic."},{"name":" Boku wa Ane ni Youbun o Suwaremashita","avatar":"https://mangadex.org/covers/8ebc75c4-3c6a-4aa4-9302-6dc8ac54d4a4/e37027b6-e028-4b09-8e3d-1741ca3c3321.jpg.256.jpg","country":"Japanese","stat":"6.33","status":"Completed","tags":["Oneshot,Psychological,Girls' Love,School Life"],"nutshell":"A boy finds out the long, hard and grueling way that he shouldn't resent his overachieving twin sister's presence… because resentment begets cold revenge.\nA cautionary tale telling the reader that cruel words cut deep, and not only on the receiving end."},{"name":" Artist Acro","avatar":"https://mangadex.org/covers/8ebdfc5f-a1e0-4eb2-b627-c82e5e4a8696/7cd7f58a-e191-4743-bf13-a9bb614232fe.png.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Action,Comedy,Adventure,Fantasy"],"nutshell":"Once upon a time, artists were able to use their special skills freely, until seven years ago with a group of artists began using souls as raw materials for their work. Now society lives in fear of artists as a young man named Acro Hamburger travels to the capital city to ply his trade as a sculptor and to realize his dream of becoming a great artist."},{"name":" Genshijin Kareshi","avatar":"https://mangadex.org/covers/8ec03746-1e9d-4fce-aab8-0436ef264944/fb84c186-5728-4176-bc99-0c17fb35138f.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Time Travel,Romance,Comedy,Fantasy"],"nutshell":"A girl is sent back in time to meet the man of her dreams–but he’s a caveman?!\nFed up with the weak, passive men of the modern age, Mito’s wish is to find her ideal boyfriend: a real tough guy! When her prayer is (literally) answered, she’s whisked over two hundred million years back into the past, to an era before the rise of humankind. Has she really met the man of her dreams in Garhi, a fur-covered caveman who looks as much ape as he does human? Don’t miss this hilarious shoujo series about a love for the ages!\n(Source: Seven Seas Entertainment)"},{"name":" Kageri ni Komorebi, Sore Kara Midori","avatar":"https://mangadex.org/covers/8ec46a22-aa0b-4ecd-81c4-bb63192c24d7/3de4787a-31c3-463b-aed7-9ed6bab4f649.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Historical,Romance,Boys' Love"],"nutshell":"Having become the head of a noble house at a young age, Kuroki is reacquainted with his school friend, Arima, at a dinner party. Though rumors are flying about the latter, Kuroki is nonetheless drawn to the whimsical, no-account Arima. However, since he must live his life for his noble house, he understands to a painful extent that he is not free to fall in love where he likes. While attempting to stifle his ever more violent feelings, Kuroki deflects his awakening love.\nEven so, Kuroki doesn't want to sever his ties to Arima…"},{"name":" Koi no Kaori","avatar":"https://mangadex.org/covers/8ec7359a-12c5-4445-b9e8-9798e874cb38/e0c5d237-f448-4ca8-9f63-318df8483117.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Completed","tags":["Romance,Anthology,Girls' Love,Drama,School Life"],"nutshell":"Collection of oneshots:\n\n\nI Await Your Reply\nA girl confides in a friend she met online.\n\n\nSorry I'm Obsessed\nMimi has realized that she has feelings for Kuro, but before she can ask her out, she discovers that she might have some competition for Kuro's heart.\n\n\nSweet Temptation\nRisa finds herself intrigued by a girl whose family runs a bakery.\n\n\nSweet Desire\nWill Risa get a taste of what she's been craving? Chika from \"Adorable to Me\" makes an appearance to offer her some advice.\n\n\nLove*Aroma\nA girl is entranced with the way her new art teacher smells.\n\n\nLove*Preparation\nChildhood friends meet once again as student and teacher, but there's more in the way than just school. This chapter leads into \"Steps\", another collection by Takemiya.\n\n\nLove*Aroma 2\nKimu confronts her new feelings."},{"name":" Seikoku no Dragonar","avatar":"https://mangadex.org/covers/8ec73d28-74ff-43ab-9235-d0eb838698ad/abb6569b-e621-444d-96c1-df16258438bb.jpg.256.jpg","country":"Japanese","stat":"7.35","status":"Completed","tags":["Action,Romance,Comedy,Harem,Drama,School Life,Fantasy"],"nutshell":"Welcome to Ansullivan Dragonar Academy, a school with a difference: the students are dragon riders, each contracted with their own personal dragon. Ash Blake has the unique ability to ride anyone's dragon, but he's been waiting for what feels like forever for his own dragon to be born. He's thrilled when his dragon, Eco, finally appears–but she inexplicably takes the form of a beautiful human girl.\nEco's peculiar appearance is only the first unusual thing Ash faces. His life is about to become a whirlwind of spies, dragon races, and unexpected attention from both the proud Princess Sylvia and the beautiful president of the student council, Rebecca. All Ash wants is to acclimate Eco to the world, but someone out there wants his strange dragon on the dissecting table!"},{"name":" Toshiue no Hito.","avatar":"https://mangadex.org/covers/8ec9a335-adb2-4de8-9718-161e67ea4848/bda3f56b-7020-46dd-9e6f-6744d7d64ea1.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Office Workers"],"nutshell":"I am an eighteen year old office worker, and the person I like is my boss, who is 14 years older than me. Although I work hard to present myself, he always treats me like a kid, and even rejected my confession! I thought he really didn't like me, but when I was in danger, his expression seemed to show anxiety and love…"},{"name":" Itsumo Houkago","avatar":"https://mangadex.org/covers/8ed3270f-f796-4a8d-bd18-ff1722ab4d48/46a56362-7869-467c-98f1-d6c18a038482.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,School Life,Slice of Life"],"nutshell":""},{"name":" Touhou - Saijitsu Gentei Jouhari Jiken (Doujinshi)","avatar":"https://mangadex.org/covers/8ed469f6-f2e8-47c1-95d3-7f0fefcf0de8/3e959080-47ef-4c95-8c40-d15268fd95ea.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Comedy,Mystery"],"nutshell":""},{"name":" High Risk Mission Therapy","avatar":"https://mangadex.org/covers/8ed64a29-8787-499b-9430-53bc0db80f73/7dfbbff8-fba3-4f8e-897b-53ac48836f6c.jpg.256.jpg","country":"Japanese","stat":"7.47","status":"Completed","tags":["Romance,Comedy,Harem,School Life"],"nutshell":"Iori Kandono is suffering from a new illness called Monderella Syndrome, thanks to which she would suddenly experience severe pain in her chest. To make the pain go away, she can either take the medicine or get a massage by a male person. One day she forgets her medicine at home and has such an attack in school, but fortunately her classmate, Edogawa, by pure chance runs into her, and it seems he's the only one who can make her pain go away!"},{"name":" Chiruru, the Girl with Supernatural Powers","avatar":"https://mangadex.org/covers/8edc7d87-56dc-4c78-b7a1-dd85e0c7bc37/8a729b45-cc6b-4ba9-8697-aede24dbc9d6.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Oneshot,Comedy,School Life"],"nutshell":"A gag comedy - Ten-year-old Chiruru is a girl with supernatural powers; she can perform psychokinesis, teleportation, clairvoyance and even telepathy! Most people want to take advantage of her powers, but not her new friend Mirika. Together they explore Chiruru's abilities, but Mirika has a surprise of her own waiting at home…"},{"name":" Waiting For You","avatar":"https://mangadex.org/covers/8ee3a68e-9a75-4254-b1a7-5c47a2e94ca4/00dcf389-c729-40f0-99e8-c640125d8e49.png.256.jpg","country":"Korean","stat":"7.94","status":"Completed","tags":["Official Colored,Monsters,Long Strip,Romance,Fantasy,Web Comic,Full Color"],"nutshell":"Ten years ago, Ha-Yoon went missing for 99 days. When she returns to the location of her disappearance, she encounters a rather strange, mysterious boy who's around the same age as her."},{"name":" Tsuyameku Hishatai","avatar":"https://mangadex.org/covers/8ee54011-1095-4366-9086-293bf7a689a9/0187e310-c26a-44f5-b48c-fe3dfd3b2b39.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life"],"nutshell":"Shou works as a photographer’s assistant in a studio. He's approached by Amamiya, the Chairman of an influential production company, to become a model. Annoyed by Amemiya Tsukasa’s arrogance, (yet unable to resist a challenge), Shou accepts Amemiya’s offer. But then Amamiya orders Shou to live in his apartment, so he can personally train Shou to be a top model. But what does the training entail…?\nRomance of an elite company president and a Cinderella boy.\nWith The Master Till Dawn: Rin, Amamiya's bratty cousin, is in love with him. What Rin doesn't know is that someone in his house hold is in love with HIM.\nA 17 Year Romance: High school friends discover new feelings for each other after 17 years of friendship.\nAnywhere With You: Secluded rich boy with health problems is in love with the delivery boy who sometimes comes around.\nThe Serious Player: A bisexual playboy always teases his gay virgin ice queen of a coworker."},{"name":" Forest of Water","avatar":"https://mangadex.org/covers/8ee82d0b-c204-44fb-a957-3d3dcd6f1395/9b3ebde4-cac9-4489-927a-9b69b80dff6c.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Fantasy"],"nutshell":"As Joan of Arc is about to be burned at the stake, she confesses to God that she is sick of people and the atrocities she has seen, and wants to die. Unwilling to let that happen, God sends her to modern-day Japan, giving her three years to make up for the time she lost to her holy mission."},{"name":" DearS","avatar":"https://mangadex.org/covers/8eeb1dfd-fb7c-4265-9a55-1173c17dc540/7ef694fd-59a2-4318-8ce9-e02dac881838.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Sci-Fi,Romance,Comedy,Harem,Drama"],"nutshell":"Aliens have landed on Earth and are now a normal part of society. These beautiful beings have been given the name \"DearS\" and are trusted and welcomed by most humans. In order for the \"DearS\" to learn Earth's customs, they are sent to random high schools to \"home-stay.\" When Takeya helps a DearS in his school, she calls him \"Master.\" Thus begins the humorous life of Takeya and his sexy alien follower, Ren, who tries to figure out the wacky customs of this place called Earth!"},{"name":" Shin Onimusha: Night of Genesis","avatar":"https://mangadex.org/covers/8eedc00e-e28b-4151-a6a3-7c423bdfbfb4/f844b4d0-4bcd-4577-94b1-8e557a29dc31.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Action,Martial Arts,Fantasy"],"nutshell":"Based on Capcom's award-winning Oni-Musha franchise, the New Oni-Musha: Night of Genesis manga is the prequel to the New Oni-Musha: Dawn of Dreams video game that features tales from feudal Japan. Yuki continues his quest to destroy the tainted cherry trees and thwart Hideyoshi's diabolic ambitions, while Akane departs on her quest for vengeance against Munenori, traitor to the Yagyu Clan. The fiery intensity that is the world of Oni-Musha continues!"},{"name":" The Soul Guardians","avatar":"https://mangadex.org/covers/8ef53df3-91fe-4c9c-8bc8-3f3bd90628a0/b9a1fea1-4266-4099-a42f-1c27ae91b17f.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Ongoing","tags":["Monsters,Action,Demons,Ghosts,Long Strip,Adventure,Magic,Drama,Horror,Fantasy,Web Comic,Supernatural,Adaptation,Full Color"],"nutshell":"The fantasy masterpiece, which once caused an uproar in Korea with more than 10 million copies sold, is now in the public eye again as a webtoon.\nHyun-Am trains in Tai Chi Qigong in order to fight the water ghost that killed his sister.\nFather Park, unable to save his friend’s daughter from an unknown evil spirit, chooses to become a priest walking the path of asceticism.\nJun-Hoo, the only survivor of Eastern Sea Esoteric Buddhism, is a genius who has inherited all the magic of the five guardians of Esoteric Buddhism.\nSeung-Hee, who has a secret, gets involved in a mysterious case due to her father.\nAn occult fantasy in which individual exorcists, each driven by their own causes, solve crimes and fight together against evil demons. Demons who rule the spiritual and emotional worlds of mankind, and drive society into chaos."},{"name":" Sakura-Coloured Triangle","avatar":"https://mangadex.org/covers/8f035f27-da9f-4b40-af15-c6ab78f5ed30/9338b90f-188e-463c-8594-e0684abdbec3.jpg.256.jpg","country":"Japanese","stat":"7.44","status":"Completed","tags":["Comedy,Girls' Love,4-Koma,School Life"],"nutshell":"A short 4koma about a girl with a mean look and her two new classmates."},{"name":" General I Love You","avatar":"https://mangadex.org/covers/8f03afac-b7e1-423f-9abe-d3257de258a9/43eab6c3-228f-4dd9-ae9a-f2905c729b03.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Ongoing","tags":["Reincarnation,Historical,Long Strip,Romance,Isekai,Drama,Web Comic,Full Color"],"nutshell":"In the middle of a historical fight, there was a time warp? The Emperor opened a film company and forced the General to debut?! The Prince that the General liked ended up being a Princess who crossdressed?! Come and watch the hilarious antics by the most dramatic General in history!"}]