[{"name":" Hoshikuzu to Hatsukoi Hyaku-nen Sou Monogatari","avatar":"https://mangadex.org/covers/e03e8426-8454-472c-8da9-d3ef978889d7/60ea0c80-0571-478b-927e-b64d339665fb.jpg.256.jpg","country":"Japanese","stat":"7.59","status":"Completed","tags":["Boys' Love,School Life,Slice of Life"],"nutshell":"When Takamori Yuuri was a child, he visited the Century Manor, which was owned by his grandfather. Forced to spend the summer there while his parents went away, Yuuri immediately wanted to go home – until he met a kind boy already living there. He teaches Yuuri origami, and promises to write him letters when Yuuri has to leave again.\nNow 18 years old, Yuuri finds himself at Century Manor once more. There, he meets his cousins, Fujiwara Yamato and Takamori Asao. As Yuuri slowly adjusts to his new life, he can't help but think Yamato's kindness is nostalgic, and then he finds familiar origami collected in one of the rooms… What memories and feelings will be remembered in this manor?"},{"name":" Kyomu no Higan","avatar":"https://mangadex.org/covers/e0428d19-8c69-492c-a192-157708b34c8f/9a9d6be1-ec51-4e9d-b623-6233b4c18147.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Ongoing","tags":["Sci-Fi,Historical,Action,Demons,Animals,Mecha,Drama,Aliens"],"nutshell":"A large group of killing machines has suddenly appeared in the Edo period with the objective of exterminating every person. But there a woman, and her dog, stood up against them. In the face of overwhelming and unreasonable military power, is there a a chance of victory for humanity!?"},{"name":" Merchant Of Heaven","avatar":"https://mangadex.org/covers/e04a5eb8-e6c9-4e6f-8a14-6ac1c3d5d1fa/28e205f3-7aeb-446f-9381-2fa3abaf6621.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Fantasy,Web Comic,Full Color"],"nutshell":"Jin Wuzu, a college student who lost money in the purchasing business, strayed into the heavens. With the help of the fairy grandfather, opened a heaven purchasing shop \"TootingGo\"! The unlucky person who was still in debt the day before was hunted down, and today he is going to be the immortal merchant of the new era in both worlds!"},{"name":" Yukuyuku Futari","avatar":"https://mangadex.org/covers/e04ecd22-8ea5-410e-a8a6-d68dff2e5917/0e7e743a-73b6-4131-b6b2-cb89e1969741.jpg.256.jpg","country":"Japanese","stat":"8.43","status":"Completed","tags":["Romance,Comedy,Slice of Life"],"nutshell":"A cute story about a couple and their dates."},{"name":" Time Capsule?","avatar":"https://mangadex.org/covers/e050c3e2-9e15-4f50-8422-352c896f9b1b/e919decb-9d2e-434d-aeed-8ff455584e94.png.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Slice of Life,Music"],"nutshell":"Two sisters, a piano and a trip down memory lane."},{"name":" Tensei! Dazai Osamu Tensei Shite, Sumimasen","avatar":"https://mangadex.org/covers/e053971d-2511-4326-ae9d-a7a1fa2e3422/3f71ee79-6412-4e11-83c5-bc2f9e0360cb.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Reincarnation,Comedy,Slice of Life,Supernatural,Adaptation"],"nutshell":"Centers on famous Japanese novelist Osamu Dazai, author of No Longer Human, who is reincarnated into modern Japan with his scathing sarcasm and dry wit toward humanity intact."},{"name":" March Comes in Like a Lion Spinoff - The Scorching Times","avatar":"https://mangadex.org/covers/e054f61f-edc3-41b4-a245-90dc2439f2ad/e503ac0f-fc26-4c5d-a5fc-30fe6dc702e6.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Traditional Games,Historical,Psychological,Comedy,Sports,Philosophical,Drama,Slice of Life"],"nutshell":"The story is set in the year Showa 44 (1969), and it centers around Takanori Jinguuji, the 27-year-old man who eventually become the head of the Japan Shogi Association in the main 3-gatsu no Lion series."},{"name":" Lady Justice","avatar":"https://mangadex.org/covers/e05fa570-7c01-454b-8ac5-74d1aa87bed7/d9cdd16a-b428-4ecb-89e1-fd2d9e5d4193.png.256.jpg","country":"Japanese","stat":"7.11","status":"Cancelled","tags":["Action,Romance,Comedy,Superhero,Drama,School Life,Supernatural,Mystery"],"nutshell":"Marufuji Enta has a crush on Kenzaki Ameri and as they visit the same class for the first time the best day of his life starts!\nIronically, he gets kidnapped until a mysterious hooded girl appears in front of the abductor's car to free him in the name of justice!"},{"name":" Ano Ko to Boku no Ie","avatar":"https://mangadex.org/covers/e063c4e0-67d7-44fc-861d-a5e8eded4e5d/976e863e-403c-4079-b977-2707a5be97e2.png.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Oneshot,Romance,Drama,School Life"],"nutshell":"A collection of oneshots stories.\nI am a dog and my name is Kai. I love a 2nd-year, but I don't know what she thinks of me. Humans do not always say what they think. Only a few words could change the whole matter. If I could speak a word, I would confess my love to her.\n[PL] Zbiór 4 historii o miłości. Nie są one takie zwykłe, ponieważ pokazują ludzkie związki z punktu widzenia psa."},{"name":" The Law of Raising a Wolf","avatar":"https://mangadex.org/covers/e06ef6c8-98e1-4788-9c5e-1a921d1e8110/00abad30-68ec-412c-a418-53989dda6f92.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.67","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Full Color"],"nutshell":"You Qi is a cowardly and timid man, who is constantly chasing over Zhou Zheng, a man with a mean and violent character. Feeling annoyed at being with such a pushover, Zhou Zheng couldn’t help but to care for him. A tsundere actor and a nobody who puts his cowardice aside to take part as a stand-in actor. Can they face their true selves?"},{"name":" Sekka Hiden ~Rantei Koukyuu Shimatsuki~","avatar":"https://mangadex.org/covers/e0738c1c-339c-438c-a052-c4316888ce7b/80f15fbc-543f-41c7-89f8-e6cd24d7d034.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Historical,Romance,Drama,Fantasy,Mystery,Adaptation"],"nutshell":"\"As long as this girl exists, she will bring harm to the emperor.\" That is what the oracle decreed.\nSou Rinsetsu (Song Lingxue) was supposed to have spent the rest of her life living in a quiet shrine, however, the young girl's fate was upset. Forcefully brought out by the emperor's order, she was sent into the capital to live as a queen, empty as that title was. With the passage of time, she had grown into a beautiful, intelligent woman. What awaited her now was a world wrapped in conspiracy.\nA Chinese-styled fantasy."},{"name":" Bad Mom","avatar":"https://mangadex.org/covers/e0763f52-ecad-4bf9-9160-1dfa0b1baffb/61b19139-2208-4f90-a537-6aa87e7b9da4.jpg.256.jpg","country":"Korean","stat":"7.59","status":"Completed","tags":["Comedy,Incest,4-Koma,Drama,School Life,Slice of Life,Tragedy"],"nutshell":"Ryan has a new stepmom.\nShe's beautiful, smart and his age.\nWhat will happen when she decides to play with him?"},{"name":" Somewhere in Time","avatar":"https://mangadex.org/covers/e07d6247-aed4-413b-b0bc-ad7c1e6e82f5/fc8d2d08-a246-4190-bcd7-2b8cf4225a96.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.05","status":"Completed","tags":["Long Strip,Romance,Comedy,Boys' Love,Drama,Web Comic,Slice of Life,Supernatural,Music,Full Color"],"nutshell":"The protagonist of history, Chen Jun, is the lead singer and guitarist of group «Triumh of William». His neighbor is an unknown artist who suffers from a lack of communication. They lived completely ignoring the existence of each other. But one day Chen Jun turned into a cat…"},{"name":" Hakoniwa Oukoku no Craft Master","avatar":"https://mangadex.org/covers/e081b8a0-5e9d-44cb-af79-75f87b7ceeb4/fb6c4d3b-c884-4926-8441-5aa45b8426fa.jpg.256.jpg","country":"Japanese","stat":"5.98","status":"Completed","tags":["Loli,Survival,Adventure,Video Games,Harem,Isekai,Fantasy,Monster Girls"],"nutshell":"An Otaku programmer who spent the last three years creating the world he desires on the computer suddenly encounters a BUG. He gets depressed and sleeps. When he wakes up, he finds himself in his own world with crafting power."},{"name":" Sugar Soldier","avatar":"https://mangadex.org/covers/e087e926-5f26-4d88-82a1-d399acc422a2/b26faaa2-a084-4a13-929b-f333182c4b92.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,School Life,Slice of Life"],"nutshell":"Makoto is determined to step out of her model sister's shadow and have her own high school debut, but when Makoto's sister shows up unexpectedly at her school, her plans suddenly go awry?\nIncluded one-shot:\nVolume 9: Hapi★Supi / Happy Spirit"},{"name":" Sono Shinigami wa Ningen ni Koi o Shitanda","avatar":"https://mangadex.org/covers/e0921dda-ee6f-4920-bb02-8a5d3e526e1e/aa9c4988-4e3c-4b5b-8b52-28e2418cb027.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Completed","tags":["Ghosts,Romance,Drama,Supernatural"],"nutshell":"A reaper and a human's love. And their crime."},{"name":" A Story About a Boy Who Wants to Get Rid of His Sexual Frustrations, so an Angel Does Something About It","avatar":"https://mangadex.org/covers/e097de96-5cad-4c8e-8c1a-b74c456c0501/3a1339b8-dc8b-4a89-a3b6-54d739250c0f.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Oneshot,Comedy,Magic,Fantasy,Web Comic"],"nutshell":"Yuuki Takuma is the top scorer in his school, but secretly he's pent up all the way on the inside, so an angel comes to pay him a visit.\n Artist’s Twitter"},{"name":" Gekkou no Carnevale","avatar":"https://mangadex.org/covers/e0abaf50-f384-40c5-bcc6-c847d6f5472b/f23bba0d-7c10-4878-acf4-49a1a1eda5a4.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Sci-Fi,Action,Drama,Fantasy,Supernatural"],"nutshell":"The story takes place in a city resembling Italy, known as Belmonte, with the technology levels resembling levels in the late 19th century. In this city there are human-sized mechanical dolls known as \"Automata\" who serve the people of the city.    The protagonist, Romeo, is a taxi driver who was originally involved in a organization known as the \"Orma Rossa.\" He finds an automata in the shape of a young woman, who appears to have amnesia. He names her Anna, they start living together. However, sometime later, the Orma Rossa begin to catch up to Romeo, and an organization composed of automata also appears; thus, Romeo must fight to protect his current life."},{"name":" Magic: The Gathering - Moe Tsukinu Honoo","avatar":"https://mangadex.org/covers/e0b4a093-3bbc-4416-a948-eb9e8fd0cb22/a4f64b61-6d20-4577-b15e-ed122117b86d.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Action,Adventure,Fantasy"],"nutshell":"In this world there are five elements of mana, green mana which is grown in the forest and represents life and growth. White mana which is born in the plains and symbolizes order and light. Blue mana which rises from islands and it reflects knowledge and illusion. Black mana which seeps from the swamps and controls death and darkness. Lastly, Red mana which bellows out of the mountains.\nChandra, known as the \"Crimson Mage\" who controls Red mana is acting as the representative of Keral Keep in order to help a village in the Great Western Wood.\n\nWikipedia"},{"name":" Yuri ni Tanpopo","avatar":"https://mangadex.org/covers/e0b4fc2b-0a2a-4639-8649-3c4780bfe35a/240513ee-ae13-4915-8a09-81842fc620ff.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Girls' Love,Drama"],"nutshell":"Fujii Kana just broke up with her boyfriend, when her older sister Mizuho calls her to ask for her hospitality for her and… her girlfriend. How will Kana, who hadn't ever imagined her sister to be a lesbian, cope with this cohabitation?"},{"name":" Shingeki no Kyojin - Ouwasa wa Kanegane (Doujinshi)","avatar":"https://mangadex.org/covers/e0bb39f8-642d-482d-9fa1-d504a2dc3079/3adbbe32-91a2-417d-b325-d47dce3e5295.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,Boys' Love"],"nutshell":"Pairing: Erwin x Levi"},{"name":" K.K. in the City of Fog","avatar":"https://mangadex.org/covers/e0bf565c-e4e6-4a77-abe4-9f54e3abace6/97b0390d-efed-463b-9329-f435df73f24e.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Historical,Action,Fantasy,Supernatural"],"nutshell":"When magic and wizards are involved in crimes, only another wizard can track them. Join Karol Kings, The Wizard, as he, Sherlock Holmes and Jack the Ripper shape London's history in different ways."},{"name":" Koko Kara Saki wa NG!","avatar":"https://mangadex.org/covers/e0c22186-cc5b-42ca-a9f3-5c81257cc78d/22897104-3a7c-4d60-8a8e-b65ac2a77dbc.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"Haru, who's NG (No good) with boys, transferred to a class full ikemen and bishounen! Will romance spark between Haru and the boys?"},{"name":" Cherry Magic! Thirty Years of Virginity Can Make You a Wizard?!","avatar":"https://mangadex.org/covers/e0c24cc1-9d3c-45ea-b61a-ea682198fa25/2e82b8ad-d95f-41ea-a4c7-56865856981a.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Ongoing","tags":["Comedy,Boys' Love,Office Workers,Fantasy"],"nutshell":""},{"name":" Omega Tribe","avatar":"https://mangadex.org/covers/e0c7eeef-0b25-43b2-9cad-d25bee60d3e3/f1393830-bf26-44ae-96da-898272b83bf6.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Psychological,Adventure,Drama,Supernatural"],"nutshell":"It's the dawn of a new millennium....while all the people of the world are living their lives, something is happening in Africa,  where the first humans were born. Now a new type of human is going to rise, and it''s going to change the world, either we like it or not. Evolve or get extinct, there no other choices in this manga which explores the meaning of life, evolution and what being human really means."},{"name":" Issho ni Itadakimasu","avatar":"https://mangadex.org/covers/e0ca7962-b5cf-4fbc-ac94-f948ddbfd187/400d7228-ab13-4f6e-ba2e-02caaf2c07a7.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Boys' Love,Cooking"],"nutshell":"A meal with someone is… I don't know why it tastes so good-- A good-natured bento shop owner & a weepy novelist. It's the kind of love that fills your body and soul. My parents used to run a small bento shore in the shopping district. He convinced his parents to close the store, and then Ryo suddenly decides to take over the store a while after he convinced his parents to close it down. But it's ..."},{"name":" Dragon Ball AF (Doujinshi)","avatar":"https://mangadex.org/covers/e0d3f82d-ecad-40d3-bffd-5caa6b15b831/23700f29-366e-4c06-a9f3-7796a2257535.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Cancelled","tags":["Action,Comedy,Martial Arts,Adventure,Fantasy"],"nutshell":"It's the continuation of the Dragon Ball GT saga. It's not made by Akira Toriyama.. but by Toyble (now known as Toyotaro). But if you read it you would say it's made by him. So this series is not to be confused with the Akira Toriyama Dragon Ball April's Fools which was a hoax.\nNOTE: The final volume of Toyble's AF (Volume 5) was never completed past the draft stage. Volume 4.5 is the real ending (for now)."},{"name":" The Voice Inside His Head Is—","avatar":"https://mangadex.org/covers/e0d40720-cbbb-40bc-8907-48683381a803/735feb0c-23b5-4b5e-8813-093bf9b23c7b.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life,Slice of Life"],"nutshell":""},{"name":" Eshikarunte","avatar":"https://mangadex.org/covers/e0d4debf-cc3c-4a8e-98dd-8bd9781b96ec/60199b42-91da-4a42-b3c1-a789b8b70d60.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Psychological,Drama,Fantasy,Slice of Life"],"nutshell":"In the spring of 1952, 11-year-old Chizuru moves with her family (her father, his new wife, and her new younger brother) to the town of Nochiu in Hokkaido, a place with strong Ainu roots. They plan to live in a spare building on the property of her father's close friend. That friend has a family of his own, which includes twins, Takeshi and Shizuko, who are Chizuru's age.\nEver since Chizuru survived the air raid in Tokyo that killed her mother and older brother, she has been unable to speak and her memories are confused. However, once they began their journey to Nochiu, she has had the same dream every night. She's in a forest, and someone is calling her name. When she meets Shizuko, she is surprised to realize that Shizuko is the one calling to her in her dreams. Why is Shizuko calling for her, and what are the secrets she seems meant to learn? [tethysdust]"},{"name":" I Tamed the Male Lead Who Tried to Kill Me","avatar":"https://mangadex.org/covers/e0d8049f-8b8c-4c21-b028-4188de56c6da/8f824a10-317b-4e8a-ba7b-ee8765ce13ea.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Reincarnation,Long Strip,Romance,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"Originally, Latia’s family had taken in Karshian as a favor to his father, who embarked on a maritime expedition for fame and fortune. However, after rumors begin to spread that the father had died at sea, they begin treating the young boy like a parasite. Egged on by her sadistic parents and desperate for their approval, Latia bullies Karshian relentlessly.\nWhen Karshian’s father returns as a national hero and powerful duke, Karshian gets his revenge by executing Latia’s entire family, including her of course! On the gallows, as her life flashes before her eyes, she realizes that her family had been lying to her and using her all along. So when she’s thrown back into the past, she’s determined to prevent her death and treat Karshian right this time. But this won’t be easy as Karshian distrusts Latia’s every move. Will Latia be able to win over Karshian and turn the tables on her family this time around, or is she doomed to die once more?\n\nOriginal Webtoon\nOfficial Translations:\n\nEnglish\nChinese (Simplified) / 汉语"},{"name":" Nikushoku no Buka","avatar":"https://mangadex.org/covers/e0de5c98-e7b3-43f5-895b-fb24c0a474f6/9f2929f8-fd52-4faf-9b3c-5227fdfd48cb.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"Recently recruited to a high powered international investment firm, Chief Kayama is trying to get married. But he gets sidetracked when he sees his aggressive subordinate Tokita kissing another man in public."},{"name":" Matsuyoi no Oni","avatar":"https://mangadex.org/covers/e0e46a8b-bca3-4c43-8798-acd65ba41065/37198421-c673-4950-b65f-651c978831e8.png.256.jpg","country":"Japanese","stat":"8.35","status":"Completed","tags":["Demons,Boys' Love,Supernatural"],"nutshell":"【Your the one who told be to be a bait】\nFrom a young age, he is bewitched by the supernatural. One day, he picked up a strange dog collapsed near his home. It turns out that this dog was actually a demon whose name was sealed and lost it's powers. He suddenly said \"I finally found you\". By some kind of fate, he is needed to gain powers. The only way he can be on human form is to form a contract. He craved for him from the depths of his body but the truth is he was just being played?!"}]