[{"name":" Daisuki Datta yo, Sensei...","avatar":"https://mangadex.org/covers/83ca97e6-7482-4eb3-9bb5-3f9e5cbd4af2/0c8bfa8f-a9a3-4d77-884b-a896af75d0bb.png.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,School Life"],"nutshell":"Daisuki Datta yo, Sensei…\nA girl whom experienced unsuccessful \"threads\" of love with her teacher, encounters her fated person!?\nA very kind, dramatic love!\nIncludes oneshots:\nUshiro kara Nibanme no Kanojo\nYumi loves Sakura and her crush happens to be friends with a guy called Sakura! She only eyes for her sempai, not Sakura, but this changes when she was caught watching Sakura getting slapped by a girl and he called her a peeping tom. He even told her that she \"should give up\" on her crush, what does he mean by that…?\nToraware Beast (Captured Beast)\nHaving just transferred into a new school, Shiori's \"experienced\" look has given her an opportunity to make friends, but in reality she is not experienced in love at all. To maintain this image, Shiori desperately hides the fact that she is a HUGE book otaku. Meeting another book fan who is a mysterious beauty, Shiori ends up in an unpredicted circumstance. What now will become of Shiori's hope for an elegant school life…?!"},{"name":" Machibito","avatar":"https://mangadex.org/covers/83cc0291-4f3a-4d81-8e26-5e081ff20119/4ce366e4-7b90-4f09-a374-4121d7d6781f.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Oneshot,Boys' Love,Drama"],"nutshell":"A reunion proves painful and brings up unresolved feelings when stepbrothers Shuuya and Kyou meet again."},{"name":" Koukyuu no Arika","avatar":"https://mangadex.org/covers/83ce5267-8adf-4b35-af92-dca4022a4fc0/77c56167-e6dc-4171-92f6-0dd3fe7a20df.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"On the two-year anniversary of the death of his mother, Masaki Kuzumi returns to the beautiful manor home where she once lived. There, he meets the kind, devoted dog trainer Yuu Kanai and instantly responds to the younger man's sweet nature… but something behind Yuu's smile hints at a secret darkness that Kuzumi knows all too well. Can these two men band together and shine the light of forgiveness on all of their past regrets? Endless Comfort tells the story of two lost souls whose wounded hearts have kept them on the fringes of life and love for what seems like an eternity. Can the beautiful but sad heir to a fortune find a true friend in a member of the staff for his family estate… or will his \"alternative\" lifestyle scare the innocent young man away for good?"},{"name":" Last Exile - Fam, The Silver Wing","avatar":"https://mangadex.org/covers/83d1e5c2-a084-47af-ba2e-2c56a8cd05af/1568796f-2361-4184-bc91-0e44c64c9bca.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Action,Romance"],"nutshell":"Vanships are flying vehicles that float and fly with the use of a rare metal called Claudia. Fam and Jize are young female pilots in the kingdom of Turan who have made a name for themselves for their creativeness and excellent piloting. Turan is currently run by the two princesses, Lilly, the older of the two sisters, and Milia. Then there is Dio, a mysterious pilot who drifted into town several months ago who is just as talented of a pilot as Fam. When the neighboring Ades Republic declares war on Turan, the paths of these people cross and they have to work together if they want to survive."},{"name":" Boku no Yasashii Oniisan","avatar":"https://mangadex.org/covers/83ddd508-d0a2-4f18-a0bf-d236301caaca/e998828f-de07-4610-8659-69641c9325b6.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"When Satoshi Kashiwabara went to Nichoume, he fell in love for the first time with Nichoume's prince, a known playboy. But right after they kissed, he received a message saying his father was in critical condition and left the hotel. A few days later, he found himself living with his step-brother, who turned out to be the prince himself! It's a romantic comedy about step-brothers suddenly living together, knowing they can't be together."},{"name":" Hibike! Euphonium - Quartet (Doujinshi)","avatar":"https://mangadex.org/covers/83e64170-1e97-4710-92b0-ecce586fe438/6d2ef362-6666-483c-b9f1-ba829d93309a.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Comedy,4-Koma"],"nutshell":"A 4-panel comic, comedic doujinshi about the Minami Quartet (Nakagawa Natsuki, Yoshikawa Yuuko, Kasaki Nozomi, and Yoroizuka Mizore)."},{"name":" Saseyo Eroika","avatar":"https://mangadex.org/covers/83e649d1-5254-49e4-bb6e-3d114e2e8062/92b948a7-df7e-4ea0-bac5-0d93dcae3ae5.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Comedy,Harem,Drama,School Life"],"nutshell":"Rintarou is deeply judgmental of women, and hates that his dad has been cheating on his mom with a female neighbor. He does not want to be like his dad, and his thoughts are full of gendered sexual slurs towards his female classmates. The only exception is the most modest girl in his class, Yatsugi Azusa. A mosquito-borne disease seems to be spreading around among the women in his city, whose symptoms are fever and extreme sexual aggressiveness. Will he and Azusa make it through the epidemic?"},{"name":" Danzai Lock","avatar":"https://mangadex.org/covers/83e95476-f38c-4f53-96f5-d1ff8015cacd/608b81ef-fffd-4b80-a1f1-4eac87b6e20c.png.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Action,Drama"],"nutshell":"The manga is set in a world where, no matter what the circumstances, everyone who kills someone is themselves sentenced to death. Those on death row are imprisoned in the \"Six Prison Districts,\" where a strange economic system has emerged. One day, a steam train sends a new batch of prisoners to one such district, as it does every day. A man named Yūshin, who calls himself a chaplain and bears priestly garb, also disembarks, and encounters a man who bears a sword that is called Kunoji."},{"name":" Kizuoibito","avatar":"https://mangadex.org/covers/83efc14e-381d-48f5-b668-189749d10069/481e8142-fabf-430b-b5c0-92a408f1b73b.jpg.256.jpg","country":"Japanese","stat":"7.01","status":"Completed","tags":["Action,Romance,Drama,Mystery"],"nutshell":"Yuko Kusaka is a Japanese journalist sent to Brazil to do a report on the gold rush phenomenon that seems to be making many people rich from night to day.\nRumors say that among the many \"garimpeiros\" (gold diggers) currently on the Amazon forest, there is a Japanese known as Rio Baraki. Reaching their destination, her crew member is promptly attacked and she is raped as a warning to stop their work and return immediately to their home country. Determined to do her job, she stays and finds out from the attacker that he is none other than Baraki, a white haired muscular man with a large scar on his back. Later she discovers that his real name is Keisuke Ibaraki. Once a promising quarterback, he ended up falsely incriminated by a powerful organization known as GPX."},{"name":" Mind Reading","avatar":"https://mangadex.org/covers/83f7b90e-ca60-4912-86a6-19e1cb8befd1/16054b87-ccf5-4900-834e-5d747c31467f.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.85","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Magic,School Life,Web Comic,Slice of Life,Supernatural,Full Color"],"nutshell":"Song Miomiao, an optimistic and energetic girl with mind-reading skills, and the domineering and narcissistic school Adonis, Zhao Wuyou. The two work together to solve other people’s troubles. Playing around along the way, parting ways, and coming back together… a light school comedy love story, hilariously presented."},{"name":" Beauty’s Online Game","avatar":"https://mangadex.org/covers/840d127b-4b9a-41fb-ae9e-1599ec70ef19/843537fc-d7aa-44f4-b5ce-84833fefabd3.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.76","status":"Hiatus","tags":["Reincarnation,Long Strip,Romance,Comedy,Video Games,Magic,School Life,Fantasy,Web Comic,Slice of Life,Music,Full Color"],"nutshell":"Shen Xiao Man is a internet celebrity that went viral from singing. Her talent granted many fans online, but because of her appearance in real life she had to deal with many unfair situations. After a car incident, she met the cosmetic system which turned her to a beauty, to have her appearance remain this way, she has to chase her dreams. Female MC can only open her system’s tasks…"},{"name":" apreha.","avatar":"https://mangadex.org/covers/840e0460-5eeb-48f9-a1ce-9fb95be8d4dd/029cbb6b-5345-4187-9ff4-39b9f748aef3.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot"],"nutshell":"After a four year hiatus, Ume is back in the doujinshi scene. We find out what she’s been doing in the meantime: playing mobile games. Fate/Grand Order, KanColle and THE iDOLM@STER: Cinderella Girls are all included.\nLink:\nThe Doujinshi & Manga Lexicon"},{"name":" Imperial God Emperor","avatar":"https://mangadex.org/covers/840ea776-58ec-4276-83f6-4b3e044d1556/976c7673-0edc-4f1a-99ab-d1dd39f877fe.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.52","status":"Ongoing","tags":["Historical,Action,Romance,Comedy,Martial Arts,Adventure,Fantasy,Web Comic"],"nutshell":"The teenager Ye Qingyu once saw his parents killed by his enemies. Before his parents died, his parents promised that he could not leave their parents' graves for four years and had to practice hard. The time of four years had passed, Ye Qingyu relied on his talent and four years of cultivation. He admitted into White Deer College, slap those who once looked down on themselves, finds the enemy to get revenge for is parents!"},{"name":" Boku wa Hajikko ga Suki","avatar":"https://mangadex.org/covers/8410f7e4-deda-4e72-aa6b-b1953eace585/69362578-b9b4-4ca5-baee-669837f225b7.jpg.256.jpg","country":"Japanese","stat":"7.07","status":"Completed","tags":["Romance,Comedy,Slice of Life"],"nutshell":"Noda Haruko has hatched a plot to get tasty lunches; she's put a love letter in a paper airplane and tossed it out into the world. By chance, it ends up in the hands of a lonely boy named Katou Seiji. Haruko confesses her \"love\" for him, and her hope that he'll become her husband and make her delicious lunches. Surprisingly, Seiji agrees, and becomes her boyfriend-chef. Seiji allows himself to be swept away by her childish enthusiasm, but he keeps trying to find ways to make their relationship more 'real'– by holding hands, kissing, or simply being alone together. Haruko and Seiji navigate their unusual relationship among their friends and classmates, who all have their share of comedic troubles!"},{"name":" Touhou Bunka Shinpou ~ Alternative Facts in Eastern Utopia.","avatar":"https://mangadex.org/covers/841524ee-2a99-47a6-a71c-1fc61236812f/d7bafe19-b0d6-48e7-be85-8364261e0799.jpg.256.jpg","country":"Japanese","stat":"8.41","status":"Completed","tags":["Historical,Comedy,Video Games,Fantasy,Slice of Life,Mystery"],"nutshell":"Following on the heels of Bohemian Archive in Japanese Red, Alternative Facts in Eastern Utopia is presented as Aya Shameimaru's attempt to create a tabloid magazine in the style of \"Shuukan Bunshun\", a notorious high-circulation tabloid published weekly in Japan. This art book, featuring articles, illustrations, interviews, comics etc., gives us a glimpse into the first issue of the \"Bunbunharu Weekly\", which due to various circumstances had to be cancelled right before its release."},{"name":" The One Who Did Not Subjugate the Demon King","avatar":"https://mangadex.org/covers/841cae32-be4c-45fe-89b1-4b635d421261/5af400ae-a76d-4d4e-9a8c-1bb7a8527067.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Oneshot,Comedy,Adventure,Fantasy,Web Comic"],"nutshell":"The demon king has been defeated and peace has returned to the world. However, the other hero lost his job as he was not the one to defeat the demon king. The journey is set on him going back to his village with the wizard from his party."},{"name":" Champagne wa Koi no Biyaku","avatar":"https://mangadex.org/covers/841f1418-1ef3-4dce-a439-560550de6e4f/3939c033-aa16-4fab-bbed-308d16babf62.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Drama"],"nutshell":"Rebecca really is unfortunate. At first her fiancé gets stolen by her stepsister and then she even has to attend the wedding of those two. At the wedding tycoon Graydon Gallagher approaches and comforts her. The next morning she wakes up next to him and is not so sure what might have happened the evening before…\nAfter that Gray proposes to take her on a business trip with him and Jessica agrees, thinking it might be the starting point to a new life… plus Gray assures her that it will only be those two weeks and after that it will simply be just a memory, nothing more."},{"name":" A Con Artist, but That's Okay","avatar":"https://mangadex.org/covers/84231f79-3fff-4e2d-936b-6f0e025640af/c2650d8b-ce8f-4b75-99d4-197418d1dc48.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Historical,Long Strip,Romance,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"\"If you sign this paper, then Milady will become the Duchess of Leviaus for the next year. In exchange, you will receive a deposit of 100,000 rubles and if you fulfil the terms of the contract successfully, you will receive 1 million rubles.\"\nA contract marriage to put an end to the rumour about Duke Leviaus, who has a status comparable to that of the imperial family! The rumour is that the woman who marries Duke Leviaus first will suddenly die from a curse within a year.\n\"If we could catch the person who spread such a wicked rumour, we would annihilate him, even if we have to mobilize all of the estate’s troops. So, don't mind the rumour, Milady.\"\n\"I'm really fine.\"\nBecause… that rumour, was spread by me.\nSeizel, in her second life, dreams of becoming the best con artist who eats away at the empire. She was going to freely live her life by finding her fellow cellmates from her past life and scamming them… This guy looks like a huge pushover, but something's fishy. He's polite, but she thinks he looks a bit sly…?\nCan she fulfil this contract safely?\n\nOriginal Webtoon: Daum, KakaoPage"},{"name":" Cinderella Collection","avatar":"https://mangadex.org/covers/8424b171-ec06-432c-bfda-5439244826f7/09973974-9ff7-4707-8520-58c069ac79f3.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"Shin is a top grade student in primary grade 6. In people's eyes, she's always serious. She's a girl with poor taste, who has no interest in fashion. Half threatened by the fashion King in her class, Omone Asahi, Shin entered the Readers' model interview…! Surprisingly, she gave a stunning performance. She begins her journey to become the legendary super-model…"},{"name":" Mémoires du Masque","avatar":"https://mangadex.org/covers/842667cf-159d-4eee-a465-d4d71d075889/37a3a80c-51ea-4e74-89ec-3eabc6d5c23f.png.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Horror,Fantasy"],"nutshell":"After being in an accident, a high-school girl ends up with strange visions of horror, deaths, and murderers. She is not sure whether these are nightmares or premonitions, so she decide to find out the true meaning of the visions."},{"name":" Some Day, I'm Sure","avatar":"https://mangadex.org/covers/842800e5-a47b-4fc7-83f9-bdbb8405d68c/cdb4e2e2-c803-47e3-91d7-ba2a69bf4e62.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Sci-Fi,Romance,Mecha,Slice of Life"],"nutshell":""},{"name":" Kinoko Ningen no Kekkon","avatar":"https://mangadex.org/covers/8428cc72-ffdd-4517-8984-8da0999b6335/773b536e-e797-481d-9ac1-12e78dccc503.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Girls' Love,Fantasy,Slice of Life"],"nutshell":"Our story begins on an all-woman planet of intelligent fungi, where Ariella and Eriella are about to get married! But they've got a long road ahead of them: illness, surgery, and even a dastardly royal plot that seeks to split them apart. Is their love strong enough to weather any storm? This offbeat, adorable, and dramatic one-shot is sure to please fans of yuri, monster girls, and enduring romance!\n(Source: MangaUpdates)"},{"name":" Demon Order Garan","avatar":"https://mangadex.org/covers/8429eb3c-3512-4181-bffd-d6db38f13642/be9b4cb1-f867-4836-89c4-805189cbf184.jpg.256.jpg","country":"Japanese","stat":"7.52","status":"Completed","tags":["Action,Mecha"],"nutshell":"The story of Garan, a travelling executioner who roams the land, killing bad guys."},{"name":" Delinquent High School Girl and Class Rep","avatar":"https://mangadex.org/covers/842cfde9-da4d-4637-97e3-d084685cabd8/144c9396-14d6-4032-9345-ef1de6324773.png.256.jpg","country":"Japanese","stat":"7.05","status":"Completed","tags":["Romance,Girls' Love,School Life,Web Comic"],"nutshell":""},{"name":" 01","avatar":"https://mangadex.org/covers/8434ab5f-b778-491c-804e-13722331739b/64e5d825-d7a5-4c82-b858-ba7582a2e7a3.jpg.256.jpg","country":"Japanese","stat":"7.42","status":"Completed","tags":["Action,Martial Arts"],"nutshell":"The year is 2028, location in New Koshigaya. A young boy, Isurugi Neru, lives in a poor family and is forced to quit school so that he can find his own way in life. Neru on the other hand, only thinks of one thing: to take revenge on Yagami, a classmate, who's especially gifted and has humiliated Neru numerous times."},{"name":" Love Live Sunshine - The Two of Us (Doujinshi)","avatar":"https://mangadex.org/covers/84367b12-ca13-4cdf-a623-deff6c12a338/e8991785-81fe-4ff7-a26e-be98c5caf81f.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Oneshot,Official Colored,Girls' Love,School Life,Full Color"],"nutshell":"A short Love Live (Aqours) doujin with You and Riko.\nOriginal Tweet: https://twitter.com/kireha0731/status/1123474543316754433\nArtist's Twitter: https://twitter.com/kireha0731\nArtist's Pixiv: https://www.pixiv.net/en/users/3246385"},{"name":" A Boy Who Crossdressed Because Buying Chocolate Around Valentine's Is Too Embarrassing 🍫","avatar":"https://mangadex.org/covers/843700b7-5eb5-488c-a0cb-3a85b2541ada/fb193299-29f4-431c-93ac-450374282b5d.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Boys' Love,Crossdressing,Web Comic,Full Color"],"nutshell":""},{"name":" atti atti","avatar":"https://mangadex.org/covers/84394e40-a9bc-419c-8769-f4eb909765b9/1ad47930-423c-4eab-99b6-1dfec8d22e17.jpg.256.jpg","country":"Korean","stat":"8.23","status":"Completed","tags":["Animals,Romance,Web Comic,Slice of Life,Full Color"],"nutshell":"Cute animals with a better love life than me & more. （・⊝・）\nHealing webtoon."},{"name":" THE iDOLM@STER - M (Doujinshi)","avatar":"https://mangadex.org/covers/843b21e5-ae25-4639-b097-728b322798ac/ef4a6238-951d-4c25-8123-439fe78bc47d.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot,Comedy,Girls' Love,Full Color"],"nutshell":""},{"name":" Baki Gaiden - Retsu Kaioh Isekai Tensei Shitemo Ikkō Kamawan!","avatar":"https://mangadex.org/covers/843c31ff-d390-4199-bc3b-94b0dfc63632/503e763f-c7e1-453d-9508-1ba29bf5d022.jpg.256.jpg","country":"Japanese","stat":"8.32","status":"Ongoing","tags":["Reincarnation,Action,Sports,Adventure,Isekai"],"nutshell":"After the events of Baki-Dou, the famous Kenpo master Retsu Kaioh wakes up in a new world unknown to him.\nNote: This is the official entry, not to be confused with the Doujinshi from Twitter user @sakuramankiti."},{"name":" Kanojo no Carrera","avatar":"https://mangadex.org/covers/843ca1ad-371d-4112-a75c-6db0d86547bd/db5e2e31-fec3-4046-b3a9-ea83ff2b567d.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Ongoing","tags":["Comedy,Sports,Tragedy"],"nutshell":"The main character’s father passes away. The will states that each of the three siblings receive a portion of the father’s wealth. The main character receives a Porsche Carrera. She doesn’t know what a Porsche Carrera looks like, didn’t know the car company Porsche, can’t drive a manual and had absolutely no interest in cars, at the time."},{"name":" ShenHao's Heavenly fall System","avatar":"https://mangadex.org/covers/843e14f8-7fd3-494f-ac88-582d3f4880d4/00453411-d09c-42e9-ad8d-41ad1f564319.png.256.jpg","country":"Chinese (Simplified)","stat":"7.71","status":"Ongoing","tags":["Action,Long Strip,Romance,Martial Arts,Fantasy"],"nutshell":"After three years as a son-in-law, Xiao Ge suffered countless glares and insults. But the kindness and beauty of his wife made it hard for him to give up. Finally, once the Shenhao system was awakened, life began to hang on from then then on he became unpredictable"}]