[{"name":" GIGANT","avatar":"https://mangadex.org/covers/6402465b-2562-427a-ab8f-05c13220ce8f/a471b1e7-21c2-4e58-a0e3-27b93360ef6d.jpg.256.jpg","country":"Japanese","stat":"6.68","status":"Completed","tags":["Sci-Fi,Action,Romance,Drama,School Life,Aliens,Mystery"],"nutshell":"Rei Yokoyamada, a high school boy who has a movie producer father. One day, while out with friends to shoot a film that he plans to enter into a film festival, a poster of Papiko, an adult video actress with big breasts, catches his eye."},{"name":" I Won't Become a Villainess. I'm Just a \"Normal\" Duke's Daughter!","avatar":"https://mangadex.org/covers/6406f5ca-ebc1-4afe-8b5e-280593a82308/052e26bb-8b3a-40ee-9a61-c9584562c68e.jpg.256.jpg","country":"Japanese","stat":"8.45","status":"Ongoing","tags":["Reincarnation,Animals,Magic,Isekai,Drama,Fantasy,Villainess,Adaptation"],"nutshell":"Although I should have avoided the death flags, suddenly the Heroine event occurs?!\nA Japanese person reincarnated into an otome game chock full of death flags for the villainess, Rosalia.\n\"I'm going to live an enjoyable life in this world!\"\nMaking full use of the game knowledge to avoid death flags, for some reason events keep happening one after another?! Contracting with spirits, helping her father, the prime minister, with his work using her modern day knowledge, taking a walk with the holy beast… and on top of all that, even starting up the heroine's event…?\nWill Rosalind be able to smash through every unknown death flag that comes her way…?! And will she be able to be fluffy lovey dovey with the supporting beastkin character she liked from her previous life――?!?!\nNote: Protagonist’s name begins as Rosalia, this is not a mistake."},{"name":" Fukumaden","avatar":"https://mangadex.org/covers/64083e47-2914-4c43-a907-7f794eb1b876/940b717e-f847-4df0-8b93-ca29e678a814.jpg.256.jpg","country":"Japanese","stat":"7.47","status":"Completed","tags":["Romance,Comedy,Harem,Fantasy,Slice of Life"],"nutshell":"The hero has defeated the Demon Lord and peace has returned to the land, but some day in the distant future, the Demon Lord will return. In order to ensure that the hero's bloodline will remain to defeat him once again, women from across the world have been gathered to form a harem and bear his children.\nThe series follows the various (and often incredibly lewd) conversations the members of the harem have to kill time as they wait for their turn with the hero, and for their children to be born afterwards.\nNote: The series is published in a seinen magazine by Cool Kyoushinsha, but under the name Kuruki Kaname, which he generally uses for hentai."},{"name":" Tales of Symphonia - Clover (Doujinshi)","avatar":"https://mangadex.org/covers/640b9144-19a0-4765-a7e0-0b74085d6ae3/2eac2108-b5f4-451d-9418-c2e78e31dfd0.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"A short Pixiv doujinshi of the couple ShihnaxZelos from Tales of Symphonia. During a short break on their journey, Shihna decides to make shamrock circlets for everyone (mostly because Collete insisted). Everyone including Zelos…"},{"name":" Kami-sama Darling","avatar":"https://mangadex.org/covers/64115baa-5ea0-4553-b198-92d4839546ed/8fab82e9-72f5-4ffe-8019-5fb1acc956f9.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,Drama,Slice of Life,Supernatural"],"nutshell":"University student Satake Aoi awakes rolled up in a red string and with a stranger inside his house that says he's a god. Aoi escapes, but something is… different… He's now extremely popular and everybody's fighting for his attention. What's the relation between these events and some promise he made with the man that calls himself the god Ookuninushi-no-Mikoto – and what will happen from now on?"},{"name":" Dragon and Phoenix Flip","avatar":"https://mangadex.org/covers/6411cb80-c42a-42c3-a9d9-6edd6948f79d/b48cd94a-837b-479a-9ac8-904bf0a0fa58.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.66","status":"Ongoing","tags":["Action,Long Strip,Comedy,Crossdressing,Drama,Web Comic"],"nutshell":"Fang Minzhu, a small agent in the entertainment industry, was introduced to the most popular idol girl star Liang Youxi as a life agent. But Liang Youxi asked for a male agent. Minzhu, who is in desperate need of work, gritted her teeth and pretended to be a boy who applied for the job, but Liang Youxi was very mysterious; \"I choose a boy because this can make you stay away from my private life with integrity.\" It is strange of the female star to say that. In a certain accident, Minzhu found out Liang Youxi's secret. It turns out that Liang Youxi is…"},{"name":" Kareshi no Koto ga Suki Sugite Kyou mo Zenryoku de Ikiru!!!","avatar":"https://mangadex.org/covers/641201c8-a37e-4c6e-a129-802188d34cda/a37f01e2-0546-4b53-9139-ac47a8f023d1.jpg.256.jpg","country":"Japanese","stat":"8.48","status":"Ongoing","tags":["Romance,Comedy,Slice of Life,Adaptation"],"nutshell":"I love my boyfriend so much I'll tell the entire nation. I will love him as long as I live.\nBoasting? No, just fangirling.\nAn enjoyable love comedy about the boyfriend-otaku who becomes crazy for her cool boyfriend as she showers him with love!\nAn autobiography, pulled from the tweets of a popular twitter user (Merori) that have also been compiled and made into a novel.\nLinks:\n\nAuthor's Twitter\nArtist's Twitter"},{"name":" Love Live - Nico-chan, we love you! (Doujinshi)","avatar":"https://mangadex.org/covers/641338ea-2769-4660-9522-9c85169ba0a7/0845153e-be36-4ec9-b861-11df810f6d52.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Comedy,Girls' Love,4-Koma"],"nutshell":"A peek at Nico's everyday life as she interacts with the rest of Muse.\nAny day can be a Nico day if you Nico Nico Nii hard enough btw.\n{ Nico x Everyone }\n Artist’s Pixiv\n Artist’s Twitter"},{"name":" Shitsuren Biyoushitsu","avatar":"https://mangadex.org/covers/64177ece-5aba-4aa9-b559-51ec3ac1e09b/dc689d9a-7492-4390-8f44-96eb3505202b.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Anthology,Drama,School Life,Slice of Life"],"nutshell":"A collection of 5 oneshots:\n\n\nShitsuren Biyoushitsu\nShe breaks the school's hair code because she wants to be noticed by the teacher. But, her teacher is transferring…\n\n\nItsuka Suki to Ieru Made\nTamao grows her hair in order to look like a decent girl, but…?!\n\n\nKono Koi wo Mousukoshi Dake\nNana and Nene are twin sisters. Nene's always copying Nana, and…?!\n\n\nKimi Iro Destiny\nHaving red hair was my complex. You told me that it was the red string of fate…\n\n\nShitsuren Mobius\nKirie goes to the Shitsuren Biyoushitsu. That is because of her hopeless love towards her sibling…"},{"name":" Kiraboshi Ojou-sama no Kyuukon","avatar":"https://mangadex.org/covers/6419c7b0-8aca-43f3-a822-e7e56124783c/f0527357-25dc-4654-865f-ce6c51f4768d.png.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Romance,Comedy,School Life"],"nutshell":"One day, Yoshimi Numamoto suddenly receives a marriage proposal from a beautiful girl, when he doesn't even know her name. Apparently, she is a super-wealthy young lady. How can she she be so sure of herself? He can't help but feel embarrassed at the situation, but she remains insistent... and soon his school life will be turned upside down! Sparkling girl x plain boy super-darling love comedy begins!!\n<BR><BR>\n(Source: Weekly Shonen Magazine, translated)"},{"name":" The strongest dad in history","avatar":"https://mangadex.org/covers/641bd47e-563a-4fb5-b065-0e8c91650b55/3d62e226-6e46-40e8-9bd1-1b3d4245741a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Completed","tags":["Reincarnation,Official Colored,Long Strip,Martial Arts,Adaptation"],"nutshell":"Zhang Fan, a generation of Dragon Soul Heavenly Emperor, returned from the rebirth, and when he opened his eyes, his beloved daughter was actually bullied! ? With an order, one hundred thousand dragon souls return! (Adapted from the original novel \"The Strongest Daddy in History\""},{"name":" Soushi Souai","avatar":"https://mangadex.org/covers/641d88f7-e2cc-4c51-abec-6729042f2741/d2648298-6d7b-444f-9b30-748feef7d317.jpg.256.jpg","country":"Japanese","stat":"7.68","status":"Ongoing","tags":["Romance,School Life,Delinquents,Slice of Life"],"nutshell":"A cute, inevitable, warm love story between a blond delinquent boy and a black-haired serious girl."},{"name":" Athenaeum of Malice","avatar":"https://mangadex.org/covers/64248689-8914-49de-89b9-c5cbce2c919a/0b80a32e-39fb-476c-943f-51f0039c6d4c.jpg.256.jpg","country":"English","stat":"7.96","status":"Ongoing","tags":["Demons,Long Strip,Romance,Boys' Love,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Dominated by soul-corrupting spirit, can Yona find freedom in Athenaeum of Malice?"},{"name":" The Legend of Zelda: Phantom Hourglass","avatar":"https://mangadex.org/covers/642801ac-7f6e-41f1-9438-c2730c816101/76cdc317-af5c-4a1f-a94f-c32adb97e6a7.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Action,Comedy,Adventure,Video Games,Fantasy,Adaptation"],"nutshell":"The story follows Link and Tetra, who live in a flood-covered Hyrule called the Great Sea. Traveling on Tetra's pirate ship, the pair discover a Ghost Ship. Immediately after Tetra boards the ship, she screams for help. While Link attempts to follow her, he slips and falls into the ocean. Washed ashore on an island, Link is awakened by Ciela, a fairy. Exploring the island, Link finds the Phantom Hourglass, filled with the Sands of Hours, and meets an old man named Oshus, who wants to help Link find the Ghost Ship and reunite with Tetra. To aid him in his quest, Link enlists the help of Captain Linebeck and his ship, the S. S. Linebeck, which Link, Ciela, and Linebeck use to visit islands. After scouring the Great Sea, Link learns that he must use maps and clues hidden in the Temple of the Ocean King to find the Spirits of Courage, Wisdom, and Power, which in turn will help him locate the Ghost Ship…"},{"name":" Hadashi De Bara Wo Fume","avatar":"https://mangadex.org/covers/642a892b-5b53-4087-a1fd-a1697a55b4af/16cc3174-9436-4b89-9b32-a476506f7a4d.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Historical,Psychological,Romance,Drama,Slice of Life"],"nutshell":"A rags-to-riches romance from the creator of Tsuki no Shippo!\nPoor Kitamura Sumi…her irresponsible older brother Eisuke keeps bringing home orphans for her to take care of even though they can barely afford their own basic needs! Just when Sumi's financial problems become dire, wealthy Ashida Soichiro enters her life with a bizarre proposition—he'll provide her with the money she so desperately needs if she agrees to marry him. But can Sumi pull off fooling high society into thinking she's a proper lady? Moreover, is it worth it to give everything up for this sham of a marriage?"},{"name":" Arknights: Get to know Rhodes Island (Doujinshi)","avatar":"https://mangadex.org/covers/64306bdc-d9e5-4e38-a77c-ab2ce6944128/f06e9d44-a8bb-435f-8e41-ee2b385f3f88.png.256.jpg","country":"Chinese (Simplified)","stat":"8.41","status":"Ongoing","tags":["Comedy,4-Koma,Web Comic,Slice of Life,Full Color"],"nutshell":"A fan made manga by Xiujia_yihuizi based on the mobile game Arknights.\nA comedic slice of life manga about operators in the Rhodes Island Pharmaceutical, Inc.\nYou can support Xiujia_yihuizi on:\n•Weibo\n•Pixiv"},{"name":" The Fight of Gods (Fanmade One Punch Man Comic)","avatar":"https://mangadex.org/covers/6431a544-f126-449d-ac00-64df39f549a7/9e795725-4c35-4dcf-ba72-0e58b978144a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.54","status":"Ongoing","tags":["Sci-Fi,Monsters,Action,Superhero,Martial Arts,Aliens,Supernatural"],"nutshell":"A fanmade comic by Cminglap, depicting Saitama vs a Godlike entity.\nWARNING: SPOILERS FOR THE ONE PUNCH MAN WEBCOMIC!\nAuthor & Artist: https://twitter.com/cminglap"},{"name":" Yong Sheng","avatar":"https://mangadex.org/covers/643b86ad-0e88-4ca2-99f0-e48651ade159/8e039078-f1fb-4092-8ddf-456aa9119fb3.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.08","status":"Ongoing","tags":["Action,Long Strip,Martial Arts,Adventure,Wuxia,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"The humble house-slave Fang Han traveled the world to build up his own strength, forging his ordinary flesh into an immortal body. Now he will step into the immortal realm and claim his rightful place on top of the throne!"},{"name":" Sorairo no Graffiti","avatar":"https://mangadex.org/covers/643dd54b-d76e-4f7d-a866-bc0c69478b5a/3c737a6c-497d-472a-b0f3-95a4b46d471b.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Ongoing","tags":["Long Strip,Romance,School Life"],"nutshell":"A girl who only brings about misfortune. A boy who has been blessed with nothing but good luck. When those two meet… what will happen?\nOriginal webcomic: http://www.comico.jp/articleList.nhn?titleNo=10807"},{"name":" Distancia ~ The Untouchable One ~","avatar":"https://mangadex.org/covers/644696ed-471b-4797-a99d-1797378550f4/cc3685b5-fdd8-4aba-bb65-33a1bd452200.jpg.256.jpg","country":"Chinese (Traditional)","stat":"7.61","status":"Completed","tags":["Long Strip,Romance,Comedy,Reverse Harem,Drama,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Luna has been keeping her powers a secret from other people. One day, she initiates a fire in her house for being distracted, and is there when she comes to know that she's actually a witch. after that, She's summoned by her grandmother and goes to an island to train as a witch… a story about a modern witch and werewolf is about to begin."},{"name":" Dr. Dead","avatar":"https://mangadex.org/covers/6448e5d7-9919-4280-a71a-f7516999ed5f/f1d3c1af-425e-4095-9221-73e49a375bad.png.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Oneshot,Sci-Fi,Action,Adventure"],"nutshell":"In a world where robots called Familer rule over the humans, a young girl Jusen attempts to stop their dictatorship with the help of a strange man, who seems to know her and her dead mother…."},{"name":" He Doesn’t See Me","avatar":"https://mangadex.org/covers/644a51a5-971d-4b60-95c9-a92bb2a99bb7/5ca0ff12-3688-4ade-b37a-53547fb1e118.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,Office Workers"],"nutshell":"I, Yui Nakagawa, I was hired as an office worker and entered a small company with only three guys. The boss is young and handsome, but mean and rude. What a waste for such a hot guy! One day one of the staff told me that I look like his lover... What does that mean...? That's going to keep me up at night... What is the truth about his lover?"},{"name":" School × Tukuru","avatar":"https://mangadex.org/covers/644c1b7b-b437-4d4e-bae0-13a664312b2b/c34076dd-46d0-407e-87cd-d71733946bcd.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Comedy,Adventure,School Life,Slice of Life"],"nutshell":"Nako Nakahara, a literary club member met\nKizuku Tachikawa, an art club who decides on garbage with a serious face, behind the building.\nI just came to look for a bookshelf that could be used in the club room, but before I\nknew it, I was caught up in the grand plan of Kizuku …!?\nA popular school DIY comedy presented by Riki Taoka from \"My Room\" and the new golden combination of popular illustrator wogura !\nPublished in the Monthly Shōnen Sunday (Gessan)"},{"name":" Kantai Collection -KanColle- Young Pet Kaga-san And Akagi-san (Doujinshi)","avatar":"https://mangadex.org/covers/644d1f77-543e-4d9e-b683-d5fb1b398a81/520f54dc-1e37-414e-b7aa-3fd46cdf40d2.jpg.256.jpg","country":"Japanese","stat":"7.60","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":""},{"name":" Dolphin","avatar":"https://mangadex.org/covers/6462d958-278a-4ca9-ab3b-597887cb9e72/0131d674-4202-4a2d-81e4-607c5b0b5e59.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Action,Comedy,Delinquents"],"nutshell":"In the 1980s, there was a legendary bosozoku (biker gang) in Yokohama that was touted as \"the strongest in Japan.\"\nIt is a record of the legendary Devil's Dolphin built by the man who united the team and his friends!\n(Source: MU)"},{"name":" Cherry na Bokura","avatar":"https://mangadex.org/covers/646924a3-d7f3-4eb6-b391-6a17387f16a5/1d61fae3-b011-4833-93c4-118784abde83.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,School Life"],"nutshell":"A 17-year-old girl, who has no experience with guys, one day sees a classmate drop something and without realizing what it is, she returns it to the guy. But soon she finds out that what she picked up was actually a condom! After school, she coincidentally meets the guy in the hallway and she's excited to be so close to a guy for the first time! But when she sees him flirting with other girls, she realizes that he's just a player…? What will happen between them?!"},{"name":" Fly Like A Butterfly, Sting Like A Bee","avatar":"https://mangadex.org/covers/646c0235-6cdf-4a30-ac17-ccf22d99b969/1791c4ec-4889-4af7-a301-ecff86dc4a9c.jpg.256.jpg","country":"Korean","stat":"8.12","status":"Completed","tags":["Oneshot,Long Strip,Romance,Girls' Love,Drama,School Life,Web Comic,Full Color"],"nutshell":"Ranju's sinful(?) gaze is always focused on the kind and popular angelic-like beauty in school, Jiha. When Ranju overhears that Jiha will be going on a date, she becomes determined to seduce her before it happens!"},{"name":" Niizuma Danshi","avatar":"https://mangadex.org/covers/646f65a3-c5a2-460e-9150-573469b03f35/4a6ecf6c-01cc-4149-a2e9-2b702aaa3f08.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Crossdressing"],"nutshell":"Ayato por fin se reencuentra con su preciado amigo de la infancia Kouhei, pero… vestido de chica en una entrevista de matrimonio!?"},{"name":" Hatsujou 5 byou mae ponkotsu arasaa airu san ga alpha no ouji ni aorarete masu  ","avatar":"https://mangadex.org/covers/64791385-99d7-4f29-b62e-5219f8704a9a/46140528-b1b8-40f4-a0ac-abc9c22c93cd.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Romance"],"nutshell":"One day, our protagonist is assigned to be a mentor to the president's son, Taiga Narukami, an elite boy with a shiny new look. However, Taiga becomes frustrated with Airu's uncompromising attitude, and finally takes her lips in a forceful manner. Airu's body gets wet under Taiga's rough kisses and fingertips. When Narukami-kun touches her, her body becomes so numb that she can't think about anything else...!"},{"name":" Hoop Men","avatar":"https://mangadex.org/covers/6484bf45-0133-4408-9274-9765577d86bd/ce6f98c2-18b3-43a2-a26b-f199ee70d067.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Comedy,Sports"],"nutshell":"Satou Yuuho gets called out by the cute basketball club manager, Koganei Mao. He thinks that it is a love confession, only to find out that it is only to help the basketball club…"},{"name":" Koishite Daddy","avatar":"https://mangadex.org/covers/6488384d-7de6-483e-9bc0-68f63fcf4798/21a84668-4a8b-4003-988b-48452628093a.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"Salaryman Satou is a single dad, raising his toddler son, Rintarou, all by himself. By chance he gets closer to his neighbour Takahashi, a university student who happens to be gay. Other than being fond of kids, this university student puts his heart into helping Satou, causing the man to slowly be attracted to him. But due to the fact that he was just newly divorced, he plans to stay away from Takahashi in order to take care of himself. Stuck with this dilemma, Satou can't stand Rintarou's demands to look for Takahashi anymore and reprimands his son in annoyance! This is a cute and sweet family story!"},{"name":" Steins;Gate - Hiyoku Renri no Sweets Honey","avatar":"https://mangadex.org/covers/64897926-3836-4307-a89d-86fb4d4ae4af/5084f298-009b-44f1-a7f1-9a487c9ff32a.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Romance,Comedy,Slice of Life"],"nutshell":"In the Steins;Gate - Hiyoku Renri no Sweets Honey series:\n\nV.1 - Hiyoku Renri no Sweets Honey\nV.2 - Motto Hiyoku Renri no Sweets Honey\nV.3 - Hiyoku Renri no Sweets Honey Final"}]