[{"name":" Umwelt - Igarashi Daisuke Anthology","avatar":"https://mangadex.org/covers/5bc1b560-178e-4604-9350-aa04972a581a/630288d9-3a21-46bd-9d29-4b3bc72390eb.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Oneshot,Sci-Fi,Action,Anthology,Adventure,Philosophical,Fantasy,Slice of Life,Supernatural"],"nutshell":"A collection of stories. Contains the original oneshot, Umwelt.\n\nGaruḍa\nWani\nUo\nOni, Raishuu (Good for You, Rainy Man)\nTsuchinoko\nDankon Darasco\nYokkata ne Ameotoko\nMasayoshi to Baachan\nMoon Child\nUmwelt\nA genetically engineered girl escapes from her home and the doctor that created her must pursue her with the help of military personnel."},{"name":" Re Re Honey ~S.O.S Daisakusen~","avatar":"https://mangadex.org/covers/5bc8917e-2d26-479c-95fc-4a145bb9729a/02bfc58d-b1dd-45d4-b7e1-098dc6197008.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Comedy,Drama"],"nutshell":"ReRe Hello x Honey and Granulated Sugar\nA crossover featuring Minato and Ririko from ReRe Hello (by Minami Touko), and Nao and Taiga from the oneshot Honey, which later became the series Granulated Sugar (by Meguro Amu)."},{"name":" What’s Wrong With Liking Big Tails?","avatar":"https://mangadex.org/covers/5bc940b5-fe46-4b89-8368-9b945442eb1b/f1d034ca-ac71-4e20-b7cb-f7bcfadf2911.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.16","status":"Ongoing","tags":["Action,Romance,Comedy,Adventure,Harem,Fantasy,Monster Girls,Full Color"],"nutshell":"They say the big shot light slayer Erl has no interest in women, but only he knows that none of YOU are his type~"},{"name":" Star Collector","avatar":"https://mangadex.org/covers/5bcac780-a7a8-45d7-a54c-157dc7cbc36e/a3609afa-517f-4b9c-8ea6-f07bdb87f6f2.jpg.256.jpg","country":"German","stat":"7.95","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"Fynn has always been lazy: his favorite activities are skipping class, smoking, and lounging around. When his girlfriend breaks up with him, telling him to try doing something else for a change, he has no idea where to even start.\nOne night, on a walk around the neighborhood, he comes across Niko stargazing on a hill. Niko wants nothing to do with this chain-smoking, loud-mouthed guy getting in the way of his astronomy— but Fynn is intrigued.\nWhat's up with this nerdy boy who loves to watch the stars, and why is Fynn so captivated by him?"},{"name":" Miraizer Vam","avatar":"https://mangadex.org/covers/5bcae92e-322e-4c22-9b26-45dd5e7edd51/c9db0d1c-dbfe-4a0e-8fe9-c90887e5101d.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Sci-Fi,Time Travel,Action,Psychological,Comedy,Adventure,Philosophical,Drama,Slice of Life,Supernatural,Tragedy"],"nutshell":"(from ebookjapan):\nWhat is time? What is life? A superhuman who travels through time, from the past to the future--Miraizer Vam!\nIn the eternal circle of time, a boy desperately fights against his destiny. When will he solve all the mysteries and learn about himself? A popular SF tale!"},{"name":" The Beast","avatar":"https://mangadex.org/covers/5bcbe112-0e6d-4e3b-961a-26c2a8517dc5/82d4856a-3d5e-4a12-8777-6b4a36b831f4.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Action,Horror"],"nutshell":"Unknown beings across from the city’s neon lights, preying on you. Do not fear. There is the Beast!"},{"name":" Love Live! - Yes! We are school idols! (Doujinshi)","avatar":"https://mangadex.org/covers/5bce8b2c-867c-40bf-9107-c0983b214243/b2242b6b-e6ab-4511-92cf-230d1dc6d9e8.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Oneshot,School Life,Slice of Life"],"nutshell":""},{"name":" Maou Iburogia ni Mi wo Sasageyo","avatar":"https://mangadex.org/covers/5bcfb652-f00a-4e36-9cb6-c9d86cf27eb8/d79fb6e1-4a0d-4807-927a-872eccd8eb13.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Ongoing","tags":["Reincarnation,Long Strip,Romance,Boys' Love,Video Games,Isekai,Fantasy"],"nutshell":"\"Like, make me your woman.\"\nThe strongest couple appears to conquer another world!?\nToshiaki Ushito (commonly known as Goz) is a socially stray person. One day he is shot dead and wakes up–wait what? He was reincarnated in a game world! Moreover, in front of him is the figure of that game's Last Boss, Demon King Ibrogia, who had been longing for a long time! He who was still young before awakening was trembling with loneliness.\n\"I fell in love with you… I'm dying to start courtship!?\"\nThe lonely demon king x demon king who is on the verge of darkness, the world conquest love (!?) Of such a terrible man, begins now!"},{"name":" The Dauntless Celestial Emperor","avatar":"https://mangadex.org/covers/5bdce757-ef7c-4826-9b39-0b25bc8afcc4/d9cc1bb1-61ab-478a-812a-4c04cf267401.png.256.jpg","country":"Chinese (Simplified)","stat":"7.94","status":"Ongoing","tags":["Official Colored,Long Strip,Fantasy,Full Color"],"nutshell":"The celestial emperor has been reincarnated as an insignificant cowherd. Yet, he still recalls his enemies from his previous life. He vows to make his enemies pay a blood price to compensate for the suffering they had inflicted on him. However, he never expected his current form to be incapable of cultivation. Hence, he must find an alternative way to rebuild his primordial spirit. Gradually, he rises against his fate, letting everyone in the celestial realm know that he, the celestial emperor, has returned!"},{"name":" Yumemiru Renaissance","avatar":"https://mangadex.org/covers/5bdd16b0-75e3-44b1-b8f2-42809cc5fd3b/6a4fecfe-648b-43df-a971-7c013ed41df7.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["4-Koma,School Life,Slice of Life"],"nutshell":"Licia, born in Florence in the 16th Century, wanted to become a Moe art illustrator!\nA girl who dreams of becoming a painter, Licia, falls from the sky in front of the slightly otaku girl, Ren! Claiming that she came from Florence in the 16th century, Licia decided to pursue the path of Moe art after seeing the anime poster in Ren's room. This is the story of the dream and friendship of a painter girl who transcends countries and eras!"},{"name":" Yuube wa Otanoshimi Deshita ne","avatar":"https://mangadex.org/covers/5bdd7755-e09b-494d-810a-08f447033c0e/a4c8d2e7-885f-4aa8-8932-06f1c9da3ed6.jpg.256.jpg","country":"Japanese","stat":"8.21","status":"Ongoing","tags":["Award Winning,Romance,Comedy,Video Games,Slice of Life,Gyaru"],"nutshell":"Takumi Satsuki plays online video game “Dragon Quest X” using female character Powder. He becomes good friends with his teammate Goro-san who uses a male character. One day, Takumi Satsuki offers to share his place with Goro-san. When they meet, Takumi Satsuki is surprised to see that Goro-san is a woman. Her name is Miyako Okamoto and she has a gyaru style."},{"name":" Arm Strike Pantser","avatar":"https://mangadex.org/covers/5bde185c-5583-4603-8588-0355dff585ba/04d10a93-a159-49c4-a954-5ecd97fd9bb0.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Sci-Fi,Genderswap,Loli,Action,Comedy,Magical Girls,Magic,Web Comic,Aliens,Supernatural"],"nutshell":""},{"name":" Regina Rena – To the Unforgiven","avatar":"https://mangadex.org/covers/5bea62a6-0a5e-4443-8173-550b575d6405/0028e94c-2e2e-4160-85d8-0318012ddf56.jpg.256.jpg","country":"Korean","stat":"8.06","status":"Hiatus","tags":["Action,Long Strip,Romance,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"\"I'll give you a chance. A chance to be forgiven.\" The father sold his daughter. And the daughter returned from Hell. In an empire with a diversity of the living and the dead, the young Rena Rubel was destined to die as a sacrifice for her father. But six years later, the girl who everyone thought had died, came back to life. Taking off the mask of a little lamb, and becoming a lion."},{"name":" Photon","avatar":"https://mangadex.org/covers/5beb70f0-8cb7-47c7-911b-b5bfd0a72660/8515f32e-0c36-4583-8cea-841a8e921c83.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Action,Romance,Comedy,Adventure,Harem,Fantasy"],"nutshell":"Guy with a 70-word vocabulary doodles on sleeping Naked Chick in a fit of sheer immaturity, Naked Chick wakes up and attacks Guy, Guy accidentally marries Naked Chick, and then the two gang up with Noisy Girl while trying to avoid Perverted Villain and his moronic minions. Meanwhile, Perverted Villain's fiancée, Naïve Princess, disobeys her father's word and goes off in search for her love.\nGot all that, or should I run it by you again?"},{"name":" Anarchy","avatar":"https://mangadex.org/covers/5befe081-96ad-4569-9991-f3b5cd032d3b/5894d091-7eeb-450b-8e79-f6df63c80336.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Anthology,Horror"],"nutshell":""},{"name":" Awayuki no Namida","avatar":"https://mangadex.org/covers/5bf1960a-b7d0-40d4-8b93-90b0f46650f9/38f6abbf-42fc-402a-81a0-a238d56b9c17.jpg.256.jpg","country":"Japanese","stat":"7.56","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"Ritsuka, who likes to watch the snow as it falls, has an unrequited love for Fubuki, who lives with an older woman. Ritsuka and Fubuki fall in love, but Fubuki still has past debts toward the older woman, who was his dead brother's fiancee."},{"name":" Devilman (Mitsuru Hiruta)","avatar":"https://mangadex.org/covers/5bf2d2a9-a21b-4596-8f31-2cd6779c7837/ea6f6835-1a22-4c71-bc2b-4732b862acc8.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Action,Drama,Horror,Supernatural,Mystery,Tragedy"],"nutshell":"A manga adaption of Devilman partly based on the 70's anime."},{"name":" Dragon Slayer～Koi ni ochita ryū to tensei no kishi～","avatar":"https://mangadex.org/covers/5bf4a7df-9213-4777-afc0-d13b08b08737/05e80230-8360-46e3-b06a-2c62527f8999.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Fantasy"],"nutshell":""},{"name":" Bakuten Hero Blader DJ Season 2","avatar":"https://mangadex.org/covers/5bf7a75a-6e49-43dd-85a5-5ee1aea23f97/23ad9354-bbbf-4123-bf99-aeb2dd8a407b.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":[""],"nutshell":""},{"name":" Kono Yoru no Subete","avatar":"https://mangadex.org/covers/5bff2974-327a-4aef-9bcd-1921fdc17780/a2dc87a9-bbb2-4abc-9da0-890c39647ecf.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"Nanao is a bodyguard who couldn't care less about the ins and outs of his daily routine… But when he's put in charge of training the eye-catching (and very young) new recruit Aoi, his sarcastic jabs are challenged by the cool precision of Aoi's commitment to the job… Will these two very different men become partners in work………and play? This Night's Everything pairs a beautiful orphan with a jaded assassin in the name of protecting a powerful public figure……… but it's the duo's private exploits that steal the spotlight! Can an old hand teach a trainee a few new tricks? Or will the truth about a shocking betrayal change the fates of both men forever?"},{"name":" Beast Children","avatar":"https://mangadex.org/covers/5c0094b6-ae83-4298-814d-48b99059aedc/a84d61c7-4431-443e-b38d-a64ffa5587c3.jpg.256.jpg","country":"Japanese","stat":"7.44","status":"Completed","tags":["Sports,School Life"],"nutshell":"Blood, guts and glory! You can find it all on the rugby field. A young man is about to be introduced to the sport of rugby in this brand-new series!"},{"name":" Song of Heaven and Earth","avatar":"https://mangadex.org/covers/5c00adc1-15da-4d11-bb0f-f5eb043e1789/b1cfb48a-e180-42d2-96f1-59435f85bc7a.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Oneshot,Drama,Supernatural"],"nutshell":"A tale of two siblings—one unconventional, the other harboring a great secret."},{"name":" Sexy Voice and Robo","avatar":"https://mangadex.org/covers/5c02d8c1-d4a7-476f-a6ab-c5d0577dab17/4c2643f8-4635-4be2-bba1-04b20469f0fe.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Drama,Slice of Life,Mystery"],"nutshell":"She calls herself Sexy Voice. To most of the world, she's just Hayashi Niko, an ordinary schoolgirl - but when time permits, she lives a double life as a hired investigator/spy. To help her, she has recruited the rather unlikely assistant she calls Robo, a geeky lump of a man who doesn't really know why he feels the need to do everything she tells him to. He just does it. Together, the odd team solve a number of cases for Sexy Voice's employer, an aging gangster.\nCurrently on Hiatus after 2 volumes."},{"name":" Egao no Sekai","avatar":"https://mangadex.org/covers/5c04b070-dad5-4b91-ae19-3d8af0479eeb/93dde146-ebd5-4616-97a5-a06b2402ac03.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Completed","tags":["Psychological,Anthology,Survival,Philosophical,Drama,School Life,Horror,Tragedy"],"nutshell":"Collection of horror stories by author Misaki Kairi.\n\nEgao no Sekai\nRikako has doubts about the smiling faces of her bullied classmates. It turns out that it is because their brains have undergone surgery to release happy substances no matter how much they're bullied."},{"name":" Batsukoi","avatar":"https://mangadex.org/covers/5c091719-0317-455b-a8d8-ba52437d1ce8/ebe5a1bb-e67a-4264-947b-f340ba3bb382.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Comedy,Slice of Life"],"nutshell":"If your pure and romantic loves just end up messy, then you should just indulge in shallow relations for relief! At least, that's what female lawyer Kahori thinks, but then due to unforeseen circumstances, she finds herself at a crossroad in life… Is it possible for an independent female lawyer nearing her 30s to find love?"},{"name":" I Became the Villain’s Trainer","avatar":"https://mangadex.org/covers/5c0ce3be-34cf-4d90-a77f-00f00addb4aa/d2c49a96-db32-4238-b2d6-d030ec0e2462.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Ongoing","tags":["Animals,Long Strip,Romance,Comedy,Magic,Isekai,Fantasy"],"nutshell":"She thought she was dead but she woke up inside a novel – to an extra who will die a year later.\nNot wanting to die like this, Alexa decided to tame the male protagonist in the form of a dog. Two years from now, the male lead will return to his human form. In the meantime, she was thinking of leaving the Grand Duchy after receiving the right pay for doing them a favour.\nThe problem is that when the male lead returns to his human form, he forgot all his memories.\n“You have to remember me, okay? There’s no point in looking so cute. Promise me!”\nShe told him many times because she didn’t want to mistakenly die by the male lead’s hands, who became a villain.\nBut,\n“You told me to remember, so I remembered everything. Alexa.”\nYsildus unbuttoned his jacket.\n“If there’s no other way to return that favour then I have to pay it with my body.”\nA cute puppy that grew up into a weird wolf.\nDamn, what did I raise?"},{"name":" Love-Kyo - My Private Tutor is Too *** for Me to Study","avatar":"https://mangadex.org/covers/5c0e6f85-3fd1-4f4a-b85d-9cadc835b6cd/419f08f6-ad5b-402b-b0e1-a5a402c20d07.jpg.256.jpg","country":"Japanese","stat":"7.35","status":"Ongoing","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"Aoi, an overly sexy tutor, appears before Hinata, a wholesome high school student! Moreover, Aoi looks exactly like the sexy actress Nanasato Sumire?! In the absence of his parents, can Hinata, who is at the mercy of Ms. Aoi, study without losing his mind?! The lesson on wordly desires taught by the too-sexy young lady is about to start!"},{"name":" Yellow","avatar":"https://mangadex.org/covers/5c0efd41-aaf7-4448-9e5b-f67c03ac5eed/f4bb78c3-faba-44b4-a18b-4ac9d8c10056.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Action,Romance,Boys' Love,Drama,Mystery"],"nutshell":"Definitely straight Taki and openly gay Goh are an expert team of \"snatchers\" hired by the police to steal from the mafia. Lately, Goh has been more interested in acquiring Taki than in the usual caches of arms and drugs. Will Taki and Goh become a new kind of partners?\nYellow Volume 2 marks the return of our heroes Goh and Taki to infiltrate the Japanese narcotics trade. This time, they're after your garden variety heroin that's being floated to Japan in a most unique way. Bullets will fly and Goh and Taki - preoccupied with their budding relationship and the reappearance of past flames - may not be able to avoid the crossfire!\nIn volume 3, Goh and Taki work as underground drugs and arms snatchers! Their fate begins to twist when people that claim to be Taki's foster parents show up. As Taki's mysterious past becomes unraveled, the two become exceedingly closer.\nThe curtains for the shocking final stage are drawn in volume 4. Just when their love for each other was finally realized, Gou and Taki's relationship is torn apart by the killer Sandfish. It's now time to come to terms with Taki's dark past… This title includes a newly drawn honeymoon episode you can only see here."},{"name":" Mizu no Yakata","avatar":"https://mangadex.org/covers/5c11de81-27fe-473e-b43f-b51f40edccc8/8c17e578-30ec-483f-87fd-f2f5de57164d.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Drama,Horror,Supernatural,Mystery"],"nutshell":"Mizu no Yakata (2 parts in the volume)\n\nA 14-year-old boy, after the loss of his parents, starts researching his older brother, who has mysteriously disappeared several years before. He finds him in a strange palace, with his two friends who had also disappeared. At first, the boy is happy, but then he discovers that something horrible has happened in that palace, and he might just become a victim too.\nNote: This is the oneshot of the movie that Sana and Naozumi starred in from Kodomo no Omocha.\n\nPochi Unscanlated"},{"name":" Sweety","avatar":"https://mangadex.org/covers/5c14ef0d-35da-42f3-9f13-2c4bd2b1f86a/0d37b223-888f-4cf5-8000-ef6ae6ea4f18.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Romance,Comedy,School Life"],"nutshell":"How do you distinguish between the love from a cute neighborhood girl (who’s like a little sister to you), and the love from the hottest, yet quirky, girl in school? This is exactly the question Myung-Ho has to ponder when both his neighbor’s cute little daughter, Ji-Hae, and his school’s most popular diva, Yu-Ri, make him their valentines. Of course he cares for Ji-Hae, because the poor girl’s already been through so much for someone her age, but still, she’s only just a kid. Then there’s Yu-Ri, the girl of his dreams…or rather, she would be if she wasn’t a fortune-telling voodoo witch doctor. Oh and yes, it would also help if her father, the local gangster boss, wasn’t out to kill him.\nWhen you’re as lucky as Myung-Ho is(?) choices are very hard to make. On one hand, he could go out with Yu-Ri by turning down Ji-Hae, breaking the heart of a child who’s been depending on him ever since she moved in next door. Or, he could choose Ji-Hae by turning down the only chance at romance with a beautiful girl dead set on making him her destined love. Choices, choices…"},{"name":" Present","avatar":"https://mangadex.org/covers/5c16ce7b-5a0a-46be-b2da-28abda2e598c/8c6c9786-f7ad-459b-9b8a-58cbc56f2471.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Horror,Supernatural"],"nutshell":"Young Kurumi has never received presents on her birthday. Over the years, she has also never aged and credits her longevity to the fact that she has never opened a present. Now it is her role to travel the world, bestowing gifts on others. But these presents never turn out to be what the recipients desired; there's always a dark side and a high price to pay. Author Inuki is known as \"The Queen of Horror\" in Japan."},{"name":" Good-Bye","avatar":"https://mangadex.org/covers/5c1728a9-87c6-49db-9a61-a0df8acadc16/f697edf4-9309-428b-9ccc-258e16d556a8.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Historical,Anthology,Drama,Slice of Life,Tragedy"],"nutshell":"Drawn in 1971 and 1972, these stories expand Yoshihiro Tatsumi’s vocabulary for characters contextualized by themes of depravity and disorientation in twentieth-century Japan. Some of the tales focus on the devastation the country felt as a result of World War II, and, yet, while American influence does play a role in the disturbing and bizarre stories contained within this volume, as always, it is Tatsumi’s characters that bear his hallmark, muddling through isolated despair and fleeting pleasure to live out their darkly nuanced lives.\nSome of the tales focus on the devastation the country felt as a result of World War II: in one story a man devotes twenty years to preserving the memory of those killed at Hiroshima, only to discover a horrible misconception at the heart of his tribute. Yet, while American influence does play a role in the disturbing and bizarre stories contained within this volume, as always it is Tatsumi’s characters that bear his hallmark, muddling through isolated despair and fleeting pleasure to live out their darkly nuanced lives."}]