[{"name":" Shadow Queen (Promo)","avatar":"https://mangadex.org/covers/784976d6-e30e-4d05-bbab-52f4891f8b78/8c4c7d9d-a9a5-49ee-a763-477f39617aa4.jpg.256.jpg","country":"Korean","stat":"8.17","status":"Completed","tags":["Oneshot,Time Travel,Long Strip,Romance,Isekai,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"“Can you be my daughter for me?”\nBy his offer, Elena became Duke of Franceschi’s fake daughter. She became the queen and gave birth to Crown Prince’s son. Then suddenly, Princess Veronica who was assumed dead came back.\nShe was only just a toy. And eventually, Elena gets her son taken and murdered…….\nHowever, she went back to the past.\n“I’ll destroy all of you.”\nI’ll never live as a toy again.\nElena decided to seek revenge."},{"name":" Taiyou no Hitomi","avatar":"https://mangadex.org/covers/7853fcd9-41b4-474a-8e3e-6008e6c6be71/4aa2099c-f5e5-4a58-aed7-583fbbdcd32e.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Action,Romance,Drama"],"nutshell":"Through a strange encounter with a dog, Asahina gets closer to his classmate Tsukishima. But then an incident with a death involved set these two apart. Will they ever be able to reunite?"},{"name":" Aitsu ni Koishita Yottsu no Wake","avatar":"https://mangadex.org/covers/785b4133-fd5f-49e1-b708-74f7fec309d6/d415b0b6-a64a-4684-b33e-13b3aba72d03.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"From Manga Rebels:\nThese stories about 4 typical high school girls' love life are Yokoyama Mayumi first work.\n\n\nA Real World\nAfter 2 years Eri got back together with her ex-boyfriend.\n\n\nLip Lock\nNina made him break his \"right hand\" so she substituted XX (sexual favours?) to take care of him.\n\n\nThat Is My Weak Point\nRisa's ex-boyfriend stole embarrassing photos of her, and now she wants to get them back.\n\n\nHotel Red Peacock\nWith the current course of events, Chika needs to make her bad tasting Love Hotel prosper."},{"name":" Mesuochi BL (Anthology)","avatar":"https://mangadex.org/covers/785ebad4-0035-4d12-83d9-5046d1d1e3b9/febf7a2b-9d1f-4bdd-96a5-79c235abbcad.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Oneshot,Anthology,Boys' Love"],"nutshell":"1: Rara no Kekkon – Tamekou\n2: Nemuri Otoko to Koi Otoko – Zaria\n3: Caste Heaven – Ogawa Chise\n4: Doushite Sensei ni Natta no – Syundei\n5: Heart no Choker – Yamamoto Ataru\n6: Mesuiki ❤︎ Kenkoushinda – Dan\n7: Fasshon'efu – Matsuda Usachiko\n8: Sense Of Loyalty – Matsumoto Yoh\n9: Josou Shitara Ikemen Yuujin-tachi ni Oishiku Itadaka Remashita – Maruki Bunge & Kasai Rikako\n10: Control – Ebun\n11: Teikoku no Kangan: Migi Gen Ouji Denka no Yometori – Hino Akira"},{"name":" Kochikame x To Love-Ru Darkness","avatar":"https://mangadex.org/covers/786158f0-9e2a-4c53-8929-07972e466667/4aafce99-4b0e-4922-aa8c-8163bc2f0f95.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot"],"nutshell":""},{"name":" Getaway killer","avatar":"https://mangadex.org/covers/786ae107-f01d-46d4-b6e0-dbf5fca7e8e8/bc259931-c57b-4081-b5b7-a09be32d13f7.png.256.jpg","country":"English","stat":"7.97","status":"Ongoing","tags":["Thriller,Psychological,Romance,Mafia,Drama,Web Comic,Tragedy"],"nutshell":"Ann is living with her sweet boyfriend. Until she starts to remember something of her past, and why is her ex stalking her? Note: First WEBTOON"},{"name":" Samon-kun wa Summoner","avatar":"https://mangadex.org/covers/7873b2c3-d16d-42b8-8071-fb87d65b5783/673e6f31-43f8-47d1-adf6-92eca24087d2.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Action,Comedy,School Life,Supernatural"],"nutshell":"Sakura Teshigawara might be the nicest girl you will ever meet. She will catch your vomit so that you don´t get it on your clothes while asking how you feel afterwards. In short, Sakura Teshigawara is a good person. That is why, Samon, the new transfer student hates her. There is no one else in the entire world that Samon hates more than Teshigawara. For the sake of his pride, he will corrupt her before she dies and fall into hell."},{"name":" Your True Color","avatar":"https://mangadex.org/covers/7875975e-b88e-4629-9ea2-feb495b73793/acf441e3-f7e9-4737-84f0-0d07f3bcd1e5.jpg.256.jpg","country":"Japanese","stat":"8.26","status":"Completed","tags":["Girls' Love,Drama"],"nutshell":"Hinata idolizes the dazzling actress Sumika, until one day she happens to meet the real deal, who is not at all like her ideal."},{"name":" Juukinzoku Kanojo","avatar":"https://mangadex.org/covers/7875d6b9-fcf1-43fd-b28c-2074a5bda715/f4fc089f-d45a-414f-845c-bfc64cbc2bec.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life,Music"],"nutshell":"The Heavy Metal Music Group at the high school consists of just Amanokawa Rinko and the main character, a teenage boy madly in love with her. The club is intended for people who enjoy the music genre to discuss their passion for heavy metal. However, there’s only one kind of passion going on in this club house located in the outskirts of campus, and it is definitely rockin’."},{"name":" Six Realms Venerable Strongest Master","avatar":"https://mangadex.org/covers/788afd2c-a2a5-4520-bf2d-a66b119cf9b6/56909f8c-d9f0-461b-8e49-7466094929dc.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.86","status":"Cancelled","tags":["Romance,Martial Arts,Adventure,Harem,Wuxia"],"nutshell":"From a genius boy to waste wood overnight? Parents died at the same time, the ability to seal, part of the memory is lost? What kind of conspiracy is behind a huge organization, a bloody wind and a long-term love affair, and in the face of monstrous hatred and fate, can they change their lives?"},{"name":" Absolute","avatar":"https://mangadex.org/covers/789233e9-4ded-439d-a859-bba99d78ae54/5d33ca6a-acce-4089-b48d-5bcc73926943.jpg.256.jpg","country":"English","stat":"7.97","status":"Ongoing","tags":["Action,Comedy,Supernatural"],"nutshell":"In the year 2199 a diving mecha gains consciousness, with the help of a Guardian of Atlantis crystal, and declares war on mankind. Believing that if humans are allowed to live, the Earth will die, the robot builds an army to cleanse the Earth of the human race. The robot, who calls himself Absolute, also learned how to use the “Light of Atlantis” power source to raise the city from the depths of the Atlantic ocean, and turn it into a robot city. There are humans that hold crystals as well, but it’s taking all the power they have just to keep themselves alive. For 100 years Absolute did everything in his power to wipe out the human race…until the day the first Guardian of Atlantis, Saturn, returned to Earth to reclaim his city. Upon arriving, Saturn reluctantly teams with the humans to try to defeat the mighty Absolute. Saturn and the other 5 Guardians, must find a way to reach New Atlantis, and destroy Absolute if they are to reclaim the city…and reclaim Earth."},{"name":" Ushirokara Dakishimete","avatar":"https://mangadex.org/covers/78937db7-e3cd-46e8-a724-fb1c92e7e627/07b3e227-ad85-4087-8635-f390473a6873.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life,Supernatural"],"nutshell":"Ushirokara Dakishimete (Embraced from Behind)\n\"If I could beat him, I would become his lover…\". Koichiro believes that the only way he can ever woo his best friend Soji into a relationship is by challenging him with a judo match for love!!\n\n\nSweet Smell\nA baseball freak fall in love with the alluring scent of his new tutor.\n\n\nHankonkou (Resurrection Incense)\nA love triangle between an emperor, the emperor's faithful minister and the emperor's dead lover…\n\n\nAi wa Konjou! (Love Must Persevere!)\nThe ultra rich Kagura decides to go to an ordinary high school for a year. He will spend whatever it takes to be with his new friend Hayakawa.\n\n\nSekai de Ichiban Ricchi na Honey (The richest sweetheart in the world)\n\n\nSekai de Ichiban Happy Honey (The happiest sweetheart in the world)"},{"name":" Renai Idenshi XX","avatar":"https://mangadex.org/covers/78a14ca8-f029-4d65-824b-579108765d7a/a5bd7f41-29a6-4a4f-8eda-4446c108749b.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Comedy,Crossdressing,Girls' Love,Drama,School Life"],"nutshell":"A sci-fi story set in a future where men have died off. Women have been divided into two groups: Adams and Eves. Each has a set role in society. The protagonist, an Adam, has just entered Kingdom Academy. Romantic relationships between Adams are forbidden there, so I'm sure you can all guess where this is going…"},{"name":" Tokyo Train","avatar":"https://mangadex.org/covers/78a277d1-f6fe-4634-be66-3385cf3ac27a/e2379c5e-81af-4235-91f7-e042d17d477c.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"The station… where both you and I can meet. A poor-looking middle-aged man Kisugi and number 2 at the host club, Ooyoshi met at Shinjuku, the street that doesn't sleep. I wanted to see you. I wanted to see you. I wanted to see you.\nAn angel who saved Ooyoshi while he was despairing in his life. He thought that he could finally show him that he is doing his best in his life, but Kisugi was just feeling depressed. For depressed Kisugi, for the first love of his life, he is doing his best and attacking life."},{"name":" Operation Demon Castle Date!","avatar":"https://mangadex.org/covers/78a3e0f2-1a4e-4885-b48d-23e6a515757f/ac69f0c9-6f24-4b76-af92-02e98c156c20.png.256.jpg","country":"Japanese","stat":"7.87","status":"Ongoing","tags":["Demons,Romance,Comedy,Girls' Love,Fantasy"],"nutshell":"Kukuru, a princess who wishes to meet her destined one, is taken away to Brosfell Castle and brought before the Demon Lord Diana, who confesses her desire to marry her. Believing that trying to escape on her own would be too dangerous, Kukuru proposes that before getting married, they should go on a date first. With Diana bringing out all the stops while Kukuru secretly looks for a way out, a date taking place in the demon castle begins."},{"name":" Kanashii Doubutsu","avatar":"https://mangadex.org/covers/78a573e6-b937-4867-aaff-6a8f3236c059/51b9049d-7a90-4e04-b31c-8d742c05f819.jpg.256.jpg","country":"Japanese","stat":"7.50","status":"Completed","tags":["Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"Eichi has always been in control but when he notices baby faced Souta has been taken advantage of; Can he really keep his composure?"},{"name":" Together on Sunday","avatar":"https://mangadex.org/covers/78a78d3e-f335-42e7-8cf2-b168df9ecd04/b13685ac-d82f-4b9e-a978-f2acf0390ff3.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Psychological,Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"This is the story of three girls who all realize at the same time, that the boys they've been chasing aren't available, and so decide to meet on a Sunday to invite the first boys they see to a party they're going to put together. Of course, it's not anywhere near that simple, and the three boys/men they pick up are all connected although none of them are aware of it, and some events in their own lives are going to complicate things…"},{"name":" Onibito no Matsuri Daiichiwa - Zurui Meguriai","avatar":"https://mangadex.org/covers/78a843bf-e963-498a-819e-284cc1fd7016/2bf092a9-7395-413c-973e-fe57ffcb2e1d.jpg.256.jpg","country":"Japanese","stat":"7.63","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":"Shiho has always felt she was different. She's much stronger than the average human and she has a hard time controlling her emotions, specifically her anger, so she's always kept her distance from people. Right before she graduated middle school, she lost control of her emotions and went on a rampage, injuring students and teachers. The incident briefly made the news before an organization, the Sorcerers, stepped in and quickly covered up the incident. From them she learned about her ancestors, and that she is the descendent of demons, and the Sorcerers are there to keep demons in check. Since all demons have trouble controlling their emotions, they are all tasked with finding a scabbard, a person that can keep their emotions at ease and, if necessary, kill them if they lose control. If they are unable to find a scabbard, they will be killed by the Sorcerers. Will Shiho find her salvation?"},{"name":" Living-Room Matsunaga-san","avatar":"https://mangadex.org/covers/78aa39b5-efff-4a83-924b-6be14cb44a2b/08d21ad0-17fa-4aad-aa57-ceb989508a70.jpg.256.jpg","country":"Japanese","stat":"8.67","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Miko leaves the house of her parents to live with her uncle who runs a boarding house, but her first meeting with Matsunaga-san isn't good and then he discovers that she is one of her uncle's tenants. Even as a secondary student she surrounds herself with university students who have a very different life from her own. Can she fit into her new home?"},{"name":" Choked up & Shady!","avatar":"https://mangadex.org/covers/78ae8244-96bc-47bc-b0e7-118915abca0f/c46a510a-2254-45b4-81cf-de90d8eced6e.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Action,Comedy"],"nutshell":"By day, Miya Akatsuki is just a slightly grumpy and unsocial girl studying in St. Margaret's Girls' College. But by night she's secretly a Final Executor – an ultimate debt collector who can make even the shadiest debtors click the \"accept\" button on the payment warrant. The debt collection agency she works for, however, is a slightly different than normal ones.\nHaruki Kobayashi, a boy working in the electronics store of his family, becomes affiliated with Miya after accidentally witnessing her at work. She and her two colleagues end up moving to Haruki's home as part-timers to keep an eye on him. Gradually Haruki starts to learn about the painful loss that made Miya want to obtain power."},{"name":" Ojousama wa Budoukai de Odoru","avatar":"https://mangadex.org/covers/78aff9db-22ac-4660-8ce2-4e14276e7022/f995f1c4-f8c1-4c7f-a0e1-16f0753deef6.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Action,Comedy,Martial Arts,School Life"],"nutshell":"Kuryuuin Getsuka loves martial arts, and she won a championship in middle school, but her father forced her to stop doing martial arts.\nShe was brought back to the high class all girl academy that she attended when she was an elementary student. The academy has no martial arts club, so she started her own martial arts association."},{"name":" Blood Lovers","avatar":"https://mangadex.org/covers/78b60980-0e0a-4963-b004-a5b0eab38717/8f0e1505-81c2-47f1-a90d-1fbbc45437c9.png.256.jpg","country":"Chinese (Simplified)","stat":"7.63","status":"Completed","tags":["Long Strip,Romance,Drama,Fantasy,Vampires,Web Comic,Slice of Life,Full Color"],"nutshell":"One is an innocent and introverted young girl, and the other is a fiery but seemingly cold delinquent boy. Because of the stings by a blood demon stinger, the two have become \"blood companions\" who must rely on each other's blood to survive. Two people with different personalities are bound together by fate. What kind of future will this blood-based relationship have?"},{"name":" Amaenaideyo!! MS","avatar":"https://mangadex.org/covers/78b9267d-a89f-4d09-99f7-154762d4982b/09a90318-beb8-4e9b-9a63-504c483a17b6.png.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Romance,Comedy,Harem,Supernatural"],"nutshell":"Ikko's finally home after a long trip at a training temple and everybody is glad to see him. But this sequel has a big twist. Since Jotoku is gone, Sakura is in charge now, and Kazuki has moved in with Ikko and the rest of the girls at the Saienji Temple! Will Ikko ever survive this kind of life? Follow the unnormal life as a monk in this Ecchi, harem comedy manga sequel of the popular Seinen manga from Japan, Amaenaideyo! It'll make you nosebleed and laugh at the same time."},{"name":" Aurion Legacy of Kori-Odan","avatar":"https://mangadex.org/covers/78bfe1b1-536e-4322-a7a6-8b093e8e54ef/a37b03b4-bc94-4221-8cdc-2317859723a8.png.256.jpg","country":"French","stat":"6.60","status":"Ongoing","tags":["Action,User Created,Adaptation,Full Color"],"nutshell":"Who am I ? What is my place in this world ?\nThere comes a time when everyone asks himself these questions. On Aurioma, an energy called Aurion reacts only to those who seek answers, connecting them to their ancestors.\nIn the city of Zama, the king and queen,Enzo and Erine Kori-Odan, are crowned on their wedding day. But this happy day will be the beginning of their struggles, their trials and their journey to find the true meaning of the Kori-Odan Heritage(legacy).\nAurion's Story: The Kori-Odan Legacy is based on the African Fantasy role-playing game. The first Cameroonian video game has been praised by international critics for its captivating and inspiring screenplay."},{"name":" Daremo Shiranai Tou no Aru Machi","avatar":"https://mangadex.org/covers/78c354e3-d749-4128-9877-20d245510f38/68fef40c-4dd0-481f-bd8a-fcf32ef64a9f.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Psychological,Romance,Drama,School Life,Horror,Supernatural,Mystery,Tragedy"],"nutshell":"The carefree days of a group of friends turn into horror as female students begin to die random gruesome deaths in their town."},{"name":" Surface Relations","avatar":"https://mangadex.org/covers/78c4a02e-5ea6-41dd-845c-f52c3fbbc6ad/143502ac-8de6-429e-ba7d-170ee10fee7c.png.256.jpg","country":"Chinese (Simplified)","stat":"7.81","status":"Ongoing","tags":["Time Travel,Long Strip,Comedy,Boys' Love,Web Comic,Music,Full Color"],"nutshell":"Faced with the second chance, what kind of hard work must Baimu put in to restore his relationship with Meng Yilan and others? A story about light comedy, love, and dreams!"},{"name":" Boku no Koe","avatar":"https://mangadex.org/covers/78c72651-df1a-4e73-a44c-7a64931a27d4/aee64191-8c60-450d-92c4-09b1d5572b70.png.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"A lifelong dream of fame and fortune has been the driving force of Wataru Jouchi's entire life. Now, after much self-doubt, he's decided to fulfill his destiny and become a voice actor for anime videos. At first, he is thrilled to discover that his long-lost friend, Renji Kazama, is considered a top star in the industry. But Kazama does not seem at all pleased about their unexpected reunion.\nBiblos (pub 2004) never published volume 2. Libre republished volume 1 along with publishing volume 2."},{"name":" Manshin Soui","avatar":"https://mangadex.org/covers/78cb73b2-7de0-4f71-9797-f59ff3412404/35dbc374-93ad-45ab-bb70-47f8a2a9029d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":[""],"nutshell":""},{"name":" Kurenai no Ookami to Ashikase no Hitsuji","avatar":"https://mangadex.org/covers/78d45f0b-e7d4-462c-b93b-aba608b34e1a/7739ff5c-9a87-44a5-a287-d0c328de4ce1.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Action,Psychological,Adventure,School Life,Supernatural,Mystery"],"nutshell":"All humans are wolves in sheep's clothing and the same applies to Douchinji Youichi, a boy who always daydreams about various things, but never says anything out loud. One day, upon seeing a red full moon, a girl came dashing at him before punching him with a silver knuckle, knocking him unconscious and unable to really remember the incident. The next day, a new student, Akatsuki Ayame, joins his class.\nOn his way home, Youichi discovers that the girl who punched him is Ayame, and her silver knuckle draws out what she calls a \"wolf\", a person's inner thoughts or desires, from a \"sheep\", the superficial mask which restrains the inner \"wolf\" from surfacing. However, when someone is full of desires and becomes obsessed with their inner thoughts, the \"wolf\" outgrows the \"sheep\" and the person will be able to see the World of Red Moon. The girl explains that she doesn't have a \"sheep\" and would like to have one, so she requests Youichi to become her \"sheep\". Youichi agrees to it, marking the beginning of a story of the red riding hood who devours the wolf."},{"name":" Toshishita Medarisuto Wa Ichizuna Kemono","avatar":"https://mangadex.org/covers/78d67a4a-c650-4e20-b401-fbdc77dfed3f/63ff9b8d-f67b-4b4d-91e3-ee72ebabddc7.png.256.jpg","country":"Japanese","stat":"7.85","status":"Ongoing","tags":["Romance,Office Workers"],"nutshell":"\"If it's Hananoi's body ... it doesn't matter how big or small it is.\"\nHe whispers sweet words to her as his muscular body envelopes her, and then he relentlessly attacks her small breasts, which she has a complex about..\nHananoi Tou is the manager of the company's judo team. One day she was taking care of Iwaki, a player who got drunk at the team's drinking party. He suddenly hugged her in his sleep and didn't let it go, thus ended up spending the night together...!\nHearts and bodies are turned over!. The 40cm height difference between the two of them makes for a very exciting love story between a pair of uneven Kyun love!"},{"name":" No Bra","avatar":"https://mangadex.org/covers/78df8df7-0886-4d37-8da6-ef4fa0877d8a/002522f6-ae26-4f9f-b544-f20fc8a53bd6.jpg.256.jpg","country":"Japanese","stat":"6.75","status":"Completed","tags":["Romance,Comedy,Crossdressing,School Life"],"nutshell":"This is a story about 2 childhood friends, Masato and Yuki, that reunite as teenagers. Masato is surprised to find that Yuki has become so cute, but even more surprised to realize that Yuki was, and still is, a guy. Yuki's affection for cross-dressing leaves Masato with feelings of discomfort and fright."},{"name":" Akuyaku Reijou Desu ga, Shiawase ni Natte Misemasu wa! - Zamaa Hen","avatar":"https://mangadex.org/covers/78dfbca2-8330-4d2a-95b7-de3eabcb7209/87f535b6-adfa-4158-8638-ba6f490c7fc7.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Oneshot,Comedy,Anthology,Fantasy,Villainess"],"nutshell":"A ZERO-SUM villainess anthology consisting of reversal stories.\nCover Art: Maro\nVolume 1 Contents:\n\n居眠り姫は賭けをする, Art by Yumoto Miko, Story by, Andrei, Original Web Novel\n私の愛しい人, Art by Fuwai Nimu, Story by Rittan, Original Web Novel\n冷血悪女による無垢な王子の利用法, by Chiaki Rie\n第二王子と一緒にやり直していくお話, by Sari\nいいですか？そもそも政略とはですね。, Art by Ei Yuzuki, Story by Yuuki (ユウキ), Original Web Novel\n\nVolume 2 Contents:\n\n氷の薔薇姫と隣の国の王子様, Art by Yasaka Akiwo, Story by Makoto Beppu\n色々と勘違いをしていたようです。, Art by Akutagawa Kazuma,  Story by Funineko, Original Web Novel\n冷血悪女による無垢な王子の利用法, by Chiaki Rie\nお慕いしたこともないのに何故わたくしが嫌がらせを？, Art by Suzumushi, Story by 黒乃きぃ, Original Web Novel\n私は悪役令嬢だそうですので、婚約者は妹に譲ることにします, Art by Inaru, Story by 榛名丼, Original Web Novel\n\nVolume 3 Contents:\n\nうふふ、踏みつけられたままでいると思っていたのですか?, Art by 黒助くい奈, Story by 三香, Original Web Novel\n追放されたので今日から自由にパンを焼こうと思います。, by Tokai Naka\n皇太子の教訓, Art by 城鐘ナコ, Story by 木月橘, Original Web Novel\n夫に愛する人が出来たと言われたので、私も自由に生きることにしました, Art by Takahashi Tsutsuji, Story by 汐乃 渚, Original Web Novel\n\"Miss Scarlet\" (ミス・スカーレット), by Deka Ore\nゲームの強制力に抵抗するのが面倒な悪役令嬢は、好き勝手に生きることにした, Art by Yukijirushi (ゆきじるし), Story by 翼弥, Original Web Novel"}]