[{"name":" Nise x Koi Boyfriend","avatar":"https://mangadex.org/covers/bf24e900-128f-4c9e-bb4f-de00530f431d/8a6fe86e-79cf-43d4-8d28-cadc33151bc0.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Psychological,Comedy,Boys' Love,Crossdressing,School Life"],"nutshell":"Soutarou Inugami is a shy and reserved high schooler interested in anime and manga. Although content with his lot in life, Soutarou also wouldn't mind having a fateful encounter with a cute girl someday. Lucky for him, he comes home from school one day to find a girl sitting at his doorstep whom he's never seen before, but who happens to have the same red earrings as Meguru Satoi, a cool and good-looking guy at his school."},{"name":" Quan Wang Bu Liao","avatar":"https://mangadex.org/covers/bf29c1ea-dc92-430c-ab09-24e9e05936b8/1f57fc14-26a6-45be-8f87-352b23d8ba1d.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Slice of Life"],"nutshell":"Quan had secretly fallen in love with Wang, but due to a misunderstand everything was over. From that day, have been spent 5 years. <br />Subsequently Quan meets again Wang… This time will she be able to confess to him?!"},{"name":" Confession, Confession, Confession!","avatar":"https://mangadex.org/covers/bf29d20b-78b8-41b9-bc80-f07800d0d091/655a37ef-869e-44cb-9141-8c6e72d180da.png.256.jpg","country":"Japanese","stat":"6.94","status":"Completed","tags":["Oneshot,Comedy,School Life,Web Comic"],"nutshell":"A typical confession at some yard in the school."},{"name":" Touhou - Being, Becoming and to Be (Doujinshi)","avatar":"https://mangadex.org/covers/bf2a8504-edd7-484a-8001-8eb931d60627/e4bcfe3d-c610-4b42-a197-ef2cc92e0695.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Drama"],"nutshell":"Marisa goes after a missing Alice, in the first part of this story about finding your place and meaning in life."},{"name":" Hadi Girl","avatar":"https://mangadex.org/covers/bf2f0b96-cef3-41a1-bfa8-ee7976e7f60f/84493e07-c709-4c47-84d8-dd7d7b649463.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Romance,Comedy,School Life,Supernatural"],"nutshell":"Kagura Sae is a shy high school girl who can't express her feelings openly on the public. One day, she was visited by a fairy named Love Angel Raburin no. 100 and was contracted to nurture an egg from a God of Love in order to have a wonderful love by following the tasks given to her but if she fails to accomplish even a single task, she'll never have a successful love in the future!"},{"name":" Bell Princess","avatar":"https://mangadex.org/covers/bf33da0b-ff39-40c4-835e-ce4b3dbc0fa9/aabab584-e217-49e8-9ff4-d51d2eaf7810.jpg.256.jpg","country":"Korean","stat":"8.03","status":"Ongoing","tags":["Historical,Romance,Drama,Fantasy,Supernatural"],"nutshell":"Because of a sin she committed in her past life, Princess Bell was born as a golden bell. In order to get back her human appearance, she must find Prince Mukyeol and tie their strings of fate back together. Will the reincarnated lovers be able to meet again?"},{"name":" Hyakujitsu no Bara - Maiden Rose (Doujinshi)","avatar":"https://mangadex.org/covers/bf3ab376-8265-4b0d-aefc-ff59349b4b6c/1157cb98-ef07-48ab-9c6a-1cd30af28a5a.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Ongoing","tags":["Boys' Love"],"nutshell":"Pairing: Klaus x Taki"},{"name":" Frontline (MOCHIZUKI Mikiya)","avatar":"https://mangadex.org/covers/bf40c3db-de11-4ede-9ba4-18e917197e08/9f3992ef-6db8-4ac8-906d-78cd17d313da.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Historical,Action,Psychological,Comedy,Survival,Adventure,Military,Philosophical,Drama,Tragedy"],"nutshell":"(from ebookjapan):\nWorld War II. Mickey, the son of Japanese immigrants, volunteers to fight in the Second Gen Corps as a member of the Allied Forces in order to free his mother from internment. Although he is ridiculed as a \"Jap\" because of his Japanese appearance, Mickey dives into a hail of bullets more bravely than anyone else.\nHe teams up with Tank Commander Leo and successfully destroys an enemy destroyer! Then, he discovers children being taken away by the Nazi SS. He tries to save them, but the enemy soldiers find them...?"},{"name":" Goblin Slayer High school","avatar":"https://mangadex.org/covers/bf44338e-630a-43fb-b6ca-061d7cebeceb/142c4f47-7473-4002-bf7e-7430ba217967.jpg.256.jpg","country":"Japanese","stat":"6.67","status":"Hiatus","tags":["Comedy,4-Koma,Web Comic"],"nutshell":"The everyday of GobSlay in high school."},{"name":" Prince of the Night","avatar":"https://mangadex.org/covers/bf44b0a9-707c-4bcd-9c0c-e8cc195ff926/c6a0f94b-5ac5-4786-9af4-30b0d0528926.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Completed","tags":["Historical,Romance,Drama,Fantasy,Supernatural"],"nutshell":"Liang You Xin is a kind and innocent girl who has left home to further her studies in the Tyrol in Europe. During her travels, the seemingly innocent act of helping a stray pig sends her to a different dimension in the Royal Palace Museum. There, she meets a mysterious young man clothed in black who invites her to the Royal Palace as a guest. Expecting to find an abandoned palace, Liang You Xin is surprised to find Tyrol’s 17th Century Royal Highness instead. This fateful encounter changes her life from one of scholarship into slavery…"},{"name":" Kirby of the Stars: Pupupu Hero","avatar":"https://mangadex.org/covers/bf4a285b-636d-4760-9a90-e538514bf024/a19fdccb-f1db-483c-87fd-3d49124d9a53.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Comedy,Video Games,Fantasy,Slice of Life"],"nutshell":"Kirby, the gourmand who will suck up anything, has come to the peaceful land of Pupupu!\n\"Pleased to eat you! I'm Kirby!\"\nThe slapstick and lively days are about to begin, involving Chilly, who has come to live with Kirby!"},{"name":" Diamond no Ace - Tsuruhananasu no Mahou wo Toitara (Doujinshi)","avatar":"https://mangadex.org/covers/bf590b0c-b3fd-47e6-9419-0ca7cafe4a7b/7c69e049-1a08-498d-8a00-63852bd86562.png.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Oneshot,Boys' Love"],"nutshell":"The story is set a few years after Seidou when Sawamura attends the same college as Kuramochi. The events look at their relationship during that time."},{"name":" Iridescent Lass","avatar":"https://mangadex.org/covers/bf5d06bb-0b0a-4e37-ab64-c78f4bb42a9f/7b843853-c2de-4fdf-b198-52155c450376.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.00","status":"Ongoing","tags":["Comedy,Adventure,Fantasy"],"nutshell":"It's otaku's time now! An otaku summoned a wolf girl accidently. What would she do? Eat him? Where does she come from? A mysterious world is waitting for you!"},{"name":" Shush! I'm Not Your Pet!","avatar":"https://mangadex.org/covers/bf60170c-5ef6-4fa9-b698-fe99985295f6/f16a28eb-12d2-4fd9-8a72-3c4c574053b1.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.91","status":"Ongoing","tags":["Long Strip,Boys' Love,Fantasy"],"nutshell":"I became a cat when stopping one from being abused? And I had to live with this \"animal shaman\" who made me a cat! I must put up with it for the sake of turning back into a human! Meow!"},{"name":" Zannen na Sasaki-san","avatar":"https://mangadex.org/covers/bf68254c-e865-44ea-88d4-bc2b85fa2c60/4e793cdb-16d8-44b0-b34f-1e7dee30aa91.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Sasaki Ichika and Sasaki Umi are couple. Handsome boy and pretty girl, they are people’s admiration. But, both of them have some regrettable secrets…?"},{"name":" Chrome Breaker","avatar":"https://mangadex.org/covers/bf690aef-27ee-435e-8b31-72ecf5e57226/e36572fc-94f5-4a96-a602-c5c9c4aea9c1.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Action,Fantasy,Supernatural"],"nutshell":"A girl named Nagisa Akira is said to be the reincarnation of the Virgin Mary (aka Maria's Daughter). The Vatican, realizing this, have sent one of its elite agents, Takagi Chrome, code named “Crimzon” to protect her. Chrome is one of the elite assassins directly under the control of the Vatican who had used to carry out terrorist acts and the assassinations of world leaders. Chrome's new mission is to protect Akira so that she does not fall under the hands of the Protestant English. Thus begins the journey to protect Maria’s Daughter, and the discovery about Chrome’s mysterious demonic power."},{"name":" Ousama ni Kiss!","avatar":"https://mangadex.org/covers/bf76a330-58a5-4aad-b375-6a5487747ebc/bb243bef-e6ff-440c-ad9c-e660fc0217c1.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Animals,Romance,Comedy,Boys' Love,Mafia,School Life"],"nutshell":"On the outskirts of Tokyo, Toubuisazaki High School is known for its mottos of \"Yakuza are your friends!\" and \"Seize the chief's weakness!\" Amidst these scary rumors is the king of the school, high school student Maki: a person with an abrasive personality, who thinks of his classmates as servants. It's a mystery that Yoshifumi, the school nurse, loves him."},{"name":" Yandere Mahoutsukai wa Sekizou no Otome shika Aisenai - Majo wa Manadeshi no Atsui Kuchidzuke de Tokeru","avatar":"https://mangadex.org/covers/bf77bcc8-797e-4eca-8702-da9276ed9045/f93553d2-46d9-48ae-9e7a-0e86b440b439.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Ongoing","tags":["Romance,Comedy,Magic,Drama,Fantasy,Adaptation"],"nutshell":"Lara, the magician, confronts a dragon to protect her disciple Alistair, and magically turns into a stone statue to avoid death. Twenty years later, she wakes up safely and is astonished to see her arrogant disciple Alistair become an older lord who is loved by everyone. Alistair reunites with Lara and begins courting her fiercely. \"You are mine.\" Lara, who is breathless with her beloved disciple's obsession and affection for over 20 years!?"},{"name":" Full Moon ni Sasayaite","avatar":"https://mangadex.org/covers/bf7be0e7-71e0-4bfe-98f3-d44403cd885c/501b85bd-4f05-4c6a-8927-5d06ff707bad.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Genderswap,Romance,Comedy,Boys' Love,Vampires,Supernatural"],"nutshell":"Marlo has a problem. On the night of the full moon, this half-werewolf, half-vampire undergoes a mysterious and terrifying transformation:\nHe turns into a girl.\nDesperate for a cure, his parents call on Doctor Vincent, a long time family friend. But Marlo wants to keep his condition secret from Vincent's son, the vampire playboy David.\nUnfortunately, the secret gets out, and a new problem surfaces: David is interested in Marlo's female form! If a remedy can't be found, their parents believe the next best solution is marriage - a marriage between Marlo and David!"},{"name":" Burning!! Women's Pro-Wrestling","avatar":"https://mangadex.org/covers/bf82d9e7-a656-44fe-80e3-531e21d1394f/9fba42cb-6f69-446a-9f48-32cc7661d6c9.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Action,Psychological,Comedy,Survival,Sports,Martial Arts,Adventure,Drama,Delinquents,Slice of Life,Tragedy"],"nutshell":"(from amazon.jp):\nThis is a coming-of-age documentary manga by Kazuhiko Shimamoto, a rare manga artist who can simultaneously depict the \"coolness\" and \"uncoolness\" of a man fighting against fate, featuring the real-life female professional wrestler Manami Toyoda. As the countdown to Toyoda's retirement is underway, the manga has been reprinted for the first time in 23 years!\nSince his debut in 1982, he has depicted the \"fighting spirit\" and \"will to move forward\" in various forms, including \" Blazing Transfer Student\" \" Adversity 9\" \" Burning Pen\" and \"Howling Pen\". The manga is based on his own adolescence.\nMost of the main characters in his \"burning\" works are male, but there is one female protagonist who shines brilliantly among them.\nThat is Manami Toyoda. Manami Toyoda was a real-life female professional wrestler who created an era in the 1990s under the nickname \"Flying Tennyo.\nThe title of the work is literally \"Burning! Women's Pro Wrestling.\nThis documentary manga depicts a black-haired girl gritting her teeth and growing by her own will in the ring, the square jungle, the wonderland of battle. It was serialized from the August 1992 extra issue of Weekly Shonen Sunday to the December 1993 extra issue, and is the gold standard of authentic women's pro wrestling manga!\nThis spring, Manami Toyoda announced that the 30th anniversary of her debut, which will be held on November 3, 2017 at the Osanbashi Hall in Yokohama, will be her last active match!\nThe event was met with an outcry on the Internet from women's professional wrestling fans of the past, and among them was mangaka Kazuhiko Shimamoto! He wrote on Twitter without a pause, \"Well...Toyoda did her best...I have a responsibility to see it through...No, it's not just me, but everyone, everyone⁉\" to the fighting heroine who once played the leading role in his own work.\nThis time, what was once published in three volumes in Shonen Sunday Comics imprint has been collected into one very thick volume of about 600 pages! With the addition of various interviews and bonus content, this volume will be published for the first time in 23 years as a love letter from Mr. Shimamoto to Toyoda and the spectators who lived together with her in that passionate era of women's professional wrestling!\nProduct specifications: 1 volume / B6 size / softcover / approx. 600 pages (old edition  combined with interviews)"},{"name":" BL Drama no Shuen ni Narimashita","avatar":"https://mangadex.org/covers/bf869837-a006-41b4-a59d-169d21cf67f8/281b92aa-6972-49d0-a86f-9379fa849793.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Ongoing","tags":["Romance,Comedy,Boys' Love"],"nutshell":"A popular BL manga is going to be adapted into a live-action drama. The double lead roles will be played by Aoyanagi Hajime, a talented actor who used to be a successful child actor but is not so successful anymore and Akafuji Yuuichirou, a popular and handsome actor. Aoyagi has a hard time with Akafuji who has an unfriendly attitude, but on the other hand Akafuji has too much love for Aoyagi... Will the two stars succeed in their BL drama?"},{"name":" I Didn't Have it But Now I do","avatar":"https://mangadex.org/covers/bf8bdd92-f86c-4515-a9ed-fe993ee51729/cd415831-b2ed-497a-836e-e2b5c04b83e8.jpg.256.jpg","country":"Korean","stat":"7.95","status":"Ongoing","tags":["Genderswap,Long Strip,Romance,Comedy,Boys' Love,Drama,Web Comic,Supernatural"],"nutshell":"\"If that's sunbaenim’s preference, then I'll change.” Hong, who took the courage to confess to his beloved sunbae Dowon, is rejected on the spot. A suspicious woman approaches Hong, who is frustrated that all her hope has disappeared. Hong, who took the medicine that has been recommended by the suspicious woman, has became the ideal type of Dowon, and made a stronger move on him. It's starting! Hyun's pure hearted love that only looks at sunbae and thinks about sunbae can be really a happy ending?!"},{"name":" Arthur Bright","avatar":"https://mangadex.org/covers/bf8de2ce-9cec-469b-b58d-b1e8b3f46fc7/f6c1ca14-06ee-4451-9e9a-1951e99a7b58.png.256.jpg","country":"Japanese","stat":"7.72","status":"Completed","tags":["Time Travel,Historical,Action,Martial Arts,Adventure,Drama"],"nutshell":"The manga's story follows Kimura Shigenari, a real-life samurai who served Toyotomi Hideyori. Kimura fights in the Siege of Osaka in 1615 but is hit with a mysterious light. He wakes up in a land ruled by England's legendary King Arthur."},{"name":" I’m Begging You! Please Crossdress!","avatar":"https://mangadex.org/covers/bf91ad7f-dbbc-4d72-9106-b3e56a8519b8/8ed44264-bd3f-4a26-93b4-642902db029f.png.256.jpg","country":"Japanese","stat":"7.64","status":"Completed","tags":["Oneshot,Comedy,Crossdressing,Web Comic"],"nutshell":""},{"name":" Transfer Student Romance","avatar":"https://mangadex.org/covers/bf927131-32e4-48a1-9958-e318fb7e7844/a534defb-93ce-4c27-9fef-7447f8387cda.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.86","status":"Ongoing","tags":["Romance,Comedy,Slice of Life"],"nutshell":"Middle school days: young, inexperienced, and magnificent. Chen Jiani left behind a love letter, and then disappeared from Yao Tianhai’s life. Two years later, they meet again, but Chen Jiani doesn’t recognize Yao Tianhai. “Stupid girl, we'll meet again!” Yao Tianhai is a bit angry."},{"name":" Hanbun no Tsuki ga Noboru Sora","avatar":"https://mangadex.org/covers/bf92ebc9-946d-4fff-ad58-48d68957b2da/20f16891-9811-45fc-9339-47e3d6bd2ab4.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Tragedy"],"nutshell":"During the winter, Yuichi was hospitalized due to hepatitis. Randomly he would try to escape from the hospital but would get beat up by the nurse. One day, he happened to meet Rika, a girl of his age, in the next building. He was fascinated by her beauty, but she was very selfish girl. Although she led him by the nose, he began to be attracted by her. However, when Rika told him about her illness, he knew why she acted so selfish; she didn't have long to live."},{"name":" Ookami wa Tantei o Tabetai","avatar":"https://mangadex.org/covers/bf971d6a-3295-43f5-8227-40f113be36f5/97a2bfcd-f9e0-464b-9713-9cf030010dfe.png.256.jpg","country":"Japanese","stat":"7.76","status":"Ongoing","tags":["Thriller,Romance,Boys' Love,Slice of Life,Supernatural"],"nutshell":"I have no confidence that I can \"wait\".\"Werewolf Syndrome\" - The spontaneous onset of a strange disease. Those who are affected present symptoms such as attacking and devouring humans. In this world, this is merely an urban legend, but, 10 years ago, Reito's brother was killed by a werewolf. Since then he has spent his life as a lone detective in order to expose the truth behind werewolves. Under such circumstances, he meets his estranged nephew for the first time in 10 years. Reito was briefly surprised to see that Yoru, who used to be a crybaby, is now a dashing university student who towers over him. Shortly after, Yoru suggests that Reito should hire him in the detective agency...?!"},{"name":" Like This.","avatar":"https://mangadex.org/covers/bfa0a29c-387a-4f4e-8334-bbc50c671185/3729ae69-2f65-4009-8649-0d09e20ba7dc.jpg.256.jpg","country":"English","stat":"7.88","status":"Completed","tags":["Girls' Love"],"nutshell":"Mindi has been single for the past 5 years and believes she cannot fall in love anymore. She meets her new boss and it might change everything."},{"name":" Just A Volunteer Club","avatar":"https://mangadex.org/covers/bfa362ea-53ef-4e83-9f79-bb732079bdf8/662b70eb-5dfc-4ef1-b6a4-623e433169a8.png.256.jpg","country":"Chinese (Traditional)","stat":"7.90","status":"Completed","tags":["Long Strip,Comedy,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"Besides students, don't teachers and the principal have worries too? We, the volunteer club, aims to solve problems for anyone who is troubled! Share your worries with us~"},{"name":" Sun and Moon Undecimber","avatar":"https://mangadex.org/covers/bfa6218d-6ab5-416d-9dd7-7247a0e50294/86aa3c2d-b0b3-4059-a537-ae55f28d7927.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.82","status":"Ongoing","tags":["Historical,Action,Ghosts,Comedy,Zombies,Martial Arts,Adventure,Magic,Wuxia,Fantasy,Web Comic,Supernatural,Mystery"],"nutshell":"There are countless undead feeding on humans in this world. Countless Sorcerers have been fighting against them for millions of years but defeat is always the end result.\nIt was not until the emergence of ‘San Zhen' Clan, 3 successors, in 3 different eras fighting against the undead. They are the last chance in this “Man vs Dead\" war."},{"name":" Furachi na Boku o Aishitamae","avatar":"https://mangadex.org/covers/bfa75ef7-07f5-4f1d-82da-dc9a4633201e/ae34ff10-bd63-4440-9a7c-7b465f7d11dd.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Comedy,Boys' Love"],"nutshell":""},{"name":" Bakuon densetsu kaburagi","avatar":"https://mangadex.org/covers/bfa9e1f4-697a-4240-8593-71138c82b8f3/1c5a9bfd-e22e-4f05-b62f-d3c5e6f93025.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Cancelled","tags":["Action,Comedy,Crime,Sports,Delinquents"],"nutshell":""}]