[{"name":" Hoshikuzu Telepath","avatar":"https://mangadex.org/covers/bc8f71a4-49d8-498b-a231-10faa0d53ab6/2a96eb72-5c41-4fe5-a456-3442d7dcd4ee.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Comedy,Girls' Love,4-Koma,School Life,Slice of Life,Aliens"],"nutshell":"Umika is very shy girl who has always been very bad at communicating with others. Over time she gave up on making any friends, until one day she meets the transfer student Yuu. Yuu claims to be an alien with the power of \"Foreheadelepathy\" - being able to read people's emotions by pressing her forehead to theirs.\nFrom the up-and-coming author Okuma Rasuko, a dazzling story about yuri, space and youth."},{"name":" My Friend's Little Sister Has It in for Me!","avatar":"https://mangadex.org/covers/61e5da82-16ac-421e-9fcd-2db8995031a3/2e031b2a-166d-4a3b-a4ad-4be4efff5133.jpg.256.jpg","country":"Japanese","stat":"7.33","status":"Ongoing","tags":["Romance,Comedy,Harem,Drama,School Life,Web Comic,Slice of Life,Adaptation"],"nutshell":"I don’t need any deep relationships. I have no desire for a girlfriend, and I only require one friend who holds any value to me. Ever since I threw out my youth for the sake of efficiency, there is one person who keeps entering the bedroom of Ooboshi Akiteru. She’s neither my little sister nor my friend. She’s nothing more than a bothersome, annoying Kouhai, as well as my friend’s little sister: Kohinata Iroha. “Senpai, let’s go on a date~! Did you think I’d say that~?”. Rather than blood, it seems that energy drinks run through her veins. She keeps occupying my bed, and she tries her best to seduce me with whatever method she can play to her favor. She’s a girl who’s constantly annoying and obnoxious around me. Even though I’m busy all day long, she doesn’t care. And in case you’re wondering why all these envious gazes are directed at me, it’s because Iroha is actually really popular. She’s an honor student at our school with top grades to boot, and she’s known for being kind and proper to anyone she meets. …Hey now, why are you only so annoying when you’re around me?\n\nLinks:\n\n Official Twitter\n Author’s Twitter\n Manga Artist's Twitter\nOfficial LN (JP)\nOfficial LN (EN)\nAlternative Raw"},{"name":" Shimoneta to Iu Gainen ga Sonzai Shinai Taikutsu na Sekai: Man●hen","avatar":"https://mangadex.org/covers/d3bf5c5d-5280-443f-9a8c-2be7277479d1/b75731fc-e43d-48e0-bba9-b9e62df70c1f.jpg.256.jpg","country":"Japanese","stat":"7.24","status":"Completed","tags":["Romance,Comedy,Harem,School Life,Adaptation"],"nutshell":"In a dystopian future, Japanese authorities are cracking down on anyone caught using any risqué language or distributing lewd materials in the country, to the point where all citizens are forced to wear high-tech chokers analysing their every spoken word. A new high-school student named Tanukichi Okuma enters the country's leading elite \"public morals school\" to reunite with his crush and student council President, Anna Nishikinomiya. However, Tanukichi quickly finds himself entwined with the perverted terrorist \"Blue Snow\" when she kidnaps and forces him to join her organization, \"SOX,\" in spreading semi-pornographic material across the city."},{"name":" Zutto Kitto","avatar":"https://mangadex.org/covers/18289e18-7808-40b0-ab42-0bb0ddf1773d/23580444-31ac-4cfa-b6c8-380d6e586cf1.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Romance,Boys' Love,Sports,Drama,Slice of Life"],"nutshell":"During high school, Hamura hurt Jin with the lowest of words and the most foolish of actions. Having regretted this ever since, his only wish is that they can be reunited. But when it finally happens…\n————\nCollege student Hamura Yuzuki is a track-and-field athlete who has competed at the National Championship level during middle and senior high school. However, he focuses strictly on pole-vaulting, to the detriment of his team. This is due to a casual comment by Akishima Jin, a fellow athlete with whom he parted ways after graduation, about the sky being the means through which they are connected. He cannot forget Jin or detach from their past, and this causes problems with his girlfriend, one of which leads to a coincidental reunion with his obsession."},{"name":" Kami-sama ga Uso wo Tsuku.","avatar":"https://mangadex.org/covers/0824242e-dbf0-4356-b18b-55fd491a8ffc/755e52bc-74ac-4212-a3d3-a99526303d38.jpg.256.jpg","country":"Japanese","stat":"8.74","status":"Completed","tags":["Romance,Drama,School Life,Slice of Life,Tragedy"],"nutshell":"It's the summer when Natsuru is 11. Ever since he's turned one of them down on Valentine's Day, the girls of his class have been constantly ignoring him. This changes just before summer break, when Suzumura, the tallest girl in the year, suddenly talks to him. Later, Natsuru meets Suzumura again outside school and finds out she has a secret.\n\nOfficial Release:\n\nArgentinian release by Editorial Ivrea Argentina as Los dioses mienten (2019)\nIndonesian release by m&c! Comics as Our Summer Holiday (2015)\nMexican Spanish release by Editorial Panini Mexico as The God's Lie (2020)\nPolish release by Waneko as Kłamstwa bogów (2018)\nRussian release by Истари Комикс as Даже боги лгут (2017)\nVietnamese release by NXB Hồng Đức as Ông Trời Nói Dối (2018)"},{"name":" Therapy Game Restart","avatar":"https://mangadex.org/covers/840766ba-c5b5-472c-8995-29913e1f1f88/d8851298-ace5-4bd7-b216-3326d377c768.jpg.256.jpg","country":"Japanese","stat":"8.37","status":"Ongoing","tags":["Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"The continuation of Minato and Shizuma's story, this time as an established couple."},{"name":" Villainesses Have More Fun","avatar":"https://mangadex.org/covers/067b49dd-c8f7-4faf-b3a7-de5cb5bdfdfb/ad70cac9-1bb7-4182-8951-69e9bb81913f.jpg.256.jpg","country":"Korean","stat":"8.25","status":"Ongoing","tags":["Reincarnation,Long Strip,Romance,Isekai,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"My friend stole my boyfriend and then dared to hand me a wedding invitation with a smile?\nHa! I had a blast enjoying my revenge and came home and fell asleep but...when I woke up I was in the body of the Villainess of a Romance Fantasy novel who has everything: appearance, assets, and intelligence.\nThe only thing this girl lacked was the insight to judge a man.\nThrow the bastard Prince away to the main female lead and let us just enjoy the luxury of power and money!"},{"name":" Asagao to Kase-san","avatar":"https://mangadex.org/covers/79b440bd-4d8a-41d6-b56f-6147d361ca8b/37096a9d-c90c-479f-9ccd-46ccdb9467b8.jpg.256.jpg","country":"Japanese","stat":"8.81","status":"Completed","tags":["Romance,Comedy,Girls' Love,School Life,Slice of Life"],"nutshell":"Yamada is the plant appointee, tending the school's garden of flowers on her own. She isn't the slightest bit athletic and she's actually quite clumsy. However, that doesn't stop her from having feelings for the star athlete in the class next-door, Kase-san. Slightly shy, Yamada is reluctant about her feelings for the enthusiastic Kase-san. Slowly but surely, the pair are helping each other to grow in confidence for both themselves and their budding relationship, each blush and brush of the hand at a time."},{"name":" Yuri Love Slave","avatar":"https://mangadex.org/covers/86d4b7bc-c4eb-4bb6-810e-9e884a41321a/54b79d63-8c54-43fc-bd07-56f735fe0973.jpg.256.jpg","country":"Japanese","stat":"8.59","status":"Ongoing","tags":["Girls' Love,School Life,Adaptation,Gyaru"],"nutshell":"Asakura is an ordinary high school girl. Once upon a time, she accidentally saw Reina, the class president who was rude and stiff, going to a bookstore. Asakura followed the chairman, and discovered that book the chairman bought turn was a gay manga.\nAsakura, who was surprised by it, along with a feeling of shame, opened and read contents of the book, and over time something tickled her crotch. The devil's grandson whispered - \"Dear Asakura, don't you want to try the things in this book? Don't you want to feel kimochii?\"\nIgnoring the angel's warning on her right shoulder, Asakura's plunged into the devil's seduction, and her gay adventure with Reina begins..."},{"name":" Please Don't Look, Medusa-san","avatar":"https://mangadex.org/covers/1a23bfac-634f-4be0-9085-4197a4e9610a/57a70c83-6f40-4eec-8b7e-e7608b88ae39.jpg.256.jpg","country":"Japanese","stat":"8.29","status":"Completed","tags":["Oneshot,School Life,Slice of Life,Supernatural"],"nutshell":"One-shot of a cute girl with snakes for hair."},{"name":" Father, I Don't Want This Marriage!","avatar":"https://mangadex.org/covers/e1847df1-db22-4279-95e2-9dbbbd1bbfbc/19ccda36-1cf3-4d4f-ac29-8dc04d881564.jpg.256.jpg","country":"Korean","stat":"8.98","status":"Ongoing","tags":["Reincarnation,Historical,Long Strip,Romance,Isekai,Drama,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"I’m Juvelian? The daughter of the duke and the villainess of this novel? I managed to avoid my death with some previous knowledge about my life, as this was my second time at it. Now, I should be able to live a peaceful life!\n“I’m not going to marry a man unless he has everything. I want the most wealthy, famous, and competent man there is.”\nI dreamt of a glamorous life as the daughter of the duke, but my father tells me the Crown Prince who is known to be a lunatic is to be my husband! As an extraordinary measure, I couldn’t help but start a contract relationship. That is, with a handsome side character that looks better than the main one.\n“Why are you trying to avoid being engaged to the prince?”\n“He’s scary. I heard that he even kills his own entourage if he doesn’t like them.”\nA few days later, the prince sent a terrible letter to me.\n“I will not kill you.”\nOh no, did I set up another death trap for myself?\n\nJuvelian is a villainess so hated by everyone that even her lover and father leave her to die a pitiful death. Just as she's about to face her fate, she gets the chance to change the course of her story. In order to avoid the tragic end she knows awaits her, she breaks up with her lover and gives up trying to win her father's love. Instead, she focuses on using his wealth to enjoy her new life to its fullest! But while she prepares for her extravagant life as a lady, her father begins looking for her new suitor. Afraid that he'll marry her off to the infamously unpredictable and stormy prince, she lands on a desperate solution: a dating contract. And the best candidate is none other than her father's student.\n\nOriginal Novel\nOfficial English Translation of the Novel\nOriginal Webtoon: Daum, KakaoPage\nOfficial Translations:\n\nEnglish\nChinese (Simplified) / 汉语\nChinese (Traditional) / 漢語\nFrench / Français\nGerman / Deutsch\nIndonesian / Bahasa Indonesia\nJapanese / 日本語\nThai / ภาษาไทย"},{"name":" Asobinin wa Kenja ni Tenshoku Dekiru tte Shittemashita? ~ Yuusha Party o Tsuihou Sareta Lv 99","avatar":"https://mangadex.org/covers/09cffd75-7d03-43cd-af83-bb7780ff62e1/ca854931-7df2-4c0e-8adb-3f220f36dfb4.jpg.256.jpg","country":"Japanese","stat":"6.73","status":"Completed","tags":["Action,Romance,Ninja,Comedy,Adventure,Magic,Harem,Fantasy,Monster Girls,Adaptation"],"nutshell":"The Jester ―― More commonly known as the ‘Playboy’ Dylan, was fired from the party of the Heroes. The self-centred Heroes didn’t understand Dylan’s importance to the group.\nThey were just a group of one-man teams. Not interested in cooperation at all. Any failures are blamed on the jester. Dylan, who was disgusted with such companions and was sick of playing as their comedic foil, happily accepted being kicked out.\nThe Heroes didn’t know. After saving them many times over with his magic tricks, the level 99 jester can change his job title to that of a ‘Great Sage’.\n“Life, how about a rewrite?”\nHe’s done being the clown. From here on out, he’s going to take the leading role."},{"name":" Yuusha to Maou no Konpaku Rekitei (Extasis)","avatar":"https://mangadex.org/covers/00a82fcc-997d-4139-9d2c-8935628199c5/8677f7e6-2fb2-4187-8ead-8c8312bd2b10.jpg.256.jpg","country":"Japanese","stat":"7.43","status":"Completed","tags":["Reincarnation,Genderswap,Comedy,Adventure,Fantasy"],"nutshell":"A blessed Hero. A vicious Demon Lord. A common objective.\nAn epic battle between good and evil whose outcome will shape the new era the world will enter has reached its endgame…\nHowever, things aren't what they appear to be and plans take an unexpected turn.\nA new high fantasy manga by ero mangaka GEN.\n\nLinks:\n\nAlternative Raw Source (comic-walker)"},{"name":" Class ga Isekai Shoukan sareta Naka Ore dake Nokotta n desu ga","avatar":"https://mangadex.org/covers/2e3d0203-e1d2-4142-b6ab-69a70643d7a1/cc2a1cf1-48a2-4c7d-9ed3-e7d92c599a05.jpg.256.jpg","country":"Japanese","stat":"7.02","status":"Ongoing","tags":["Action,Romance,Magic,Harem,Isekai,Drama,School Life,Fantasy,Supernatural,Adaptation"],"nutshell":"A god of a different world had abruptly appeared in Kamiya Yato's classroom and forcibly summoned the entire class to his world… except for him, because he was sleeping in a seat in the corner of the class, the round summoning magic circle didn't reach him, and he ended up staying here on Earth, but with brand-new skills.\nAfter he made it through a whole year full of police interviews and journalism reports, he finally became a high school student, but the quiet days he had hoped for were far from over; be it terrorists who decide to occupy his school or even monsters from different world, one by one new incidents take place in the town he lives in…\nWill a boy without any motivation be able to save the world?"},{"name":" Orenchi ni Kita Onna Kishi to Inakagurashi Surukotoninatta Ken","avatar":"https://mangadex.org/covers/20e4c17d-3741-46dd-a8bb-cbc132ee52d1/bc8f688a-c867-4e2a-ba20-080b549d5dac.jpg.256.jpg","country":"Japanese","stat":"7.57","status":"Ongoing","tags":["Romance,Comedy,Magic,Isekai,Drama,Fantasy,Slice of Life,Cooking,Adaptation"],"nutshell":"Saeki Kanji, 32 years old and still single, is living in the Japanese countryside, which is in decline. After graduating from university with a degree in economics he took a job as a salaryman in a leading company in Tokyo, but retired when he inherited the family farm in Mitsuyama village when his parents passed on. He soon took to the life of a simple farmer. One day a beautiful woman wearing full body armor came to his door begging to stay the night. She claimed to be royalty from another world and is unable to return there. She ends up living with Kanji and helping out the local agriculture situation.\n\nLinks:\n\nOfficial LN (JP)\n Web Novel"},{"name":" Sokuochi Mayuri-chan - Pixiv Shorts","avatar":"https://mangadex.org/covers/e7ab9322-d2e1-4219-b96a-8a715f520f08/f8716622-0863-4c72-b4ee-c2ebece479e3.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Comedy,Slice of Life"],"nutshell":"Mayuri-chan likes to tease her very, very close childhood friend, but she's not quite so brave when he counters her challenges exponentially!\nWatch Mayuri-chan lose WAY more than what she bargained for!(*)\n**(*)**clothes and dignity included\nThe original pixiv series was deleted and moved to the author's alternate account, the chapter order has been changed to match the new page order(10.5 is completely gone there) seen at the raw link (Ch. 16 here is page 19 here)\nThe other parts of the raw link are just previews for the serialized version (Serialized Ch. 11, 12, 13 etc. preview)\nThe author's original Pixiv is: https://www.pixiv.net/member.php?id=20806956 Some of the works are NSFW. If you can, please follow him."},{"name":" The Guy Who Was Reincarnated Into the World of a Gacha Game","avatar":"https://mangadex.org/covers/debe0c2f-3d31-4137-aabf-1bc8b802f675/860dd031-a811-40ad-84ab-401eb87a8bab.jpg.256.jpg","country":"Japanese","stat":"7.04","status":"Completed","tags":["Oneshot,Reincarnation,Genderswap,Web Comic,Full Color"],"nutshell":""},{"name":" Mind Reading Princess","avatar":"https://mangadex.org/covers/f5a6e607-69d7-4e2b-963a-2a7bf80176b3/b25de0d2-8fa6-4efd-bbd6-d3df6c361d86.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.00","status":"Ongoing","tags":["Time Travel,Romance"],"nutshell":"Used, betrayed, and tortured by her husband and sister, she died in despair wondering why she couldn’t have seen through them earlier?\nAs if God had heard her question, she awakens back at the morning of her wedding day. To add to this strange occurrence, she discovers she can read people’s minds, at least, most people's minds.\nThere seems to be a certain Prince who is immune to her ability. What is he thinking? Will he undermine her revenge plan?"},{"name":" Sacred Chevalier","avatar":"https://mangadex.org/covers/57c93f71-2f4c-451b-b873-4d0300a68a8c/47ae3ea8-5cd2-4bba-a30d-a9d78eaa0d1d.png.256.jpg","country":"Japanese","stat":"7.11","status":"Completed","tags":["Action,Magic,Harem,School Life,Fantasy,Supernatural,Adaptation"],"nutshell":"In the world of the Goddess Wellos, women are blessed with strength and good looks and men with good luck after sex. The women who gain this godly strength and good looks become Paladins and participate in battle and the men support the Paladins as Chevaliers. in Lente village, Kite, the son of a blacksmith, is a boy with a very strong libido. Former Paladin Lilia identifies him as a chevalier candidate and encourages him to join the Royal Academy in the capital to become a Royal Chevalier."},{"name":" Battle in 5 Seconds After Meeting","avatar":"https://mangadex.org/covers/6f084aaa-ab29-40f8-82a9-b7586b260182/29ca5f25-0126-405d-9e33-fe6710b97584.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Ongoing","tags":["Action,Psychological,Drama,Supernatural"],"nutshell":"It was just a usual morning.\nAkira Shiroyanagi, a high schooler who loves games and Konpeito (Japanese sweets), is suddenly dragged into a battlefield by a mysterious girl who calls herself Mion. The participants are told that they are \"erased from the family register, involved in an experiment, and have gained certain powers.\"\nAkira is determined to win the game with his newfound powers and destroy the organization. Armed with a power no one expects and his \"brain\" skills, a new era of intelligence battle of begins!"},{"name":" I Want to Ask Hu Tao Out on a Date!","avatar":"https://mangadex.org/covers/df46ab10-08ad-4f3d-8334-8556798f0efa/c8293bea-9f8a-4a97-a4a5-6827de1ae174.png.256.jpg","country":"Japanese","stat":"8.20","status":"Ongoing","tags":["Romance,Video Games,Web Comic,Slice of Life,Full Color"],"nutshell":""},{"name":" War's Unwomanly Face","avatar":"https://mangadex.org/covers/097ba2ca-4f27-439d-b74b-623443924e75/7fcb19aa-2843-4300-9943-78284a6b3191.jpg.256.jpg","country":"Japanese","stat":"8.77","status":"Ongoing","tags":["Historical,Psychological,Survival,Military,Drama,Web Comic,Slice of Life,Adaptation,Tragedy"],"nutshell":"Based on The Unwomanly Face of War by Svetlana Alexievich which can be bought here.\nIn The Unwomanly Face of War, Alexievich chronicles the experiences of the Soviet women who fought on the front lines, on the home front, and in the occupied territories. These women—more than a million in total—were nurses and doctors, pilots, tank drivers, machine-gunners, and snipers. They battled alongside men, and yet, after the victory, their efforts and sacrifices were forgotten."},{"name":" S Rare Soubi no Niau Kanojo","avatar":"https://mangadex.org/covers/29b8c90a-4e8e-4da6-a002-e74d2a3de2d4/534152da-4068-4b56-8f25-fad84ce78c49.jpg.256.jpg","country":"Japanese","stat":"5.64","status":"Completed","tags":["Action,Romance,Comedy,Video Games,Magic,Harem,Drama,Supernatural"],"nutshell":"Seko Daiko, a second-year high schooler is an extreme cheapskate. Taking down all the light bulbs in the house, making his siblings eat baked bread crust for breakfast… He would do anything just to save an extra penny.\nDaiko was sure he could keep this thrift lifestyle going forever until… The world's fate depends on him spending money on a mobile game?! (from MangaUpdates)"},{"name":" I Raised the Beast Well","avatar":"https://mangadex.org/covers/6a9baffb-505e-49c1-9b28-94521fdd5b2b/0b6eccff-1a90-446d-82fa-62731cc1029a.jpg.256.jpg","country":"Korean","stat":"8.84","status":"Ongoing","tags":["Historical,Animals,Long Strip,Romance,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"Blondina is living a real-life Cinderella story. After growing up poor and enduring a difficult childhood, she discovers that she is a princess of the Ates empire. However, her estranged father and half-siblings give her the cold shoulder when she moves into the palace, and Blondina must keep a low profile. That all changes when she befriends Amon, a cat-like creature with mysterious intentions. For years, creatures like Amon and humans have struggled to live in harmony. Can Blondina and Amon’s friendship bring peace, or will it deepen the rift between their people?\n\nBlondina, a princess who had commoner’s blood, lived quietly in a separate palace. Due to her mixed blood, she received ill-treatment and was surrounded with contempt. One day, she happened upon a wounded black cat and decided to treat it. But, the lovely cat she assumed it to be was actually…?\n“If you run away like that, of course, I’d want to hunt you.”\nAmon’s lips gently wandered down her skin.\n“You’re the one who picked me up. You’re the one who kept me by your side,” Amon whispered, as his feverish breath made her skin crawl, “So you have to take responsibility for me till the end, Bridey.”\nOnce the lovely cat was all grown up, she realized… She thought she raised him well, but she's going to be eaten up as well.\n\nOriginal Webtoon\nOfficial Translations:\n\nEnglish\nChinese (Simplified) / 汉语\nChinese (Traditional) / 漢語\nFrench / Français\nGerman / Deutsch\nIndonesian / Bahasa Indonesia\nSpanish / Español\nThai / ภาษาไทย\n\nLinks:\n\nPromotional Video\nOriginal Web Novel"},{"name":" \"Oppai Momitai\" tte Sakendara, Imouto no Tomodachi to Tsukiau Koto ni Narimashita.","avatar":"https://mangadex.org/covers/3a6977cb-3494-4f93-a2e7-48853dfe3325/e1d750b3-a1b6-4245-8cef-bd6c765fbf73.jpg.256.jpg","country":"Japanese","stat":"8.19","status":"Ongoing","tags":["Romance,Comedy,School Life,Adaptation"],"nutshell":"\"I want to fondle boobs!\" His prayer was answered by an angelic girl named Miko-chan. \"I-if I let you touch my breast, will you go out with me?\" It's a sweet story of their daily lovey-dovey life. Isn't it wonderful to have a girlfriend?"},{"name":" She's the Prince and I'm the Princess!? (Webcomic)","avatar":"https://mangadex.org/covers/000d87a2-63cc-4760-b7a0-8393c14fa6b4/d80ade81-943f-44c3-8ced-a739a1ded4f8.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Ongoing","tags":["Romance,Comedy,School Life,Web Comic,Slice of Life"],"nutshell":"Ichinose Haruma is handsome, but the girl he likes happens to be even more handsome…?!"},{"name":" Honey Trap Shared House","avatar":"https://mangadex.org/covers/7493b91c-c906-4fd8-85f4-900c4c1538f9/9546255c-d9ac-4699-9dcd-1b63de0cd737.jpg.256.jpg","country":"Japanese","stat":"8.19","status":"Ongoing","tags":["Action,Romance,Comedy,Crime,Harem"],"nutshell":"The trump card of the strongest spies who hold the power balance between nations is \"Honey Trap\"!\nThese two strongest spies face off in a Honey Trap at a Shared House.\nUse everything and every method to make them fall in love!"},{"name":" Kimi to no Dogfight","avatar":"https://mangadex.org/covers/337276c3-0824-4e53-b8df-b262c7fb6501/fcceb774-6ee7-424c-a2e5-bd32bb55b151.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Boys' Love,Video Games,Slice of Life"],"nutshell":"College boy Haruno goes to meet a friend he's gotten to know through an online game. He goes expecting to meet a cute girl, but instead he meets a guy – and not just any guy, but a very popular ikemen guy who attends the same college as he does. Maybe this meeting is fate."},{"name":" Saving 80,000 Gold Coins in the Different World for My Old Age","avatar":"https://mangadex.org/covers/89ed3ec2-ebe6-4d6b-92eb-d753a8bb365e/6d2dafd6-e7da-4ab8-905f-0c319214a79e.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Ongoing","tags":["Monsters,Action,Comedy,Adventure,Magic,Military,Isekai,Drama,Fantasy,Supernatural,Adaptation"],"nutshell":"An 18-year-old girl who lost her family in an accident, Yamano Mitsuha falls off a cliff one day and transferred to a different world with a civilization level of medieval Europe. Mitsuwa who discovered it was possible to go and return to Earth after a deadly fight with wolves decided to live in both worlds.\n\"For security in old age, I will aim for 80,000 gold coins!\"\nI will try not to let strange things circulate to not distort the progress of the world, but I won’t hold back for the sake of my easy life and safety!\nWhile wearing three handguns along with words and deeds that appear decent, in her head Yamano Mitsuha is a sly girl. Making an effort to make money even with a small body that looks like a child to Westerners!\nOh, my secrets are too dangerous, is that so? It’s all right, it’s fine! I’ll teleport away when push comes to shove!\n\nLinks:\n\n\nOfficial English LN on Amazon.com\n\n\nWikipedia"},{"name":" Let’s Hide My Younger Brother First","avatar":"https://mangadex.org/covers/24302640-2313-4f9c-8149-b572ec450907/77d920af-abbf-416e-9056-87164929f635.jpg.256.jpg","country":"Korean","stat":"8.33","status":"Ongoing","tags":["Reincarnation,Historical,Long Strip,Romance,Isekai,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"The fate of a girl in a BL novel is a tragic one. Girls are either vaguely helpful, evil, or add nothing to the plot. So what happens when you turn into the older sister of a BL novel protagonist? The older sister who dies a tragic death at the hands of a madman who’s infatuated with your younger brother? You go with your gut instinct: hide him. Hide your brother from everything, especially men, that could harm him and you. That’s the task that Kyla Vesta is set with in this life, and a task that she’s determined to complete.\n\n\nOfficial Japanese Translation\nOfficial Simplified Chinese Translation"},{"name":" Dark Arts Master","avatar":"https://mangadex.org/covers/18512a9e-1fc0-4adb-93e5-dc718ff8d604/168112c3-9351-4c0b-bfa9-5ded2b194259.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Monsters,Action,Demons,Adventure,Magic,Girls' Love,Fantasy"],"nutshell":"Bella, a girl with poor magic skills, attends the magic academy Anziffollon. Desperately following the footsteps of a certain person's dream, she eventually gets her hands on a forbidden magic…\n_______________"},{"name":" Sweet Little Devil","avatar":"https://mangadex.org/covers/9ea8f695-fbe0-4c27-a1ff-5af81b351d82/d1b70394-aca3-4c9b-a4b8-c6bc23476293.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Romance,Anthology,Girls' Love,School Life"],"nutshell":"A collection of stories by Nanzaki Iku (better known by the circle name Doropanda Tours), mostly from Yuri Hime Wildrose.\n\nSweet Little Devil : two childhood friends who are now in a relationship.\nHeart and Soul: a sequel to \"Sweet Little Devil,\" Ritsuko and Sayo deal with their insecurities about Ritsuko's upcoming graduation.\nMoment Like Fireworks\nLove Prep Room: two girls have the art prep room all to themselves\nOur Future Plans: Azumi worries that her girlfriend Shiki, a dog groomer who's a few years older than her, doesn't really love her.\nStarting Over\nOne and Only: gives us a glimpse of Ritsuko and Sayo's future after graduation\n\nExtras:\nIn \"Girls Don't Cry,\" Ritsuko gets a shock–one of her friends thinks Sayo is cool!\n\"Another Sweet Field\" is about how Sayo wants to be Ritsuko's bride when they grow up."}]