[{"name":" Human Neon","avatar":"https://mangadex.org/covers/ca8246e0-910f-4f39-b2cf-a3bceb9dcfe6/b65ad78d-929e-4b45-8ddc-dbda7fe5fd9f.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Thriller,Crime,Tragedy"],"nutshell":"Follow a sparkling boy, during a war, in his travel to find what he is useful for."},{"name":" Quickly Started to Go Out","avatar":"https://mangadex.org/covers/ca8449af-403b-4af9-ab7e-bdd8ec28b717/6ac22c28-7efd-45c3-af42-ffac6db2493f.png.256.jpg","country":"Japanese","stat":"7.56","status":"Completed","tags":["Oneshot,Romance,School Life,Delinquents"],"nutshell":"A oneshot story about a plain class rep. girl and a delinquent-looking guy and how they quickly started to go out."},{"name":" Inochi","avatar":"https://mangadex.org/covers/ca87a7fc-1847-4408-a5af-b69982283ee2/dacff977-b7de-4593-ae00-cbafbf4bb496.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Psychological,Romance,Drama,School Life,Slice of Life,Tragedy"],"nutshell":"“I killed my sister. Now I will live as her.”\nMischevious Nobara and good-girl Kotori are identical twin sisters. After their father’s death, they lived with their grandmother and mother, respectively, but one day, while they had switched places, Kotori was murdered!\nBecause she was robbed of her most precious daughter, Nobara’s mother’s hair turned pure white!\nNobara, who is tormented with guilt, decides to live as Kotori in order to protect her mother…!?"},{"name":" Touhou - Moon Rabbit, What do You Watch When You Jump? (Doujinshi)","avatar":"https://mangadex.org/covers/ca88a47b-add5-4ac0-826b-7783e039ac61/f8e4a30d-3dd5-483e-97b7-3d1d2359ea2c.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Fantasy"],"nutshell":"The story takes place at Eintei. When she ran away from the moon.\nReisen is discovered by Tewi and welcomed into Kaguya and Eirin's household. This tells the story of Reisen's first days on Earth and how she acquired the name \"Udongein\"."},{"name":" Anata Dake wo Matteru","avatar":"https://mangadex.org/covers/ca8bd8e8-7f56-4fd7-a945-782fc076c0f4/517d7238-2188-4f2e-91d4-d1ec963a8ddf.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Boys' Love,Slice of Life"],"nutshell":"Collection of short stories :\n\n\nAnata dake wo matteru\nFrom Peccatore Sanctuary:\nShirasawa, who sought a lover he could be dependant on, always dated married men old enough to be his father. At such a time, appears Nakatani, a student at the cram school he used to work part-time for. Nakatani passionately tells Shirasawa of his love for him, but Shirasawa doesn't seem interested in having a relationship with younger guys…\n\n\nEgao de itene\n\n\nTonari no lovely\n\n\nYoru ni sumu hito\n\n\nAnata dake wo matteru - Extra"},{"name":" Touhou - Soshite Namae wo Yobutameni (Doujinshi)","avatar":"https://mangadex.org/covers/ca8bfa59-7055-4a6f-882f-e3b55957427b/94c71fe8-a715-43fd-931d-14ca84b41f3f.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Drama"],"nutshell":"Akyuu and Mokou talk about the different natures of their immortalities, and what it means to them."},{"name":" Loveroid","avatar":"https://mangadex.org/covers/ca8bfe72-b486-4341-b1c5-072fb2ccb193/cfd56393-0377-4179-bba6-ec5628379f8d.jpg.256.jpg","country":"Korean","stat":"7.90","status":"Ongoing","tags":["Action,Long Strip,Romance,Comedy,School Life"],"nutshell":"Han Narum is a boy who believes small things are the best. A little girl found him. \"I found you. My boyfriend.\" And at the same time that he asked \"what's that mean?\" someone else appeared. What? The robots known as loveroids transform into adults if they receive a loving confession? And the winner of the \"loveroid game\" in which the loveroids fight will gain 10 billion won?! A light and lively battle comedy, start!"},{"name":" Devil Ecstasy","avatar":"https://mangadex.org/covers/ca8d714f-c8c8-4ef1-befb-78503a80bd7e/8b4435a7-5cfb-4e63-8ad9-fd6210275338.jpg.256.jpg","country":"Japanese","stat":"7.23","status":"Completed","tags":["Demons,Romance,Comedy,Drama,Horror,Supernatural"],"nutshell":"A childhood trauma has left Kusakabe Noboru, a college freshman in Tokyo, afraid of women, especially those with big breasts. Talking to them, let alone touching them is out of the question and it is no surprise that he is still a virgin. After another failed night to talk to girls with his one and only friend Takahashi, the two see an incredibly large building called the Devil Ecstasy. They learn that it is a brothel and Takahashi convinces Noboru to use this opportunity to lose their virginity.\nAs the two pick out the girls, Noboru notices Meruru, a cute flat chested girl and chooses her while Takahashi picks the sexy Celine. Noboru’s fear of girls kicks in and nothing happens while Takahashi leaves happy. But when Takahashi dies the next day under unusual circumstances, Noboru learns the terrifying truth that the women at Devil Ecstasy are all succubi, waiting to suck the mojo and life out of the men who dare approach the brothel!"},{"name":" A River of Hope","avatar":"https://mangadex.org/covers/ca910e64-1207-4f22-ad12-491494d49cca/af381a86-90e6-43c6-88de-3ab3245c4e39.png.256.jpg","country":"Korean","stat":"7.19","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Office Workers,Web Comic,Full Color"],"nutshell":"This is a brand new webtoon by the author of \"True Beauty\"! It is a story of the hopeful romance between Joo Sang-hyuk, an official at the Ministry of Economics and Finance, and Hun Yi-soo, an aspiring writer, and the rough chemistry between them."},{"name":" Empress’ Conquest","avatar":"https://mangadex.org/covers/ca9123bf-4926-4e12-87b3-85e59cbe65e5/22a1a46d-5ac3-4982-907b-722afd0f4dc9.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Historical,Long Strip,Romance,Drama,Web Comic,Full Color"],"nutshell":"Xu Bixuan is in a loveless marriage with Emperor Leng Aotian, a man who is cruel to his wife. When Xu Bixuan's newborn daughter was killed due to an incident, she vowed to take revenge. Witness a queen scheming against her emperor and his concubines in order to have justice"},{"name":" Houkago Shinjuu","avatar":"https://mangadex.org/covers/ca92987b-db15-47f3-a972-4a0e63304493/388c8f97-dfc0-4b6c-9bdb-988149fa674c.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"After school Lover's Suicide. Is there a terminal station ahead?"},{"name":" Gwi","avatar":"https://mangadex.org/covers/ca947c91-98ca-4585-9b79-e4837b1584bc/0d820d6a-78e2-4bf0-bf3b-cb424ab9b361.jpg.256.jpg","country":"Korean","stat":"7.81","status":"Completed","tags":["Historical,Action,Martial Arts,Adventure,Drama,Tragedy"],"nutshell":"Mu-Sang’s has a quest… He must find and kill every “Gwi” that has ever existed. He is determined and won’t let anything get in his way, not even the imperial army!\nWhile traveling and searching for the remnants of Gwi, he meets a girl who also bears the same crossed out mark that he has. A fateful encounter? Were those two fated to meet? And why does he hold such a grudge against the “Gwi”? …are all questions left to be answered!"},{"name":" Balance Days","avatar":"https://mangadex.org/covers/ca97a619-be08-4688-93aa-fe32cb5aef1e/5b95e06b-4138-4f49-a5cf-273f59471086.jpg.256.jpg","country":"Japanese","stat":"7.71","status":"Completed","tags":["Oneshot,Romance,Sports,School Life"],"nutshell":"When Mizuoka sneaks into the pool after hours for extra swimming practice, he's caught by his classmate Hino! Hino agrees not to tell anyone he's broken in, provided he teaches her how to swim. Mizuoka agrees, and, though he finds himself liking her more and more, he really needs the extra practice for his swimming club status. Will Mizuoka's dedication to his club ranking destroy his chances with Hino?"},{"name":" Ogrest","avatar":"https://mangadex.org/covers/ca996f13-0e38-4381-bd33-8b3841a8f112/2bfd236f-915d-45d1-b805-1c788430977a.jpg.256.jpg","country":"French","stat":"7.98","status":"Ongoing","tags":["Adventure,Fantasy"],"nutshell":"On an island paradise, far from the hustle and bustle of the old continent, lives Ogrest. This little ogre flows happy days with Otomaï, its creator, and Dathura, a doll with divine beauty … Until the day when the Dofus, precious eggs of magic dragons, escape the surveillance of their guardians. It is a boon for all aspiring adventurers, but not for our trio, whose island hosts a Dofus. Very quickly, lust and the thirst for power will lead them into a dark scheme …"},{"name":" Kiss Shite Yowamushi-kun!","avatar":"https://mangadex.org/covers/ca9b6d04-cecc-4ff9-8547-78c0c9e5dc2f/e5785f6c-9764-482e-83db-b6b55c1f5748.jpg.256.jpg","country":"Japanese","stat":"7.72","status":"Completed","tags":["Romance,Boys' Love,Fantasy,Shota,Supernatural"],"nutshell":"Short and unpopular Sawa gets his first love confession. And it's from a tall and dark wimp! His name is Ono. He even went so far as to follow Sawa to his workplace. So what was up with that outrageous confession?! A moving story about a weakling and his strong-willed senpai."},{"name":" Sakura Trick - Maple Season (Doujinshi)","avatar":"https://mangadex.org/covers/ca9cf1ad-aed5-4b02-96fe-7bccf3a9eea4/1f7357cc-7964-435c-bb3a-16b7da148c63.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Girls' Love,Slice of Life"],"nutshell":""},{"name":" Exorcist","avatar":"https://mangadex.org/covers/caa0a488-2350-4395-be44-1bad6ab56bd7/41ebfc43-6867-4c44-bc7f-58e41e98206d.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Action,Fantasy,Supernatural"],"nutshell":"\"Exorcists\" are the protectors of the human world with sole responsibility to deal with the evil demons that come from the magic world….\nLan Ximing, a normal student, unexpectedly meets a demon named Nilu and a fantastic journey unfolds before them.\nHere lies an unimaginable tale that is just waiting to be experienced!"},{"name":" Bakemonogatari - Panaino! (Doujinshi)","avatar":"https://mangadex.org/covers/caa15e26-2a41-4951-887e-ea790e629b03/26132966-17fa-4edf-a5ef-c9c4b3bc1fd0.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":[""],"nutshell":""},{"name":" Collecting the Divine","avatar":"https://mangadex.org/covers/caaa3f33-3ac2-4170-9b3a-20b667be7d2d/b08bff1a-0dc4-42ca-a8e1-b82a4a24b8c0.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.01","status":"Ongoing","tags":["Historical,Action"],"nutshell":"Modern-day Daoist Fang Yi wakes up one day with a superpower—the ability to sense antiques and artifacts! From there, he becomes an artifact-collecting wonder. Countless treasures all become his, and he leads his band of brothers on a journey to the very peak of life!"},{"name":" Dragon Ball Beyond","avatar":"https://mangadex.org/covers/caac63d5-8269-4ad5-8939-e4bde6a570ab/a9fe8baf-2161-4462-86a5-48c6b34e531a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":[""],"nutshell":""},{"name":" El lugar donde sopla el viento","avatar":"https://mangadex.org/covers/caafb043-dac7-4a85-a146-018830a395f0/a458529f-f16a-41a7-8c13-39b1fe2a268b.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Ongoing","tags":["Long Strip,Boys' Love,Drama,Web Comic,Full Color"],"nutshell":"Para romper una antigua maldición que asola el linaje real, el joven príncipe Tasara está destinado a ser sacrificado a muerte. Nara se alista como sirviente de palacio para llevar a cabo la ejecución del príncipe cuando llegue el momento. Pero él desarrolla una debilidad por el príncipe maldito, y después de cometer un acto atroz e imperdonable contra Tasara, Nara está desesperado por corregir sus errores. Pronto, su relación lasciva que se había mantenido en secreto pone a prueba su resolución. ¿Nara se verá tentado de su misión original? No se sabe hasta dónde llegaría para ganar el perdón de Tasara."},{"name":" Kasumi","avatar":"https://mangadex.org/covers/cab204b5-7f8d-490a-a5ae-744cd86f349a/3fb70b0e-82be-486b-951d-592c2d22f2f9.jpg.256.jpg","country":"English","stat":"7.97","status":"Cancelled","tags":["Romance,Comedy,School Life,Slice of Life,Supernatural"],"nutshell":"Kasumi's father moves around for work frequently, meaning she constantly has to change schools. On one such move, while the two of them have stopped to take a break, Kasumi spots an odd glowing light. She chases it up a tree, but after catching it the branch she's standing on breaks and she falls. When she wakes up the next day, strangely uninjured, she heads to her new school, which turns out to be super exclusive! Kasumi has trouble fitting in with the snobby rich kids in the school, even more so after she gains the ire of the most popular boy in school's fan club, and now she even seems to have gained special abilities!?! How will Kasumi fare in her new school and what are these strange powers that are developing?\nNOTE: This is an OEL. Not an English translation of a Japanese version.\nWikipedia"},{"name":" 417","avatar":"https://mangadex.org/covers/cab5b832-4b10-4b74-8285-a8f92f14434d/eb48893d-f9f9-4537-8152-7d630d9d991c.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.79","status":"Ongoing","tags":["Long Strip,Comedy,Web Comic,Slice of Life"],"nutshell":"Short stories on the 417 group."},{"name":" MookHyang - The Origin","avatar":"https://mangadex.org/covers/cab9bbbf-5acd-4bc0-83b5-f803bec4a37e/a87c7d4b-4490-41ee-b18b-d72bcf285003.jpg.256.jpg","country":"Korean","stat":"8.22","status":"Completed","tags":["Action,Long Strip,Martial Arts,Adventure,Magic,Wuxia,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"In this prequel to “Mookhyang: Dark Lady,” we meet Mookhyang in Murim, or the world of martial arts, as a young member of the Demonic Sect. After years of rigorous training, he rises through the ranks and joins an elite squad of first-rate assassins. Despite his impressive achievements, however, he finds himself hungry for more. His obsession for martial arts ultimately leads him down a different path… one that few have ever dared to take. He spends decades learning the way of the sword and cultivating his inner qi, or mana, in hopes of one day reaching a state no warrior of the Demonic Sect has ever reached before—the State of Demon Transcender. Join Mookhyang as he fights powerful masters, takes down evil forces, and pushes himself to the limit... and beyond.\n\n\n\nWebtoon Promo\n\n\nOriginal Webtoon <Webtoon kakao>"},{"name":" Haikyu!! - Il Mio Caro (Doujinshi)","avatar":"https://mangadex.org/covers/caba060a-d4d7-491c-8c1a-68e73d11e43f/6f1f5518-cbcd-4a15-ad1e-59775eb65b78.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Boys' Love,Sports"],"nutshell":"OC x Ushijima Wakatoshi"},{"name":" Grandma in the Magical Girl","avatar":"https://mangadex.org/covers/cabcdaa5-9767-475f-b959-c7b0d629341c/121d9f82-2360-428f-82c9-e4447eb152ef.jpg.256.jpg","country":"Japanese","stat":"8.54","status":"Ongoing","tags":["Comedy,Magical Girls,Web Comic"],"nutshell":""},{"name":" Shinba Shounen to Nemuru Kyojin","avatar":"https://mangadex.org/covers/cabe9efe-af2e-45a6-acfb-a129950a2d7c/bf7ed2eb-4c9e-4320-a212-1c88fb1a6e7c.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Oneshot,Action,Supernatural"],"nutshell":"Shinba, who's always isolated himself and never made friends, finds stones that contain the souls of dead famous people. With his special power, he uses the stones to be people he thinks he could never be like."},{"name":" Kyoudai Gokko to Shoujo Bitch","avatar":"https://mangadex.org/covers/cac23a33-632c-41f7-8013-1ee08818416a/0384ceab-04dc-4acc-9a3a-05df48024597.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Boys' Love"],"nutshell":"Hisaki lives alone with his younger step-brother, Yuzuru, his only remaining family member. Before he realizes it, he starts developing feelings for his brother, who's grown into an attractive young man. Hisaki starts working at a call service for men for the money and to help get over his feelings. His cool, bossy persona makes him the most popular guy at the club. But, he's actually never gone all the way! Just as Hisaki starts worrying that he won't be able to hold his feelings inside any longer, a misunderstanding results in Hisaki and Yuzuru getting it on… It's a hot, steamy love story between two step-brothers. (From Renta)"},{"name":" Diamond Ni Naritai","avatar":"https://mangadex.org/covers/cac52e47-1e15-4fa5-86b5-e6561f6f1dff/15729f48-52de-4575-bec2-8312affc47ec.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"The single-minded love of childhood friends."},{"name":" Kill Your Honey","avatar":"https://mangadex.org/covers/cac76da3-192d-4a0d-8b82-cd041cb5bf8e/bda88d81-0dac-4454-81f0-00ec333e0455.jpg.256.jpg","country":"Korean","stat":"7.72","status":"Completed","tags":["Romance,Comedy,Boys' Love,Vampires"],"nutshell":"Do-hyun, an incompetent vampire and unemployed man, falls in a back alley and is found by Mu-hyuk, the conglomerate's successor, who forces him to work for the company. Do-hyun is being coached by Mu-hyuk every day on the condition that he procures a blood transfusion pack."},{"name":" I Am A Sukeban","avatar":"https://mangadex.org/covers/cace0b4c-6696-4d08-ae26-6c8be207ef36/6a988d07-c249-4691-92f5-246343d841b4.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Genderswap,Action,Romance,Ninja,Comedy,Incest,Crime,Martial Arts,Office Workers,Crossdressing,Drama,School Life,Fantasy,Delinquents,Police,Slice of Life"],"nutshell":"Summary and Preview\nBanji Suke, better known as Sukeban, and his family are forced to move away after destroying their previous town. In order to be able to attend his new school (which happens to be an all-female school), he must disguise himself as a girl! However, this situation coupled with Sukeban's rebellious nature will result in many comedic troubles, and his all-girls school may never be the same!\nThe manga has been adapted into two live-actions films and an OVA.\nsource:https://mangahelpers.com/m/oira-sukeban"},{"name":" Tales of the Abyss - Tsuioku no Jade","avatar":"https://mangadex.org/covers/cad2cda2-3eee-4185-8a12-712760f4f746/1d54006d-87a4-4e62-9bb7-a02d7942dd36.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Action,Adventure,Fantasy"],"nutshell":"A Tales of the Abyss side story that focuses on Jade Curtiss, also known as Jade the Necromancer."}]