[{"name":" Reborn as a Vending Machine, I Now Wander the Dungeon","avatar":"https://mangadex.org/covers/9ea92521-d38b-4f66-a1bd-7e653e93ef98/9dccacf4-b7cf-4d7e-a860-3bfcf25eb0cb.jpg.256.jpg","country":"Japanese","stat":"8.42","status":"Ongoing","tags":["Reincarnation,Comedy,Adventure,Isekai,Fantasy,Adaptation"],"nutshell":"After dying in a traffic accident, I find myself standing near an unfamiliar lake. My body won't move, I can't hear my voice, and when I try to shout in confusion, words that I never expected come out!\"Get one free with a winner.\"I-it seems I've turned into a vending machine...! I can only do what actual vending machines can. It's impossible to move by myself, and there's no way for me to have any meaningful conversation-how am I going to survive some fantasy world's dungeon like this?!\n(Source: Yen Press)"},{"name":" Kantai Collection -Kancolle- I Will Never Be The Little Mermaid (Doujinshi)","avatar":"https://mangadex.org/covers/9eab9b52-6b25-4fba-ab61-aa730a15988f/86bde923-d3cb-4d7a-8da3-bd6bb81b9e30.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Action,Romance,Military"],"nutshell":""},{"name":" Bofuri - Real Life or Game? (Doujinshi)","avatar":"https://mangadex.org/covers/9eadb43a-bd2a-4fe5-8bbb-47c462cb64b0/eacf8c41-ef56-4159-a8ed-03a8845f9088.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Virtual Reality,Video Games,Girls' Love,Slice of Life"],"nutshell":""},{"name":" Lunar Helios","avatar":"https://mangadex.org/covers/9ebc05b7-46d4-4619-ac62-59979179f849/eb68ace7-858a-4cfb-bb58-05ca590f998a.png.256.jpg","country":"Indonesian","stat":"7.97","status":"Completed","tags":["Action,Fantasy,Vampires"],"nutshell":"In the world of Lunar Helios, humans and vampires are at constant odds. One such vampire, Aelfric, meets twin vampire hunters but the hostility takes another turn. As an uneasy alliance between them begins, new journeys await them in a strange world!"},{"name":" Brilli","avatar":"https://mangadex.org/covers/9ebcf9e0-6532-47ea-a32b-54fb5a1bb44a/33a3f887-cfa6-4d2b-98a3-2e3b67c674ad.jpg.256.jpg","country":"Korean","stat":"7.88","status":"Hiatus","tags":["Animals,Long Strip,Romance,Boys' Love,Drama,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"The boy from Wolf Clan meets his brother whom he missed for such a long time while resting at countryside.\nUm garoto do clã encontro seu irmão perdido.\nOfficial English translation on Comico's Pocket Comics app"},{"name":" Haven","avatar":"https://mangadex.org/covers/9ebd454a-d1bf-4662-939a-a2bf573bb8ae/c43d2ee2-56c6-4509-9700-3976d5443eef.jpg.256.jpg","country":"Korean","stat":"8.01","status":"Ongoing","tags":["Psychological,Long Strip,Boys' Love,Web Comic,Full Color"],"nutshell":"Please be advised that this is Omegaverse.\nAfter their parents decided to re-marry, Minseong and Jian became brothers.\n8 years later, Minseong (26) works as a food stylist, and Jian (23), now works as a model.\nAfter being violently treated during his time at school, Minseong’s eyesight got worse, and due to this, manifested omega traits.\nWith Jian being abnormally obsessive over the vulnerable Minseong, the two of them start satisfying each other’s heat. After Minseong realizes that his brother’s behavior isn’t just him being cutely fussy and that there’s something wrong with their relationship, Minseong then tries to put some distance between the two of them.\nWhile their relationship starts to slowly become twisted, Minseong’s past uncovers itself, making the brothers’ relationship even more destructive."},{"name":" I Accidentally Provoked a Wealthy CEO","avatar":"https://mangadex.org/covers/9ebde017-a105-4f34-9b05-409ad42b1517/77fa3023-4248-4b9d-9a3d-9c37301b77a0.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.00","status":"Ongoing","tags":["Long Strip,Romance"],"nutshell":"Mo Yanran was forced into an arranged marriage with a CEO from a rich family. On her wedding night, she was filmed for a sex tape and made headlines the next day. Lei Haoming, the wealthy CEO, did everything in his power to make her life miserable and forced her to be his pet."},{"name":" Sweet and Salty","avatar":"https://mangadex.org/covers/9ec7113b-b88b-4ffa-898d-18272db3d79e/27278daf-d303-4b8e-aeb0-79da64b8d192.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Award Winning,Long Strip,Romance,Comedy,Drama,Web Comic,Slice of Life,Cooking,Adaptation,Full Color"],"nutshell":"A sweet and salty romantic comedy series about Ahn Chan-hee who can't eat at all and often vomits right after eating something, Dan Ah-young who tries to lose weight but is a glutton and is in a relationship with Team leader Jung Barum who has a habit of calculating calories.\n\nLinks:\n\nBefore Serialization"},{"name":" Mercenary Enrollment","avatar":"https://mangadex.org/covers/9ecd208c-c592-4462-9f57-4d7d4a9f956f/75e7fac6-c9f4-43ce-ae0e-cbf06f28f99b.jpg.256.jpg","country":"Korean","stat":"9.16","status":"Ongoing","tags":["Action,Long Strip,Crime,Adventure,Military,Drama,School Life,Delinquents,Web Comic,Full Color"],"nutshell":"Yu Ijin was the sole survivor of a plane crash when he was little. After becoming a mercenary to survive for 10 years, he returns to his family in his hometown.\n\nAt the age of eight, Ijin Yu lost his parents in a plane crash and became stranded in a foreign land, forced to become a child mercenary in order to stay alive. He returns home ten years later to be reunited with his family in Korea, where food and shelter are plenty and everything seems peaceful. But Ijin will soon learn that life as a teenager is a whole other feat of survival. With only one year of high school left, Ijin must master new tactics to maneuver his way around the schoolhouse battleground. Can he survive a year of high school? Or rather, will the school be able to survive him?\n\nOriginal Webtoon: Naver Series, Naver Webtoon\nOfficial Translations:\n\nEnglish\nChinese (Simplified) / 汉语\nChinese (Traditional) / 漢語\nFrench / Français\nGerman / Deutsch\nIndonesian / Bahasa Indonesia\nJapanese / 日本語\nSpanish / Español\nThai / ภาษาไทย"},{"name":" Luno","avatar":"https://mangadex.org/covers/9ece07b2-3d1d-4c2e-b9dd-fc0eb249f51d/32df3d97-d183-4897-bf22-ad4c7e1b93cf.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Fantasy,Supernatural,Tragedy"],"nutshell":"Tete is a boy in a small European-like town. Recently some odd people have moved into the town, including the young vagrant Geeta who lives under the bridge. He befriends her and learns about her tragic past. Geeta then asks him to temporarily keep a mysterious clock for her. Shortly afterwards a dangerous man appears, one of the very last survivors of a race with powers over life and death."},{"name":" Spirited Away by the Rain Woman Youkai","avatar":"https://mangadex.org/covers/9ed05684-d63b-4e87-9867-d01db9779641/a191612a-b84f-4d4d-8c68-fb313221db6b.jpg.256.jpg","country":"Japanese","stat":"8.85","status":"Ongoing","tags":["Drama,Web Comic,Slice of Life,Supernatural,Tragedy"],"nutshell":"The fearsome Rain Woman youkai finds a little boy to haunt, but finds in him more than what she bargained for: A little kernel in her heart."},{"name":" Crows Gaiden - Katagiri Ken Monogatari","avatar":"https://mangadex.org/covers/9ed3ecbc-b64e-4d26-b144-f118dd283769/40fc7d75-8626-46a4-850d-18abf5f64382.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Action,Comedy,School Life"],"nutshell":"One volume detailing the life of Katagiri Ken (from the Crows Zero movies) in the infamous Suzuran All-Boys High School."},{"name":" Touhou - A-V-P Alice vs. Patchouli (Doujinshi)","avatar":"https://mangadex.org/covers/9eda1202-95bc-40c2-b116-1ed33a02a1cd/644e903c-b759-463c-871d-c732e07dd24b.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Ongoing","tags":["Action,Comedy,Tragedy"],"nutshell":""},{"name":" Kimi janakya Dame na Dorei Shoujo","avatar":"https://mangadex.org/covers/9edbc41a-5c25-4f1a-b323-9c0c9552dc34/7caa8f5d-ddb2-4d67-801d-4fbe5f34df94.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Ongoing","tags":["Romance,Comedy,Magic,Fantasy"],"nutshell":"Daito's your average high-school kid. After getting home one day, he finds a strange girl sleeping on the floor—only to find out she's a slave from another world. He decides to take her in so she can start life anew as a normal girl, beginning their sweet-but-unusual life together as they navigate cultural barriers."},{"name":" Slayers Light•Magic","avatar":"https://mangadex.org/covers/9edece6b-def1-4e57-94f7-d90ec6ef130d/e8dcf5e6-de1e-4a0e-8654-716fc597d1f5.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Comedy,Adventure,Fantasy"],"nutshell":"In the distant future, mankind has advanced into an age of technological supremacy, where magic is a lost art only mentioned in fairy tales and nursery rhymes. Living in such a world is Light Inverse, a youth who dreams of sorcery…. but suddenly, his home is attacked by demons! With modern weaponry proven to be ineffective against the monsters, all hope seems to be lost…. Until Lina Inverse and Gourry Gabriev are suddenly transported to the future from a mysterious shrine in their time. Can Lina bring magic back to this land…!?"},{"name":" Look a Picture","avatar":"https://mangadex.org/covers/9edfccfa-082e-45f4-b02f-69ae5f0397f0/c81cb3cf-ec49-4181-8b76-ab796ada5538.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Completed","tags":["Official Colored,Long Strip,Romance,Comedy,School Life,Slice of Life,Full Color"],"nutshell":"Jisoo, who dreamed of becoming a fairytale illustrator since she was young, dropped out of school to achieve her dream and went to her grandmother's house, where she meets Dowon.\nDowon, who was worried about not having a dream, is interested in Jisoo who is trying hard to achieve hers.\n\"The more I try to catch my dreams, the more distant it becomes. When will the day I finally reach my dream come?\""},{"name":" London Vampire","avatar":"https://mangadex.org/covers/9ee06c68-7e96-4ef5-9128-68a7ce4748c1/3a614b07-9a9a-4cb5-b6ef-a4922d3091a5.jpg.256.jpg","country":"English","stat":"7.45","status":"Completed","tags":["Oneshot,Long Strip,User Created,Vampires"],"nutshell":"Jaime Winchester is a famous actor about to step into a life of hot girls and partying at one of England's most prestigious private schools, but when he is hit by a truck on his first day, he wakes up in a Gothic mansion with a mysterious girl sleeping on top of him."},{"name":" Kobayashi-san Chi no Maid Dragon Official Doujinshi Set","avatar":"https://mangadex.org/covers/9ee6a7de-d5ac-4f33-ab9b-7dfb5cb5ac02/4376bab5-9b06-4d4c-9643-aaa2d665ce20.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Ongoing","tags":["Loli,Action,Comedy,Adventure,Magic,Girls' Love,Drama,Fantasy,Monster Girls,Shota,Slice of Life,Supernatural"],"nutshell":"Collection of official doujinshi of Kobayashi-san Chi no Maid Dragon sold at Comiket."},{"name":" Kare ga Cafe ni Iru no nara","avatar":"https://mangadex.org/covers/9eeb828f-b64a-41fa-825e-adc16b8bc4e8/801318a8-4c56-453a-814f-5f1064246881.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,School Life"],"nutshell":"Aiko always dreams she could have a sweet love story. But all boys around her are like kids, so far from Aiko's ideal boy. To get a mature ideal man, Aiko is working part-time in a cafe which popular for handsome and cute guys!\nIncluding two other stories:\n♡ You Are My Vitamin\n♡ Shooting Star on the Café"},{"name":" Vinland Saga - Animalland Saga","avatar":"https://mangadex.org/covers/9eec6ba5-68a4-4b42-9bc1-8b7472f62ed5/b5d46c1c-3a6f-4e2e-9cfc-489941d17b1b.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Ongoing","tags":["Historical,Comedy"],"nutshell":"Animal parody of the manga Vinland Saga"},{"name":" Find the Waves","avatar":"https://mangadex.org/covers/9eed1988-5c5c-4a43-8b3d-047b2d962b3c/c7aa80f5-6761-441c-a04b-6230b7967ec3.jpg.256.jpg","country":"Korean","stat":"8.15","status":"Completed","tags":["Action,Long Strip,Romance,Comedy,Sports,Web Comic,Slice of Life,Full Color"],"nutshell":"Kang Pado is a boy who accompanies his father on their countryside farm; raising cattle, fruits, and vegetables for a living. At the same time, he is studying at the not-so-nearby high school which, travelled by land, is 10km away. However, Pado’s father unwittingly mentions to him a shortcut using the river, shortening the distance to only 3km. Being an obedient kid, he takes his father’s advice and swims every day back and forth to the school whenever he has classes. However, circumstances occur when, due to a lack of students in their high school, the administration shuts it down, leaving Kang Pado no choice but to go to Seoul, where his sister lives. There he will continue his high school studies and deal with what Seoul High School Life has to offer!"},{"name":" A Modest Man and a Macho Woman","avatar":"https://mangadex.org/covers/9ef38599-b45b-417a-a500-35d072b97b9f/7d8d26f2-170b-44dc-954b-c8fd7ef22b9b.png.256.jpg","country":"Korean","stat":"8.07","status":"Completed","tags":["Long Strip,Romance,Drama,Slice of Life"],"nutshell":"A man named Seha Song grew up hearing that he was feminine from a young age, while a woman named Bada Pi grew up being told that she was masculine since she was a child. These two, whose image is opposite their gender, have grown up anxious about the attention they receive. Upon the entering university, Song Seha and Pi Bada decide to live in a way that matches the gender that society expects them to be. They try to meet the standards of others.\nThis is a self-seeking, healing romance story about a feminine man, Song Seha and a manly woman, Pi Bada, who resist falling in line with the standards demanded by society."},{"name":" Love Live! - Nico And Maki Got Locked In The Bathroom (Doujinshi)","avatar":"https://mangadex.org/covers/9ef8ef5c-f23e-485d-b4d7-4c671e0b6440/a0b8d552-ac67-4df5-a483-b9f865634e97.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Comedy"],"nutshell":""},{"name":" Hush","avatar":"https://mangadex.org/covers/9ef96974-7693-487e-b7f2-22bd7ffd91f5/d0d1d9b0-fa2b-4999-bc88-d824d2cfa62d.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Boys' Love,Web Comic"],"nutshell":"It's the first day of the new school year and Juhyun… Well, he's not exactly enthused. In fact, the only things on his mind are girls. The girls at his school, to be specific. Jigoo, on the other hand, wakes up early and gets ready and stops by Juhyun's home on the way to school. And, as it turns out, Jigoo might not be as interested in girls as Juhyun is. Juhyun is about to find out that some secrets are hard to keep quiet. And sometimes, everyone needs a little help."},{"name":" Good Girlfriend","avatar":"https://mangadex.org/covers/9efbfa57-76f7-4690-a8f3-de9188beb335/0d974536-0eb7-47a0-b3c9-6e55580981ed.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Romance,Drama,Slice of Life"],"nutshell":"Famous writer Haesoo and travel essay writer Yeo-Wool have been dating for 12 years. Yeo-Wool, hidden in the shadow of Haesoo and the tag 'Park Haesoo's girlfriend', wants to stand out only with her own name. At the same time, an offer to appear on a TV show comes in. This is a golden opportunity for Yeo-Wool who wants to shine on her own. But there, an attractive younger man who approaches Yeo-Wool, appears..."},{"name":" My sweet chocolate","avatar":"https://mangadex.org/covers/9f0611ca-7e67-4d23-98ff-843aaf4cd079/8a89af59-f76e-4d38-a816-a1089cf77b8d.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Animals,Long Strip,Drama,Web Comic,Slice of Life,Full Color"],"nutshell":"16 year old Choco. A dog close to 80 years of age. The text that flew to my mother during the Christmas Eve overtime work, “Choco hurts a lot.” Choco, who always thought it was natural to be together, became old dog. The third So-jin who spent time now has to prepare for a breakup with Choco.\n(Google Translate)\n\nOfficial Japanese Translation"},{"name":" Nomenclature of the night","avatar":"https://mangadex.org/covers/9f082a4c-2a50-4859-ae0d-30a0bcf1cf9e/205416c6-f702-4a19-8c8a-52ced3e16fb3.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.03","status":"Ongoing","tags":["Thriller,Sci-Fi,Time Travel,Action,Martial Arts,Adventure,Isekai,Fantasy,Web Comic,Adaptation,Full Color,Tragedy"],"nutshell":"In the blue and purple neon, under the dense steel sky, the front end of the data torrent is the world after the technological revolution, and it is also the boundary between reality and illusion. Steel and body, past and future. Here, the outer world and the inner world coexist, and everything in front of you is like a wall of time. Darkness gradually shrouded. But you have to understand, my friend, that we cannot deal with darkness with tenderness, but with fire."},{"name":" My Aurora","avatar":"https://mangadex.org/covers/9f0c94d9-48b3-40ed-95d4-8d4205261198/ac0bc472-0639-4454-b26b-f2bad9b9f4bf.png.256.jpg","country":"Chinese (Simplified)","stat":"7.84","status":"Cancelled","tags":["Official Colored,Historical,Long Strip,Romance,Magic,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"The ‘Sleeping Beauty’ who falls asleep during the day is not only a princess, but also an un-aging and immortal witch. The witch, Aurora, has been punished by God and will fall asleep during the day, to wake up only when night falls. In order to break the curse, she and a young man collect light. As the collected light increases, the reasons for Aurora's punishment by God are gradually revealed."},{"name":" Aka no Washupiel","avatar":"https://mangadex.org/covers/9f0d9c1c-23c6-48f3-8f2a-9862d363f768/c63a5904-9c75-405a-a5fd-32c0361dd6b1.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Historical,Boys' Love,Military,Drama"],"nutshell":"NOTE : was released as a stand alone in 1993 by Biblos, and ran in BexBoy Magazine. When Suguro moved to publisher Taiyou Tosho in 1999, she continued the story in their Craft line, and closed it up as part of the second Aka no Washupiel in 2000."},{"name":" How to Tame a Wild Lion","avatar":"https://mangadex.org/covers/9f1c7055-d172-4689-8795-f69eedd7c734/fb1ff6f1-d1f0-4002-a94c-a37740aef9e4.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.94","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Web Comic,Music,Full Color"],"nutshell":"A main vocalist with the temper of a lion x a cheerful and straightforward bassist. Who knew that the band couple I fangirl about is actually real! In order to understand and save the band that is on the verge of getting disbanded, he found a child prodigy star, who had to secretly leave the entertainment industry because of a car accident. But, this gangster-like youth, who became a \"backside singer\" at a bar, how should I tame him? Should I chase after my dream or choose my husband? I want them both!"},{"name":" Onmyoji","avatar":"https://mangadex.org/covers/9f1fb707-872a-4824-b12b-27a2894db9ed/4b438908-082e-43a1-bbef-c514aec86ed0.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Award Winning,Historical,Demons,Drama,Supernatural,Adaptation"],"nutshell":"Must we believe in ancient legends? In mythical tales and characters?\nAs a child, Abe-no-Seimei in the company of his master Kamo Tadayuki walks his first steps on the paths frequented by evil spirits and angry souls of darkness with a thousand spells. Seimei, who can feel an evil entity approaching before anyone else, is taken in by Tadayuki, who sees in him an exceptional talent for the practices of Yin and Yang.\nFrom that day on, Seimei was made his disciple and was taught all his secrets."},{"name":" Heaven's Souls","avatar":"https://mangadex.org/covers/9f2050fa-5095-44e9-af70-c90ba9db7d37/96bfb8a4-2290-4ae4-808b-250dfcb24b6d.jpg.256.jpg","country":"Korean","stat":"7.65","status":"Ongoing","tags":["Action,Long Strip,Fantasy"],"nutshell":"The world has plunged into a new threat. Alien creatures are wreaking havoc and there is only one team who can stop them. This is the story of valiant heroines fighting against these alien foes. Want to know more?Stay tuned, get ready, and watch them battle on!"}]