[{"name":" The Return of the Sect Leader","avatar":"https://mangadex.org/covers/8b11d0c6-f51d-456c-8531-ee3a2fb9be4a/3487e1a2-05ea-4467-944f-876d91a94bb3.png.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Ongoing","tags":["Official Colored,Long Strip,Full Color"],"nutshell":"The Demonic Sect Leader Tang Ke, who lived in seclusion on the streets ever since his martial arts went astray, returned after his son went missing. This time, from someone who failed the Imperial Exams and sold pxxn as a living, once forgotten by others for many years, shall slowly return to being the demon king that was once feared by everyone! Tell those who respected me, feared me, dreaded me, that the Sect leader is back!"},{"name":" Kerberos Panzer Cop","avatar":"https://mangadex.org/covers/8b15b6f5-68ce-4d61-9a14-ba9090f5b69b/41433048-976d-4b20-84db-fbe87b31013c.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Thriller,Historical,Action,Psychological,Crime,Survival,Mafia,Adventure,Office Workers,Post-Apocalyptic,Military,Philosophical,Drama,Police,Slice of Life,Tragedy"],"nutshell":"Years after the country's defeat and occupation period, Japan is still recovering.\nAlthough they are on the road back to industrialization and prosperity,\nstrong handed economic and political policies have turned many areas into dilapidated slums.\nAnarchists and anti-government student protesters have taken up arms, stirring up violent social riots.\nIn order to combat this growing threat to their fraudulent power the Japanese government has nationalized\na division of the police, creating the Capital Police Organization (CAPO).\nIt consists of hard-trained panzer troopers carrying heavy firearms and wearing special armor suits called Protect Gear:\nthis specialized unit is feared by anti-government groups, criminals and civilians alike.\nFirst adapted into a live action by Mamoru Oshii in 1991.\nLoosely adapted into the anime movie Jin-Roh: The Wolf Brigade in 1999, also written by Mamoru Oshii."},{"name":" The Female CEO's Close-Quarter Mad Soldier","avatar":"https://mangadex.org/covers/8b165e99-1c9a-4a68-aa6a-abc50b5927e0/d979c5ba-23c0-42a4-ac26-3a25d3380f79.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.48","status":"Ongoing","tags":["Action,Long Strip,Romance,Comedy,Martial Arts,Web Comic,Full Color"],"nutshell":"He's the best special forces soldier ever. After being forced to retire from the military, he came to the Zhonghai city and started a reign of terror! There's another super legend in the city!"},{"name":" Akahime Ranshin","avatar":"https://mangadex.org/covers/8b181573-18e4-459e-ac8d-72a1dd097077/3f905ad2-0e5e-4c75-bb07-f72d9e21c1ec.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"Akagi Erika is a classical literature teacher at a high school. One day, she scolds a male student, Usami Rento, for wearing perfume to school. However, she later finds out that the sweet scent isn’t from perfume but from incense that’s soaked into the kimono he wears, for Usami Rento is actually a famous kabuki actor playing female roles. Erika watches a performance of Usami’s out of curiosity, and finds herself gradually drawn to this strange student…"},{"name":" Otonari-san Game","avatar":"https://mangadex.org/covers/8b19ee44-ea3b-4b14-917c-b665fdb14d54/6dd8b596-59a6-4378-b212-53e6a179e67d.jpg.256.jpg","country":"Japanese","stat":"7.07","status":"Cancelled","tags":["Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"Tsuruoka Maiko and Sasano Keisuke are childhood friends and just entered high school. Their families are neighbors and have been living next to each other for well over a decade. They’ve been getting along well ever since they’ve met, but recently there seems to be a divide between them. What could be the reason? (From: MU)\n- Status : Cancelled at vol 1, but the author made a vol 2 of it on his own without a publisher."},{"name":" New Danganronpa V3 - Never-Ending, Never Loving (Doujinshi)","avatar":"https://mangadex.org/covers/8b1ca3f0-6194-48db-a97a-d82142f4aa9c/ed15288f-e428-48d6-bf7a-56c83c86fd65.jpg.256.jpg","country":"Japanese","stat":"8.31","status":"Completed","tags":["Oneshot,Boys' Love,Slice of Life,Tragedy"],"nutshell":"After the main story, Saihara and Ouma meet again.\nWarning: Contains spoilers for Danganronpa V3.\nPairing: Ouma Kokichi x Saihara Shuuichi"},{"name":" Dragon and Chameleon","avatar":"https://mangadex.org/covers/8b1d7ca0-6b34-415c-96c8-f3ffd460e932/b7b25a4b-0062-4e91-a2b5-9ec2f75b0e22.png.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Action,Drama,Supernatural"],"nutshell":""},{"name":" Kamunabi","avatar":"https://mangadex.org/covers/8b1d7f2f-2c4c-4047-a394-6d5cbc56271a/e2a41d9d-8319-4867-9579-6ffbfd517650.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Historical,Mystery"],"nutshell":"A series of short stories detailing the exploits of Dr Imibe Kana, a researcher on Japanese mythology and religion, as she travels around the country becoming involved in various occurrences centred around ancient traditions and folklore."},{"name":" Sanada Kenryu","avatar":"https://mangadex.org/covers/8b1d9a93-b2ae-4612-8c52-02984ca94239/09583605-a867-489a-bf83-7c3779e1ae31.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Action,Ninja,Martial Arts,Adventure"],"nutshell":""},{"name":" Mosaren Bugi","avatar":"https://mangadex.org/covers/8b1da6a0-5136-4531-8e66-acbf293199a9/0408b9c6-cf80-43b5-bc12-ead25659d1f0.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Romance,Mafia,Drama"],"nutshell":""},{"name":" Taciturn Little Sister","avatar":"https://mangadex.org/covers/8b20a2dd-c611-4ed2-8b0c-6fa8a657180f/79ad8cb7-f143-4f9d-b5ce-0b485f08eb39.png.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Web Comic,Slice of Life"],"nutshell":"Little sister wants to snuggle. Don't let her face tell you otherwise.\n Artist’s Pixiv\n Artist’s Twitter"},{"name":" Senyuu. - Foyfoy・Rudolf-hen","avatar":"https://mangadex.org/covers/8b2ae8c9-6eba-4128-8a63-565ea177d551/8cda20bb-d225-467f-947b-1c4319f9ad7c.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot,Comedy,Adventure"],"nutshell":"Another Spinoff of Senyuu focusing on Hero 14, Foyfoy Dran, and his royal Soldier, Rudolf I. Athena. This story takes place during pre-series. Foyfoy and Rudolf are on a journey to subdue the Demon Lord. Foyfoy simply cares about the reward… but is that really the only thing he cares about?"},{"name":" Sarakiel","avatar":"https://mangadex.org/covers/8b2cc273-9046-44bb-ac9f-92feee95201f/83e7331c-b5dd-4933-9743-48e887f6d1cf.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Crime,Adventure,Drama,Fantasy,Monster Girls"],"nutshell":"The story follows a girl on a journey with two companions. Her mission is to seal her innate power, the \"power to lead the world down the path of destruction.\" Unfortunately, there are people who stand in her way and attempt to use her power."},{"name":" Yasashiku Shinai de","avatar":"https://mangadex.org/covers/8b325c2e-4683-4af3-8e5e-cfb355753418/9590a95a-05a9-45cd-a80c-5c600b773767.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,Drama,School Life,Slice of Life"],"nutshell":""},{"name":" Onakura no Yuurei-san","avatar":"https://mangadex.org/covers/8b330376-0993-48af-bf67-6712e2d475a8/764df1aa-0238-4624-abb1-685ae6af2657.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Comedy,School Life,Supernatural"],"nutshell":"A mysterious triangular relationship between Hasami Youichi, who has a secret love for Miss Ghost (Yuurei-san), and the public morals chairperson Kagesaki Kisara, who has a secret herself. [Back cover text, somewhat expanded.]"},{"name":" The 31st Consort","avatar":"https://mangadex.org/covers/8b36689e-955b-4e8a-b480-124b76912da8/ff2b252d-dd01-4837-a9a9-74ca7ba63ba1.jpg.256.jpg","country":"Japanese","stat":"8.33","status":"Ongoing","tags":["Romance,Comedy,Fantasy,Adaptation"],"nutshell":"She was summoned for the position of the misfortunate consort? Feria is the younger sister of a feudal lord from a remote region living her life to the fullest until suddenly, one day, she was told that she had been chosen as the 31st consort candidate of the king. However, even if she’s called a consort, the 31st position is a position no one wants since it’s the most misfortunate one. The king can only visit his consorts by the order they were appointed and since the 31st only happens once in three months… But Feria who doesn’t care about any of that started cultivating the fields in the harem….? What about your love with King Macron!?"},{"name":" Isekai de Item Collector","avatar":"https://mangadex.org/covers/8b397303-76b3-45d9-8a52-a0003e09fcdb/037bc7db-acd2-4e24-b547-24ba095fef44.jpg.256.jpg","country":"Japanese","stat":"6.44","status":"Completed","tags":["Reincarnation,Action,Romance,Comedy,Adventure,Isekai,Fantasy,Adaptation"],"nutshell":"Kagami Kouma loved to collect different kinds of objects and collections ever since he was a kid. One day, he was transported to another world by a girl who claims to be the daughter of the demon lord Lucifer! She needs his talent of collecting things to help her collect the 72 treasures in order to become as powerful as her father. What danger will Kouma face in his journey?"},{"name":" Shin Sakura Tsuushin","avatar":"https://mangadex.org/covers/8b3d1fa8-84ac-44e4-92f8-8708788b5f69/8b8a8b28-f220-433c-bc86-2c01fe33edf6.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Comedy"],"nutshell":""},{"name":" Yuri Between A Werewolf and A High School Girl.","avatar":"https://mangadex.org/covers/8b3d9e57-b3b5-4a04-a8c1-a0dbaf0febe5/d7cd7e16-4d3e-407c-80fe-6d7d44680875.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Girls' Love,School Life,Monster Girls"],"nutshell":"Author’s Pixiv\n Author’s Twitter"},{"name":" Pigeonhole Fantasia","avatar":"https://mangadex.org/covers/8b3ddfef-2d77-408c-9e63-750a494ba09f/f0c3b63b-0941-4c5a-bc9d-603f565eea16.jpg.256.jpg","country":"Korean","stat":"8.04","status":"Completed","tags":["Comedy,School Life,Slice of Life"],"nutshell":"Wony, a wolf, is just a regular Korean guy in his twenties. He’s got a less-than-average TOEFL score and has finished his two years of mandatory military service, but he has no luck with women and doesn’t like the way society works, though he isn’t able to change it. Nevertheless, he and his friend Gom (Bear) always find ways to poke fun at the world.\nSeason 2 English"},{"name":" Juicy Cider","avatar":"https://mangadex.org/covers/8b485d0a-6d81-424f-b3c2-fc570e82a66f/50a09fb2-e308-40ce-aad3-27dc6428db11.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Comedy,Boys' Love,School Life"],"nutshell":"High-schooler Takayuki is considered a cool elite; all his peers are sure his thoughts are about nothing but serious, important subjects. However, they're mostly just wild fantasies about his childhood friend, the cute but simple Ken. Using all his cunning and wiles, Takayuki's determined to win over Ken."},{"name":" Gal Kadou","avatar":"https://mangadex.org/covers/8b497f06-30d5-4cb3-a9ea-158ce9693057/86ca5c68-4e78-44fa-8b05-e4b355aeffd5.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance"],"nutshell":"Fifteen-year-old Kuzuhara Tsubomi's family is a hundred years old and counting, and still a prestigious family. Tsubomi is not only the only heir to the Kuzuhara family, but she is also a delinquent kogal who won't listen to her father. For that reason, her father hired her a tutor in order to make her a better heiress."},{"name":" Tittle Tattle","avatar":"https://mangadex.org/covers/8b4d653b-dc14-4ae0-83b2-f2cf6ca6d2a6/c242f396-0575-48cd-8cd0-bc0e60c3bcff.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Oneshot,Boys' Love"],"nutshell":"Contains side stories for Mizuiro to Pinku, Sore kara Daidai and Oboreru Koi no Itade."},{"name":" Sister Blood","avatar":"https://mangadex.org/covers/8b5e43d2-adc3-483d-bd36-453e472f11b4/125fe0fb-b5aa-412f-bd06-b6d8758d8887.jpg.256.jpg","country":"Japanese","stat":"7.58","status":"Completed","tags":["Oneshot,Action,Romance,Incest,Harem,Drama,Horror,Vampires,Mystery"],"nutshell":"Since they were kids, Saya has always looked up to her kind, gentle older brother, Shou. He always looked after her, put her needs first, they spent all of their time together, and ultimately he was the only one who was ever there for her. Even without parents, the two of them lived happily, enjoying their peaceful lives together.\nThat is, until Saya was bitten.\nWhen bitten by a pure-blooded vampire, the one who was bitten may themself become a vampire, as was the case with Saya. She can't leave the house out of fear that she will feast, and her brother must lock her away to protect her from vampire hunters, such as himself. The only solace she has is being taken care of by her beloved older brother, whom she knows has eyes only for her, and vice-versa.\nShou, on the other hand, can't stand to see his sister in such a state, locked away in their own home and forced into solitude. And so he has made it his goal to kill the pure-blooded vampire who bit his sister, believing that in doing so he may restore his sister to what she once was. He becomes an expert at hunting vampires, driven by his sole desire to make his sister human again.\nBut Shou has another reason for wanting to get out of the house. Since she was bitten, Saya has become increasingly obsessed and forceful. She can't stand being mere siblings anymore, and with her actions becoming more forward and deliberate, her brother himself is having a hard time holding back.\nWill Shou give in? Or will he kill the pure-blooded vampire first? And even if he does, will that be enough to stop the romance forming between the two of them?"},{"name":" The Legend of Zelda: Breath of the Wild -I Know About a Store in Gerudo Town that Sells a White Outfit","avatar":"https://mangadex.org/covers/8b658eba-fdce-43ed-9d1b-daf05a000e48/cd9010fb-5193-4b83-9f0d-94ed9f25688e.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Official Colored,Romance,Video Games,Crossdressing,Fantasy,Web Comic,Slice of Life"],"nutshell":""},{"name":" Watashi no Kare wa Bijo de Yajuu","avatar":"https://mangadex.org/covers/8b6b12b8-5802-4205-a515-4d85ae645c23/8597b83f-104f-46a9-8140-4d03802dd2e2.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Oneshot,Romance,Comedy,Crossdressing,Drama"],"nutshell":"狙っているイケメンにデートに誘われた読モ・一帆。勝負下着で気合いを入れて向かった待ち合わせ場所に現れたのは女装姿の彼で!?"},{"name":" Yuuwaku - Sakaraenai Yokubou","avatar":"https://mangadex.org/covers/8b7550e6-0cb5-427c-b414-d88be0cbfde3/cf682296-c9ad-4d6b-abcb-d80e66c2b2d0.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Romance,Anthology,Drama"],"nutshell":"Teach Me More by SHINJO Mayu\nOn her way home from school, Hina is attacked by a pervert on the train! She's too embarrassed to raise her voice, but - she's saved by Kyousuke!? Kyousuke is the hottest guy around, and there's not a single girl who doesn't want him. He pulls Hina off the train, and then… he does more things to Hina than the pervert on the train would have!\n(Also included in Motto Oshiete)\n\n\nChase 4Me by IBUKI Kaede\nHana's mother and father died when she was five, and ten years later it's her four incredibly over-protective and super-possessive brothers who take care of her. Today, she's beginning her first day of high school at an all girls school… but when she accidentally walks into the all boys school next door, she's assaulted by males! Then Hana falls in love at first sight with the boy who saves her - Ren - and begs him to take her on a date. Ren can can rescue Hana from the boys in his school… but is he any match for Hana's brothers?\n\n\nThe Frontline of Summer! A First Date Victory-or-Defeat Charge by FUJIWARA Natsu\nMegumi is 16 years old. Today is her first date with her crush, Satou-kun, and… the extra-long title says it all about this extra-short story!\n\n\nRadical Love Revolution by SARA Mahiro\nRiko and Kippei have been friends since they were kids. They're so close that they beat up bullies together, and now they've handcuffed themselves to each other! They've always looked for excuses to fight… but now Riko is looking for an excuse to love. So the question becomes: can Kippei survive the romantic advances of a girl who expresses herself through violence?\n\n\nThe Desires of My Right Hand, the Beating of My Heart by AYUKAWA Mio\nTouko is a mild-mannered high school girl with an unspoken crush on Kuga-kun… until her friend hypnotizes her, and Touko's right hand takes on a perverted mind of its own! It gropes Kuga-kun, and Touko no longer has any control over it…!?\n\n\nSepia-colored Secret Room by HARUSHIRO Amami\nThird grader Chiko's friends were constantly being bullied by Rei-kun, a boy who glared at them with beautiful sepia-colored eyes, because he didn't want anyone hanging around Chiko but him. They took revenge on him by locking him in a haunted house, and Chiko never saw him again… Seven years later, the new transfer student from America is… Rei!? He's become rich and is twice as sadistic as before, and he's got a score to settle with Chiko's friends - and Chiko herself."},{"name":" Pretty Wimps","avatar":"https://mangadex.org/covers/8b775247-1aa4-4a60-a268-36c3ae98d4ff/f1462470-cd46-4029-ae15-a7408308beb3.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"Yukihira has been in love with his teacher, Abe Hiroshi, for a long time and wants to confess before graduation, but doesn't know how to go about it. Confused, he ends up stalking Abe and discovers his biggest secret."},{"name":" Mother, I'm Sorry","avatar":"https://mangadex.org/covers/8b7e1f44-ed31-4b97-bf64-363d0b986975/0a49ec4d-b1cc-4ef2-96c8-cb6a7dedcf42.jpg.256.jpg","country":"Korean","stat":"8.40","status":"Ongoing","tags":["Long Strip,Comedy,Drama,Fantasy,Web Comic,Slice of Life,Supernatural,Full Color"],"nutshell":"Gong Hyochan's world was turned upside down when he finally learned about his mother's terminal diagnosis. After all, they had no one else but each other in this whole world. He had always taken his mother's love for granted, but it was now too late to make amends. Or was it? A mysterious man approached him on his mother's bedside, offering to give his mother a new life at the cost of his own lifespan. The desperate Hyochan made the deal and 50 year-old Yeon Geum-ok was given a second chance in life. The catch? She was now younger than her own son!"},{"name":" Yuuutsu-kun to Succubus-san","avatar":"https://mangadex.org/covers/8b7e5dcb-4ea1-46d5-99e3-805e2e33088c/d2e3b73d-592d-4efa-acb5-0ce535b33d69.jpg.256.jpg","country":"Japanese","stat":"8.64","status":"Ongoing","tags":["Demons,Romance,Comedy,4-Koma,Drama,Slice of Life,Supernatural"],"nutshell":"A man in the middle of a mental breakdown caused by overwork becomes the chosen target of a young succubus. In his exhausted state, he can't provide the \"food\" she needs, so she takes it upon herself to treat his depression to restore his energy so she can feed.\nLinks:\nAuthor's Twitter\nAuthor's Fanbox"},{"name":" Touhou - Omoito (Doujinshi)","avatar":"https://mangadex.org/covers/8b81e8a2-b0dc-4a78-af1a-8af1adfd5fbc/f5a15ab9-46e6-45d8-ab1a-520e0de18b9b.png.256.jpg","country":"Japanese","stat":"8.55","status":"Completed","tags":["Drama,Fantasy"],"nutshell":"A comic focus on Alice’s less famous doll Hourai. She has gained consciousness."},{"name":" Sono Rokudenashi ni You ga Aru","avatar":"https://mangadex.org/covers/8b8d20cf-c58a-4da4-a9ad-6017b9092c08/9f56e94a-f9d7-4e52-a431-f3c472cd849c.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Comedy,Slice of Life"],"nutshell":"What will happened when Yuzu meets the boy who helped her out ten years ago in middle school? What will happened between the relationship between her and Shinra, her boyfriend?"}]