[{"name":" Hitotsu Yane no Shita no Kedamono","avatar":"https://mangadex.org/covers/3a0ef334-7299-40bd-ba59-00d9b2ab2e6e/0d97463a-ffaa-4bed-9f94-9879976cc9c1.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Comedy,Boys' Love"],"nutshell":"Daigo is starting college in the spring, joining his twin cousins, Jin and Shin. Daigo always had a crush on Jin since he was a child, but Shin was always the one who couldn’t leave him alone. Shin finds out that Daigo has a crush on Jin, and aggressively presses Shin about it, telling him to pick him instead of Jin. Since Shin and Jin are identical, Daigo gets confused. His heart starts beating faster as he looks into Shin’s eyes and…?!\nThis series has been published in Japan since 2012 which Japanese title name is \"Hitotsu Yane no Shita no Kedamono\"\nAvailable in English:\nAmazon Kindle\nBook Walker\nComixology\nGoogle Play\nKobo\nNOOK"},{"name":" Heart no Kuni no Alice - White X Silver (Anthology)","avatar":"https://mangadex.org/covers/3a120007-2f93-47d1-81f0-6d37257152bf/1503183f-b15a-436f-9fdc-5982208e7b61.png.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Comedy,Anthology,Drama,Fantasy"],"nutshell":"The White X Silver Anthology is a collection of standalone stories for multiple pairings featuring various Wonderland characters from the Heart no Kuni no Alice series."},{"name":" Heart of a Dragon","avatar":"https://mangadex.org/covers/3a147cb2-12cd-4e30-973f-dc880549abce/4993d7fe-b688-4e72-81d8-fe8994051964.jpg.256.jpg","country":"Korean","stat":"7.94","status":"Completed","tags":["Action,Long Strip,Comedy,Adventure,Fantasy,Web Comic,Full Color"],"nutshell":"It's been 70 years since the war between the dragons and humans ended. One day, a wounded dragon appeared in front of the human girl Koon… This is a tale of travel with dragons!\n\nOriginal Webcomic"},{"name":" Oishiku Meshiagaremasu","avatar":"https://mangadex.org/covers/3a15baa7-2f1b-4737-ab8c-c499ba2212fb/ff0a86cf-e14a-4b2d-89c7-59d67df7a69e.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Oneshot,Boys' Love,Slice of Life"],"nutshell":"Yoshimi, who has a strong attachment to food, meets the resourceful lunch box boy, Endou. As he is being fed, a strange desire began to grow…"},{"name":" Kimi to Tsugai ni Narenai Riyuu","avatar":"https://mangadex.org/covers/3a16a812-28bd-4258-8cb9-60c93686234b/6198aa89-5fe0-4f2a-98a3-c3da902a3210.jpg.256.jpg","country":"Japanese","stat":"7.59","status":"Completed","tags":["Boys' Love,Drama,School Life"],"nutshell":"There was never a time when they didn't like each other - Minato (Omega) and Jin (Alpha) have sworn to each other to become a \"pair\". However, when Minato was supposed to go into heat, the doctor reveals to him that the chance of him getting pregnant are close to zero... Minato is shocked that is seems like he's unable to bear a child! After all of this he separates from Jin and they drift apart...\nThis Manga contains 15 years of love between an Alpha who has made a promise to mate, and his childhood Omega friend who's somehow infertile."},{"name":" Abarenbou Kareshi","avatar":"https://mangadex.org/covers/3a178111-12a9-4ba9-9182-ddd6fe189bef/32ef293f-1cad-4202-b0c7-340aa991e153.jpg.256.jpg","country":"Japanese","stat":"7.68","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"1-2.5: ♥ Boyfriend\nNaoto is Hajime's childhood friend. Naoto may look cute but then again, his attitude gets on everyone's nerves. Even though Naoto's like that, Hajime still has his eyes on him. The problem is, Naoto hates homosexuals – so much that he wishes they will become extinct and rot in hell!\n3-3.5: All About My Brother\nShinji has always loved his younger brother, Haruki, more than any older brother should. Yet when he receives an unexpected warning letter demanding payment on a delinquent loan, he is left speechless. With everything Haruki could ever ask for provided by loving parents, he demands to know what could it be that would cause Haruki to be so greedy and irresponsible. Can Shinji really handle the truth behind Haruki's unusually selfish actions? Will he give up on Haruki altogether?\n4-5.5: Piano Lesson\nAfter his parents' divorce, Hara Shuuji left Tokyo to live with his mother and attend the local school. With hopes of starting a new and peaceful school life Shuuji feels at ease when his first day starts out well. That is, until a problem arises – a problem named Yoshie Kennichi, who carries the label of a \"delinquent\" with pride. Shuuji's first impression of Yoshie isn't good, but what's worse is that his ideals for a peaceful school life are ruined when Yoshie suddenly recognizes him! Shuuji, a new student, has no idea how Yoshie can possibly know him and he frantically wonders: what in the world is going on!?"},{"name":" What's Under the Bed","avatar":"https://mangadex.org/covers/3a1bafef-8615-4352-9d18-10b4ea9a9eb6/2b3278dd-3764-4c65-b123-a8ac47e55c57.png.256.jpg","country":"Chinese (Simplified)","stat":"8.00","status":"Completed","tags":["Oneshot,Ghosts,Long Strip,Comedy,Horror,Web Comic,Supernatural,Full Color"],"nutshell":"A young boy moves into a new house. But there's something hiding under his bed."},{"name":" Trans Star","avatar":"https://mangadex.org/covers/3a1d1c65-193e-4dbe-be4d-2fb34bf7fab1/bf7df8a3-43e5-4b67-940b-167cb51a34bf.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Oneshot,Genderswap,Romance,Girls' Love,School Life"],"nutshell":"The story of a girl who decided to finally confess to the boy she has a crush on after a vacation. Only to find out that he caught the \"TS disease\" and turned into a girl."},{"name":" Otome Historic","avatar":"https://mangadex.org/covers/3a208580-dc19-401c-8ee3-18cc64cfb39c/46f54d68-51ce-4ccd-a7a2-1a1919d98937.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,School Life"],"nutshell":"Touko Isshiki, a female high school student had been active in the Table Tennis Club lead by her favorite teacher Katakura-sensei. However, he decided to stop managing the club and instead became advisor for the History Study Group. After losing her last possible tournament, Touko decides to follow her beloved Sensei and join the study group – only to find out that their way to study history is kind of special."},{"name":" Musashi No. 9","avatar":"https://mangadex.org/covers/3a26a09a-73c4-4b75-9972-33d0c1fa9f34/0f714336-4f1b-4890-958c-a7d196202f69.png.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Action,Romance,Adventure,Crossdressing,Drama,Medical,School Life,Slice of Life"],"nutshell":"Exotic. Smart. Lethal. Musashi #9 doesn't live the life of a normal teenager. Hers is full of intrigue, violence, and death.\nSome people want to change the world. This sixteen year-old girl can. Deep ideological, religious, and social differences drive the world closer to destruction, and the innocent masses suffer while politicians huddle in safety.\nOne ultra-secret organization is committed to preserving world peace, and their top agent goes by the code name Musashi #9. This agent battles terrorists and extremists, while bringing hope to the people she saves. The world may be a dangerous place, but it's a whole lot safer with Musashi #9 in it.\nOfficial Chinese"},{"name":" Musunde Hiraite","avatar":"https://mangadex.org/covers/3a2a3995-6a5e-4872-baff-a3cc87cac39a/f714d38b-f3b5-4c0c-b6f7-a4bfd101022d.jpg.256.jpg","country":"Japanese","stat":"8.23","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"School life never fails to be an alluring theme to the reader. Even more so if there's romance involved. Musunde Hiraite chooses to take a quite innovative path in the description of high school romance, as it doesn't simply focus on a single character's pubescent worries, but rather has a school-wide purview."},{"name":" Shine Post","avatar":"https://mangadex.org/covers/3a2ac3ce-24ca-46e0-82f7-5408774466e0/09cdb482-e678-4315-8361-d571842cda39.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Ongoing","tags":["Slice of Life,Adaptation,Music"],"nutshell":"The idol unit \"TINGS\" has big dreams, but only small achievements, and is not very popular. The best manager in the world was supposed to be their savior, but... \"I'm not interested in being your manager.\" The man who shows up is Naose Hinaki, a man with no motivation. However, he has a special power...? This is a story of you and the girls shining brightly to become \"absolute idols.\" The best idol entertainment begins here!"},{"name":" Fate/stay night - Lovely Days (Doujinshi)","avatar":"https://mangadex.org/covers/3a335a5e-63c1-42bf-85b5-026866739174/00c7ea00-b09d-4ff9-adeb-b280451324b6.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Comedy"],"nutshell":"Rin reduces Saber's size \"to save energy\" much to her and Shirou's delight, but Taiga gets in the way. Hilarity ensues."},{"name":" Fantasista","avatar":"https://mangadex.org/covers/3a38dfab-363a-4ef7-9281-0290e42cafa7/b937204d-b150-41f8-9619-7805d49ecf80.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Sports,Drama,School Life,Slice of Life"],"nutshell":"Teppei Sakamoto is a boy living in the countryside. He loves soccer, and all his soccer skills were taught to him by his sister. Finally, his sister wants him to join the Mizumoto High School soccer team. Teppei's turn in life has come!! How will this soccer newbie fare in his new environment?"},{"name":" 100 Nichigo ni Kuufuku de Taore Maid ni Naru Onna no Ko","avatar":"https://mangadex.org/covers/3a3927d4-be93-4b05-9336-ca9d1a0e4cf8/95c13887-f3b8-4149-b83c-f64fd0fb72a8.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Completed","tags":["Comedy,Web Comic,Slice of Life,Full Color"],"nutshell":""},{"name":" Boku no Naka ni Kimi ga Inai","avatar":"https://mangadex.org/covers/3a3ca392-9bf5-4553-8f60-856a68f8687a/d15bf5cb-33fa-40b2-bb8e-2ab322e71507.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"[Doting medical college student x amnesiac college student]\nSubaru, a college student, loses only part of his memory in an accident. It is a memory of \"living together\" with a high school classmate, Soji. At that time, he was sure he hadn't talked to the guy who's cool and popular, unlike himself. Subaru who was discharged from the hospital, started living together, and learned about Soji again. From the surprisingly caring and anxious man, he realised that he was being looked at with a kind gaze he had never seen before…"},{"name":" Dragon Quest: The Great Adventure of Dai","avatar":"https://mangadex.org/covers/3a3cfc32-357e-4b50-a660-5ce4b58dfcbc/5d20bf27-eb44-4191-82b5-cab5631625b7.jpg.256.jpg","country":"Japanese","stat":"8.66","status":"Completed","tags":["Monsters,Action,Demons,Comedy,Adventure,Magic,Drama,Fantasy,Supernatural"],"nutshell":"\"Long ago there was a brave swordsman known simply as 'the hero'. People back then had been suffering under the rule of the great demon lord. The hero and his companions challenged the devil king and, after a great battle, emerged victorious… The demon lord had fallen!\nThe monsters who were under the demon's influence were freed and setled on an isolated island and, with no humans around to stir the monsters, it became a peaceful place where everyone could live together.\"\nOn a remote island on the southern seas lives Dai, a shipwrecked boy adopted by Brass, a lump wizard monster. Dai dreams of becoming a great hero but after years without human contact, one day a ship arrives to the island. This is the start of Dai's adventures…\nNote:\nVolume count based on the bunkoban."},{"name":" Bikkuri Suru Hodo Doji na Koi","avatar":"https://mangadex.org/covers/3a3daf06-1aae-42b8-af13-316535a753b5/ef379a42-ea7d-4dff-951e-a3e149e64312.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Comedy,Boys' Love,School Life"],"nutshell":"~Невероятно неуклюжая любовь~\nНао и Тому - друзья детства. Нао всегда присматривал за неуклюжим и неопрятным болваном Тому: завязывал галстук, застегивал пуговки и поправлял волосы. Но вот, Тому внезапно признается ему в своих чувствах. Нао, будучи в глубоком культурном шоке, может вымолвить на это лишь: «Но мы ведь оба парни!» Что же ждёт нас впереди? Как будут развиваться отношения Нао и неуклюжего недоразумения по имени Тому?\n~Пузырьки от содовой~\nДва студента колледжа: Симидзу Микио и Савамура Сота уже пару месяцев вместе снимают квартирку, и всё бы ничего, если бы не подозрения Микио о нежных чувствах, что питает к нему Сота. Его добродушные провокации могут закончится только одним… Чем? Давайте почитаем…"},{"name":" The Villainous Violet","avatar":"https://mangadex.org/covers/3a436b85-37f8-423a-8302-42318117a120/697e14dd-aa32-4143-b64f-d0c29c89ba44.jpg.256.jpg","country":"Korean","stat":"7.38","status":"Completed","tags":["Reincarnation,Historical,Long Strip,Romance,Reverse Harem,Isekai,Drama,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"Dahye always felt sorry for the villainess character Violet from the novel \"For Shannon,\" who tragically pursues a one-sided love for Earhart, the hero. After waking up in Violet's body, Dahye sees her chance to ditch the story's love triangle and declares her feelings for Earhart are no more. Her next mission is to save Violet's childhood friend Haron from similar heartbreak by making sure he doesn't fall for the heroine, Princess Shannon. But now Earhart has suddenly confessed a renewed love for Violet, and the normally kind Shannon has become vindictive towards her. Can \"Violet\" and Haron find their own happily ever after, amidst all the unexpected drama and confusion? Based on the hit novel.\n\n\n\nOfficial Simplified Chinese Translation\n\n\nOfficial Indonesian Translation\n\n\nOfficial Japanese Translation\n\n\nOfficial German Translation\n\n\nOfficial French Translation"},{"name":" Venus Plus","avatar":"https://mangadex.org/covers/3a46f96d-e2ae-466b-8a90-099754269136/065d51fc-ae01-4d55-ae13-b60565453a84.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":"Toshiaki Minowa gets the prize at the audition at Hokkaidou by Barnies, the biggest talent agency of idol stars and goes to Tokyo to be an idol star. To tell the truth Toshiaki's right object is \"to meet Naoya\" who was lived at next door when they were in Hokkaidou. Naoya is now a vocalist of very popular rock group, \"Succeed Cover\". Toshiaki tries to call Naoya for many times but Naoya is always absent. Toshiaki fails to enter Naoya's mansion by so many fan girls but is saved by Naoya. Naoya says Toshiaki that they should not meet again for their career…"},{"name":" Hualong","avatar":"https://mangadex.org/covers/3a46fee7-fb26-4258-84a3-149ab4da2a88/4f7b0a04-2cfe-4275-883f-50ba479ceb46.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.69","status":"Ongoing","tags":["Action,Romance,Boys' Love,Adventure,Drama,Fantasy"],"nutshell":"In his past life, he spent thousands of years cultivating, transforming from a carp/serpant into a dragon, but he was betrayed by the people closest to him, he died gruesomely. Swearing that he would return the favour a hundredfold, but he found there was another person behind it…"},{"name":" My Boyfriend Is So \"Use-full\"","avatar":"https://mangadex.org/covers/3a57573d-84f2-4eab-9f5e-ee5100518c5c/7c7fca98-e6c1-40d7-adc9-bbd5abcd50b5.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.28","status":"Completed","tags":["Long Strip,Romance,Comedy,Drama,Fantasy,Web Comic"],"nutshell":"I have no money, no car, no work, my life seems to be at it's tip… \"God! Please please give me a hottie and take me to the climax of my life!!\" ——As if the summon was heard upon, a boy fell from the ceiling and the cake loving Zhen Tian’s greeting was surprisingly…the taste(a)of (French) the(kiss) lips!!? What do you mean it doesn't taste good?!! Hmph!"},{"name":" LOOCK IN DEAD","avatar":"https://mangadex.org/covers/3a5870a9-17bd-48e5-9024-244a06009573/9f082f2c-198e-4b4d-a6cb-73e4e93de0f4.png.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Action,Adventure,Fantasy"],"nutshell":"One day, Miruke transfers to an underclass (which is a lower combat unit). There, however, she finds herself repeatedly subjected to a horrific and unbearable situation.\n(Translated with author's permission)"},{"name":" Ichigo no Haitta Soda-sui","avatar":"https://mangadex.org/covers/3a605c68-a3e4-4027-a198-6976fb00ce4e/15059fdb-017f-4e24-b8c3-f95f8ff5aa8e.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Comedy,Girls' Love,4-Koma,School Life,Slice of Life"],"nutshell":"Mannenrou Ladies' Academy is famous for its upper class and posh students. Despite knowing how out-of-place she'd be, the former yankee, Hanaizumi Luna, decides to enroll there. Moreover, according to her underling: \"Girls' schools means yuri!! Add in school dormitories? Now that's a world of girl on girl action!!\""},{"name":" Ai wo Hamu Akuma","avatar":"https://mangadex.org/covers/3a654785-5fe4-41f8-a44f-97625d8ebdb5/ee0a0107-b9b0-4e48-8a04-730eb171f5e6.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Romance,Supernatural"],"nutshell":"Owl is a demon that consumes people's love. Bored with such an easy task, he finds a challenge from Maria, a girl that only loves god. Can he make her fall in love?"},{"name":" Strike Witches - Unknown Witches: Secret File (Doujinshi)","avatar":"https://mangadex.org/covers/3a67bae2-edc6-4878-8e44-592d6405e331/f17da08c-9cd0-490c-a5e3-411e27a1cc60.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Anthology,Girls' Love,Fantasy"],"nutshell":"A collection of manga, short-stories, and art arranged and published under the direction of the World Witches creator group Firstspear."},{"name":" Kashou no Tsuki","avatar":"https://mangadex.org/covers/3a6925de-5147-4248-a5bc-34d792423a85/46195071-9354-48bf-8e76-0ca88d99da73.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Genderswap,Historical,Demons,Romance,Boys' Love,Adventure,Drama,Fantasy,Supernatural"],"nutshell":"Arimasa was a half-demon priest who cared nothing of what others thought of him. That was, until one fateful night, while on a mission to exorcise a gang of demons, he encounters Kagetsu, a clumsy cat demon who will eventually change his world, and more importantly, his views of it."},{"name":" Shizuku ni Nureta Hada Ashi","avatar":"https://mangadex.org/covers/3a6c6ca4-356f-46be-9209-e0d890e6c72b/507f9f24-133f-4817-bef0-4acf7ce4b875.png.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Slice of Life"],"nutshell":""},{"name":" Ore no ××× ga Genki ga nai Ken Nitsuite","avatar":"https://mangadex.org/covers/3a6d1bab-8fbe-4c21-b468-9577b8130f8e/63619e97-3ccd-4cda-b2e9-d6e7c3befa92.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,Boys' Love"],"nutshell":"His behind is now alive after experiencing some super skilled fingers!\nThis is the story of a handsome and skilled massage therapist and a ditzy, cute, and young office worker.\nTiny!! Impotent!! Boring!! That's what Tomoya's girlfriend said when she dumped him.\nSince he's worried that he's limp because of exhaustion, Tomoya consults his big brother, who introduces Tomoya to his massage therapist friend, Hayato (who's said to possess \"golden fingers\"😉.\nAs Tomoya's letting himself enjoy a nice massage, Hayato's fingers go in an unexpected place…\nThis is something right out of an adult story!!!\nWill Tomoya's little friend be able to regain its strength thanks to the golden fingers!?\nThis is a hot and ditzy yaoi story with a lot of sweetness and absurdity!"},{"name":" Natural","avatar":"https://mangadex.org/covers/3a6dafc9-571d-466b-9218-ad2a056dbf83/b298e007-fb7e-4112-8b37-c27eb0c0cda7.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Sports,Drama,School Life,Slice of Life"],"nutshell":"Riko (whose real name is Ayako) was already in high school when she gained a new younger brother. Miguel is a nine-year-old Peruvian boy rescued by her father in the midst of turmoil before he came home to his loving family in Japan. Miguel had a good grasp of Japanese but he didn't seem to be warming up at first. He was overly polite and he barely smiled. But Riko was determined to make sure that he felt that he was now a part of her family, introducing him to the world outside and to the game of basketball… Now Miguel is in high school, fresh out of the international school. And he has proven he can be good at many things: in academics, in sports… but even though he seems to be really good at basketball (showed the students their first live look at a dunk), and though he seems to really like it, he seems unwilling. What is he afraid of? What is he pushing away?"},{"name":" Armados","avatar":"https://mangadex.org/covers/3a73ca4b-f09a-4a49-a9f7-930e11251322/54275dd4-f844-4239-b5d3-e9b82df984d9.jpg.256.jpg","country":"Spanish (LATAM)","stat":"8.05","status":"Completed","tags":["Oneshot,Award Winning,Monsters,Action,Comedy,Supernatural,Mystery"],"nutshell":"Estic is a bored student who dreams of becoming a hero. After a supernatural encounter, he discovers that anyone can be a warrior and anything can be a weapon.\nWinner of the 100th Tezuka Manga Award."},{"name":" Mukashi Mukashi no Ohanashi.","avatar":"https://mangadex.org/covers/3a7495fd-b084-4489-8d08-2abb5c9ee663/ac8f24d1-c164-4d31-948a-18fe1143ca25.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Oneshot,Romance,Fantasy"],"nutshell":"To save the village, Suzu, a virgin, was offered as a living sacrifice. However, Inugami-sama, who was said to be nothing but frightening, turned out to be a beautiful man who was deceived and trapped by humans. He tells Suzu that in return for granting to her the power of god, she should offer her virginity, then kissing her kindly."}]