[{"name":" What I Decided to Die For","avatar":"https://mangadex.org/covers/0998984d-78ba-4c6d-b2b7-7c3bbe3a9759/695c110e-24a8-4b30-a27b-a29a19fe3cd4.jpg.256.jpg","country":"Korean","stat":"8.39","status":"Ongoing","tags":["Psychological,Long Strip,Romance,Drama,Web Comic,Full Color"],"nutshell":"Ji Oh, a senior in high school who was injured ahead of the National Taekwondo Competiton, is facing late puberty. Cha Gyeol, who met Ji Oh while having all sort of bad thoughts, is completely swoon over by Ji Oh with her dazzling smile. However, the people around Cha Gyeol are somehow dangerous for her to go head over heels with him. Her mind knows that she should be wary of him but she could not stop her interest towards Gyeol. Is it alright for her…to like him?"},{"name":" Nioi o kagu no ga suki na onnanoko","avatar":"https://mangadex.org/covers/099c7d7f-15bd-4f4d-b09c-44f0202b72ed/c49b0cb4-72cc-450d-b9a9-757b98cd65fd.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot,Romance,Comedy,Web Comic,Slice of Life"],"nutshell":"A Twitter oneshot about a girl who likes to smell things and her friend. By the author of Doujima-kun wa Doujinai."},{"name":" Gensou Suikoden -Uketsugareshi Monshiyou-","avatar":"https://mangadex.org/covers/099e1d86-4d4d-4543-ac9e-d11a0cebb901/f7704d07-3189-4bb2-8e1d-26e2c7bbf887.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Adventure,Fantasy,Tragedy"],"nutshell":"Due to the friendship he had with Ted, McDohl's attempt to save him eventually turned his life around from being the son of General Teo McDohl of the Imperial Army to become a wanted enemy of the Empire. A chosen bearer of one of the 27 True Runes, his encounters with death were already foreboding the moment the True Rune was attached to his right hand. Yet, McDohl continues to walk upon the journey through the Empire: facing corruption, cruelty and the life-changing decisions he has to make in order to restore order and peace for the people in his country and to fulfill the hope of many that was entrusted to him.\nBased on the PSOne video game, it is also loosely based on the Water Margin classics, though it's limited only to the gathering of 108 Stars of Destiny in order to overthrow a corrupt government."},{"name":" Wand of Fortune","avatar":"https://mangadex.org/covers/09a8bd54-425b-42f6-83d3-57ada108f4ce/908c2d7c-8d79-4166-ac1f-77c94dc2fc65.jpg.256.jpg","country":"Japanese","stat":"7.51","status":"Completed","tags":["Romance,Reverse Harem,Magic,Fantasy,Adaptation"],"nutshell":"\"This wand will bring you 'fortune', I'm sure.\" Lulu is an incredibly positive girl, who is overflowing with dreams and hopes. She aspires to become a magician after falling in love with her grandmother's magic. However, she was not born with an 'element', like everyone else who is able to use magic, which becomes a hurdle for her to achieve her dream. In the world renowned \"Mils Clare Academy\", in the magic capital Latium, Lulu goes through daily struggles to harness an inner element. Friends with peculiar characteristics begin to gather around her. Every day she seems to find herself involved in all kinds of happy(?) trouble. Based on the incredibly popular otome game by Otomate, Wand of Fortune is now reintroduced in manga format."},{"name":" A Little Melody of Love","avatar":"https://mangadex.org/covers/09aad780-4391-49ec-9eb6-beaa9c29ef30/cc1f4dd7-a096-471c-9232-0257cafac9ec.jpg.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Oneshot,Romance,Comedy,Girls' Love"],"nutshell":"\"A Little Melody of Love\" is a short story about two girls who are very different, who both seem to have feelings for one another.\nThis oneshot appears in volume 3 of 百合姉妹."},{"name":" Meteor Methuselah - Darling. (Doujinshi)","avatar":"https://mangadex.org/covers/09bafbf5-114c-4045-9978-03f24eab2b72/fab3082e-d64a-42db-bcc8-c2199f85ccbc.png.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Romance,Comedy"],"nutshell":"Second collection of Immortal Rain side-stories, alternative-stories and omakes."},{"name":" White Cup","avatar":"https://mangadex.org/covers/09becbd2-16e3-4f0a-83b0-00eeb3bd6ee8/d14afc80-d2b0-465c-b141-99922bc18cf7.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love,Fantasy,Shota,Supernatural"],"nutshell":"A boy meets a mysterious and mischievous man, requesting for a taste of the Sake he carries, on his way back home."},{"name":" Allison","avatar":"https://mangadex.org/covers/09bf03e4-356d-4386-abff-91880eb704ef/b146f8a0-c10d-4e55-bd56-028dc4337b2c.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Romance,Adventure,Fantasy"],"nutshell":"An adaptation based on the series of 3 light novels by Keiichi Sigsawa. Set in a world of a single continent divided by the Lutoni River and Central Mountains into 2 warring countries, Roxche and Sou Beil, the story follows Roxche pilot Allison and her childhood friend Wilhelm in their dangerous quest for a fabled treasure in Sou Beil territory that may end the war between the 2 nations."},{"name":" Human Doll Contract","avatar":"https://mangadex.org/covers/09bffb5b-d50e-43cb-b9cb-c0aa036aaaf6/afd89f17-564b-4387-86a3-e5d9cadb5aab.jpg.256.jpg","country":"Chinese (Traditional)","stat":"7.94","status":"Completed","tags":["Comedy,Horror,Fantasy,Supernatural"],"nutshell":"Translation from the product page:\nOpen the box to give me light, breath life into me, hold me with your love…then forget about me.\nMaster, I miss you.\nMaster, I love you too.\nMaster, do you remember?\nI'm still lying in that box waiting for you. Waiting for you to open it again, and tell me you love me.\nJiang Ziya returned home to find that the single child in the family had become two and no one seemed to notice.\nZiya has a strange left eye, one that could see what others couldn't. Most of the time, he would ignore it but this time something abnormal is happening in his home. He couldn't possibly turn a blind eye to this, could he?\nThere is no peace in this world.\nSome dangers require just a 'glance.'\nIn the face of unknown, do you choose to see – reality?\nNote from the scanlator:\nThe artist has said that the manhua will only cover the first two volumes of the original novel, which concludes the case \"Human Doll Contract.\"\nThe original novel is \"Illusions, Lies, Truth,\" which is being translated by Prince Revolution!."},{"name":" Hang In There, Bro!","avatar":"https://mangadex.org/covers/09c5de95-4660-4e05-9166-39b71e09671a/2271d5f3-de4a-4b05-adef-852f204744ac.png.256.jpg","country":"Chinese (Simplified)","stat":"7.95","status":"Ongoing","tags":["Long Strip,Romance,Comedy"],"nutshell":"Jun Bo is a poor man who suddenly gains an inheritance from his estranged grandfather. He receives a lavish villa, but it's being occupied by six beautiful women. With the beautiful tenants refusing to give him his villa, Jun Bo must think of a way to get it"},{"name":" Fullmetal Alchemist - The Unchanging People (Doujinshi)","avatar":"https://mangadex.org/covers/09cf9abe-8292-4230-aaa3-ee1f8c1c125a/8ecefe05-176d-448e-8d46-888de16de69f.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Ongoing","tags":["Oneshot,Romance,Comedy"],"nutshell":"Artist’s Pixiv\n Artist’s Twitter"},{"name":" Hold Onto Your Tears!","avatar":"https://mangadex.org/covers/09cfbef6-8b1f-4e47-a28a-29889d797636/47e533ae-3411-451b-beed-f7ec83d1d470.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Psychological,Anthology,Sports,Drama,Delinquents,Slice of Life,Tragedy"],"nutshell":"A shonen one-shot compilation of Akiyama. In addition to the title one-shot, also contains \"Dandelion\", \"I'm in Tatters\", and \"The Sound of Sunset\"."},{"name":" The Fox Lover","avatar":"https://mangadex.org/covers/09d1a69e-87a5-415e-8302-94982521b7eb/aa6279d8-55f8-498a-bd6a-279bba59ecfc.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life,Supernatural"],"nutshell":"\"In a certain wooden high school building, in a rural town… a strange student, and as it seems, a strange couple is enrolled.\""},{"name":" Genjitsu no Yohane: Unpolarized Reflexion","avatar":"https://mangadex.org/covers/09d29299-40cd-47b9-ae1a-fa8c70e520ce/1e3a02c2-87f9-4bd1-8aa4-c86864549823.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Ongoing","tags":["Comedy,Magic,Isekai,Fantasy,Slice of Life,Supernatural"],"nutshell":"The story of the girl everyone knows, but no one knows the story of. The daily life of Yohane, who runs a fortune teller's shop in a town by the sea, is relaxed, heartwarming, sometimes full of black magic? A short comic depicting the days of an illusion, near and far."},{"name":" Ruru Hikaru","avatar":"https://mangadex.org/covers/09d2d6f5-c101-4d0b-9cc7-f55daef0f850/4000fefa-e4c2-4107-9ba6-e24f65807368.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Fantasy"],"nutshell":""},{"name":" Bokuretsu Manken Love Gun","avatar":"https://mangadex.org/covers/09d51cdd-e3c1-4537-8f58-2fb959bee5bc/46a32114-6721-47fe-9bde-91394851ec5b.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot,Action,Romance,Comedy,School Life"],"nutshell":"Fuyuki Souichirou is a first year freshman who arrives for his first day of high school only to find a great battle raging on in the school yard."},{"name":" The Lady is a Cavewoman","avatar":"https://mangadex.org/covers/09dc2026-69f7-42d5-9ccb-dc55f1745750/0169650e-ace5-48d4-8bf0-9f353b4929bf.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sci-Fi,Animals,Romance,Comedy,Anthology,Drama,School Life,Slice of Life"],"nutshell":"(from ebookjapan):\nNeely, a college girl, went to her grandfather's cottage with her friend Killy during their summer vacation, but the cottage that used to be there was gone, and her grandfather appeared in the form of a caveman.\nNeely sympathizes with Grandpa, who has built an atomic hometown where people live in the wilderness without the use of man-made structures, but Killy leaves him out of love.\nThen Ryan, a male friend who joins them later, comes to live with Neeley and Grandpa...!\nIn addition to \"The Lady is a Cavewoman\", the collection also includes \"I'm Learning To Tell Fortunes\", \"Black Cat Tango\", \"My Sister Marin\", and \"There's Room for Rent\"."},{"name":" Your Memes Are Better Looking Than You","avatar":"https://mangadex.org/covers/09e06266-1d4d-4dd8-aab1-4fc5c972b4f1/a7b7e83c-1e4c-4787-9849-c65cf7aa79f7.png.256.jpg","country":"Chinese (Simplified)","stat":"7.69","status":"Ongoing","tags":["Official Colored,Long Strip,Comedy,Boys' Love,Full Color"],"nutshell":"Gu Wei. the popular yet controversial lead dancer of a boy band. Jiang Xun, a god-tier professional esports player.One day, after a variety show aired, these two complete and utter strangers became a trending topic together.Gu Wei’s anti-fans: Do these two people have anything in common? Gu Wei is absolutely shameless, even leaching on the popularity of esports and buying paid posts left and right!Fans of Jiang Xun’s skills: Our God Xun is as rich as a nation. If he wanted to, he could play around with any nameless celebrity and dump them after getting bored. However, an expected trending topic emerged not long after.  “Jiang Xun slacks off during livestream to promote a celebrity and fight against anti-fans.” “Jiang Xun’s younger brother Jiang Ying complains that he’s been forced to defend his nemesis Gu Wei against anti-fans.” Netizens: ???Although they have an arranged marriage between them, what Gu Wei fell for first was not Jiang Xun, but Jiang Xun’s memes.  The first time Jiang Xun met Gu Wei, he thought he liked him. He could never have imagined that Gu Wei only liked his memes. Gu Wei: I think your memes are better looking than you.Jiang Xun: Little kid, you’re a little rebel, aren’t you.Later, affection gradually grew between the both of them until Gu Wei eventually mustered up the courage to confess to Jiang Xun.  Gu Wei: Jiang Xun, I’ve become a fan of our ship.Jiang Xun replies ruthlessly: It’s too late, I’m now your solo fan."},{"name":" Koutetsu no Daitenshi","avatar":"https://mangadex.org/covers/09e2ccf7-2dbd-4ca2-854b-d0ec048b0023/92932464-1731-4438-8410-fb7331f6ac2f.png.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Historical,Comedy,Boys' Love"],"nutshell":"Silently, Give Yourself To Me\n\n\nStrike Song\n\n\nIt's Okay To Love Me\n\n\n4-6) The Dictatorial Archangel\nAfter his older brother died in the war, Hanse has no one if not for Colonel Michel Rosenberg who took him under his wing. Despite the Colonel's cocky attitude which Hanse dislikes, the orphaned boy couldn't help but respond to the Colonel's sexual advances.\nBut where does a wedding and a honeymoon on the battlefield fit in the story?!"},{"name":" Otoko to Sumu Imi Wakatteru? - Osananajimi no Risei ga Genkai","avatar":"https://mangadex.org/covers/09e89b39-e4b2-4076-b870-f77932d2d496/7f70ce43-fc25-490e-989f-57938b648477.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance"],"nutshell":"\"You don't understand. I am a man!\"\nIntertwining with the tongue of a lustful childhood friend... I can't, I'm going to collapse?! Miku, with a one-way unrequited love for her childhood friend Masato, follows him to Tokyo after they are split apart due to him finding employment. Miku stubbornly insists on living together but there is a sudden change in the once kind Masato?!\n\"I'll show you what it means to live with a man.\"\nHaving her nipples viciously licked, Miku's body responds sensitively to her first experience of pleasure... This can't be true... I can't believe Mah-kun is doing this!\n\nOfficial English Translation: INKR, Renta"},{"name":" For the Sake of Dulcinea","avatar":"https://mangadex.org/covers/09eb23ae-7b26-47b7-b3a9-48d38a2dd9f6/f7899108-6a42-4b68-9346-d5ebb4fbff96.jpg.256.jpg","country":"Korean","stat":"7.94","status":"Completed","tags":["Romance,Comedy,Drama"],"nutshell":"Shin Soon-Ae has the perfect boyfriend in the eyes of her peers. He’s handsome, is in a band and loves her. One problem though- she doesn’t love him. One day, a boy appears and wants to board with her family as a student, and Shin Soon-Ae finds herself attracted to the boarding student. To complicate things, the boarding student seems to have strange mysteries of his own.\nBACKGROUND: Dulcinea is a reference to Don Quixote, a Spanish novel about a man who is in love with a woman, Dulcinea. It also happens to be the name of the band Shin Soon-Ae’s boyfriend is a part of."},{"name":" Limbless Schira","avatar":"https://mangadex.org/covers/09ed038c-0eb5-4d2d-aeae-e0637394475e/5097bda0-0ba5-4ca7-980d-82c9bbed0ff2.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.05","status":"Ongoing","tags":["Action,Long Strip,Romance,Comedy,Adventure,Fantasy"],"nutshell":"Childhood friend turning into demons? And the reason is because of me? In order to save BaiYe who is corroded by a curse, YeYi went on a journey to purify the curse. Along the way, the truth of previous life unfolds…… This is a story that consist of conspiracy, monster hunting, friendship, romance and all the comedy elements of an magical adventure story!"},{"name":" Tabetaku Natchatta","avatar":"https://mangadex.org/covers/09ed1d8a-fd5a-4966-b615-658f65a84dda/189f28b2-55e2-44e2-abd7-8358f897ff21.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,Office Workers,Slice of Life"],"nutshell":"Jin and Akitaka hit it off as coworkers at the same company they joined after graduating. Ten years have passed since they started living together to save money on rent, and now they are spending time together like a family, but \"a change\" comes over them...?\nA step-up live-in love story between a friendly guy who's like a junior and a cool guy with covered eyes, by Tsunechika Obata, a master of romantic comedies."},{"name":" Nejikemono","avatar":"https://mangadex.org/covers/09ee7d6b-1938-4f85-b089-2de7ccefd8fc/e3663541-e196-44b5-b89e-fb5bd80644b8.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Historical,Action,Adventure,Drama,Supernatural,Tragedy"],"nutshell":"The time is the Sengoku era, the place is the country of Kyushu, Hyuga. A lone warrior is asked to exterminate a fox youkai, enters the mountains, and encounters a strange woman."},{"name":" Yuri!!! on Ice - Kimi wa Boku no Hikari (Doujinshi)","avatar":"https://mangadex.org/covers/09f7eab5-9595-436f-86cc-df48fa0e5ca7/9b4749d8-3077-459e-8a67-75a0ff9f58fa.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Boys' Love"],"nutshell":"Pairing: Victor Nikiforov x Katsuki Yuuri"},{"name":" Seolyusang Appa","avatar":"https://mangadex.org/covers/09fad1c6-e296-43e2-8236-4ab75bd1e0ef/29b93fd8-6dd4-4213-b25e-6658a1694642.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Web Comic,Slice of Life,Adaptation,Full Color"],"nutshell":"Orphan Ah Young is a financially struggling 23-year-old who takes care of her 8-year-old sister Dan Bi while juggling part-time jobs. One day a 28-year-old man Yoo Sang appears in front of Ah Young offering to be her dad through a signed agreement."},{"name":" Killing Den","avatar":"https://mangadex.org/covers/09fe38a8-d269-42a1-8d8d-0056c5bf68f9/de118866-df6a-464a-87a7-7b3db00aa51b.png.256.jpg","country":"Chinese (Simplified)","stat":"8.00","status":"Completed","tags":["Oneshot,Thriller,Long Strip,Horror"],"nutshell":"What's the most terrifying thing in the world? It's not ghosts. It's not demons. But rather finding out that the people living around you have been secretly replaced. The appearance and manner of the TA is exactly the same as the person you are familiar with, but only you know that there is an unknown monster hidden within that human body. Chen Heng realises that his mother is really not her. He alone confronts with the terror, but discovers the more shocking and dreadful other side of the world, hidden within the everyday life."},{"name":" Nemureru Mori","avatar":"https://mangadex.org/covers/09fe52a0-c495-416e-a6c7-8bcba9a4754c/fe8fb43b-bdcb-4948-af47-bbf0854b1866.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Incest,Drama"],"nutshell":"A short story about inappropriate love wandering between dreams and reality."},{"name":" En Passant","avatar":"https://mangadex.org/covers/09ffee50-f5ad-4997-86a6-ac797b94b3e4/a4fc9aa3-d6bc-402f-8c30-dc98d3cff317.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Action,Comedy,School Life,Fantasy,Supernatural"],"nutshell":"Verde, a powerful and secret organization that controls the world, has a new leader. The only thing that stands in its way is an unlikely character, Kujou Shin, the king of pessimists. He has no attachments to anything or anyone and feels no hesitation to dying. He is unwillingly dragged into a fight for the most powerful position in the world, the leader of Verde. What will his fate be?"},{"name":" Red Eyes","avatar":"https://mangadex.org/covers/0a012ab6-294d-48c6-be4f-18c7102dc6dd/aa07a77e-8300-4a8b-bc92-2841261f7cdf.jpg.256.jpg","country":"Japanese","stat":"8.47","status":"Ongoing","tags":["Sci-Fi,Action,Mecha,Military,Drama"],"nutshell":"My war isn't over!\nOne mobile suit infantryman's personal battle resumes as a red fire blazes again in his eyes!\nCaptain Grahalt Mills, commander of the Legium nation's special forces \"Jackal\" unit, utilizes the most advanced mobile infantry exoskeleton in existence, the SAA (Special Assault Armor). With the last line of defense faltering against Dragnov's pressing forces, the Jackals are deployed in a last ditch attempt to hold the line and succeeded at destroying all opponents in their sector! In a bizarre turn of events, Mills' own subordinates of the Jackals all frame him for the murder of several Legium soldiers, severe war crimes which sentence him to be executed for treason. With an eye for vengeance, Mills escapes from prison on his own and tracks down the old members of the Jackals to figure out why he was betrayed.\nSetting:\nBased in an alternate sci-fi future, a previous super power set up an ever lasting global orbital satellite array acting as a powerful anti-missile laser defense known as Orbit Eyes. This eliminated the looming threat of nuclear destruction, but the key to control the system was lost with the fall of the super power, leaving it permanently on safe mode. More wars ended up fought with boots on the ground, leading to the creation of advanced infantry exoskeleton technology known as SAA.\nThe story revolves mainly around the conflict between two nations: the Republic of Legium engaged in a costly war with the Federation of Dragnov after the latter attempted to reunify the two countries. A war broke out between the two nations with heavy losses to both sides. Eventually, Dragnov got the upperhand and their forces came close to overrunning Legium's last line of defence around its capital. As a trump card, Dragnov unveiled new tech in the form of a low altitude, heat signatureless warhead which could bypass the Orbit Eyes missile defense. It was detonated 8km away from Legium's capital, causing severe damage to the surroundings, and convinced the Legium politicians to negotiate for a surrender. However, a segment of Legium's military, the 3rd Army, has defied the Legium administration, refusing surrender to continue fighting against Dragnov for their homeland."},{"name":" Pangaea/Ezel","avatar":"https://mangadex.org/covers/0a0269f7-085a-4933-a848-0b9fa6d68635/6efebf4f-d312-4cfb-87aa-0a7d89e2254f.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Action,Comedy,Adventure,Fantasy"],"nutshell":"In a setting where religion and the mythical power of the tree 'Pangaea' rule the world, our protagonist travels with a gang of people who have parts of Pangaea within them. He has a stick that contains the power of Pangaea which he can use to summon shoots and branches to fight. With their complicated backgrounds, they are often in fights and dangers.\nIn the first volume, we get to see a slight glimpse of the power of Pangaea. There are others with the power of Pangaea; they can resonate, sensing each other, and those with the seed(?) have the strongest power. Nothing much is given on the family background of all the leads, what are they traveling for, how they met–nothing. All we know is that they have something in common: they are linked to Pangaea in some way–and Pangaea, (despite its power) is not common knowledge to the world."},{"name":" Dostoevsky's Dog","avatar":"https://mangadex.org/covers/0a069d10-5830-4aa8-954f-264a46b37617/07548527-18e0-41d5-8b8d-ed2895d2ec0d.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Psychological,Animals,Anthology,Office Workers,Drama,School Life,Horror,Slice of Life,Tragedy"],"nutshell":"(from ebookjapan):\nA collection of George Akiyama's masterpieces, including eight heart-wrenching masterpieces and shocking problem stories. Jun, an innocent boy who loves his dog Jiro, is asked by his mother to find a pair of sandals that Jiro seems to have hidden. Jun orders Jiro to look for the sandal, but Jiro somehow brings Dostoevsky's \"The Brothers Karamazov\" with him. ......?"}]