[{"name":" Hammurabi Code","avatar":"https://mangadex.org/covers/7103bec9-a3a0-4e57-a0a4-090ed5b6a77b/d484aa8d-bf59-4053-b4bd-0d57ea0ad5ad.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Oneshot,Thriller,Psychological,Supernatural,Mystery"],"nutshell":"If you had a loved one killed by someone, could you allow that? Could you really trust today's judicial system? What would you do if you had the ability to punish people severely? From the author of Liar Game and One Outs comes a two-part one-shot about a judicial system for criminals that operates under the ideals of, \"An eye for an eye\"."},{"name":" Akai-san wa Kyou mo Tsunderu.","avatar":"https://mangadex.org/covers/71070881-db48-46ed-a319-c2ddd6f377b6/38c24d07-077f-4ff3-a23a-f37931f9ce8f.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["4-Koma,Slice of Life"],"nutshell":"The manga about a female shogi player was first published as a one-shot in August."},{"name":" Kyouraku no Mori no Alice","avatar":"https://mangadex.org/covers/710a534c-2d53-4bb1-a13c-c8d6864eaab5/1aed97ba-bb31-4c12-84c5-ef1438011779.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Historical,Romance,Fantasy,Adaptation"],"nutshell":"Losing her parents when she was young, Alice lives with her aunt. Thinking that she should be independent, she had intended to undergo training as an apprentice geisha, however, in the 8 years she has been gone, Kyoto seems to have changed."},{"name":" Straight or Not","avatar":"https://mangadex.org/covers/710dd38d-872e-4bd0-b86a-83d0ff95f2c9/eff5f754-52bb-4bb6-9f5c-d8eb7d40d77a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.06","status":"Ongoing","tags":["Long Strip,Boys' Love,Office Workers,Web Comic,Full Color"],"nutshell":"He is a sunny, hilarious, positive and obscure actor. He is a composed generous and graceful general manager. Because of a strange request, they began a long journey of attracting each other. What should they do? Nonsense, of course becoming lovers."},{"name":" Ashi Tsuma Katari","avatar":"https://mangadex.org/covers/712400c0-5dcb-4ab7-9ca4-9d2908ee1998/73eba883-2850-4b6f-8abd-a8eb9737ed7b.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Historical,Romance,Adventure,Drama,Supernatural"],"nutshell":"The protagonist is Mizumatsu Onna (Mirume), a daughter of the Araragi clan, the family who are protected by the serpent god. It is said that the daughter who draws the blood of Araragi will get prosperity after getting married, but Mizumatsu is rumored to be an “unusual bad wife”. Mizumatsu woman's fate begins to move because a new marriage destination has been decided."},{"name":" Katekyo Hitman Reborn! - Sandai Yokkyuu Yuusen Juni (Doujinshi)","avatar":"https://mangadex.org/covers/71262b6c-04d3-419e-875c-174da3d55d70/eff3658c-12c8-44ab-89ad-9ad8876381f8.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Boys' Love"],"nutshell":"Pairing: Dino x Hibari"},{"name":" Ten Second Kiss Cooldown Game","avatar":"https://mangadex.org/covers/7126df39-4374-4f53-9aa9-e1a552cdcc72/40522d70-32df-459d-a026-70b040f7bdcd.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Oneshot,Comedy,Girls' Love,Slice of Life"],"nutshell":""},{"name":" Extraordinary Dating","avatar":"https://mangadex.org/covers/712fa8ad-722a-4f00-b88f-45b677902feb/bbde4394-9994-4086-a330-53ed989a8ef3.jpg.256.jpg","country":"Korean","stat":"8.06","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Office Workers,Drama,Web Comic,Slice of Life,Adaptation,Full Color"],"nutshell":"There was a man who rose to the position of the director of an advertising company at the young age of 34. The perfect man blessed with talent and appearance that could rival that of a celebrity, 'Kim Yoon'. This man had a weakness... \"Secretary Yang.\" The ends of Seoyu's lips trembled. That human's starting up again. But she erased her annoyance and exasperation from her face and replied courteously. There's nothing easy about being paid a salary by someone else. \"Yes, Director.\" \"Tell me the truth from now on.\""},{"name":" Koji Koi","avatar":"https://mangadex.org/covers/7134dd52-eaab-4f04-8f41-3ce8f77c85db/31578389-83cb-431a-bc2e-0483bc7ba01c.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"The protagonist lives and works in a boarding house and has a phobia of boys, however she finds herself having to manage her fear when two new boys are hired in the boarding house who will live and work there. One is a silent boy who confesses he hates girls, the other is a school friend who can't stand the protagonist because of her elusive character…"},{"name":" Snow and Ink","avatar":"https://mangadex.org/covers/7138083b-4fbf-4cc3-8695-ce175034e45a/6a8ecd47-1665-4dbc-bd6e-547b1a4c0d20.png.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Romance,Drama"],"nutshell":"Neneo was being hauled through the city for the terrible crime of murdering 50 villagers. \"I will buy you off,\" she said. With one word, Freya, the daughter of a prestigious family, changed his fate as he was about to be beheaded. When Freya loses the battle for the throne and heads off to a remote, cold region, Neneo is ordered as her squire, and he finds himself in the company of a woman who, like himself, is scorned and pitied by the world. The two have different backgrounds and different ways of thinking, but as they confide in each other about their respective circumstances, they come to understand each other... (MTL)"},{"name":" Tensei! Takenaka hanbei 〜 maina bushou ni tensei shita nakama-tachi to sengokuranse wo ikinuku 〜","avatar":"https://mangadex.org/covers/7139976f-57ef-4530-8668-89cba8c2164a/4085b489-6366-40f4-a13f-8abdd0b2b400.jpg.256.jpg","country":"Japanese","stat":"8.21","status":"Ongoing","tags":["Reincarnation,Historical,Comedy,Adventure,Drama,Fantasy,Slice of Life,Adaptation"],"nutshell":"The two genius military advisors who led Toyotomi Hideyoshi to unify the nation, Kuroda Kanbei Yoshitaka and Takenaka Hambei Shigeharu. A dull and unmarried salaryman in his thirties wake up one day to find that he had become Takanaka HanbeL He had been reborn along with seven other men of the same age and circumstance! That night, he suddenly found himself in an empty room with a PC with a chatroom called \"Tea room' open. Apparently, he could use this to chat with his fellow reincarnators?? Will they be able to survive in this era of battle and strife?"},{"name":" Yankee to Yandere no Karera ni wa Tomodachi ga Inai","avatar":"https://mangadex.org/covers/713f5bee-a4d2-45cf-90f2-4455503aca4d/ca55c58d-4168-4759-8236-3be9e53816e3.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"One is a delinquent-looking pervert, the other is a haraguro yandere. Place them together. This is their daily comedy school life."},{"name":" 10-sai Kaa-san","avatar":"https://mangadex.org/covers/71427f0c-6fc8-41cc-812a-4930d956c657/43f185a8-7846-492f-84df-0a8537e38451.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":"Wauman (Nagomi) who lost her mother due to a water accident at the age of 5. A decade later, a mysterious primary school student Mr. Ano Mari appears before him. She said that she is a reincarnation of her mother and starts to live with Wakami. Two new parent-child relationships are established.\nFrom Comic Flapper."},{"name":" Windowside Dreaming - Dragon Quest XI","avatar":"https://mangadex.org/covers/7144486f-45e1-44ee-a895-56f9ca43c066/40ad2ab5-200d-4cfc-a125-9c8d5f272f79.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Psychological,Adventure,Tragedy"],"nutshell":"This story takes place in the world left behind by Eleven after he breaks Time’s Sphere. Erdrea is slowly recovering from the damages caused by Mordegon, but some people have it harder than others…\nThis doujinshi is the novelty comic of the book, バイバイ、モラトリアム (Bye Bye, Moratorium), sold during Haru Comic City 24: Tokyo."},{"name":" Oshioki X-Cute","avatar":"https://mangadex.org/covers/71448de6-d528-4c03-8787-1143714ca699/560350b3-fe8e-4180-a2fc-5d1e76a3cf43.jpg.256.jpg","country":"Japanese","stat":"6.88","status":"Completed","tags":["Loli,Psychological,Romance,Comedy,Drama,School Life,Supernatural"],"nutshell":"Shimizu Kenta's high school life changed when he was seduced by Aoi Riku as a joke who then proceeded to bully him mercilessly. However, a messenger from hell named Beatrice came and gave him a choker so that he can dominate sinful women as an executor."},{"name":" Eiyuu Densetsu - Rei no Kiseki Prestory: Shinpan no Yubiwa","avatar":"https://mangadex.org/covers/7145da84-8be7-4a82-8d91-4b3d872ac9d1/17020409-685e-4171-b8cd-bfa9e9428445.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Action,Comedy,Adventure,Drama,Fantasy"],"nutshell":"Follow the adventures of Estelle, Joshua, and a Bracer from Erebonia, Toval. They are following up on the mystery of the mercenary group known as the Jester’s Jaegar.\nPrequel to the video game Eiyuu Densetsu VII - Zero no Kiseki (The Legend of Heroes VII - Trails of Zero)."},{"name":" Necromancer Survival","avatar":"https://mangadex.org/covers/71462682-2ca6-434c-8081-d88e239f308d/a3413c88-e288-4ef3-bd5f-2a7ddba7668f.jpg.256.jpg","country":"Korean","stat":"8.08","status":"Ongoing","tags":["Monsters,Action,Ghosts,Long Strip,Boys' Love,Adventure,Magic,Drama,Fantasy,Web Comic,Supernatural,Adaptation,Full Color"],"nutshell":"When the weak and unconfident Choi Yikyung first found out that he was a user, he thought he had finally hit the jackpot. In Yikyung’s mind, Necromancy seemed like the ultimate mix of cool and interesting. Back then, he had no idea that the Necromancer class was the weakest of them all! But as Yikyung enters the newly reopened Tower of Spirits in search of enhancement materials, he is sucked into a mysterious area of the dungeon where he encounters a frightening corpse. “Ding!” A quest window pops up, and it says… “You have made a pact with Seo Dawon, a vengeful spirit.” When tackling quests, it doesn’t hurt to have a companion or two, especially if one of them is the spirit of an ultra powerful and handsome young man. After all, “it’s dangerous to go alone”!\n\n\nOriginal Webtoon <kakao>\n\n\n\n\nOfficial Simplified Chinese Translation\n\n\nOfficial German Translation\n\n\nOfficial French Translation"},{"name":" Watashi to Dasshutsu Shimasen ka?","avatar":"https://mangadex.org/covers/714a9a71-8aac-4b73-af59-342cb6c13d87/4f967b29-0818-49a1-8a3a-a2b8d60fd471.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Romance,Comedy,Video Games,School Life"],"nutshell":"She seems innocent and quiet in class. But Tojino-san is actually a huge \"escape room\" geek (almost obsessively so)! Tsunemi, a boy who \"thinks too much about everything,\" found out about her hobby. Now let the games begin!"},{"name":" Dragon's Chosen","avatar":"https://mangadex.org/covers/71567c3c-3f44-4fd6-8049-f224aedd3cef/00e58eb8-0979-4cae-ae6f-2b145fdd6d94.png.256.jpg","country":"Chinese (Simplified)","stat":"8.02","status":"Ongoing","tags":["Historical,Monsters,Action,Long Strip,Martial Arts,Adventure,Wuxia,Isekai,Fantasy,Full Color"],"nutshell":"In a mission to find cultural relics, the greatest soldier of China was dispatched. But however, while Lin Yuntian got ahold of the Divine Jade pendant, a grenade exploded nearby and he died. Only to have his soul transmigrate into the Tian Continent, and posess the body of the deceased prodigy also named Lin Yuntian. With the dragon's soul along with his mysterious Jade pendant, he'll cultivate the supreme cultivation art, pay back his grudges, and be the greatest person in the world!"},{"name":" Ohigara mo Yoku","avatar":"https://mangadex.org/covers/71593f3f-4ef9-44d4-9df2-df4cc0c873ce/da02ba31-b90a-490a-b5dd-7e0366f584b5.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"From the time he was very young, Shuuta longed to be \"married\" through adoption to Kouhei. While Kouhei, as a guardian, was too absentminded, Shuuta always felt as if he never fulfilled his duties to him as a \"wife\".\nIt's a love story between an airheaded, thick-skinned, handsome \"husband\" and an innocent, pure-hearted new \"wife\" – with an age gap!"},{"name":" Akai Kami wa Yuuwaku no Shirushi","avatar":"https://mangadex.org/covers/715a50ce-bc69-42d4-9a41-db29c4e6db95/0f66a1c6-d57a-4fab-8b5b-b1621a4c3e70.jpg.256.jpg","country":"Japanese","stat":"7.60","status":"Completed","tags":["Romance,Drama,Mystery"],"nutshell":"Ben Radford thought Kay Napier was a fortune hunter, out to get the Endacott family fortune by posing as the long lost Kimberley Endacott. Kay just wanted to know whether or not her recently deceased mother was a kidnapper. Will the two find the answer, as well as love?"},{"name":" Touhou Momotarou, Zen Part Boshuu","avatar":"https://mangadex.org/covers/715a584b-e335-4793-90da-1e42e04dc22d/da5e3d03-ffa7-4d87-8d62-bb993629808d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Animals,Comedy,Magic,Fantasy"],"nutshell":""},{"name":" Guerilla","avatar":"https://mangadex.org/covers/715e2e0f-19c6-43d9-b779-978448b2e714/49201321-5030-490b-a096-6b8a07c72b7a.jpg.256.jpg","country":"French","stat":"7.97","status":"Ongoing","tags":["Action,Sports,Martial Arts,Mafia,Delinquents,Police,Tragedy"],"nutshell":"Un temps considéré comme le plus grand espoir du MMA français, Ahmed Al-Mokht, 22 ans n’est désormais plus que la tête d’affiche de la ligue clandestine la plus violente et dangereuse qui soit, le KSL."},{"name":" Neko to Spica","avatar":"https://mangadex.org/covers/7161a29c-1ba4-4002-be30-57fe23b6f3a7/7b728ef5-204a-424c-b2bd-14f187bdd7e3.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Ongoing","tags":["Romance,Boys' Love"],"nutshell":"Salaryman Kawamura Kouta hates troublesome things. The only exception is the black stray cat that likes to sit in front of his apartment. One day, he stumbles upon a black-haired boy who seems to have replaced his favourite cat. When the boy collapses in front of Kouta, he decides to take him in on a whim. What will happen to Kouta's trouble-free everyday life?"},{"name":" DanMachi 4koma - Somosomo Dungeon ni Moguru no ga Machigai de wa Nai Darou ka","avatar":"https://mangadex.org/covers/71628726-625f-4fa3-a20e-286b75e830df/cb545ae4-a351-4c0b-8cb2-a391b091c6f3.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,4-Koma,Fantasy"],"nutshell":"4-koma spin-off of the Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka series."},{"name":" Koufuku wa Kimi no Tonari ni","avatar":"https://mangadex.org/covers/71632de6-a0b0-44c6-b740-30ec09662231/22d9f85b-7874-476a-8282-bbb821a20615.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Boys' Love"],"nutshell":"It was supposed to be the happiest day of Satoru's life - until his bride left him at the altar for another woman! As he struggles to get his life back in order, it's a good thing his old friend Daichi's always there to look out for him - but is friendship really the only reason why Daichi's keeping him here? Or had Satoru's happiness been right beside him all along?"},{"name":" Ore Dake Miteroyo","avatar":"https://mangadex.org/covers/716c8e17-1f79-4c77-8dab-6742ba612d4e/8fe90d67-e2c8-4f43-9e29-3c1607c57dd3.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Office Workers,Slice of Life"],"nutshell":"Suzuno has been working at a stationary manufacturer while repaying the debt incurred by her father due to certain circumstances. However, this was discovered by Watarai. “I will protect you, so let’s get married!” he says, as he offers to shoulder the debt in exchange for Suzuno’s hand in marriage!? Despite the hesitation, Suzuno accepted and thus begins their daily lives as newly-weds! Unknowingly, Suzuno, an amateur in love, gradually stimulates the possessive nature of Watarai…!?\nSynopsis source: Chibi manga"},{"name":" Asagiro - Asagi Ookami","avatar":"https://mangadex.org/covers/71716cbf-e1b0-4871-b247-38aebcaaf287/4394d71d-dc78-494d-b522-e06bb363a58f.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Ongoing","tags":["Historical,Action,Samurai,Drama"],"nutshell":"A twelve year old boy from a lesser known school of swordsmanship is known to be an outstanding prodigy. A demonstration match with wooden swords is arranged for the local lord, and an instructor from a nearby school is called to be his opponent. The instructor, not taking the boy seriously at first, learns quickly that he should not take the boy for granted. Both of them settle into a serious fight with their pride as warriors on the line. The match is hard fought, but finally the boy wins, and sets in motion a cascade of unforeseen consequences.\nWhile the boy is ferocious with the sword, he is ignorant of the intricacies of politics and court politeness that can even be deadlier that a blade. And when the instructor decides to kill himself out of shame, that is a consequence that shakes the boy out of his simplistic notions that sword matches are simply contests of skill, especially when the instructor requests that the boy be his second and cut his head off!\nAsagiro is a detailed period piece with compelling art, great sword-fights and it shows how important pride and position were in ancient Japan."},{"name":" The idiots at the high school of gifted males!","avatar":"https://mangadex.org/covers/71779854-09bb-4821-b38b-837428b30e82/c49fc8de-49a5-4097-b83a-00797360b072.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.80","status":"Ongoing","tags":["Sci-Fi,Official Colored,Animals,Long Strip,Romance,Boys' Love,Drama,Web Comic,Supernatural,Full Color"],"nutshell":"Edgar, Ace and I are roommates and go to a school surrounded by males who adore us. Help us! what should we do?"},{"name":" Boku Koi Conductor","avatar":"https://mangadex.org/covers/717b10f2-f55f-4b58-be4f-dc20565489b0/928ac0db-7cda-46ac-ae3f-d5c605d878bf.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Comedy,4-Koma,Drama,School Life,Slice of Life"],"nutshell":"Nakamura Kouta is a freshman in high school who dislikes girls. One day he is visited by his childhood friend Karen, with whom he lost contact over time. Karen is a tomboyish girl, who refers to herself as “Boku” (a first person pronoun usually used by males). She asks him to help her become more feminine to win the affection of Itsuki-san, a colleague at her part time job. Even though he is reluctant at first, he more or less voluntarily agrees to help her out in the end. But making a lady out of the clumsy Karen with nothing but his extensive galge experience as reference proves more difficult than he could imagine."},{"name":" Jinjuu Houretsuden","avatar":"https://mangadex.org/covers/7183210e-ed32-4a2b-bd03-f4a61d261b00/55a62f1b-6108-4e34-8953-3500bea100e5.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Historical,Action,Boys' Love,Adventure,Drama,Fantasy,Supernatural"],"nutshell":"In ancient China there exists an alternate dimension called Jusenkai, whose inhabitants, the Senkaijin, possess tremendous powers. One of them, YanLang, fled to Earth along with his rebel army after being defeated during his attempt to overthrow the Emperor. In order to capture the fugitives, the Emperor sent his elite soldiers to Earth after them.\nLiFang has been traveling alone to find his father’s murderer when he picks up a sick and injured man. That aloof man, TuoRen, turns out to be one of the imperial soldiers sent to earth to hunt and capture the Senkaijin rebels. While his comrades work in pairs, TuoRen prefers to be alone. That is, until the strangely powerful human, LiFang, decides to follow him on his quest."},{"name":" Mou, Sou Shichau?","avatar":"https://mangadex.org/covers/71843fb5-cce4-41b7-809e-06bea0eccd5b/2f74163d-bd69-4f67-b7ef-92129e07cab7.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Oneshot,Comedy,School Life"],"nutshell":"Miki-kun likes the girls in school. A lot. One day, he meets someone in class who shares his interest in girls… (From: MU)"}]