[{"name":" Metroid","avatar":"https://mangadex.org/covers/5de460b1-500c-4d16-9e9e-6f4cf554ef6a/a74646d6-d248-407f-b600-7adc9e4333b4.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Sci-Fi,Action,Comedy,Survival,Adventure,Video Games,Military,Philosophical,Police,Aliens,Tragedy"],"nutshell":"A 2 volume manga that explores the origins of Samus Aran."},{"name":" Tensei Shitara Danzai Start Nante Kiitemasen! Anthology Comic","avatar":"https://mangadex.org/covers/5de46c0b-9c60-4291-abf7-82a3f66861a6/6d6911f1-04cf-40b1-bd8c-4f72d4ff32f0.jpg.256.jpg","country":"Japanese","stat":"8.61","status":"Ongoing","tags":["Oneshot,Reincarnation,Romance,Anthology,Fantasy,Villainess"],"nutshell":"Despite having just regained their memories after reincarnating, it's always the worst possible timing——?! Death by Poison route, Demon King summoning, false accusations, engagement annulment, Execution Ending… A compilation of 5 stories with happy endings after these noble girls reincarnate \"for various reasons\" and turn the tables on their situations! Here's an anthology for you of noble girls who obtain happiness on the brink of destruction♪\nCover Art: Shidou Murasaki\nVolume 1 Contents:\n\n\"Even Though I Died to a Pufferfish, I Reincarnated as a Villainess Who'll Die to Poison?! But I'm Going to Be Happy With My Favourite Chara!\" (フグで死んだのに毒死する悪役令嬢に転生!? でも推しと幸せになります！), by Mugichapo Yoko\n\"The Villainess Gets Entangled With the Cunning Demon King\" (悪役令嬢、ずるい魔王に引っかかる), by Ohtsuji Ei\n\"The Noble Girl Fell Into a Cursed Sleep\" (令嬢は呪い仕掛けの眠りに落ちる), by Ooya, Has a GL ending.\n\"I'm Not Really Sure If I'm the Heroine, so I'm Going to Run Away With the Villainess\" (ヒロインとかよくわかんないから、悪役令嬢と逃げます。), by Yamagata Atsuka. Has a GL ending.\n\"Does the Duke's Daughter Dream of Revolution at the Guillotine?\" (公爵令嬢は断頭台で革命の夢を見るか？), by Akanatsu\n\nVolume 2 Contents:\n\n毒女ですが、ヒロインを救わせていただきます, by Michiyuki Aoi\n自分でつくったクソゲーの悪役令息に転生したので今度こそ責任を取ります, by Ogi Kannu\nエンゲージ・ジェム～悪役令嬢の婚約相手は魔王様！？～, by 霰屋\n鈴木くんは思い出したい, by Yamagata Atsuka\n\nVolume 3 Contents:\n\n悪役令嬢の取り巻きは幸せになりたい. By Mitsuki Anne.\n社畜OLの異世界転生. By Sawane Chihiro.\nとある断罪劇の一幕. Art by Chairoi Risu, Story by 千子. Original Web Novel\n推しに課金しすぎて気付いたら異世界にいました. By Arareya.\n本当にあくどい悪役令嬢は、ヒロインの真似事をする。. Art by Sasahara Chie, Story by sasasa. Original Web Novel"},{"name":" Good Morning","avatar":"https://mangadex.org/covers/5de55dff-e1e4-4d1b-a6d2-278444a2357b/e80d4339-933f-48ca-9551-66fcab93f8bc.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life"],"nutshell":"One morning, Hayashi wakes up naked – next to another man. That man: Shinohara, a client everyone says is gay! Hayashi, hung over with no memory of the night before, is horrified when Shinohara tells him they slept together. He doesn't know Shinohara is lying! Plus, normally a cool character, Shinohara has turned beet red, crying and yelling… and incredibly, Hayashi thinks this new Shinohara is kinda cute!"},{"name":" Poncho.","avatar":"https://mangadex.org/covers/5de7ee35-8a9c-4316-b70e-39f2b187ee14/0f186834-78ee-403a-93d2-5982f6e7798a.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Ongoing","tags":["Comedy,4-Koma,Slice of Life"],"nutshell":"4-koma about the funny moments of Hiroshi and his girlfriend's little sister Pon."},{"name":" Super Turtles","avatar":"https://mangadex.org/covers/5deeedc4-615a-42b2-856f-02b99e22d201/3c51c6ef-a821-413e-815d-89f5bb9d86f1.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Action,Comedy,Fantasy"],"nutshell":"The Teenage Mutant Ninja Turtles (often shortened to TMNT or Ninja Turtles) are a fictional team of four teenage anthropomorphic turtles, who were trained by their anthropomorphic rat sensei in the art of ninjutsu and named after four Renaissance artists. From their home in the storm sewers of New York City, they battle petty criminals, evil overlords and alien invaders, all while remaining isolated from society-at-large."},{"name":" Among Us","avatar":"https://mangadex.org/covers/5df4760c-1400-416d-8b4c-0a6718347c1c/fae90b72-c895-4644-b134-7d3974976a4a.jpg.256.jpg","country":"Japanese","stat":"8.49","status":"Completed","tags":["Oneshot,Sci-Fi,Comedy,Survival,Aliens,Adaptation"],"nutshell":"A one-shot adaptation of the video game of the same name.\nPublished on Coro Coro Comics magazine, same publication as Doraemon, Pokemon, and Youkai Watch manga."},{"name":" Koi no Recipe wa Amakute Nigai","avatar":"https://mangadex.org/covers/5dfdae1b-7511-4f08-9278-04ef1adde5cc/dcdbd82a-ebb0-4110-8089-1e269cd75bcd.png.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Boys' Love,Cooking"],"nutshell":"\"On the outside, he’s like a prince, but on the inside... he’s just like a mother?!\nMitsuge, the handsome cook who keeps getting dumped due to his high-level housework skills and overly-helpful personality, wants to pamper his recent obsession, the slightly clumsy restaurant server, Tomori.\n“You were looking at me so lewdly during our lunch break, weren’t you?”\nWhen Mitsugi becomes captivated by the way Tomori eats his cooking so deliciously, it's not just love he's feeling but an 'appetite' too... Can this earnest love not be romantic?! A bitter-sweet love story.\""},{"name":" ChäoS;Child","avatar":"https://mangadex.org/covers/5e027a8d-1543-4ec4-acb2-ebfc73538047/89b164f6-bdbb-4964-bff5-063fa7091153.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Sci-Fi,Psychological,Harem,Supernatural,Mystery"],"nutshell":"ChäoS;Child takes place in October 2015, six years after the events of ChäoS;HEAd. Abnormal events begin to occur in Shibuya district, including mysterious deaths."},{"name":" Nozokimi","avatar":"https://mangadex.org/covers/5e028b0e-84ac-41b9-8183-7529adf8e5bb/ffb40ec0-a14c-40dc-9591-aed52bda2bab.png.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Oneshot,Romance,Slice of Life"],"nutshell":""},{"name":" The Boy from the Future","avatar":"https://mangadex.org/covers/5e03cdc7-9e41-4dfe-90f9-9a9f7b3eeec0/2059ee5a-af6f-41a7-9606-532c9dbf5fa4.png.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Time Travel,Comedy,Drama,School Life,Fantasy"],"nutshell":"In the year 3015, humanity has suppressed emotions so that they may advance more efficiently. It is a world that has eliminated unnecessary values, forcing humans to live hollow lives. A riveting story of a boy who lives in a desolate future and how he struggles with society!"},{"name":" Prisoner","avatar":"https://mangadex.org/covers/5e04134e-4033-4c6c-88a7-d74e6a7097ff/239a7070-9eae-4322-9941-67f06e543e99.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love,Adventure,Drama,School Life,Mystery"],"nutshell":"After Kei Oosawa's father died in an car accident, all he had left was his father's dear friend, Kazuma Takashina. Kazuma, who was still young, took Kei in and gave him a new home. During the years that passed by, a relation of desperation and hate grew out between Kei and Kazuma and the older Kei became, the more he wanted to escape from his 'prison'. Will Kei be able to live on his own, to escape from Kazuma…?"},{"name":" We Are Peaceful Brothers","avatar":"https://mangadex.org/covers/5e0643a7-d476-4d97-bc5d-9ec92dd7486a/9837c464-06f8-4a2a-b605-fb8d058eff80.jpg.256.jpg","country":"Korean","stat":"8.04","status":"Completed","tags":["Long Strip,Comedy,Slice of Life,Full Color"],"nutshell":"The daily story of two brothers with different personalities who live together.\nOfficial Indonesian Translation"},{"name":" Ramen Ikaga!?","avatar":"https://mangadex.org/covers/5e0b8b54-def9-429e-aa12-82beab02b6df/6f109d83-8dfa-4357-8299-2e69137b3bfa.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Comedy,Boys' Love,Fantasy"],"nutshell":"Culture Shock is a bitch. On Earth, pouring boiling water over a bowl of instant Ramen means you're hungry. On Planet Cup Ramen, where the women are human sized and the three-inch tall, Instant sized men need to be brought up to human size by, you guessed it, pouring hot water on them. It's also a proposal of marriage. Sumire was only hungry, but Prince Kanmen is very persistent, and between various fiancées, older brothers, younger brothers, obsessive SM handmaidens and popstars, Sumire may just end up marrying Kanmen out of sheer exhaustion.\nAlso includes a short story, \"Gold.\""},{"name":" Osomatsu-san - Stockholm no kanenone wa naranai (Doujinshi)","avatar":"https://mangadex.org/covers/5e0f740e-3db2-4278-b59d-dcc2ab79eced/8f7bc67c-6476-486b-b854-6aa8fd2703b2.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Psychological,Boys' Love"],"nutshell":"Tougou x Osomatsu Matsuno"},{"name":" First Time Acting?!","avatar":"https://mangadex.org/covers/5e10c490-eb94-4537-aa97-83cd119b386a/ba1ab0e1-dd2e-4176-bbad-93c8d008621c.png.256.jpg","country":"Korean","stat":"7.88","status":"Hiatus","tags":["Long Strip,Romance,Drama,Web Comic,Full Color"],"nutshell":"Hot Blooded high school student Moon Sia followed her boyfriend and joined in taking acting lessons… \"Huh?! Webdrama audition? But it's only been two days since I applied?\" An acting munchkin's growth story starts!"},{"name":" Ekiben Hitoritabi","avatar":"https://mangadex.org/covers/5e12f46a-a0f3-49c1-8ea9-cf126bd88593/c7a8bada-94fb-4209-afba-54398d490b53.png.256.jpg","country":"Japanese","stat":"8.20","status":"Completed","tags":["Slice of Life,Cooking"],"nutshell":"Most people would be concerned about getting a ticket to go around the country by rail, alone, for their wedding anniversary, with their significant other calling it a special break from them - but not Daisuke Nakahara. For this thirty-five year old train and ekiben (train station box lunch) enthusiast, a trip around Japan - spotlighting each region's seasonal delicacies - is the present of his dreams, with each stop - and tasty titbit - telling a story about the region's food and its history. The first stop in his trip, Kyushu, by special express sleeper train, And from there, the track less travelled."},{"name":" Hanamaru GO! GO!","avatar":"https://mangadex.org/covers/5e149723-8d3e-49f5-b467-353416496c54/d4572ca7-dd52-49ee-9be3-a95b73d6319b.gif.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Sports,School Life"],"nutshell":"New school, new teachers, a new class, new friends... and basketball.\nAll these things that Ishizuka Sakura are looking forward to are rudely interrupted by the fact that she's running late on her first day of high school! Everything is a mess with her being told the wrong directions to the auditorium, and after school when she looks to relax and play some basketball... she meets the legendary Miyamoto Hayato and Tadashi twins.\nShe wants to team up with them, but will they accept...?! Read and find out!"},{"name":" Shin Lone Wolf and Cub : Ippiki Ookami","avatar":"https://mangadex.org/covers/5e246110-de96-4492-aa7f-1e3f0aa28fef/d43665f4-cb3a-4ee5-a0b4-f397f04fcb14.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Historical,Action,Martial Arts,Samurai,Adventure,Drama"],"nutshell":"Ogami Itto, the Lone Wolf, and his nemesis, Yagyu Retsudo, lie dead on the field of their titanic duel. Ogami's young son, Daigoro, will not leave his father side, and none dare help the child, none save Togo Shigetada, a samurai on a desperate and deadly mission of his own!"},{"name":" My Girlfriend's a BL Author, What Do I Do?","avatar":"https://mangadex.org/covers/5e29d71a-cc93-4b76-8684-938d7909c951/976c4f81-d19d-4b95-a5e8-343b0f0cfae1.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Romance,Comedy,Slice of Life"],"nutshell":"My girlfriend's a BL author, What do I do?\nLove her more."},{"name":" Help me! Ancestors","avatar":"https://mangadex.org/covers/5e2acc1c-c647-420f-96cd-3fa4fc047fa5/e06c63ed-a4e2-4fe1-807f-d4431044d08c.png.256.jpg","country":"Chinese (Simplified)","stat":"8.00","status":"Ongoing","tags":["Comedy,School Life,Web Comic"],"nutshell":""},{"name":" Masca","avatar":"https://mangadex.org/covers/5e2dc4f4-e31b-4c34-a799-3601f1548778/802f6edb-3823-466b-ba55-9fb433be9610.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Completed","tags":["Demons,Romance,Reverse Harem,Magic,Drama,Fantasy,Supernatural"],"nutshell":"The Devil's Castle was a dark and somber place, until the good-hearted apprentice ASARELLA stumbled on it in a goodwill mission, against her master's wishes–the archmage ELIWHO. Things sour quickly, as Asarella was bound with a blood pact to the Devil, KAINEN. Little did she know, the mage harbors a secret love for her that will only complicate her training for the upcoming apocalyptic battle. This sets up the most unusual love triangle of all space and time."},{"name":" Karasu no Yomeiri","avatar":"https://mangadex.org/covers/5e3383b5-8942-44f3-ae4b-4ed09060122a/6659133f-c202-464f-a11c-e6f365f0a307.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Boys' Love,Drama,Fantasy,Slice of Life,Supernatural"],"nutshell":"For generations, the Kagurazaka family have possessed the power to speak with the messengers of Inari, a power that has been sustained through the centuries by intermarriage with women of the Ujou family. Having waited long for his bride, Rio, the current heir to this power, is shocked to find himself abandoned by his bride-to-be when she elopes with another man.\nShortly after, her younger brother Nagi presents himself to the shrine as her replacement, declaring, “As a man, I can’t produce offspring, but I can have sex.”\nA story of family scandal involving an emotionally wounded young man and the conflicted heir to the shrine."},{"name":" I'm Home","avatar":"https://mangadex.org/covers/5e363ab3-da90-44da-ab1b-5f43b66d2afb/2358141e-f786-4715-9181-8e834e4d235a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Award Winning,Psychological,Drama"],"nutshell":"The hero, nearly killed by carbon monoxide poisoning while on a solo assignment in another city, loses his memory and can no longer recognize his own family. Unconsciously, his feet carry him to the homes of his former lover, his parents, old friends. As he journeys, he follows the threads of their memories to find out what kind of person he used to be. The clear story line and design draw readers into this powerful work.\nWinner of the \"1999 (The Third) Agency for Cultural Affairs Media Arts Festival Grand Prize"},{"name":" Saeki-sanka no Black Cat","avatar":"https://mangadex.org/covers/5e39f490-a489-46ec-afbd-4af0eee72842/eee0afb8-34a4-4482-9b3b-2e4aecb0a0ba.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Ongoing","tags":["Animals,Comedy,Office Workers,Slice of Life"],"nutshell":""},{"name":" Suit no Okumade Ijimete Ageru","avatar":"https://mangadex.org/covers/5e3f6531-18a9-49db-9209-118e309c4ae0/743d7f7b-fac1-464f-ac6e-751dba7c49b0.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Boys' Love,Drama"],"nutshell":"“Can you cum from just me playing with your ass? Show me.” Aitani, an earnest tax inspector, has suffered so much abuse while collecting taxes that he’s inadvertently awakened to his masochistic tendencies. A man named Sakimura immediately recognizes his fetish, and constantly pushes Aitani around, playing with his body in various ways and taking him to sexual shops! Aitani can’t help but be attracted to Sakimura, but… who is he, really?"},{"name":" Drop","avatar":"https://mangadex.org/covers/5e401a0d-2a2f-4879-bd5a-2c277828f5bf/da2afd8f-055a-443e-973e-1bb1b8558aaa.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"This is the story about a forbidden relationship. An innocent girl falls in love with a boy who has a secret…\nIncluded one-shots:\n\nUwaki na Kizuato (浮気な傷跡)\nOroka na Toomawari (愚かな遠回り)"},{"name":" The Legendaries","avatar":"https://mangadex.org/covers/5e418660-a917-47f5-8402-e6ee0089ebf1/324ab8f8-a7fa-4059-b4f3-839c70de36d2.png.256.jpg","country":"French","stat":"8.10","status":"Completed","tags":["Action,Comedy,Adventure,Magic,Drama,Fantasy,Full Color"],"nutshell":""},{"name":" BL Game no Shujinkou no Otouto de Aru Koto ni Ki ga Tsukimashita","avatar":"https://mangadex.org/covers/5e45dabe-1c2e-4c70-81a0-fc101e8277ba/80bb30f6-2104-42cb-bace-76b0986a7db2.jpg.256.jpg","country":"Japanese","stat":"8.40","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,Harem,Isekai,School Life,Fantasy,Slice of Life,Adaptation"],"nutshell":"Reincarnating from a fujoshi to the younger brother of a BL game MC!!\nAll I wanted was to watch over my older brothers, but I became the main character?!\nA working-class adult fujoshi reincarnates as the younger brother of the BL game protagonist that I played in my previous life. It's after my elder brother gets together with one of the game capture targets... From watching the \"happy ever after\" of the \"oshi couple\", to seeing how the other brokenhearted capture targets bounce back, this position is just too delicious!!! But when I was playing the game, there was no \"younger brother\"?!!"},{"name":" Tadashi Ore wa Heroine Toshite","avatar":"https://mangadex.org/covers/5e49b64c-37b1-441a-acdd-9b02913ef907/9fd8de36-451a-4bc2-86ba-e52d9b40de6c.jpg.256.jpg","country":"Japanese","stat":"7.56","status":"Completed","tags":["Genderswap,Romance,Comedy,Video Games,School Life,Slice of Life,Supernatural"],"nutshell":"After the manufacturing company of R-18 dating sims undergoes dissolution, an obsessed 30-year-old virgin visits a deserted shrine and requests to be sent to the world of their masterpiece, Kokorone Heartful.\nAlthough his wish is granted, the god mistakenly turns him into the heroine instead of the protagonist. Ordinarily the romancing choices are left to the protagonist. However, unless he completes the game as the heroine, he will be forced to remain in Kokorone Heartful as a woman forever.\nWill he be able to complete the game in this state?\nPixiv"},{"name":" Kirakira no Sekai","avatar":"https://mangadex.org/covers/5e55d409-8b72-4b54-91f4-8cda0800bc0b/aed3c03c-5ec8-47cb-ad3f-df0a30664bce.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,School Life"],"nutshell":""},{"name":" Oh, Dear Nemesis","avatar":"https://mangadex.org/covers/5e56feef-0277-4af9-8a3e-ce7ecc3bcdce/5dc00cf9-cce6-4d4d-bbd3-e0180f313e69.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Time Travel,Long Strip,Romance,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"The moment she believed she won, everything went back to the beginning.\nKalmia Phlox, whose dead brother came to life, was engaged to a man she was close to, and had a relationship with the man she was in love with. In her very different relationships, she comes closer to a truth she did not know in her previous life…\n“It’s greed to wish for something you don’t have the ability to handle!”\n“Yes, I know. I’m being greedy. Do I need permission to be greedy?”\nShe’ll be the Countess again in this life. It’s not a lucky title, but it was won with her own strength, so she’ll be a perfect Countess who is nobody’s scarecrow.\n\nCalmia Phlox is given a second chance at life, but this time, she must compete against her beloved twin brother to gain back her coveted status and title as Countess Phlox. What’s more, her nemesis wants to... marry her?! Striking a deal with her former archenemy, Rudbeckia, while struggling between her ambitions and her fondness for her brother, will Calmia reclaim what is hers?\n\nOriginal Novel: R15, R19\nOriginal Webtoon: Naver Series, Naver Webtoon\nOfficial Translations:\n\nEnglish\nChinese (Simplified) / 汉语\nIndonesian / Bahasa Indonesia\nJapanese / 日本語\nThai / ภาษาไทย"},{"name":" I'm Telling The Teacher","avatar":"https://mangadex.org/covers/5e5a2ecf-4b9a-4f44-969f-f4a92369ee5d/0d225ab7-6d18-42e1-8ad3-3840c3e3e0e3.png.256.jpg","country":"Chinese (Simplified)","stat":"7.99","status":"Ongoing","tags":["Official Colored,Long Strip,Comedy,Boys' Love,School Life,Slice of Life,Full Color"],"nutshell":"Lu Bei, the delinquent big brother who dominates the entire district, suddenly declares that he wants to be a good student! Carrying the \"Student Rulebook\" like a Bible everyday, swearing not to get into fights again. When the Boss of a rival gang came to seek trouble, Lu Bei couldn't bear it and finally... goes to tell the teacher?! At the same time, 700 points scorer Ye Siya transferred to this delinquent school to continue his studies. Getting preferential treatment from the principal and teacher, this perfect student, however, always speaks bluntly. In the end, Lu-ge, the only one with most courage took the initiative: hey, Ye Beicui classmate, teach me how to study? Transferred Student: Let go. My name is Ye Siya, not Ye Beicui."}]