[{"name":" Mezametara Saikyou Soubi to Uchuusen-mochi Datta no de, Ikkodate Mezashite Youhei Toshite Jiyuu ni Ikitai","avatar":"https://mangadex.org/covers/8791c515-0245-4fcc-81cc-22863a0aba6b/60aac146-ca0a-4d4d-856f-c43c66239b4c.jpg.256.jpg","country":"Japanese","stat":"8.32","status":"Ongoing","tags":["Sci-Fi,Action,Romance,Comedy,Mecha,Harem,Military,Isekai,Monster Girls,Aliens,Supernatural,Adaptation"],"nutshell":"Sato Takahiro was an ordinary office worker and hobbyist gamer until the day he woke up on a spaceship–one that strangely resembled a craft from a favorite space-shooter game. With a decked-out ship, a crew full of babes, and a fantastic universe to explore, he’s going to make the most of his good luck and create the life he’s always dreamed of!\n\nLinks:\n\nOfficial English Light Novel"},{"name":" Hayate no Gotoku!","avatar":"https://mangadex.org/covers/9a247e9e-3f89-4bc9-bd33-6b36616502b9/12e9aef3-bee0-4b1d-a7a9-a734d7f9764f.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Action,Romance,Comedy,Adventure,Harem,Drama,School Life,Slice of Life,Supernatural"],"nutshell":"Ayasaki Hayate, 16, the world's unluckiest boy.\nWorking hard as a child for food and school fees, his unemployed and indebted parents sold him to the yakuza for his internal organs. After temporarily escaping the criminals and contemplating the benefits of a life of crime, he was saved by a wealthy young girl, who now employs him as a live-in butler."},{"name":" Bokura no Mitsudomoe Sensou","avatar":"https://mangadex.org/covers/6c9fdd28-5284-43e9-815d-1a92a522564d/437bd539-9a46-47b4-a04e-89653036dd1a.jpg.256.jpg","country":"Japanese","stat":"7.49","status":"Completed","tags":["Comedy,Boys' Love,School Life"],"nutshell":"Takahiko can't stand Aizawa, a student in another class. As for the reason why: it seems that Aizawa has his eye on Takehiro, a mutual friend.\nTo save Takehiro from Aizawa's evil clutches, Takahiko plans an onsen trip so he can reveal Aizawa's true colors. However, when he hears about this idiotic plan, Takahiko's best friend Magi is nice enough to play along, but… Of course there's no way it could all go according to plan. The result is something Takahiko never anticipated!"},{"name":" Believe My Sign","avatar":"https://mangadex.org/covers/87f7e7fb-a2bc-4dee-bf7c-60f1053d78fe/8e1eb83f-bcc1-47a3-993a-b88903b5fd83.png.256.jpg","country":"Korean","stat":"7.86","status":"Ongoing","tags":["Action,Long Strip,Romance,Boys' Love,Zombies,Adventure,Post-Apocalyptic,Drama,Horror,Full Color"],"nutshell":"Soo-jeong is always getting on the self-absorbed Eunchan's nerves since he first appeared before him out of the blue.\nSoo-jeong feels the same way towards the socially inept Eun-chan, who is often harsh towards him.\nTheir ironic relationship develops as they try to survive together, even though they don't trust one another.\nWhat should you trust? Your past experiences and memories, or intuition?"},{"name":" Let's Meet Again Tomorrow","avatar":"https://mangadex.org/covers/86a558d7-fa7b-4277-8879-c51d810ad5d5/7e8b5381-9cdc-4843-bd3e-deefb51c80a3.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Girls' Love,School Life"],"nutshell":"High school girls meet and fall in love on the train."},{"name":" Villager A Wants to Save the Villainess no Matter What!","avatar":"https://mangadex.org/covers/ffbd1ee1-65e8-45d4-ba03-6441f584b74b/f9979798-820d-472c-b4ad-8ff901505ebf.jpg.256.jpg","country":"Japanese","stat":"8.24","status":"Ongoing","tags":["Adventure,Magic,Isekai,School Life,Fantasy,Villainess,Adaptation"],"nutshell":"Allen, an eight-year-old boy from a poor family in the royal capital, is living a poor but happy life together with his mother. One day, however, memories of his previous life suddenly come back to him and he remembers that he is in an dating sim game and that the capital will be destroyed by war if he doesn’t do something about it. If this continues, both he and his mother will be killed! With a sense of urgency, he decides to rise to the occasion in order to save his precious mother’s life and save his favorite character, the villainous young lady Anastasia, the only girl he liked in the game, from her all too tragic and ruinous end.\nThis is the story of a man who isn’t even a character in the game, but who strives with his steely determination and uses all the knowledge he has to turn overcome fate!"},{"name":" Chiyo-chan no Yomeiri","avatar":"https://mangadex.org/covers/2b986a4b-d259-4b1b-b0c9-c29a28236fa2/3bd324fa-af18-4e4e-ac15-f402199fcac6.jpg.256.jpg","country":"Japanese","stat":"8.30","status":"Completed","tags":["Romance,Comedy,Girls' Love,Drama,Fantasy,Supernatural"],"nutshell":"A collection of Itou Hachi's doujinshi re-published in tankoubon by Ichijinsha.\n\n\nShuujuu Yuri Hon (Mistress-Servant Yuri Book)\nA story about a sickly mistress and her female servant who loves her.\n\n\nHaru ni Furu Yuki (Snow of Spring)\nShiro is a little girl who lives in a small village. Being the only one without animal ears on her head they call her cursed. One day a researcher steps by.\n\n\nChiyo-chan no Yomeiri (Chiyo-chan's Marriage)"},{"name":" Little Tyrant Doesn't Want to Meet with a Bad End","avatar":"https://mangadex.org/covers/79417920-7081-4f02-bc61-e4ef3bb058fd/8d6ded01-ba33-4040-ba37-78396d4cb464.png.256.jpg","country":"Chinese (Simplified)","stat":"8.19","status":"Ongoing","tags":["Action,Ghosts,Long Strip,Magic,Fantasy,Web Comic,Full Color"],"nutshell":"The day the little aristocratic tyrant, Roel Ascarte, met his younger foster sister was the day he regained his memories of his past life—and realized that this was the world of a popular gal game that he had played before. What’s more, he was the main route's antagonist! Just how can he avoid his demise? Now that Roel has awakened to the system, he sets off on the path of self-preservation!"},{"name":" Gundam Build Fighters Plamo Diver: Kit & Built","avatar":"https://mangadex.org/covers/a4ede9fd-0ccb-495d-8a94-2fd4e2dc9780/3dac84b9-3a1f-4718-9202-35f27953a038.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sci-Fi,Action,Mecha"],"nutshell":"Kit Tenjin, beginning Gunpla Battler, meets the ghost Built Tateyama! Two schoolchildren, a genius and an airhead, team up in hopes of becoming the very best!"},{"name":" Yuiitsu Muni No Saikyou Tamer","avatar":"https://mangadex.org/covers/6f7b4a77-31ca-4ba6-a4a1-ecaa6a66ee1e/34ceeaf4-72cf-4e33-b5a0-7d7779f5f89b.png.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Monsters,Action,Comedy,Adventure,Magic,Fantasy,Adaptation"],"nutshell":"web novel  (jp)"},{"name":" Kunoichi Tsubaki no Mune no Uchi","avatar":"https://mangadex.org/covers/1ab5f7e0-7768-457c-9f63-19471b6503cc/c095945e-6b4f-4651-8469-568343ae9278.jpg.256.jpg","country":"Japanese","stat":"8.24","status":"Ongoing","tags":["Ninja,Comedy,School Life,Slice of Life"],"nutshell":"The isolationist Akane Clan, composed of an all-girls body mainly consisting of young kunoichi in training, has a code to which they all must adhere:\nAs men are beings of danger, to exchange with them is forbidden.\nKunoichi Tsubaki, the leader of the Dog Squad, is an excellent trainee with a promising future, but she has started to experience a strange feeling in her heart… whenever the subject of boys is brought up."},{"name":" Hana Tokidoki Kuma","avatar":"https://mangadex.org/covers/125c8fed-c991-44d2-88ce-244e08bee195/a7a4feff-8401-4f8a-8355-df5fc1d6fab2.jpg.256.jpg","country":"Japanese","stat":"8.65","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"A high school student, Sumito, who had just been playing with his friends, is currently absorbed in the coffee shop's notebook. While perusing the notebook, he replies to a comment written out in beautiful characters. From that day on, the interaction between him and his favorite \"girlfriend\" at the old coffee shop continued without any direct contact, and Sumito's love grew day by day. One day, Sumito learned that the \"person from the notebook\" would come to the store, and he eagerly visited the store, but what was waiting for him wasn't the pretty girl that Sumito had dreamed of, but someone 190cm tall… It was a giant man, Koguma!"},{"name":" Konchuki","avatar":"https://mangadex.org/covers/b86bb86b-a377-467b-a01c-ec29134ac036/74052c2b-1b8a-41fa-ab3f-049ecde46832.png.256.jpg","country":"Japanese","stat":"7.20","status":"Completed","tags":["Sci-Fi,Time Travel,Comedy,Harem,Monster Girls"],"nutshell":"One day, a boy who loves Insects, \"Anri Kajimi,\" meets \"Makiri Oka,\" an Insect girl (Konchuki) who came from 100 years into the future. Oka, who is a \"Konchuki\" with the characteristics of both a human being and a insect, presses him into \"mating with her\"."},{"name":" Tate no Yuusha no Nariagari","avatar":"https://mangadex.org/covers/0f237a5f-07ad-4e43-bbd9-2a320694434d/5cbe9b30-7b15-40d1-9ff4-e56e6da95449.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Ongoing","tags":["Reincarnation,Monsters,Action,Animals,Romance,Survival,Adventure,Magic,Harem,Isekai,Drama,Fantasy,Monster Girls,Adaptation"],"nutshell":"Naofumi Iwatani, an uncharismatic Otaku who spends his days on games and manga, suddenly finds himself summoned to a parallel universe! He discovers he is one of four heroes equipped with legendary weapons and tasked with saving the world from its prophesied destruction.\nAs the Shield Hero, the weakest of the heroes, all is not as it seems. Naofumi is soon alone, penniless, and betrayed. With no one to turn to, and nowhere to run, he is left with only his shield. Now, Naofumi must rise to become the legendary Shield Hero and save the world!"},{"name":" Positively Yours","avatar":"https://mangadex.org/covers/40da1219-1860-4d7f-b823-d3511ac67cac/2e5569b8-76c4-401f-a59d-e2aa37ff6d1c.jpg.256.jpg","country":"Korean","stat":"8.67","status":"Completed","tags":["Long Strip,Romance,Drama,Web Comic,Slice of Life,Adaptation,Full Color"],"nutshell":"To Hee-won’s dismay, the BFF she crushed on and her other BFF are now dating! Seriously bummed, Hee-won decides to go wild just one time, and find solace with a handsome stranger. A very satisfying one night affair has now turned into more — she’s pregnant! Fate brings them together again, and now the regimented Doo-joon is determined to do the right thing and marry her. But they’re basically strangers! Except… their bodies have been very intimately acquainted. What’s this mother-to-be to do?\n\n PT-BR\nPara o desespero de Hee-won, seu melhor amigo que ela sempre gostou e sua melhor amiga agora estão namorando! Muito chateada, Hee-won decide enlouquecer apenas uma vez, e encontrar consolo com um estranho bonito. Um caso de uma noite muito satisfatório agora se tornou algo mais - ela está grávida! O destino os une novamente, e agora o disciplinado Doo-joon está determinado a fazer a coisa certa e se casar com ela. Mas eles são basicamente estranhos! Só que… seus corpos são intimamente familiarizados. O que essa futura mãe deve fazer?\n\nBased on the Original Webnovel by LEE Jung."},{"name":" A Galaxy Next Door","avatar":"https://mangadex.org/covers/9496f98c-78b9-46d0-a092-d4ccc6759cc9/cc99f9a8-0273-4cf1-bafc-6b718a9407d8.jpg.256.jpg","country":"Japanese","stat":"8.82","status":"Ongoing","tags":["Sci-Fi,Psychological,Romance,Comedy,Survival,Drama,Slice of Life,Aliens,Mystery,Tragedy"],"nutshell":"After the death of his father, Kuga Ichirou, a shoujo mangaka fresh out of high school, has to take care of his two little siblings, Machi and Fumio, all by himself. Struggling to meet a deadline after his previous assistants get their manga debuts, he hires a new assistant through his editor. However, his life takes an unexpected turn after this new assistant is revealed to be a beautiful and mysterious girl…\nOfficial English"},{"name":" Tokyo Aliens","avatar":"https://mangadex.org/covers/3843d4d1-ddde-430e-91d7-7f9a322b1116/647a0bf5-5576-4b06-a6b9-ceec45ecfc42.jpg.256.jpg","country":"Japanese","stat":"8.51","status":"Ongoing","tags":["Sci-Fi,Action,School Life,Police,Aliens"],"nutshell":"Gunji Akira, who has just started high school, has been chasing after his father's ghost by trying to become a police officer just like him. One day however, he has a surprise encounter with an alien while leaving school. And there begins the start of his fateful adventures with extraterrestrial life…\nNote: It runs in a seinen magazine and will not be BL. At most, just as Fujobait as any shounen sports manga."},{"name":" Hime Hiro","avatar":"https://mangadex.org/covers/007c16b6-f30d-444e-b8c9-96bd8417192f/240f1bdf-63ce-49c7-ba3c-1cb5138c12ec.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"Hime and Hiro are a normal couple in high school… except that Hime has a tendency to bite Hiro."},{"name":" I Was Born as the Seventh Prince, What Should I Do?","avatar":"https://mangadex.org/covers/8357f8a7-bb0d-46cf-ba65-f6140e721f98/c6c6145b-8878-4e5c-b6b3-a502cecbc7d3.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Ongoing","tags":["Comedy,Adventure,Magic,Isekai,Fantasy,Mystery,Adaptation"],"nutshell":"In rare cases, there are children that have reincarnated while holding the memories of their previous lives. Dependent on the god's caprice, they will be reincarnated into another world. One such case is the seventh prince of a certain kingdom.\nThe eldest son is the crown prince, the second, the third a diplomat, the fourth is bewed to the princess of another country, and the fifth and sixth are geniuses in music and art. Wait? Then what's left for me?"},{"name":" If I Get Serious, I Can Kill You","avatar":"https://mangadex.org/covers/5ae836aa-95fa-4f18-8b02-b5f6c261be5c/3de71a6c-3311-4298-96b1-e6c3791fd150.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Comedy,Philosophical,Slice of Life"],"nutshell":"Sakurako Kurahashi, 18 years old. I'm a reserved and quiet college student and today I'm going on a date. But don't underestimate me just because I'm a woman. Because I can kill you if I really try!"},{"name":" Teirui Makura","avatar":"https://mangadex.org/covers/877dca6d-6561-4910-8e60-563dcd9d98b0/6efe698b-c175-4e0b-acda-dd8b76f18782.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Sci-Fi,Romance,Comedy,Boys' Love,Incest,Drama,Fantasy,Supernatural"],"nutshell":"Collections of oneshots:\n\nTeirui Makura\nPopular honor student little brother, Yuua, and his kind older brother, Seigo. One step ahead in the puberty department, Seigo tries to put a little distance between him and his cute little brother. However, the innocent little brother is to blame with his defenseless skinship. Finally, Seigo's lust consumes him and he can't endure anymore. Once Yuua accepted that idea, his desire to be attached to his brother grew stronger every day.\n\n2-3. Finger Biting, The Moon's Colorful Person\n\n\nChoroize! Jigoku\nA constant failure at job interviews thanks to his scary expression, Danda's employment agent sends him on a rather unusual assignment.\n\n\nLoup-Garou Gokou extra\nA short extra to Loup-Garou Gokou, chapter 9 in Hide and Seek.\n\n\nNatsu ni Shini Yuku Monogatari (Dangerous Symphony)\nRock and Homero live in a world, where all kinds of laws restrict people and you can get arrested for the simplest things. Naturally, being love with another man is frowned upon."},{"name":" Yokubou Pandora","avatar":"https://mangadex.org/covers/69b4df2d-5ca3-4e58-91bd-74827629dcce/fc271091-58fb-4578-aaae-5aad0de920eb.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Ongoing","tags":["Demons,Romance,Comedy,Fantasy,Supernatural"],"nutshell":"Guy with crazy armpit fetish gets a ring that gives him a demon that is there to pleasure him, and he starts off by going ham on the demon's armpit.\nNote: Extreme ecchi, not a hentai (do not tag as hentai).\n\nBookwalker Links:\nVolume Version\nChapter Version"},{"name":" Koi da Ai da wa Sateoite","avatar":"https://mangadex.org/covers/ff22d8cb-a5d7-444a-993e-e0e965fb171c/a4c498be-0b0c-405c-8cf7-8fb869338899.jpg.256.jpg","country":"Japanese","stat":"8.21","status":"Completed","tags":["Romance,Comedy,Boys' Love"],"nutshell":"On the way home from work, Okazaki Taichi finds a man named Fuji sleeping on a bench one day. Okazaki brings Fuji to his house, and somehow ends up on top of him. They become friends with benefits. It's the start of an erotic BL between a heterosexual salaryman and a lewd bartender."},{"name":" Hyakujitsu no Bara - Thorn Crown (Doujinshi)","avatar":"https://mangadex.org/covers/6e814c5e-ce39-4e35-b371-ced2c3d86238/5f966963-e5c2-419b-8eef-e3d66b98e44d.png.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Boys' Love"],"nutshell":"Hyakujitsu no Bara side story, taking place after vol 2."},{"name":" I Am Troubled That My Fiancé Is a Villain","avatar":"https://mangadex.org/covers/d58b3f3c-d732-4105-8484-782576a1cb61/56f656a5-ae76-473e-9ff9-ef5d794b2177.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Reincarnation,Romance,Comedy,Video Games,Isekai,Drama,School Life,Villainess,Adaptation"],"nutshell":"Lizzia is reincarnated into an otome game world as a mob character.\nShe decides to live with two lives worth of filial piety, however, she has been betrothed to Bernhardt, the last villain in the prince' Route. This is the struggle of Lizzia as she tries for a peaceful life."},{"name":" Pumpkin Night","avatar":"https://mangadex.org/covers/4e421eb8-d4a0-4096-86db-ca5e3fc42c5d/50d0d034-d01d-4be8-88f3-dd029c6debfa.jpg.256.jpg","country":"Japanese","stat":"7.48","status":"Ongoing","tags":["Action,Psychological,Drama,Horror,Tragedy"],"nutshell":"A deformed female human goes out with a pumpkin on her head to kill all those who bullied her in the past after escaping from a mental hospital."},{"name":" Koi da Ai da wa Sateoite - After Story","avatar":"https://mangadex.org/covers/1c631434-b7d9-4370-83f0-b715fb8461a0/9e77c3fb-bd8a-45c5-9634-f6d926e15106.jpg.256.jpg","country":"Japanese","stat":"8.33","status":"Completed","tags":["Oneshot,Romance,Comedy,Boys' Love"],"nutshell":""},{"name":" Boku no Tsuma wa Kanjou ga Nai","avatar":"https://mangadex.org/covers/509b1474-cb0a-4f9d-8ca4-95cb44c9b8db/2a476805-c331-46ed-9adf-b267e612d9fe.png.256.jpg","country":"Japanese","stat":"9.06","status":"Ongoing","tags":["Sci-Fi,Psychological,Romance,Comedy,Philosophical,Drama,Slice of Life"],"nutshell":"A story about the humble marriage of a corporate slave salaryman and a housework robot."},{"name":" Hasta que confieses","avatar":"https://mangadex.org/covers/16ffd56e-32a9-4e45-a044-df684b4ebd7d/cf30f9d8-f91b-4e91-9923-c03123a86127.jpg.256.jpg","country":"English","stat":"7.90","status":"Ongoing","tags":["Boys' Love,School Life,Web Comic"],"nutshell":"Luka se ha acostumbrado a vivir como un chico. Ya tiene su vida planeada, bien como está, hasta que este chico, Rei, fue y se confesó. Entonces, se dio cuenta de que… ¿tal vez su vida no era tan buena como pensaba? Siempre hay algo que guarda en su interior… siempre había querido vestirse como una chica."},{"name":" Last Quarter","avatar":"https://mangadex.org/covers/237c31d7-ef4d-4caf-b5c3-58089d3c1783/8d195f91-6a2b-4bda-a5e6-bce9e2e77d24.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Completed","tags":["Psychological,Romance,Drama,Supernatural,Mystery,Tragedy"],"nutshell":"From Storm in Heaven:\nMizuki is a girl who wants to run away from her life. As she smiles at everything sad that happens to her, her soul becomes heavier day by day. Her escape door is Adam, an English singer. But is he really real, or is everything they've been through just a dream? Adam sees his dead Japanese girlfriend in Mizuki, but strangely, nobody, apart from a girl who met her at the gates of heaven, can see Mizuki. This is a story that takes place somewhere between dream and reality."},{"name":" Harta Alternative 2019-AUTUMN","avatar":"https://mangadex.org/covers/751fb01e-3391-4d9f-9067-7894035b5bf6/e4050677-b7ed-497a-aa36-784582dcd7fd.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Anthology"],"nutshell":"Contents\n[01]赤瀬由里子（あかせ・ゆりこ）「80's video trip」\n[02]山本和音（やまもと・かずね）「ナイトゲーム」\n[03]黒川裕美（くろかわ・ゆみ）「黒髪を舞うころ」\n[04]富沢未知果（とみざわ・みちか）「ハートのお仕事」\n[05]樫木祐人（かしき・たくと）「うすべに」\n[06]福島聡(ふくしま・さとし)「ゾンビのビビ」\n[07]サカノ景子（さかの・けいこ）「円楼暮らし」\n[08]松本水星（まつもと・すいせい）「午前１時の同窓会」\n[09]長蔵ヒロコ（ながくら・ひろこ）「ククリヒメ」\n[10]佐々木尚(ささき・なお)「テイラーとクリスの事件簿」\n[11]山本ルンルン（やまもと・るんるん）「魅惑のタピオカミルクティー」\n[12]三星たま（みつぼし・たま）「スター・ドリーマー」\n[13]高橋那津子（たかはし・なつこ）「夏の夜」\n[14]右野マコ（みぎの・まこ）「預言者カロン」\n[15]高江洲弥（たかえす・やや）「洋裁店の蝶」\n[16]佐々大河（さっさ・たいが）「不利な相手」\n[17]吉田真百合（よしだ・まゆり）「愛の焦土」\n[18]川田大智(かわだ・だいち)「100人の百子さん」\n[19]浜田慶亮(はまだ・けいすけ)「豪烈送球」- 「どうすればハンドボールの迫力を漫画で伝えられるだろうか？」\n[20]冨明仁（とみ・あきひと）「ランランランダ」\n[21]仁科彰太朗（にしな・しょうたろう）「つきの裏側」\n[22]井上きぬ（いのうえ・きぬ）「彼らのルナシー」\n[23]長沼修(ながぬま・おさむ)「アダンソンちゃん生活史」\n[24]百名哲（ももな・さとる）「キラキラ星」\n[25]佐藤春美（さとう・はるみ）「緋袴をぬがさないで」\n[26]丸山薫（まるやま・かおる）「琥珀の鳥の夢」\n[27]嵐田佐和子（あらしだ・さわこ）「子連れ魔王」\n[28]大武政夫（おおたけ・まさお）「ラークの大冒険」\n[29]かまぼこRED（かまぼこれっど)「おかあさんといっしょ」\n[30]渡邉紗代（わたなべ・さよ）「みちのくピンポンステーション」\n[31]四方田千紘（よもだ・ちひろ）「浴槽のシンデレラ」\n[32]namo（なも）「青い夜」\n[33]西原優葵(にしはら・ゆうき)「Lemonade Girl」\n[34]加藤清志（かとう・きよし）「竜巻狂い」\n[35]氷堂リョージ（ひどう・りょーじ）「捨て丸さま」\n[36]八重樫莉子(やえがし・りこ)「俺が一番愛してる！」\n[37]押岡大和(おしおか・やまと)「マイリトルサーモメーター」\n[38]都森れん(つもり・れん)「Lingerie Hunt」\n[39]紙島育(かみじま・いく)「星の手遊び」\n[40]かわもと まい「泡沫サンセット」\n[41]福浪優子「ノウゼンカズラの家」"},{"name":" Tsurugi-san no Meirei wa Zet! Tai!!","avatar":"https://mangadex.org/covers/1dba6997-4e22-4e31-9e49-8ad399d3bd0e/2ff9fa69-9cf8-4ef0-a8f6-62d48feae608.jpg.256.jpg","country":"Japanese","stat":"6.83","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":""}]