[{"name":" Ekrano","avatar":"https://mangadex.org/covers/08ace43b-a2f2-4a70-b2aa-07bd0797ff86/f3108689-29a1-46d5-ac2b-d154a83cef5c.jpg.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Oneshot,Mecha"],"nutshell":"Shiruru and Solotto are riding \"Ekrano Bi-dice,\" machines designed to hunt \"kujirani,\" an alien life-form inhabiting Earth's oceans."},{"name":" Haikyuu!! - A Date, Right?! (Doujinshi)","avatar":"https://mangadex.org/covers/08b06a9e-9858-4c2f-8989-7231398a8939/e4bb0cc9-0ed9-4f17-bf5d-9b82557fdc27.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.56","status":"Completed","tags":["Oneshot,Comedy,Boys' Love,Sports"],"nutshell":"Sequel to Love, Right?!\nAfter Kageyama finally confessed his feelings for Hinata he wants to take his boyfriend out on their first date. Things go as well as can be expected from two volleyball-idiots."},{"name":" My Charming Bandit","avatar":"https://mangadex.org/covers/08b59d73-2a83-4cec-92c3-c37a3f598310/a0052038-4329-464e-9f8d-be5d89d452e3.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Historical,Romance,Comedy,Boys' Love,Drama,Web Comic"],"nutshell":"Tang, a charming noble, almost met his end at the hands of a sleazy prince. Luckily, he awakens to find himself in the home of Cheng, the stunning stranger-turned-bandit who saved him! While recovering in the mountains, the unlikely pair form a bond, but they eventually go their separate ways. Even so, they can’t stop thinking about each other... is there a happily ever after for them, or will their conflicts tear their love apart?"},{"name":" Free! - Alcohol Date (Doujinshi)","avatar":"https://mangadex.org/covers/08b81e29-0cf1-47af-8685-e3aa4d03e5a5/770ae91c-22ff-4710-a8bc-7ee720098658.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":""},{"name":" Bara no Kusari","avatar":"https://mangadex.org/covers/08bc0b5d-3caa-4120-8113-f7e387c1e642/76c40877-cfd8-4e94-bc80-5fdb43e8bb8d.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Romance,School Life"],"nutshell":"When I was only 8 years old, I was attracted to Hagane, who was accepted into our house as the son of a servant. But is duty the only reason why Hagane listens to what I say…? I can’t understand how you feel because invisible chains bind you…"},{"name":" Bronze","avatar":"https://mangadex.org/covers/08c05702-e02b-4e36-9bc9-087cc801ba11/1d117c6e-244a-45f9-ad7b-83a0fe0a16cd.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Psychological,Romance,Boys' Love,Sports,Drama,Tragedy"],"nutshell":"Kouji and Izumi are still playing one step forward, two steps back in their angst-ridden dance of love. The drama is taken to new heights in this series: just how far will Kouji go in his desperate love for Izumi? Will these two ever be together and be happy at the same time?\nNote - Volumes 1-14 have been completely translated into English. However, several years after the supposed finale, the mangaka published 3 more chapters (recently compiled into a 15th volume) which act as an epilogue for the series, though the 14th volume had a conclusion of sorts in itself. Of these, chapter 1: Ai ni Obore, Ai ni Shisu has been scanlated, but chapters 2 and 3, titled Rakuen 1 and 2, have not."},{"name":" Koibito Gokko","avatar":"https://mangadex.org/covers/08c41024-5a99-4ea7-b898-949414102129/d4640b88-144f-4a8c-afd8-79d810bdc1fc.png.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Comedy"],"nutshell":""},{"name":" I Want To Be In Love With A Game Addict!","avatar":"https://mangadex.org/covers/08c6683f-b4bf-4fe2-984e-bbc6eece84b6/2e79a521-ff5a-4d8b-967d-b4de2ea24153.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Long Strip,Romance,Comedy,Boys' Love,Video Games,Web Comic,Full Color"],"nutshell":"It was love at first sight for high school student Jaemin when he saw Sooji. After confessing to Sooji, they started dating, but the problem is, Sooji ignores Jaemin and games all day. For their three year anniversary, Jaemin wants to do this(?) and that(!) with Sooji, so he suggests Sooji a game…a game where you earn points to win a prize; a prize where you can ask the opponent to grant you a wish! Will Jaemin be able to have the lovey lovey relationship he desires with his gaming addict boyfriend?"},{"name":" The Shiki Family","avatar":"https://mangadex.org/covers/08c885ce-08fa-4096-9e93-2d71d2e08edc/7e39a752-8fb2-490f-9794-be6d04efd789.jpg.256.jpg","country":"Japanese","stat":"8.30","status":"Completed","tags":["Comedy,Slice of Life"],"nutshell":"Three brothers lived together and they got a sister.\nThree brothers, Natsuki, Soushuu, and Touma, who spends boring daily life. One day, their mother who came home for the first time in a long time brought them a way younger sister, Haruka …!?"},{"name":" Aoi Shiro - Kaeishou","avatar":"https://mangadex.org/covers/08cb0cbc-1695-4538-af7f-0dfaae0ab65a/3f3c840f-03a9-437d-ae64-d899fa325dcc.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Girls' Love,Drama,Mystery"],"nutshell":"The Seijou Girls Academy's Kendo Club is traveling to Shoushinji for summer training camp. Near there is an island, Urashima, where a demon extermination took place long ago.\nIt happens that this summer something related to that demon extermination is also going to take place as the captain of the team, Osanai Syouko finds a young girl washed up on the beach…\nThis is the official comic based on the PS2 game Aoishiro which is a sister game to Akaiito."},{"name":" Nejimaki Shoukougun","avatar":"https://mangadex.org/covers/08cf89a5-83de-46b7-8cd8-f0b96f404e88/7efed5ce-a808-4440-80da-09e152748b6d.png.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Oneshot,Adventure,Fantasy,Supernatural"],"nutshell":"Certain people suffer from a mysterious disease which causes a wind-up key to appear somewhere on their body. The key has to be wound regularly, otherwise they will stop moving. Miku’s parents, who suffer from this disease, are captured by the authorities, while Miku escapes into the town to seek help from a mysterious boy called Kuro."},{"name":" We Only Held Hands","avatar":"https://mangadex.org/covers/08d86992-fc59-43d7-93be-1d901d43c96e/618abcc1-30c8-473b-b4f1-eb91c2a6f54a.jpg.256.jpg","country":"Korean","stat":"7.86","status":"Completed","tags":["Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"The Ki men can get pregnant if they fall asleep with a person while holding hands. Terry unwillingly saves Mike and passes out while holding hands. Is he pregnant?"},{"name":" Otaku Grandma","avatar":"https://mangadex.org/covers/08d8edc7-dae0-43c2-aad1-329ae70e5282/3c1601fe-a305-4ccb-8c5b-f525706cc730.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Comedy,Slice of Life"],"nutshell":"80歳を過ぎてから二次元キャラの虜になり、オタクと化したおばあちゃんと、ツッコミながらも優しく見守る孫の日常を描いた、〝老後×推し活〟ギャグマンガ！！\nホストも女子高生も巻き込んで、オタクの力を見せつける…！？"},{"name":" Company Grievance Squad","avatar":"https://mangadex.org/covers/08daf943-9d76-44fe-85dc-4c24aebe1f20/b915e54d-324b-4f08-9404-5c8351de0f90.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Action,Psychological,Long Strip,Crime,Adventure,Drama"],"nutshell":"Ilgang Group, the number one business group that controls the Korean economy. However, the inside is steamed and stained with various kinds of corruption and corruption.\nThe chairman, who needed a solution to save the decaying Ilgang group, makes a secret proposal by calling the youngest member of the Ilgang family, Lee Seon-ho, to Korea, who was living quietly in the United States…\n“Humans who treat their employees like dogs and pigs! Our ‘In-house grievance team’ will take care of your abuse!”"},{"name":" Koakuma Model-kun to Fushidara Ecchi","avatar":"https://mangadex.org/covers/08dfcfc0-3804-4570-b531-b9718d74e7d1/9a1c4b44-bcec-4806-b908-fd20e19deb5f.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"“Your face and your cock are just my type.” Though he’s a great-looking guy, university student Daiki has trouble talking to women because he was raised in a family full of brothers. Then, he receives a job as a handyman to clean the home of the highly popular model, Kazuma! Far from the usual shining prince he impresses upon people, Kazuma is a full-fledged slut with a sharp tongue to match, and he sets his sights on Daiki. Devilishly sexy, he bribes Daiki with sex to keep his mouth shut! Daiki can’t keep his eyes from Kazuma, who shows his true colors only to him like a coy kitty cat, nor can he leave that easily turned-on and erotic body…"},{"name":" I Am No Match For My Childhood Friend.","avatar":"https://mangadex.org/covers/08dfe0d5-14ea-4713-bde6-dddcf3513f5b/fc0a78d7-3296-4afe-86fc-dfdb13bbd92d.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Ongoing","tags":["Romance,School Life,Slice of Life"],"nutshell":"After entering high school, Makoto is, for the first time in a while, classmates again with her childhood friend, Tsukasa. Just when she started being happy because she can talk more with Tsukasa again, she is now being led around by his casual words and actions instead! Hey... was that intentional? Is this love?!\nA love comedy about the fluffy and heart pounding daily lives of two childhood friends now begin!"},{"name":" You're Dazzling","avatar":"https://mangadex.org/covers/08e12356-c030-4f56-b65f-391e2e1002d1/cadf13fa-814f-4770-96d3-f0ed15a932eb.png.256.jpg","country":"Chinese (Simplified)","stat":"8.05","status":"Ongoing","tags":["Long Strip,Romance"],"nutshell":"Lin Xiaomu, whose life deeply revolved around playing the “supporting role,” had finally made contact with the school hunk, Huo Dongze, after an incident. In her eyes, he was “dazzling.” Who would’ve thought that he, too, cared a lot about her as well?! Maybe it was the day that I met you that my life had become dazzling and radiating…"},{"name":" Cross-dressing Boy Suspected of Cheating","avatar":"https://mangadex.org/covers/08e169ae-b236-4ec5-93b4-1b5180380601/b9e9044c-f8b8-4d23-a0df-ac19fbf7ffe3.jpg.256.jpg","country":"Japanese","stat":"7.36","status":"Completed","tags":["Crossdressing,Web Comic"],"nutshell":"Creator-approved translations by Hachirumi Scans."},{"name":" K-ON! - Study Time (Doujinshi)","avatar":"https://mangadex.org/covers/08e22327-802f-409e-b2f5-9ee04410bfd6/06ebc2b4-1f51-47b2-84ea-b88f951acfa4.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Girls' Love"],"nutshell":"Azusa x Yui"},{"name":" Aiming At You","avatar":"https://mangadex.org/covers/08e44453-bcb2-4ff6-9160-0db090cb4eb0/ffc88152-e687-481a-9617-364c2b4421c4.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.85","status":"Completed","tags":["Comedy,Boys' Love,Sports,Web Comic,Slice of Life"],"nutshell":"Shao Yiliang has lived at an orphanage for his whole life, and surprisingly he meets his long-lost twin brother in the bathroom! Brothers reunite, and the big brother proposes an exchange: The younger brother goes to a national shooting competition in replacement of him. With identities swapped, how will the fates of these two change?"},{"name":" Touhou - with a smile (Doujinshi)","avatar":"https://mangadex.org/covers/08e68ab9-8102-4370-8f58-b1aa4b2cee1c/477a366a-a307-43b3-a068-b55547c14ccd.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Action,Fantasy"],"nutshell":""},{"name":" Romance Papa","avatar":"https://mangadex.org/covers/08e9267e-89f1-4e30-8ecc-fc7d57f6ca52/6416f502-9191-4c26-a5c1-36ee0d68ceb1.jpg.256.jpg","country":"Korean","stat":"8.09","status":"Ongoing","tags":["Drama"],"nutshell":"Sangbum, a misogynistic and germophobic (that is, mysophobic) plastic surgeon, is shocked to discover that the sperm he donated when he was a medical student has produced a 13-year-old daughter named Myunghae!\nMyunghae's other parents were killed in an accident, so she is suddenly dropped into her biological father's life. Sangbum is unprepared for the responsibility of fatherhood, but he quickly learns to love the daughter who looks so much like him.\nIn the midst of her happy new life with Sangbum, however, Myunghae is shocked to find out that her boyfriend Hyunjoon is going out with her best friend Mijoo. The truth is that Hyunjoon and Mijoo just wanted to teach Myunghae a lesson, but unexpected feelings are growing between them. Meanwhile, a popular student named Donghui is attracted to Myunghae.\nWith so many changes in their lives in so little time, how will the new, small family of two cope?"},{"name":" Yasoukyoku","avatar":"https://mangadex.org/covers/08e9afc8-eab3-4c86-9f5c-ff82bb61180b/e4d6f9d4-3bf2-4ff5-845a-539bb3f54140.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Boys' Love,Drama"],"nutshell":"Shou is the illegitimate son who is mistreated by his family, while Takashi is clearly the favoured son. Shou is being “used” by Takashi. Due to his extraordinary piano playing, Shou is invited to study abroad in Germany.\nWill both, Takashi and Shou, admit to their feelings for each other even if they are apart?"},{"name":" Itsuka Tenma no Kuro Usagi","avatar":"https://mangadex.org/covers/08ea21d7-0a1d-43c8-939a-019967408f69/a9299ef3-c77f-4a61-98db-8a2a16363f5f.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Action,Romance,Comedy,Horror,Supernatural"],"nutshell":"Taito has been really sleepy lately, and keeps dreaming of a female vampire who says she has given him her \"poison.\" Sometimes he even thinks he hears her voice when he's awake. But after surviving an accident that should have killed him, Taito's world changes drastically and he realizes that his dreams are more real than he thought.\nSee AnimeNewsNetwork for the anime.\nSee AnimeNewsNetwork for the anime (OAV).\nWikipedia\nChinese (Traditional)\nEnglish\nJapanese\nPortuguese\nRussian\nSpanish\nTagalog"},{"name":" Magic Club","avatar":"https://mangadex.org/covers/08eac4bf-4a34-4809-858a-edd9b8f0a8a5/d6317ff9-8829-4267-89d3-8e974f300611.jpg.256.jpg","country":"English","stat":"7.45","status":"Ongoing","tags":["Romance,Comedy,Magical Girls,Adventure,User Created,Magic,4-Koma,School Life,Fantasy,Web Comic,Supernatural"],"nutshell":"A comedy manga about a guy and a girl who are addicted to magic. What was their surprise when they found out that magic actually exists."},{"name":" Crystal Palace","avatar":"https://mangadex.org/covers/08fa87c9-5383-4db7-9a99-5a354edc7836/5330deb1-1a35-44ba-b1b5-282515d85f1d.png.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Boys' Love,Incest,Drama,Tragedy"],"nutshell":"Two brothers who were abandoned in the deep of a cold mountain range. The older brother, Tyltyl, is a slut that sleeps with men for just two pieces of tobacco, while at the same time waits for the father that once abandoned them. The younger brother, Mytyl, holds strange emotions towards his brother. Is it because they’re only half related…? Or is it something completely different…? While holding such feelings, one day the both of them find a fallen soldier. A land covered in snow where time has stopped… Even so, days pass ever so quietly. Many people pass through among the seasons. The place at which souls arrive upon agreement is…?"},{"name":" Nichiyoubi no Ichigo-chan","avatar":"https://mangadex.org/covers/08ff391a-7991-4c43-8741-531d7d0b2165/cc86153a-99f2-4481-ac9f-63788b7f3f0f.jpg.256.jpg","country":"Japanese","stat":"8.41","status":"Ongoing","tags":["Romance,Boys' Love,Crossdressing,Web Comic,Slice of Life,Full Color"],"nutshell":"An ordinary high school boy, Yamano Itta, indulges his cross-dressing hobby by transforming himself into a beautiful girl named \"Ichigo\" once a week! One day, \"Ichigo\" ran into Kisaragi, a popular boy at school, and their sweet-and-sour romance will begin......!\nNote: Originally self-published on Twitter as \"女装が趣味の高1男子\" (Josou ga Shumi no Kou 1 Danshi, Crossdressing High School Freshman), the first chapters were collected for commercial publication by Comic Pool on 2022-05-20 with the new name."},{"name":" I’m Cute Enough to Get Away with It!","avatar":"https://mangadex.org/covers/09038e65-417f-40a5-964d-66eddc843cea/b233887a-13d2-443e-8c05-6f1529f473fb.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Romance,Comedy,Crossdressing,Harem,School Life"],"nutshell":"“I know it’s for my sister’s sake, but... Is it really all right to lie to a girl and sleep in the same room as her?!”\n16-year-old shut-in Yoruhiko's twin sister, Akane, ends up in a coma after getting into an accident. Not wanting to ruin her perfect attendance, Yoruhiko decides to continue her record by going to school in her place. But, in order to do so, he must disguise himself as her and attend an all-girls boarding school! How will former recluse Yoruhiko keep up his act when surrounded by his sister's friends and roommate?"},{"name":" Valkyria Engine","avatar":"https://mangadex.org/covers/0909e25d-c463-4ba4-b9fd-95fc7e738fcb/eb3283b8-a23a-4554-a310-6a9958fae664.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Action,Romance,Mecha,Harem,Slice of Life"],"nutshell":"Half a century ago, the human race was attacked by an enemy from the sea known as the AUS. When Reiji Shiroyama was little, he was unable to protect his sister from the AUS because the gun he tried firing jammed. Since then, Reiji refuses to trust guns and only trusts his fists."},{"name":" Deadly Game","avatar":"https://mangadex.org/covers/090cbd15-d32f-4749-865d-e73625d5e777/1a30a3cb-c1cb-4ead-9b23-8b439fef5252.png.256.jpg","country":"Chinese (Simplified)","stat":"7.78","status":"Ongoing","tags":["Official Colored,Long Strip,Boys' Love,Full Color"],"nutshell":"Tseng Chyi, the most popular escort with a deep understanding of how to please his clients, has got his chance to succeed by approaching a young wealthy man with a bad temper. Thanks to him, friends become enemies, brothers turn against each other, and companies are falling apart... When this game of revenge is about to end with his absolute triumph, the truth suddenly revealed turns his whole world upside down..."},{"name":" Swallowed Star","avatar":"https://mangadex.org/covers/09138da1-93f7-4de4-a546-ef8042e91c92/ec28a059-1290-4812-ac00-a2970eb58d99.png.256.jpg","country":"Chinese (Simplified)","stat":"7.88","status":"Ongoing","tags":["Sci-Fi,Action,Adventure,Fantasy,Mystery,Tragedy"],"nutshell":"In the Year 2056, a teenager clad in a tactical vest, combat pants, and alloyed combat boots sat atop a ruined and shattered six story apartment building. The building lies in a Prefecture-level city in the Original Jiangsu area. With a Hexagonal Shield and a Bloodshadow Combat Sword on his back, the young man sat silently on the edge of the roof. Under the brilliant hue from a starry night, it brought forth a breath of fresh air as the night breeze caressed his body. However, within this now ruined city, all was silent… all except for the occasional chill-inducing howls…\nNo ano de 2056, um adolescente vestido com colete tático, calça de combate e botas de combate em liga estava sentado no topo de um prédio de apartamentos de seis andares em ruínas e destruído. O edifício fica em uma cidade no nível da prefeitura, na área Original Jiangsu. Com um escudo hexagonal e uma espada de combate à sombra de sangue nas costas, o jovem sentou-se silenciosamente na beira do telhado. Sob a tonalidade brilhante de uma noite estrelada, ele respirou fundo enquanto a brisa da noite acariciava seu corpo. No entanto, nesta cidade agora arruinada, tudo ficou em silêncio … tudo, exceto pelos ocasionais uivos que causam calafrios …"},{"name":" Shinayaka ni Kizutsuite","avatar":"https://mangadex.org/covers/09156c11-d45f-4be3-ad88-fe944c3e2dc3/555d8d48-1729-4f02-998c-31fb6f35dfdd.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"Ai was just a girl minding her own business when she met him. He was so poor and down on his luck that he couldn't even pay for his own meal. Ai took pity on him and decided to treat him for lunch. What should have been a fairly innocent meeting with him, turns rather strange when she decides to take him home and give him a place to sleep. That should have been all, since he left very early in the morning and nothing unfortunate happened…but is it possible? After how long of a time will she see this beautiful boy again?"}]