[{"name":" Mirai Nikki Redial","avatar":"https://mangadex.org/covers/a02e8bd8-e11a-45c6-ae83-d5541ba54745/7a89f0f5-e5b1-4427-b5c3-e253207f7d83.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Action,Psychological,Romance,Drama,Horror,Supernatural"],"nutshell":"A story that picks up after the first story ends. It tells the tale of the 3rd Universe's Gasai Yuno after her encounter with the Yukiteru and Yuno of the other universes. Her life seems normal, but something feels like it is missing. She can't help being fascinated with the boy in her grade, Amano Yukiteru, because he keeps appearing in her dreams…"},{"name":" Nordiska Sonata","avatar":"https://mangadex.org/covers/a035cc7f-a1b7-40eb-a935-640b4bdd4c21/dfb1868c-626d-4c14-bc14-51d2e62857a8.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["School Life"],"nutshell":"The prequel, Vienna Concerto, is about the relationship Takemiya Keiko has with a talented Japanese boy who attends in the Vienna the music school and writes her letters about his studies and his life."},{"name":" Apple Collection","avatar":"https://mangadex.org/covers/a037e450-6537-4725-aa7b-189fb2586e09/75631bee-1e6b-4321-9593-99cc82a1daa6.jpg.256.jpg","country":"Korean","stat":"7.94","status":"Completed","tags":["Oneshot,Mecha,Anthology,Fantasy,Full Color"],"nutshell":"Collection of oneshots released under Apple Artbook Collection"},{"name":" Tamashii no Futago","avatar":"https://mangadex.org/covers/a03d68c1-69f5-40ea-9424-259a82e0318a/b33e51d6-7776-4b49-9edf-589385807ec1.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Psychological,Drama,Supernatural,Tragedy"],"nutshell":"From Storm in Heaven:\nAlex and Rite are two souls who died at the same moment on different ends of the earth. This is the story of their interactions with the humans who can see them as they travel towards each other."},{"name":" SUPER Dobutsu Zoo","avatar":"https://mangadex.org/covers/a03eaca6-ce1c-42d1-9eac-aebb3198c11b/04a39f1e-44bd-4719-9810-db12e53dc4fe.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Animals,Comedy,Web Comic"],"nutshell":"The daily lives of Tony the mouse (27 years old), Kony the rabbit (27 years old) and Pony the elephant (29 years old), living in the animal city \"Big City\"."},{"name":" Samu Neko Azuki-san wa Sekai no Chuushin","avatar":"https://mangadex.org/covers/a03f17ed-8631-4f81-a2bd-0d17f892e6f9/c59eaea7-b9f8-46ba-ac0b-5c209a186afd.jpg.256.jpg","country":"Japanese","stat":"8.35","status":"Ongoing","tags":["Animals,Slice of Life,Full Color"],"nutshell":"Short anecdotes about artist Nobeko's cat Azuki."},{"name":" The Vampire","avatar":"https://mangadex.org/covers/a0423d9f-7fb4-437a-b0b8-4f9d60adeb55/3f516561-6393-495b-9fb8-e65c87f14b8b.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Ongoing","tags":["Romance,School Life,Web Comic,Slice of Life,Adaptation,Music,Gyaru"],"nutshell":"I am a hungry Vampire.I longed to suck the blood of a destined one, which is said to be the finest, but somehow I satisfied my hunger on social media as an internet influencer. But one day, I got a hateful comment--."},{"name":" Amatsuki","avatar":"https://mangadex.org/covers/a047b8f0-c3f0-455a-a506-3301eac7bb9f/e5ea7f59-50dc-4308-9d5b-2bb90452635f.png.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Historical,Comedy,Adventure,Drama,Supernatural,Mystery"],"nutshell":"History isn't Tokidoki's strong subject. He's even forced to do make-up work at a high-tech museum to boost his failing grades. After being attacked by a virtual reality monster and having his goggles broken, he finds himself trapped in the Edo period. Could it be real?"},{"name":" A Silent Garden","avatar":"https://mangadex.org/covers/a048d131-aec1-4f5d-a410-5c4d5988143a/ee4fdf4f-9180-401c-a390-2cdc39f7a81b.jpg.256.jpg","country":"Korean","stat":"7.89","status":"Ongoing","tags":["Time Travel,Historical,Long Strip,Romance,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"Only after losing my daughter and husband did I realize how twisted the world was. By some miracle, I was given a second chance at life. This time I will only live for myself.\n\n\nOriginal Webtoon <Webtoon kakao>"},{"name":" Murder Dial 9999","avatar":"https://mangadex.org/covers/a0576aa8-d19b-4766-8f39-c3a078376e1d/4cc783ba-68ea-4367-8126-51c2e83cffe9.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Anthology,Horror"],"nutshell":""},{"name":" The Girl And The Geek","avatar":"https://mangadex.org/covers/a059b43e-efc7-4e9f-b4e0-b90bf41651fd/fbbb7cfc-2c97-439c-b889-2f4bbfac0157.png.256.jpg","country":"Korean","stat":"8.35","status":"Completed","tags":["Romance,Comedy,Web Comic,Slice of Life,Full Color"],"nutshell":"Single with no regular job, Go Nanhee starts a new cleaning gig and meets Oh Deokhoo; literally the filthiest, NERDIEST guy she's ever seen! If that wasn't bad enough, his uber expensive action figure goes missing during her shift! Now she's stuck cleaning his messy apartment in order to pay him back. Can a man who's only ever seen a girl in games and a woman who only fawns over stars on TV… actually fall in love?"},{"name":" Lover-Like Friend","avatar":"https://mangadex.org/covers/a05d4e3e-89e2-43c5-a202-5a8480b0cbf3/2d5491cc-5f09-4f02-abe2-b21e03cc38a6.jpg.256.jpg","country":"Indonesian","stat":"8.13","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Slice of Life,Full Color"],"nutshell":"Andhra and Bella have been friends since childhood, but instead of being stuck in the friendzone, their relationship is more like Lover-like Friends! If this is how it is now, how about the future? Will they stay friends, or become lovers?!"},{"name":" Marriage Purple","avatar":"https://mangadex.org/covers/a0685346-3f0b-4296-a8c3-8f502c2e7f24/42af9caa-944d-4a41-974c-757d09e19aa3.png.256.jpg","country":"Japanese","stat":"7.87","status":"Ongoing","tags":["Romance,Comedy,School Life"],"nutshell":"Rin Suzumiya gets into the high school of her dreams, but she ends up in the same class as Yukichi Sakamoto, a total jerk who always picked on her when they were in elementary school. It seems like nothing's changed about Yukichi in the three years that they hadn't seen each other, so when he tells her to write her name on a piece of paper, she does it just to make him go away. However, Rin completely misses that it was a marriage registration form! And to make matters worse, Yukichi refuses to give it back unless she stops avoiding him for 3 years! How is Rin going to survive high school now that she's stuck with such a tyrant?"},{"name":" Grave Robbers’ Chronicles","avatar":"https://mangadex.org/covers/a06c8c64-03d4-428a-9e58-918b2ba313bb/b8fcd6f5-d1a3-4292-8d99-22fca253d260.png.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Completed","tags":["Official Colored,Long Strip,Full Color"],"nutshell":"50 years ago, a silk scroll that the tomb raiders from Changsha uncovered recorded the location of a unique tomb from the Warring States period. 50 years later, one of the tomb raiders’ grandson discovered this secret in his notes. He then assembled a party of experienced tomb raiders to go for a treasure hunt. But nobody had expected that so many strange things would happen in the ancient tomb. The Seven Stars Sarcophagus, the green-eyed corpse, the nine-headed snakes, and more. They discovered the owner of this mysterious tomb and found the real sarcophagus. This is a story filled with mysteries and a plot with twists and turns."},{"name":" Please Subscribe to the Second Floor","avatar":"https://mangadex.org/covers/a06f05f5-12c2-44a0-8472-3ecf2fa7f880/03c1208a-5894-498d-85e2-52866b3e08f3.png.256.jpg","country":"Korean","stat":"7.97","status":"Hiatus","tags":["Long Strip,Comedy,Web Comic,Slice of Life,Full Color"],"nutshell":"Eugene, my best friend, who happened to find a house to move on to a good condition. However, there was something suspicious on the second floor and there was no intervention. It turned out that the second-floor resident Jinu was famous for her handsome flower on YouTube. And Hikikomori, who's nothing like online? Finally, Jin Su-il and Jin Woo will live together."},{"name":" Kahogo na Wakadanna-sama no Amayakashi Kon","avatar":"https://mangadex.org/covers/a0704348-6231-425f-a5ce-ba76240e20d5/48933ab8-467e-40cb-b320-cb3a80386469.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Romance"],"nutshell":"Tsuruoka Io, who is training in Itamae at a long-established inn in Asakusa, has been in love with the young master, who is a sucessor, from an early age.\nOn one occasion, I was shocked to hear the rumors of marriage of the young master, in response to a rainy day proposal from the young master ...?\nLong-established inn young master × chef apprenticeship in Pure girls, sweet people married life ☆"},{"name":" Touhou - Little Pop Sugar (Doujinshi)","avatar":"https://mangadex.org/covers/a072a3d5-5793-4f19-84d3-a2d254276831/6d170d40-5ded-41e5-9b0e-ecabd933f3c9.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":"A Rin x Utsuho doujin."},{"name":" A Wisdom Tooth","avatar":"https://mangadex.org/covers/a073b0ef-45c0-42df-a102-5eeb5d17bbff/5c7deb1e-7201-4cc1-ab43-9318f193051c.png.256.jpg","country":"Chinese (Simplified)","stat":"8.16","status":"Completed","tags":["Official Colored,Long Strip,Romance,Comedy,Boys' Love,Office Workers,Medical,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"The unspeakable secrets between a handsome dentist and his patient's classmate."},{"name":" Amefurashi - Shunu ni Shippori to Nureru, Ooedo Renaitan","avatar":"https://mangadex.org/covers/a075a1ca-e33d-4252-9305-d8b3ecd87ce4/03e36559-8e75-41e5-ba1f-297c50abddde.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Oneshot,Historical,Romance,Boys' Love,Drama"],"nutshell":"A collection of oneshots."},{"name":" Motori","avatar":"https://mangadex.org/covers/a07a9a33-ea8b-4504-a460-1587fd7d2b74/6a9a3cda-a6fb-4797-bfa7-cef420485349.png.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Teranouchi Bon is an average teenager except for one thing: his imagination. As a virgin, he uses his wild and vivid imagination and envisions himself in a sexual relationship with Ichihara Ibuki, one of the heroines from one of his favorite TV shows from when he was a child. Bon finds out that one of his new schoolmates is the beautiful Momose Koharu, who he used to be childhood friends with, and his life soon becomes chaotic. But just when Bon thought life could not get crazier, his world is turned upside down when he learns that the new school nurse is none other than Mitsuba Touko, the actress who played Ichihara Ibuki, his imaginary lover."},{"name":" Tsumi to Toga","avatar":"https://mangadex.org/covers/a07dbebe-aeb8-43a7-b8cd-6d572d103018/b6440bc9-81a2-45c5-8ae2-a4242d621c74.png.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Psychological,Romance,Boys' Love,Drama"],"nutshell":"I can only feel aroused around people that don't move.\nA psychopath who does not know love × A young boy in despair over life. A near-maddening love-hate relationship story...\nRaised by a single parent, Subaru was forced to work to pay rent while enduring abuse from his mother with a dependent personality disorder, and her lover. One day, Subaru's advanced wages are stolen by his mother's lover. To make matters worse, he overhears a conversation between his mother and her lover, who are both plotting to kill him to obtain his insurance money.\n\"I wonder why I'm alive...\"\nHe loses his will to live and wishes to die. When trying to act on his thoughts, a man he doesn't recognise, Kousei, approaches him and asks him to be his instead of committing suicide.\nTo Subaru, who had been faced with despair, those words seemed to be like sweet temptation..."},{"name":" Matsuri Special","avatar":"https://mangadex.org/covers/a0839924-04d7-4c16-b88e-48c72133b6d1/8b63e968-ff3a-42c6-ab41-6fbe06023413.png.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Romance,Comedy,Sports,Drama,School Life"],"nutshell":"Matsuri is a girl like all the other high school girls. She likes boys, especially one called Wataru, but he hardly notices her even though she watches him like a crazy gal. \"Tough girls aren't my type,\" he once said, and now even three street guys call her a tough chick?! Nothing too good to say to the wrestling Princess. Being this kind of princess is nothing to be proud of for Matsuri so it's a secret that she keeps from her school mates, because it's her father who wants to make her a wrestler…but what will happen when she's discovered fighting those three guys by Arata, the bad boy who can even \"fight cows\"? Discover it and keep track of Matsuri Special!\n[PL] Matsuri Special opowiada o licealistce, która szczególną uwagą darzy swojego kolegę z klasy, Wataru. Niestety, Matsuri nie należy do dziewcząt popularnych wśród chłopców i często nawet nieznajomi chuligani, spotkani na ulicy nazywają ją ‚twardą laską’. Cóż poradzić, skoro Matsuri ma tajemnicę, która skrzętnie ukrywa. Nie każdy bowiem jest uznawany za Księżniczkę wrestlingu – Hani. Matsuri jednak ani trochę nie lubi wrestlingu, jednak jej tata, który widzi w niej talent spotykany zaledwie raz na 10 lat, nie pozwala jej opuszczać żadnych treningów. Co się wydarzy, gdy ktoś odkryje jej tajemnicę?"},{"name":" Crest of the Pharaoh","avatar":"https://mangadex.org/covers/a0861345-be1a-4f4d-97bb-6310b91cb32b/576feb01-1a2c-466a-96df-7b99fe48af14.png.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Thriller,Award Winning,Time Travel,Historical,Action,Psychological,Romance,Comedy,Adventure,Philosophical,Drama,Fantasy,Slice of Life,Tragedy"],"nutshell":"The main character is Carol, a blonde-haired, blue-eyed American teenager from a wealthy family with an interest in Egyptology studying in Cairo. When her mentor discovers the tomb of a young pharaoh, a curse is put on the excavation team and Carol. The curse sends her back in time to ancient Egypt, where she becomes embroiled in the affairs of Egypt and other ancient countries such as Assyria and Babylonia. Carol meets Memphis, a handsome young pharaoh whose tomb she excavated in modern times. Despite his headstrong, at first violent nature, they fall deeply in love. This angers Memphis's half-sister, the Priestess Isis, who has longed to marry him. Carol, due to her exotic looks and curious ability to tell the future, becomes a major player in ancient history.\n\n\nWon the 36th Shogakukan Manga Award for Shojo in 1991"},{"name":" Farewell My Demon","avatar":"https://mangadex.org/covers/a0865d69-18ae-4d22-a058-4e2350f06abf/cab93851-41c1-4524-8222-431ee76d7dbc.jpg.256.jpg","country":"Korean","stat":"8.01","status":"Ongoing","tags":["Romance,Drama,Web Comic,Full Color"],"nutshell":"Moon Dami’ll do anything to escape the clutches of Mr. Sohn, the evil CEO who’s out to get her guts—literally. Her rare blood type makes her an invaluable resource to the old man, but when his obsession with her results in a family tragedy, Dami needs to find a way to step up her survival game.\nShe seeks help from an unlikely source: the handsome but haughty Kang Taesung, owner of Taekyung Financial. Impressed by her bravery, Mr. Kang agrees to protect Dami’s body from Mr. Sohn’s schemes… but who will protect Dami from Mr. Kang?\nCaught up in the wild wars of the rich and powerful, will Dami be able to change the demons of her past into the blessings of her future?"},{"name":" Kuroko no Basket - It's a Sharehouse, everyone Gather Up! (Doujinshi)","avatar":"https://mangadex.org/covers/a08dfc15-96a1-464f-b7d4-d4afd6a03dd6/7097a006-de36-44f5-91a7-ff19833671b9.png.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Oneshot,Romance,Comedy,Boys' Love"],"nutshell":""},{"name":" A Dream","avatar":"https://mangadex.org/covers/a092b1c0-a4ed-4946-ad45-d80f01559971/cc56d921-3654-403f-aa52-df4ae74734e7.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Completed","tags":["Oneshot,Sci-Fi,Psychological,Long Strip,Mecha,Post-Apocalyptic,Philosophical,Web Comic,Full Color"],"nutshell":"In the distant future, a man sits at a bar when a bartender makes him question his reality, and reveals a shocking truth about their world."},{"name":" Nozomu Nozomi","avatar":"https://mangadex.org/covers/a0968d67-f13e-4fbc-a97c-0cc3e0bc2834/6c21c686-3d1a-4197-8cf6-c5dd0850a7f5.jpg.256.jpg","country":"Japanese","stat":"7.51","status":"Completed","tags":["Genderswap,Romance,Comedy,Crossdressing,Supernatural"],"nutshell":"After losing a bet, Tao Nozomu's baseball team is forced to dress up as cheerleaders and cheer for their rivals, the Titans. However, after the bet is all settled and done, Nozomu finds he likes crossdressing almost as much as he likes baseball. Despite interior conflict with such desires, he tries to give it up; but one day, he discovers he's turned into a girl?!"},{"name":" I Still Like You As A Snail","avatar":"https://mangadex.org/covers/a0970b9e-0c89-4875-888e-2bf7075ff033/68136566-991f-45f6-93da-99658f80de7c.png.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Monsters,Animals,Long Strip,Romance,Magic,Web Comic,Supernatural,Full Color"],"nutshell":"She meets a mysterious snail at the grave of her first love! A sorceress who can't forget her first love, and a snail under a curse! Will the snail finally break the curse he's under?"},{"name":" Neither A Long nor Short Walk","avatar":"https://mangadex.org/covers/a09b6b87-2745-4d74-badf-60fe63e69fad/5cc66a16-1a52-437c-a87d-f0a201791475.jpg.256.jpg","country":"Korean","stat":"7.83","status":"Completed","tags":["Long Strip,Drama,Web Comic,Slice of Life,Mystery,Full Color"],"nutshell":"In a quiet village, Young Seol, an aristocrat, wakes from deep slumber, only to find a young man named Soon Jo Yi trying to kidnap her."},{"name":" Angel-chan In Love","avatar":"https://mangadex.org/covers/a09ca50a-5e5d-40da-b69d-03c20e7ad768/43988b54-58f8-4d0c-ba50-3585968535a9.jpg.256.jpg","country":"Japanese","stat":"7.33","status":"Completed","tags":["Oneshot,Comedy,Magic,Girls' Love,Web Comic,Supernatural"],"nutshell":""},{"name":" Midare Somenishi","avatar":"https://mangadex.org/covers/a09d2f74-a6ff-4c99-a8af-92916516aa6a/6e4f67e1-42fc-49bd-89a2-c6320e3f7314.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Historical,Boys' Love,Drama,Tragedy"],"nutshell":"Set in ancient Japan, involving many explicit steamy sex scenes. Shirou and his little brother are captured by bandits, and he is given two options: become the leader's sex toy, or watch his brother die."},{"name":" Shoujotachi no Asobi","avatar":"https://mangadex.org/covers/a09ed591-8440-40e2-8d33-2fc684c18fbb/fb202992-5d47-4672-81e8-bfc4064ad96a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Award Winning,School Life"],"nutshell":"http://www.moae.jp/comic/shojotachinoasobi"}]