[{"name":" Tekuni to Shijou Saikyou no Nakamatachi","avatar":"https://mangadex.org/covers/d19d8f66-302a-403a-9da6-89aa4b6fa395/320bcd39-70e6-469e-b93b-c06092c7b236.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Comedy,Martial Arts,4-Koma,Slice of Life"],"nutshell":"A 4-panel comic strip crossover series featuring characters from both \"History's Strongest Disciple Kenichi\" and \"Skill Hunter Tekuni\"."},{"name":" Blue Gray no Kutsuoto","avatar":"https://mangadex.org/covers/d19fefe3-dfcc-498f-be71-842acd793ede/3cf2cd85-76c8-4bf9-b7f2-8963bc2a8591.png.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Historical,Romance,Boys' Love,Drama"],"nutshell":"Shoes of Fate – \"Beautiful shoes bring happiness to the person who wears them.\""},{"name":" First District Back Alley","avatar":"https://mangadex.org/covers/d1a16d9d-09a5-4b42-9220-4fbb081b1575/a46e7a9c-7ce7-49b9-9405-421268720d89.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Animals,Adventure,Fantasy,Slice of Life,Supernatural"],"nutshell":"A collection of short stories by MURAI"},{"name":" Assassin's Creed - Animals (Doujinshi)","avatar":"https://mangadex.org/covers/d1a55131-f56c-41d2-86eb-251c155a4fef/054aac3d-f603-4ae6-a048-ae07430fdf16.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Completed","tags":["Comedy,Boys' Love,Supernatural"],"nutshell":"The mildest of one-sided Ezio/Altair\nWhen Desmond, Malik, Altair and Ezio all live under the same roof, shenanigans are bound to ensue… especially when Altair is turned into a tiny, adorable cat-boy."},{"name":" Order wa Tantei ni","avatar":"https://mangadex.org/covers/d1a973ba-b593-4fc6-956f-0e56f933185e/86ecc5f6-26b8-43bb-9f2f-fd88afe4400b.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Mystery,Adaptation"],"nutshell":""},{"name":" Kage Hinata no Koi","avatar":"https://mangadex.org/covers/d1aa1597-4365-4416-9d94-0012ee8e078a/85ce5ddf-1f7b-4356-9a02-360952dbc1fa.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Ongoing","tags":["Romance,Mystery"],"nutshell":"“Who am I really?”\nDue to a traffic accident 18-year-old heroine, Yuki Hinata lost her memory. To her who lives well without taking care of that. One day, a strange event begins to fall. A strange diary was placed in a room that doesn't belong to her... A strange handsome guy who suddenly talks to her... And an abnormal constitution that always falls asleep \"at a fixed time\" ...\nThe mystery deepens and love is born."},{"name":" Legend of Tyr","avatar":"https://mangadex.org/covers/d1ae3ac8-bd1d-46fd-a073-53d9ba8ce415/51a58249-e6ec-4554-8348-4f142e0f64c7.jpg.256.jpg","country":"Korean","stat":"7.91","status":"Completed","tags":["Action,Comedy,Adventure,Fantasy"],"nutshell":"Fantasy Action Legend that follows brother's diary!!\nAfter his brother's death, on Tyr's 17th birthday…. his brother, Loki's diary is delivered to Tyr. When following his brother's diary step by step, Tyr realizes that everything that's happening around him is already recorded on the diary."},{"name":" TiN-So: Kimi ga Te ni Suru Ore no Ex Machina","avatar":"https://mangadex.org/covers/d1b05488-32d2-44c3-98de-e301d770f314/2eb03189-8449-4ddc-a2ba-6d1200cc4c3c.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Action,Romance,Comedy,Adventure,Supernatural"],"nutshell":"A boy with the power to create the strongest weapon meets a girl who must take his sword in her hands to save the world."},{"name":" Jouzu ni Abaite Wakarasete","avatar":"https://mangadex.org/covers/d1b34f94-4026-4da7-bb7b-9da00d4ae5ba/f32bfd48-f706-4f94-bf89-d6ec8d4ce043.png.256.jpg","country":"Japanese","stat":"8.15","status":"Ongoing","tags":["Romance"],"nutshell":"Most men approach An because of her lack of chastity. Yanashita, an art major with a frightening face and endless bad rumors, suddenly appeared in front of her. Why are you looking like you're going to attack me!? No, you're going to kill me!? I was a frightened, but the man's goal was to make me become a model for a painting. That's how she comes to know the \"unexpected face\" of this dangerous man... I want to humiliate a pure handsome man. A love story for adult women with dangerous habits"},{"name":" Ninja Slayer Kills","avatar":"https://mangadex.org/covers/d1b5c090-2840-47b6-9396-86bf8def31a3/389290ee-ae88-4a5a-8f85-46f970de92a7.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Sci-Fi,Action,Ninja,Comedy,Adventure,Drama,Supernatural"],"nutshell":"In the gritty, futuristic city of Neo-Saitama, the streets run slick with acid rain and blood. Here, an army of cybernetics-clad ninjas runs amok under the menacing rule of the Soukai Syndicate. As incessant strife wrought by a ninja turf war takes the lives of all citizens who end up in the crossfire, one can only hope to end the day without getting a shuriken to the skull. But in these dark, tragic times, a spirit of vengeance rises to kill all wicked Ninja who terrorize Neo-Saitama. This crimson avenger is Ninja Slayer, and he will not rest until all Ninja have been slaughtered at his hands. [Kodansha]"},{"name":" Nine Puzzle","avatar":"https://mangadex.org/covers/d1b78cf3-1b79-4fc1-a216-c28d15c88904/a09bd96d-7d60-4cec-95ce-b80f07e48bc2.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Sports,School Life"],"nutshell":"Mika is a regular girl who just goes day to day without any concrete dreams for her future. Until one day, when she sees her classmate Kaede playing pool in a billiards lounge. Kaede is a boy who hides many secrets… whose personality seems to change when he plays billiards. Entranced by the smile Kaede wears when he plays, Mika soon finds herself immersed in the game…!\nAlso contains the following short stories:\n\nPlatinum in vol. 1\nIchigo Namida (Strawberry Tears) in vol.2\nWakasama no Jijou (The Youth's Circumstance) in vol. 2"},{"name":" Delinquent Cinderella","avatar":"https://mangadex.org/covers/d1bac7e3-c3a4-4663-9dac-7d097fe61298/48525d27-4179-4375-b8d0-f5d0bb746389.jpg.256.jpg","country":"Korean","stat":"7.90","status":"Completed","tags":["Romance,Drama,School Life,Slice of Life"],"nutshell":"Nan Hui was sent off to the city to live with her mother and her nasty grandmother when she was caught smoking at her country school again. There she rescued the drunk and ungrateful, Gong Myeong from the beatings of five boys. Angry that he did not appreciate her help, she stomped on his arm and ran off…not expecting to meet him again.\nGong Myeong devised a plan with Nan Hui after being heartbroken over losing a girl he loves to his half-brother, Baek Jae Ha.\n\"We’re not going to really love each other. We’ll be a contract couple to get what we both want.”\nThe handsome bad boy, Cha Gong Myeong & bad girl, Lee Nan Hui are declared a couple of horror!\nWhat will happen when Nan Hui’s best friend, who is in love with her, comes to Seoul? Things get even more complicated when Gong Myeong’s half-brother falls for Nan Hui.\nCan this bad prince give this bad Cinderella her glass slipper? Will love blossom between these two bad personalities?"},{"name":" How to Be a Demon","avatar":"https://mangadex.org/covers/d1bded2d-92bf-4786-962a-e099aa1e3f24/d27c6962-be10-4d84-961a-9092e5cc0b57.png.256.jpg","country":"Chinese (Simplified)","stat":"7.71","status":"Ongoing","tags":["Demons,Long Strip,Romance,Comedy,Wuxia,Fantasy,Monster Girls,Web Comic,Full Color"],"nutshell":"The human girl who was taken in and adopted by monsters, Yaoyao, met Zhang Naihe, a fake Taoist who stormed the cave to capture those monsters. In order to steal back the “Sky Thunder Pearl” and the other treasures Zhang Naihe snatched from them, Yaoyao decided to stick close to this Taoist…. A sweet relationship involving previous and present lives unknowingly unfolds……"},{"name":" Honey Mustard","avatar":"https://mangadex.org/covers/d1c0ee70-0f98-4810-921c-00c642531a03/29e1c89b-2792-4a7f-b565-da37acdf3a4b.jpg.256.jpg","country":"Korean","stat":"8.03","status":"Cancelled","tags":["Romance,Comedy,Drama"],"nutshell":"Ara - a pretty high school student - finally gets the chance to cozy up to the guy of her dreams, but she blows it and ends up kissing the wrong boy under fairly compromised circumstances. Hilarious complications, mistaken identities, and misinterpreted signals ensue, and Ara soon finds herself being backed into an arranged marriage she at first wants no part of…\nBut, as we all know, love has a way of blooming in the unlikeliest of places… and, of course, love eventually conquers all!"},{"name":" Victory - Ai wa Katsu","avatar":"https://mangadex.org/covers/d1c41ef0-9824-4820-b52c-dda5475cd27b/e9f82410-1a92-41bd-acca-276ed45beb02.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Historical,Boys' Love,Fantasy,Supernatural"],"nutshell":"Seven oneshot stories featuring samurai, detectives, sorcerer, demons, a monk, and students. The last chapter is shoujo featuring a witch and a demon.\n\n\nVictory - Ai wa Kabu\n\n\nEndless Game\n\n\nLesson on Love at First Sight\n\n\nBlood Dream\n\n\nThe Summer Dream of Youth\n\n\nThe Adorable Straw Doll\n\n\nWhite Christmas Eve"},{"name":" Chinese Ghost Busters","avatar":"https://mangadex.org/covers/d1c47cb0-0665-43c9-8065-5e22bc3f4c0a/fd8c7e3e-3a97-4ef6-9797-0b557c8a6001.jpg.256.jpg","country":"Chinese (Traditional)","stat":"7.97","status":"Completed","tags":["Monsters,Action,Comedy,Adventure,Fantasy,Supernatural"],"nutshell":"After a seance goes awry and unleashes evil spirits and monsters onto Taipei, it is up to a delinquent named Feng-mi, and monk Yi-shi to save the day."},{"name":" Crossover Love","avatar":"https://mangadex.org/covers/d1c7a186-cdb7-4a49-8b61-34a9fca284a8/56270411-dbfb-427d-9c9f-a63029b53342.png.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama"],"nutshell":"Daiki Sakura was put in charge of \"Moderate\", a bar owned by the wakagashira of the Sakaki group.\n\"This world of mine, as a bartender, and the world Tatsumi lives in will never intertwine…\"\nTrying to ease his worries, Daiki seeks comfort in Tatsumi's arms, but…"},{"name":" Bleach - Dormer errant (Doujinshi)","avatar":"https://mangadex.org/covers/d1c7bb9e-c49f-4867-a995-9af85746399a/0b11329e-6b12-4bcd-b565-7716dcfee5d6.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Boys' Love"],"nutshell":"Pairing: Ichigo x Uryuu"},{"name":" Usagi-kun no Shitsukekata.","avatar":"https://mangadex.org/covers/d1d086be-9273-4843-8e14-2b1d7074f396/db113996-b8bb-4ccb-912d-b34c2a7574ae.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Romance,Comedy,Drama,School Life"],"nutshell":""},{"name":" Garakuta-Hime to Tsukumo-san","avatar":"https://mangadex.org/covers/d1d993bf-3655-49c3-bb79-c019c4ba900b/8261d8f2-b33e-42a0-b18b-aa4b6ce8a5d4.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Oneshot,Action,Romance,Fantasy"],"nutshell":"Ante Seiya -un estudiante de secundaria que ayuda en la tienda de antiguedades de sus padres- aparece Yume, una chica que puede escuchar las voces de las cosas…?"},{"name":" Elf JK's with Many Fans","avatar":"https://mangadex.org/covers/d1ddb5a4-47af-415b-b693-500d304321a9/fdab7b3b-4d38-4281-965c-008499442871.jpg.256.jpg","country":"Japanese","stat":"7.43","status":"Completed","tags":["Oneshot,School Life,Fantasy,Web Comic,Slice of Life,Full Color"],"nutshell":""},{"name":" Mamono no Hanayome","avatar":"https://mangadex.org/covers/d1e493d3-b539-4658-ac94-a2aae29e1709/e4b8079c-22e5-44c1-9224-3c88b4dced73.jpg.256.jpg","country":"Japanese","stat":"8.28","status":"Ongoing","tags":["Monsters,Romance,Fantasy"],"nutshell":""},{"name":" Pink Porno de Machiawase","avatar":"https://mangadex.org/covers/d1e697ac-314d-4942-87f2-b4d0541ca8ac/691687d1-fb0a-4e10-80bf-e17949715591.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Boys' Love"],"nutshell":"“I hadn’t planned for this, but… I couldn’t help myself after seeing your sexy expression.” Tomoe, an office worker, finally gets the chance to see his favourite pink movie on the big screen at a local theater. But just as he takes his seat, a man blocks his view to proposition him like it’s a cruising spot! While he’s lost for words, an attractive young man named Kumano comes to his rescue! While they’re chatting alone in the bathroom, they catch snippets of the movie’s audio through the wall. Kumano whispers one of the lines in his ear. Unexpectedly, the warmth of his voice and his breath turns Tomoe on. Then, Kumano puts his hand down Tomoe’s pants with the practiced expertise of a man who’s put on those moves hundreds of times. What’s happening…!?"},{"name":" Miracle Dieter Miyuki","avatar":"https://mangadex.org/covers/d1e74521-72f5-4563-87db-55324621959e/ea949af5-f6ee-4df1-ba15-ad97f2425733.png.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Comedy,Magical Girls,School Life,Fantasy"],"nutshell":"Yukimi, a chubby junior high student, discovers a magical dumbbell that can transform her into Miyuki, a beautiful and slender young woman in a revealing costume. But she must do battle with an evil three-star chef who tempts young girls with calorie-rich treats and dubious weight loss products, and keep her identity secret from her family and schoolmates."},{"name":" K-sensei no Himitsu no Netsujou","avatar":"https://mangadex.org/covers/d1efe3ee-40d7-477f-8639-613fe2c095b0/471614ea-6f57-4414-b623-4980269302fa.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"Popular erotica writer Kaji \"K\" Sensei's glamorous appearance is only rivaled by the fantastic rumors surrounding him. Like how one of his best selling novels was based on a relationship with a high school student… or how two of his model sex friends got into a cat-fight in the middle of a highway… or how he has threesomes during his nocturnal writing sessions!\nAt least these are the things that go through editor Kobayakawa's head when he sees his celebrity charge – that and the one time that K-sensei sent three editors to the hospital?! Yet, while taking photos for a magazine interview and watching K-sensei work with such professional focus, Kobayakawa realizes that the outrageous rumors may be just that. That is, until Kaji pushes him down on the sofa to \"reward\" him. Thus begins the hunt of the herbivore editor and his carnivore author."},{"name":" Wadanohara and the Great Blue Sea: Sea of Death Arc","avatar":"https://mangadex.org/covers/d1fee409-c9bf-4c12-9246-e663ac3f02d6/caca758f-0ef9-4e3b-93fe-951e1eefdedf.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Psychological,Comedy,Drama,Horror,Fantasy,Mystery"],"nutshell":"The Sea Kingdom was invaded by the Totsusa Kingdom, but Wadanohara and her familiars managed to hold them back. The two princesses faced off with one another – and suddenly the two kingdoms were at peace.\nThe war was seemingly over…. However, Wadanohara's original familiar, Samekichi, was thinking.\n\"Wadanohara.. I will definitely… protect you.\"\nWhat are his true intentions? All will be revealed soon."},{"name":" Boku no Hero Academia: H-2-ZERO (Doujinshi)","avatar":"https://mangadex.org/covers/d20045f8-8487-4cab-9fb8-5dbb1d0d6159/c80ed11e-d99d-490c-9793-88891b1759a9.png.256.jpg","country":"English","stat":"7.82","status":"Ongoing","tags":["Monsters,Action,Superhero,User Created,Drama,School Life,Monster Girls,Web Comic"],"nutshell":"One day, a young girl came to a sudden realization: the world is not fair. Set in Kouhei Horikoshi’s My Hero Academia universe, H-2-ZERO follows the misadventures of Shimizu Azumi who is inconvenienced by her own superpower and subjected to a world that isn’t afraid of going beyond the upper limits of \"quirks.\"\nThis is her story.\nLinks:\n\nOfficial H-2-ZERO twitter\nAuthor's art twitter"},{"name":" The Diary of a 100 Day Part-Time Witch","avatar":"https://mangadex.org/covers/d2046dd6-1288-49a6-a242-b63c8d0be1f7/37cec826-0a37-4fc7-8fc8-7d984b20dd5e.png.256.jpg","country":"Chinese (Simplified)","stat":"7.86","status":"Ongoing","tags":["Demons,Long Strip,Magical Girls,Adventure,Magic,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"An ordinary girl who knows nothing of magic accidentally stumbles into the world of the supernatural. Unfortunately, she signs a contract with the most wicked of monsters, thus setting down the road to becoming a witch."},{"name":" The House in Fata Morgana - The Veil Over Your Eyes","avatar":"https://mangadex.org/covers/d204fdc9-8e05-4279-91ca-aaecf5f9e003/9ea31a60-a972-413d-a92b-d8f73e447d9a.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Medical,Adaptation,Tragedy"],"nutshell":"From Sekai Project:\nYou awaken in a decrepit old mansion.\nA woman with eyes of jade stands before You, informing You that You are the Master of the house, and she Your Maid. However, You have no memories, no concept of self—or, indeed, any certainty that You are even alive.\nThe Maid invites You to join her on a journey through the mansion's lifeless halls, to behold the numerous tragedies that have befallen its residents. She suggests that among them, perhaps You will find some trace of Yourself.\nBeyond the first door lies the year 1603.\nIt is an era of unparalleled beauty, where art and theatre flourish. Roses bloom abundantly in the garden where the inseparable Rhodes siblings play, and though they appear to be free of worry and strife… not everyone is content to see them happy.\nBeyond the second door lies the year 1707.\nIn this era, the mansion lies in ruins, and a beast dwells within. He claims to yearn for a life of serenity, but it is not long before he yields to his innate savagery and a massacre ensues.\nBeyond the third door lies the year 1869.\nIn this technologically advanced era, people are always on the move. The mansion's master is an ambitious businessman who has invested in the rail industry. However, his obsession with wealth and power leads him to neglect and mistreat his wife.\nBeyond the fourth door lies the year 1099.\nThe Maid tells You that this is the final tale. In this era, You see a young man who claims to be cursed and a girl with white hair, called Giselle, who has been branded a witch and marked for death.\nHaving borne witness to these four tragedies, each set in a different time and place, You are now free to choose whether You wish to end Your story here… or press on.\nBut there are those who would say, \"You were able to bear them because they weren't your tragedies.\""},{"name":" Manburi!","avatar":"https://mangadex.org/covers/d20aa7ad-d452-40dd-b6d7-5fcc9e8fb785/14a8a581-006f-4027-82b9-3ed54cc35171.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sports"],"nutshell":""},{"name":" Ore no Imouto ga Konna ni Kawaii Wake ga Nai - Official 4koma Anthology","avatar":"https://mangadex.org/covers/d212f83c-743a-43b2-93fa-510d03e67200/0f4f9bee-d14e-45e4-92af-7f74aa4991cf.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Comedy,Anthology,4-Koma"],"nutshell":"The Official 4koma Anthology Dengeki Comics EX."},{"name":" Hosaka-San to Miyoshi-Kun","avatar":"https://mangadex.org/covers/d2155bb1-22a9-4471-8c30-60110fa6c678/ce1166cc-29e1-4a31-ac01-b67ba8f4db4e.png.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Romance,Comedy,Boys' Love"],"nutshell":"After being hit on and picked up by the older Hosaka, Miyoshi starts to find a liking to their easy-going relationship; however, on Christmas, just before the entrance exams, he was given a house key and when asked \"When you become a college student, how about you move in with me?\" Due to various anxieties, they lost contact with each other. 8 months later, the two reunite--!?"}]