[{"name":" A Sukeban, a Transfer Student, and Their Silly Little Game","avatar":"https://mangadex.org/covers/f7269745-4974-4da5-817b-747c226e969a/7366f6e1-bfcf-477f-ad39-98f615bdb95a.png.256.jpg","country":"Japanese","stat":"7.58","status":"Completed","tags":["Psychological,Comedy,Girls' Love,School Life,Delinquents,Slice of Life"],"nutshell":""},{"name":" Utahime Obaka Miiko","avatar":"https://mangadex.org/covers/f7269b98-f3c2-4c28-ba3b-3ca4e4a7bd3d/91cc7440-1671-47b7-a1e1-3daaed1832ce.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Traditional Games,Comedy,Sports"],"nutshell":"Miiko is a girl with a problem. She's passed all the tests and become a Mahjong Pro, but she stinks at Mahjong! She was starting to even hate the game, but then she runs into a man who used to be a Top-Tier Mahjong Pro named Namidame in a parlor and asks him to teach her how to play right! The two strike a connection and Namidame vows to help Miiko work her way up to the top leagues. He gives her a new lesson each chapter, and we as the readers also learn along with Miiko! This \"Mahjong for Dummies\" series by prestigious Mahjong Mangaka, Katayama Masayuki, is a must-read for anyone who wants to get better at Japanese Mahjong! Let's learn together!"},{"name":" X2","avatar":"https://mangadex.org/covers/f72b1592-248a-4d99-9007-ac46bd398ece/a4c57bf4-98fe-4df9-84d5-1431efcdd145.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Drama"],"nutshell":"When you're in love, life feels like it's been multiplied two times!\nThese five short stores of budding high school romance explore the confusing emotions that arise in the first tentative phases of love and the exhilaration of falling for someone new!\n#1: Love at First Touch\nLove is in the air at Field Day, and Eri can't figure out what is it that draws her to Kohei.\n#2: Expiration Date 2001\nMiwa's secret crush Kenta gives her a soda can for her help, and she decides that the date on the bottom of the soda can must be symbolic. Would this love taste sweet , or will it go sour?\n#3: Second Impression\nWhen delinquent Naoki turns out to be a passionate gardener, will he and Haruka sow seeds of romance together?\n#4: Frequency\nWhat happens when naturally blunt and loudmouth Kaori gains the ability to tune in to the private thoughts of 'model student' Morihiro?\n#5: Baby Universe\nCan Kengo convince Saki that she's not too grown up to recapture the innocent excitement they felt while searching the sky for UFOs as kids?"},{"name":" Memoirs of a nameless person","avatar":"https://mangadex.org/covers/f72c21fb-21a6-489b-b137-77918b5ac834/ee42aba9-8083-4d51-9a8f-313fe9c97e86.png.256.jpg","country":"Chinese (Traditional)","stat":"7.98","status":"Ongoing","tags":["School Life,Web Comic,Slice of Life"],"nutshell":"\"Doodles of light-hearted moments in the dull life of a university student.\"\n-Pixiv"},{"name":" Vivarium","avatar":"https://mangadex.org/covers/f7332d8f-c000-4084-82f6-95826e065ad8/57e77e0f-a9b9-4994-866d-2f2e2ab36e1f.jpg.256.jpg","country":"Korean","stat":"7.68","status":"Ongoing","tags":["Psychological,Long Strip,Boys' Love,Drama,Full Color"],"nutshell":"[Obsessive stalker Jaeyeon x  Egotist Huisung]The unemployed, arrogant and selfish Huisung attempts to steal his childhood friend’s banking book. Leaving their house with light foot steps, he is suddenly abducted by a mysterious figure. Huisung, who had been raped in his sleep, awakes to see a smiling Jaeyeon looming over him."},{"name":" Youkai Gakkou no Seito Hajimemashita!","avatar":"https://mangadex.org/covers/f738c64a-8050-4ff7-85f3-a0bba314d176/b76e0e20-aea3-4b8b-9802-cf1b657a6f8c.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Ongoing","tags":["Comedy,School Life,Web Comic,Supernatural"],"nutshell":"The side-story of \"Youkai Gakkou no Sensei Hajimemashita\", set 1 year before the events of the main story, following Maizuka Mamekichi's first year at Hyakki Academy.\nSerialized on Pixiv Comic."},{"name":" Idol Paradise","avatar":"https://mangadex.org/covers/f7399fdc-3d01-4d29-af73-bfeb1953345a/cbbfdd42-77e0-4631-a89a-1aaa74ddf39e.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Romance"],"nutshell":"Takaishi Minori is a cute and perky female fast-food worker who is adored by all the female customers because she looks like a teen idol--a MALE teen idol. Minori is a tomboy and has short hair, so she is often mistaken for a boy.\nOne day after work, Minori spots an unfair fight going on, and leaps into the middle of the fight, ready to even the odds…only to be mortified to learn that she landed right in the middle of a music video shoot for the popular boy band GOLD! She is dazzled by Tomoya, the leader of GOLD. Minori apologizes for her mistake and is about to continue on her way, but not before one of GOLD’s managers sees her and gets a great idea…"},{"name":" Pokémon - Dating a Team Magma Grunt (Doujinshi)","avatar":"https://mangadex.org/covers/f73cf534-a45b-4bca-adfb-b984d68960d5/3b550f73-e907-4b5b-828b-a319352e2d87.png.256.jpg","country":"Korean","stat":"8.77","status":"Hiatus","tags":["Long Strip,Romance,Comedy,Fantasy,Web Comic,Slice of Life"],"nutshell":"About dating a Team Magma Grunt."},{"name":" Mobile Suit Gundam SEED MSV - The Blooming of Housenka on the Battlefield","avatar":"https://mangadex.org/covers/f73d1664-58c6-4cdc-b1c3-59d37643b54b/d00f6cff-7680-4f80-8861-6f6096bcb4eb.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Sci-Fi,Mecha"],"nutshell":"One shot with Shiho, a member of the Joule Team, testing a new Mobile Suit."},{"name":" Umineko no Naku Koro ni - Ange a la mode (Doujinshi)","avatar":"https://mangadex.org/covers/f7400b57-b841-4fc8-887a-8bc97fd4da8d/314aae02-3e35-404a-9833-1febe1f39b86.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Girls' Love"],"nutshell":""},{"name":" Travelogue of the Succubus","avatar":"https://mangadex.org/covers/f74bda04-6923-4c35-a2b7-eea5a7f8cb4a/be518459-3301-4381-ab37-d57cd96ae48e.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Completed","tags":["Horror,Supernatural,Mystery"],"nutshell":"A young woman comes across a remote village that has an unusual form of worship.\nThe newest series from acclaimed horror mangaka Junji Ito."},{"name":" GirlS Alert","avatar":"https://mangadex.org/covers/f753dc4f-14b4-4969-bb3a-3d6de1639bae/553f6eda-262f-499c-a4e1-646ae42021cf.png.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Long Strip,Comedy,School Life,Web Comic,Full Color"],"nutshell":"Choi Sun is a teacher assigned to quite a strange school after an accident. He meets three girls with goals of making popularity, success, and... eliminating all of the school. Hijinks ensue as he tries to guide these girls while trying to control their destructive impulses"},{"name":" Anmitsu Hime","avatar":"https://mangadex.org/covers/f755d00d-568c-4e18-8561-91be83867cee/83fadff2-acc8-422c-8318-ffcb0755312e.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Comedy,Fantasy,Slice of Life,Adaptation"],"nutshell":"The manga adaptation of the 1986 anime reboot of the early postwar shoujo manga Anmitsu Hime."},{"name":" Tennen x Renai ÷ Model","avatar":"https://mangadex.org/covers/f758a343-cf03-447c-929a-b6736a491974/ebddf930-3ca0-4f06-a2c7-36c71893ce8c.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Romance,Comedy"],"nutshell":""},{"name":" The Enemy Beside Me","avatar":"https://mangadex.org/covers/f765164c-615d-4641-86d8-de662cb81d30/37a2b9e9-d767-42af-9b5b-144447a862da.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.07","status":"Ongoing","tags":["Official Colored,Long Strip,Boys' Love,Police,Full Color"],"nutshell":"In order to source writing material, suspense writer Xiu Rui gets personally involved in a murder case investigation only to discover that the case is eeriely similar to what he wrote in his novel! The man who is secretly manipulating the case is lurking right next to him… Crime and evil combined causes love to turn deadly, while discrimination will eventually destroy trust. As a messy love triangle develops, who should he believe, and who can he trust?"},{"name":" POPS","avatar":"https://mangadex.org/covers/f767da3f-a529-4e9e-ae45-15f2e7edea43/191eefe6-a41a-47f3-8819-1c5fd31d8673.png.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"Kusuko has a secret crush on the resident class playboy, Mishima. But with his constant rotation of ever changing girls on his arm, she keeps a safe distance. Mishima takes her stand-off-ish attitude for coldness and confronts her about it; however, they manage to overcome the misunderstandings and even begin dating! The more she gets to know him, the harder she finds herself falling, but one day, she overhears him talking to another girl on the phone…"},{"name":" Black Forest - Trip Lovers (Doujinshi)","avatar":"https://mangadex.org/covers/f7681f2f-5d66-4319-bad5-15e4b86a61a9/6c2bac64-80e9-418a-9d1b-c8bee737e990.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Boys' Love,Samurai,Fantasy"],"nutshell":"Self published, spin-off from Trip Lovers series."},{"name":" Booking Life","avatar":"https://mangadex.org/covers/f7697e12-bec5-465f-943b-8ed833d56fff/9d391037-4885-4441-8e35-bb1b126fdcab.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life"],"nutshell":"Kuzumi Kentarou is a salesman and also an organ donor card owner (their organs get donated upon death). He gets mugged and almost dies but eventually regains consciousness in a hospital and sees a patient with an ailing heart, Hasegawa Kirin, who tells him that he is completely compatible with her… as a donor.\nKentarou promises to give his heart to her. However, Kentarou lives on, but he never got into college. He now works part-time in the hospital where he begs Kisaragi Ryouko, an organ transplant coordinator, \"when will Kirin receive his heart?\""},{"name":" Come on a My House!","avatar":"https://mangadex.org/covers/f777bcce-d6fd-4cff-a18b-56e67e2aeb35/42792e88-1211-42c5-b964-44d67618f2c5.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"From Lovesick Alley: Ever since she was little, Hina has always had a routine of visiting a particular vacant house. One day, she notices a stranger sleeping inside. Why is Hina so fixated on that house and who is that guy sleeping there?!"},{"name":" Colorless Girl","avatar":"https://mangadex.org/covers/f77b7d5f-8dc3-4d98-bdeb-f7f771baeec8/67b3b0f4-4b3d-4cd7-8633-73589667d9de.png.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Crossdressing,Drama,School Life,Slice of Life"],"nutshell":"Aoi, the main character of our story, has just enrolled at the art college of her dreams.  She always looks cute, is pure perfect, and is loved by everyone around her.  But Aoi, nicknamed “The Girl” by her friends, hold onto a secret she doesn’t want anyone to know.  Underneath her makeup and clothing, she hides the secret that she is actually a cross-dressing man.  Afraid of what others may think him. Aoi finds himself staring into the mirror confessing his true feelings, “I'm not okay.”.  This manga is for people who suffer from issues with self-confidence. Follow a heart-touching story and watch Aoi overcome his struggles with his sexuality, the looks of disapproval of those around him, and his relationships with his family and friends.\n[Official synopsis taken from MangaPlaza]"},{"name":" GABULI","avatar":"https://mangadex.org/covers/f77c9587-ebb7-4fc1-8798-c6c6948e91cf/f35771cd-1d70-48a7-955a-cab20da9c28c.png.256.jpg","country":"Japanese","stat":"8.06","status":"Ongoing","tags":["Thriller,Sci-Fi,Action,Crime,Adventure,Philosophical,Web Comic,Supernatural,Mystery"],"nutshell":"In the year 20XX, a bill was passed to indentify and surveil every citizen using nanomachines and DNA data. Those who don't possess this identification are deemed criminals, \"NoIDs\". As disappearances continue in the city, Liu and Tough are living their lives as NoIDs in the slums, helping people find what they lost.\nGabuli is a web-original multimedia project created by no.959. Its story is told through manga, music videos and short stories, available on https://gabuliiiiiii.com."},{"name":" UnLeong","avatar":"https://mangadex.org/covers/f7808a85-3c51-4973-b850-78962729bc0a/9b0a65e0-f7b9-4c27-8342-9c6e47d41e81.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Action,Long Strip,Fantasy,Supernatural,Mystery"],"nutshell":"Spirits that eat people's words - UnLeong. In return, they make people's wishes come true.\nOh Sung is an UnLeongist who counsel others who have wishes that cannot come true unless UnLeong help them."},{"name":" Aneue. Skirt wo Makutte Mata wo Aite Misete kuremasen ka?","avatar":"https://mangadex.org/covers/f7818582-5e5a-4f9b-96e6-c3f27422a579/2724c170-f71f-458d-9453-0e6d1c445141.jpg.256.jpg","country":"Japanese","stat":"5.91","status":"Completed","tags":["Romance,Reverse Harem,Fantasy,Adaptation"],"nutshell":"My brother started looking for people. He seems to be looking for a woman he fell in love with at a masquerade. The only reference he has of that beautiful woman is a small set of moles on the inner part of her thigh. And that woman is… Nee-chan?! A love story given by a main character who can't be honest! Do not be fooled by the title! This is a pure love! No incest, either!"},{"name":" Henkyou no Shishi wa Ruriiro no Bara wo Dekiai suru","avatar":"https://mangadex.org/covers/f782d9ad-6d40-42fd-9885-bb82e3cdf1e4/f9c2e70a-461b-4f6c-9655-49e5d2b7a64b.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Fantasy,Slice of Life,Adaptation"],"nutshell":"瑠璃色の瞳を持つ美女・サリーシャは、王太子妃候補として育てられた。\nしかし妃として見初められず、さらに事件に巻き込まれ、背中に大怪我を追ってしまう。\n失意に暮れる彼女の前に現れたのは、強面の辺境伯・セシリオだった。\n大きな体に、貴族らしからぬ寡黙な雰囲気の男からの突然の求婚。\n「なぜ傷物の私を？」と戸惑うサリーシャだったが…。\n醜い傷を見せたら、あなたは離れる…？\n強面軍人とワケあり美女の溺愛ラブロマンス、開幕！\n\nOriginal Web Publication: Pash Up!, Pixiv\nOriginal Web Novel"},{"name":" Your Majesty, Please Let Me Go","avatar":"https://mangadex.org/covers/f7833c7e-8b3d-4930-838b-36e01573bbd4/dee20ad9-6955-429d-9dc7-bae36199cc1c.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Ongoing","tags":["Historical,Romance,Comedy,Reverse Harem,Web Comic,Mystery"],"nutshell":"Cette nuit-là, d’une jeune fille innocente, elle est devenue sa femme.\nLui, était un prince beau et sauvage doté d’une aura dominatrice.\nLa rencontre d'une servante de basse extraction comme elle avec lui était-elle le destin ou juste un sort malheureux ?"},{"name":" Kyoshinki Senki","avatar":"https://mangadex.org/covers/f7892762-3cb3-409f-9fa7-8972f8f1cc8d/7812dc16-dc37-43cf-809d-1c797744db9d.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Ongoing","tags":["Monsters,Action,Adventure,Drama,Fantasy,Tragedy"],"nutshell":"Once gods and men had lived together, fought assailing enormous fiends together. The young boy Tsuchimaru felt powerlessness in the state of humans only being able to be protected by gods, but one day, his life was changed by a vagrant artisan and the the sword he had created..."},{"name":" Zettai Kami no Yuugi","avatar":"https://mangadex.org/covers/f789b79b-0712-4080-82e6-87888df95fa2/f58652c3-24dd-413d-9539-a3f4a8a1c975.jpg.256.jpg","country":"Japanese","stat":"7.71","status":"Ongoing","tags":["Action,Long Strip,Isekai,Drama,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"The boy dies.\nHowever, it was not the end, but a new beginning…\nOnce a year, he would have to fight a battle that would cost him everything.\nThe loser will be deprived of not only his memories, but even his powers…"},{"name":" Missing Jun","avatar":"https://mangadex.org/covers/f78b57e9-2e29-4725-a9c6-3db5604240b7/d43817e2-3ec0-4ca4-9604-fec4848e2c21.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.05","status":"Ongoing","tags":["Boys' Love,Delinquents,Web Comic"],"nutshell":"Fortune-teller versus a Mensao* Doctor?\nI, Meng Fanjun, spent all my time telling other people’s fortunes, but unexpectedly overlooked my own luck in love?! A hospital visit brings to me a chance encounter with a doctor who absolutely piques my interest! His gentle heart hides under an icy demeanor. \"Doctor Tao, I did a divination reading: you’re missing Jun in your life. Not Jun as in just any “gentleman” out there, but Jun as in me, Meng Fanjun!\n*Mensao is a term referring to people that have an icy, untouchable persona but are actually very passionate on the inside; a mensao person is basically the equivalent of a tsundere."},{"name":" Kago no Uchi","avatar":"https://mangadex.org/covers/f78b871c-fb60-4517-83cb-f150f0e8e763/e0b205fb-4289-4c9b-b549-cefb583dc258.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Completed","tags":["Oneshot,Boys' Love,Drama"],"nutshell":"An injured man guilts college student Eiji into bringing him home to treat his wounds, but Eiji becomes alarmed when he realizes this man knows the older brother who Eiji lives with."},{"name":" Yubisaki Kara Honki no Netsujou ~ Charaotoko Shoubou-shi wa Massuguna me de Watashi o Daita ~","avatar":"https://mangadex.org/covers/f78f26b8-433c-4c69-9609-77399b2e3e99/c27634ed-47e2-4885-9f44-aa9549a00f8c.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Romance,Office Workers,Slice of Life"],"nutshell":"Fujihashi Ryo enjoys her job as an office worker well enough, but it doesn’t hold a candle to the exciting job of her childhood friend Mizuno Souma, who works as a fireman. He and his handsome buddies are more than happy to entertain ladies with their heroic tales. Ryo wants to set up Souma with a girl in her office, but he’s too much of a playboy to settle down…or so she thinks. It turns out that he has the hots for her, and when he rescues her from a fire in her building, a different kind of spark begins to fly!\n\nMangaka's Twitter\n Mangaka's Pixiv\nSee AnimeNewsNetwork for the anime."},{"name":" Lady Love","avatar":"https://mangadex.org/covers/f7909519-3a62-40b7-b2cf-51ec3b64de7d/85938830-7ab5-4db3-a2e3-38ccbaa689e6.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Award Winning,Romance,Sports,Drama,Slice of Life"],"nutshell":"(from Shoujo Manga Outline:) Michelle is passionate about ballet but belongs to a poor family that can not afford the Academy of Dance. However, a prima ballerina who takes a liking to Michelle decides to help: Oriella Siorella. Michelle sees her benefactress as an idol and aspires to be like her but is shocked when Siorella falls from grace when a new dancer arrives, named Olivia Ann. The series narrate Michelle's pursuit in her passion, dance, and the entertainment world in Italy.\nWon the 8th Kodansha Manga Award for shoujo in 1984."},{"name":" 40 no Sora ni Koi ga Furu","avatar":"https://mangadex.org/covers/f7917dd2-6d5e-4eef-80a6-a8c34f87acdc/732d949b-1c58-4ca8-8d0b-f697164ac52d.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"Is it love? Or is it admiration? The 20 year old ready for a pure love encounter!!\n(From blueberry)"}]