[{"name":" Stay Awake All Night","avatar":"https://mangadex.org/covers/82cf0018-d918-46e6-9a61-9893d97b09ac/c41cc205-eb70-4fbf-acb3-4035effb52ed.png.256.jpg","country":"Chinese (Simplified)","stat":"8.12","status":"Ongoing","tags":["Long Strip,Romance,Fantasy,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"Lian Mian is a normal girl, but she has the \"eye of death\" and is able to see people's mortality rate. Suffering from this curse, she tried to kill herself many times, but she just could not die! Upon hearing her cries, a Death God came. However, even his powers couldn't help her. What kind of spark will begin between the girl who wants to die and the Death God who will kill her? What kind of secrets are hidden behind the girl's powers? Can she resist the deadly temptation to dance with the Death God…?"},{"name":" Kimi no Kaketeru Tokomo Suki","avatar":"https://mangadex.org/covers/690540ab-5f55-4b44-910d-4d2ed0a0faa9/47218dc5-3fc6-42ff-8233-6175304e9890.png.256.jpg","country":"Japanese","stat":"8.64","status":"Completed","tags":["Oneshot,Romance,Drama,School Life"],"nutshell":"Haruto, a shy high school student with poor communication skills, who faces a melancholy entrance ceremony, is stunned by a beautiful profile. The profile belongs to Rui, a girl who is also a new student, and she is missing her arm. An encounter between an awkward boy and an amputee girl marks the beginning of a new relationship. A new generation boy meets girl, who looks into the eyes of the heart."},{"name":" Goblin Slayer: Brand New Day","avatar":"https://mangadex.org/covers/0b47248c-1c79-451f-bb95-c6bcc3d2c1b4/49f7553f-1a6d-42c1-9684-4097bd8aa84f.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Monsters,Action,Adventure,Fantasy,Adaptation,Tragedy"],"nutshell":"Goblin Slayer is a man who has been killing goblins in a remote town. A new warrior and an apprentice saint are frightened by him, but ask him to teach them a lesson. A beastman girl tries to get him to eat at a tavern. And the nest of goblins that awaits him… It's a story of adventure, carnage, and everyday life for him and the people around him!"},{"name":" Ikitsuku Saki wa Yuusha ka Maou ka","avatar":"https://mangadex.org/covers/331660d5-a2f4-47d8-8da8-99dfe5277e56/a4e4fb6e-a6eb-4f57-95cb-3116c1965df2.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Ongoing","tags":["Action,Romance,Isekai,Fantasy,Adaptation"],"nutshell":"“I’ve found you!”\nMamiya Yuuto was transported into another world after hearing those words, but all he got out of it were a younger body and the ability to see his status screen at any time — in overwhelming detail.\nHe uses his knowledge and perserverance from playing games and his experience from working as weapons to survive in a world with skills and magic!"},{"name":" Get Out of My House!","avatar":"https://mangadex.org/covers/0aeef1e9-356d-4ffe-8e00-376bbfb7925a/718c1491-a1cc-4767-a0c1-5bf7834297f3.jpg.256.jpg","country":"Korean","stat":"8.91","status":"Ongoing","tags":["Long Strip,Romance,Girls' Love,Drama,Web Comic,Full Color"],"nutshell":"“She's now your “responsibility”!” Cha Hong, a freelancer; heard as soon as she stepped foot onto the set the biggest drama. This job was everything that she wanted but she was only left to become an assistant. She ends up having to take care of Noh Seung-Ah; the nation’s actress with a really stubborn attitude. Hong will have to look out for the actress 24 hrs daily up until the drama is aired. Hong’s daily life routines and dreams are suddenly interrupted by Noh Seung-Ah who is 12 years younger than her.. On top of it all \"I never told you that you can live in my house?!\""},{"name":" Space Exchange Student Moru","avatar":"https://mangadex.org/covers/d79cd1af-c86a-436c-8478-16c7dc6dc548/ba953a8e-1332-441d-a1d4-08b9d469c08d.jpg.256.jpg","country":"Japanese","stat":"8.92","status":"Completed","tags":["Oneshot,Romance,Drama,School Life,Web Comic,Slice of Life,Aliens"],"nutshell":"Tatsumi, a pragmatic boy who doesn't make friends nor goes out for fun, meets Moru, an exchange student from space. And yet, he ends up accompanying her, although reluctantly, when she asks him to show her around the Earth...?!"},{"name":" GYO","avatar":"https://mangadex.org/covers/d831ed75-10fd-4af4-b23f-e732bc759036/5193ff9a-003f-484b-b271-1954b089aba7.jpg.256.jpg","country":"Japanese","stat":"7.44","status":"Completed","tags":["Drama,Horror"],"nutshell":"Something is rotten in Okinawa…the floating stench of death hangs over the island..What is it? A strange, legged fish appears on the scene…so begins Tadashi and Kaori's spiral into the horror (and stench) of the sea."},{"name":" Iwakutsuki Bukken no Yakuro-san","avatar":"https://mangadex.org/covers/a05b5c8c-1095-467e-96ce-a228f66c855b/8a9da5f7-5d67-4a1f-8715-0e6066bebcb6.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Ghosts,Romance,Comedy,Web Comic,Slice of Life,Supernatural,Mystery"],"nutshell":"19 year old Reikan Yuuki moves into an apartment that's supposedly haunted by a female ghost and sure enough said ghost shows up at night to get rid of him, but instead of running away in fear he joyfully introduces himself to the puzzled ghost! After all, the only reason he moved in was to meet his fated (ghost) person!\nA love comedy between a college boy with unusual preferences and a shy ghost, begins!\nAuthor's Twitter"},{"name":" The Nightmare of Fabrication","avatar":"https://mangadex.org/covers/9ba83841-f8f0-4ea6-934a-f3e1df40eb34/e06bb643-cab7-4007-af81-35110e0dff2d.jpg.256.jpg","country":"Japanese","stat":"8.19","status":"Completed","tags":["Oneshot,Sci-Fi,Psychological,Drama"],"nutshell":"The Nightmare of Fabrication is a beautifully drawn full-colour manga from Yoshitoshi ABe. The 18 page short story can be found in the Lain Omnipresence in Wired artbook. It's a bonus story which apparently isn't related with neither the anime nor the PS game. It shows characters who were included in the PS game but not in the TV series (like the psychiatrist), but also determinant characters from the anime who didn't appear in the videogame (like Deus)."},{"name":" Young Boy and Diamond","avatar":"https://mangadex.org/covers/662ce410-d63c-4b67-83f7-7a1d4a38d269/4c677376-0b7f-49eb-81ea-a5f06a286256.png.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Oneshot,Sports"],"nutshell":"This oneshot is about a young boy who hates baseball… until the day a passing stranger teaches him a valuable lesson!\nThis oneshot was featured in Harta volume 70, which released in December of 2019."},{"name":" Tiempo","avatar":"https://mangadex.org/covers/579b778b-bb9d-4f68-a193-4b30118cfbf5/852471de-604c-495f-9dda-9f98b841ff32.png.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Sports,Drama,School Life"],"nutshell":"A high school soccer story begins with a crybaby soccer player spinning a miracle! Yuzuki Seto started playing soccer in middle school and has been living a fulfilling life as it is. However, the situation changed completely when Keisuke Asami, who is one year older, joined the soccer club. Now the days of yelling hell will begin!"},{"name":" Master Villainess the Invincible!","avatar":"https://mangadex.org/covers/15d88ad6-19e7-48b6-b5db-8107fcccb220/1aad9f02-9753-451b-bb5a-1ec608daa5d3.jpg.256.jpg","country":"Korean","stat":"8.90","status":"Ongoing","tags":["Reincarnation,Historical,Action,Long Strip,Romance,Martial Arts,Wuxia,Isekai,Drama,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"Yeoju is a second-rate author living a mediocre existence in modern-day Korea. A tragic accident lands her in the plot of a bestselling martial arts novel and she wakes up as the infamous villainess Haewon Tang. Hoping to save herself from a gruesome death, Yeoju must figure out who to trust, harness Haewon’s inner chi, and learn martial arts as she fights to save the Sichuan Tang Clan. Can she change the outcome of the novel and prove she’s the worthy hero?\n\nLinks:\n\nWebtoon Trailer\nOriginal Webtoon <Webtoon kakao>\nOfficial Traditional Chinese Translation\nOfficial Indonesian Translation\nOfficial Japanese Translation\nOfficial Thai Translation"},{"name":" The Hero Who Returned Remains the Strongest in the Modern World","avatar":"https://mangadex.org/covers/69dcebee-7446-4eb2-8244-d903f12a6712/4c2a9863-dbd5-44de-9302-09186ee4fa6a.jpg.256.jpg","country":"Japanese","stat":"6.54","status":"Ongoing","tags":["Monsters,Action,Demons,Romance,Comedy,Adventure,Magic,Harem,Isekai,School Life,Fantasy,Supernatural,Adaptation"],"nutshell":"Morishita Taiju was transported into another world and became a hero, after wonderfully defeating the Demon Lord, he has returned to Japan. He was satisfied with his peaceful days as he hid his power, but… Hidden yokai and people with powers start to rampage, and the (rare nowadays) academy power battle-ish hidden world unfolds!! And Now He Trains Beautiful Warriors Using Superpowers!?"},{"name":" Hotaru wa Ashita Shinu DJ - Enough","avatar":"https://mangadex.org/covers/5c063063-4616-4f85-aa66-7b5742fbb5d9/a3d9fc09-cbf2-4255-89a4-c2d8b575fedf.png.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Oneshot,Romance,Boys' Love"],"nutshell":"10 Years Later."},{"name":" The Ribbon Wearing Female MC is Too Pure","avatar":"https://mangadex.org/covers/96a353a0-5a9e-49a3-81a6-3587c9e4cacd/c7a44024-6174-4c5c-b4fa-1e356405c1b2.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Oneshot,Romance,Web Comic,Slice of Life"],"nutshell":"A couple have a cute interaction over a ribbon."},{"name":" Douyara Watashi no Karada wa Kanzen Muteki no You Desu ne","avatar":"https://mangadex.org/covers/b6f8c7b9-eeae-4698-a0e7-05474f56b644/9a7366c1-5879-4362-b04f-d06ecd539e1f.jpg.256.jpg","country":"Japanese","stat":"7.46","status":"Ongoing","tags":["Reincarnation,Comedy,Adventure,Magic,Isekai,Fantasy,Adaptation"],"nutshell":"On her deathbed, a sickly young girl wishes to be reborn with a strong body that will never succumb to anyone or anything. Lo and behold, her wish is granted! Upon reincarnating into another world as Mary Regalia, she discovers her new body has maxed-out attributes, from physical strength to defense—even magic. But wait! That isn’t what she really wanted! All she longed for was a normal life. Baffled by God’s choice to grant her wish in this most unexpected way, Mary tries to spend her days as uneventfully as possible. The hitch is...nothing’s harder than living a normal life when you’re absolutely invincible!    Links:  - Original Web Novel (Raw)  - [ ComicWalker | NicoNico ] (Raw)"},{"name":" I Was Acknowledged as a Useless Good-for-Nothing so I Moved to the Empire to Get Ahead in Life","avatar":"https://mangadex.org/covers/71772ad7-505f-4180-a317-583034890a6c/eab86ab5-b628-48b0-ab74-f914dc939d24.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Ongoing","tags":["Action,Comedy,Fantasy"],"nutshell":"In the kingdom Lutz lived in until now, commoners were unable to climb up the social ladder, their efforts were denied and extra work disregarded. Lutz finally got fed up, and decided to move to the Empire, which was a complete meritocracy. It was a wonderful country where hard work and creativity was valued. Moreover, Lutz's special magic, which was seen to be useless in the kingdom, is able to beat platoon level monsters in the Empire! Lutz decides to set off in this new land, where values are upheld, rewards are given, and there's a simple path to get ahead in life!\nA fast paced magical isekai fantasy!!!"},{"name":" Isekai Kaeri no Daikenja-sama wa Sore Demo Kossori Kurashite Iru Tsumori desu","avatar":"https://mangadex.org/covers/312b9bce-c18c-4fa9-ba39-59ecc7d9cbe1/aa314257-25d5-49eb-9532-fa59b8c14f8e.jpg.256.jpg","country":"Japanese","stat":"7.29","status":"Ongoing","tags":["Action,Harem,Fantasy,Slice of Life,Supernatural,Adaptation"],"nutshell":"Saito was reincarnated to the other world at the age of 15, becomes the Great Sage, and defeated the Demon Lord. Shortly after that, the door connecting the other world and the real world opens, and Saitou return to Japan with the power of the Great Sage. However, 19 years have passed in the real world. Saito, who was drifted away for so long, met his childhood friend Kanako, who’s now a single mother. But it seems like there’s someone who’s targeting Kanako’s life… A story of a slow life wannabe Great Sage who came back from another world begins!"},{"name":" Fuuki Shoujo Manga","avatar":"https://mangadex.org/covers/68ffc937-4412-4909-9449-f11201ea2167/cf5e183a-f419-43b4-b081-0deae7ccbc8e.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life,Web Comic,Slice of Life"],"nutshell":""},{"name":" Wavelength of Imagination","avatar":"https://mangadex.org/covers/f8736ad0-99a8-44d7-97d3-03350739a045/0d9d783b-e850-4add-a378-6252f157ab67.jpg.256.jpg","country":"Japanese","stat":"8.60","status":"Completed","tags":["Oneshot,Comedy,School Life,Web Comic,Slice of Life"],"nutshell":""},{"name":" Usotsuki Satsuki Shi ga Mieru","avatar":"https://mangadex.org/covers/fac1870c-2ca1-439c-bd97-020dbbd732f0/0500a56d-f8c7-4b4c-a408-fde13a3172ca.jpg.256.jpg","country":"Japanese","stat":"8.77","status":"Ongoing","tags":["Thriller,Psychological,Girls' Love,School Life,Horror,Web Comic,Slice of Life,Supernatural,Mystery"],"nutshell":"\"You… are going to die tomorrow.\"\nMinadzuki Satsuki, 16 years old. Apart from being antisocial and declaring the death of her classmates, she is a normal high school second-year student. Her nickname is \"Liar Satsuki\".\nHowever, her eyes alone are abnormal. What she is gazing at is…"},{"name":" Bocchan no Jidai","avatar":"https://mangadex.org/covers/9c8d2826-7598-4979-a1c8-f1f9e9c999ca/18809e0c-f407-4fb2-9064-5da6c49e3418.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":[""],"nutshell":"Tokyo, November 1905. The Meiji Era began about 30 years ago, propelling Japan into the modern era. Never before had a country experienced such profound transformations in such a short time. It is in this context, at the same time totally changed and intensely Japanese, that the writer Natsume Soseki, back from England, begins the writing of his most famous work: Botchan... It will have taken twelve years to Jirô Taniguchi and Natsuo Sekikawa to complete the 5 volumes of the vast fresco that is At the time of Botchan."},{"name":" SMELL","avatar":"https://mangadex.org/covers/c27c21a8-5505-4ade-8c70-214ccb9e93db/8711cc00-7c41-4cc5-89c7-125518ab7913.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Animals,Boys' Love,School Life"],"nutshell":"In a school that a multitude of dog breeds attend, among them are a gregarious Border Collie and a taciturn Bloodhound..."},{"name":" Akuyaku Reijou to Kichiku Kishi","avatar":"https://mangadex.org/covers/40353755-a631-4c39-8974-7c90ebd8cd60/08527f73-690b-45c3-8407-f0147c9de605.jpg.256.jpg","country":"Japanese","stat":"8.35","status":"Ongoing","tags":["Romance,Isekai,Fantasy,Villainess,Adaptation"],"nutshell":"From Painful Nightz: The Marquis' daughter, Cecilia, had suddenly realised the fact that she had reincarnated into an Otome game as the villainous daughter! However, it was already too late for her to avoid condemnation. After breaking off her marriage engagement, she was framed by the heroine and had fallen, forcing her to become a prostitute. Her first customer was the heroine’s childhood friend, the Deputy Leader of the Imperial Guards, Lucas Herbst, who was so strong that he could even be considered a cheater in life. Frightened, Cecilia was embraced relentlessly only to awake in the residence of the Duke of Herbst the next morning. Moreover, a mark of the vow was engraved on her lower abdomen, marking her as Lucas’s fiancéeー?!"},{"name":" Sasaki and Miyano","avatar":"https://mangadex.org/covers/b603c211-d1f9-4145-a2ac-04dcd5f06329/e23ed186-9172-4eac-9a59-b747cfd7e4f1.jpg.256.jpg","country":"Japanese","stat":"9.33","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,School Life,Slice of Life"],"nutshell":"It all started like a typical old-school boys’ love plotline—bad-boy senior meets adorably awkward underclassman, one of them falls in love, and so on and so forth. But although Miyano is a self-proclaimed boys’ love expert, he hasn’t quite realized…he’s in one himself. Which means it’s up to Sasaki to make sure their story has a happily ever after…!"},{"name":" Yamada to Kase-san.","avatar":"https://mangadex.org/covers/8d612ce8-2d6f-464b-8d0d-98c0352cc146/df569dfc-4fc0-40e1-b498-8676852ad751.jpg.256.jpg","country":"Japanese","stat":"8.72","status":"Ongoing","tags":["Romance,Comedy,Girls' Love,School Life,Slice of Life"],"nutshell":"Yamada and Kase are now college freshmen living separately in Tokyo, and trying to sustain their loving relationship in an environment that is more open than what they're used to.\nOfficial Korean Translation"},{"name":" Cheerful Amnesia","avatar":"https://mangadex.org/covers/f9448f90-c068-4b6a-8c85-03d739aef255/5df363c5-16aa-471a-97f2-5bf24810a714.jpg.256.jpg","country":"Japanese","stat":"8.65","status":"Completed","tags":["Romance,Comedy,Girls' Love,4-Koma,Slice of Life"],"nutshell":"Mari's girlfriend, Arisa, loses her memories of the past three years, including all memory of their life together.\nHowever, it turns out that being crazy in love with someone transcends all realms of possibility."},{"name":" Hana ni Arashi","avatar":"https://mangadex.org/covers/bc86a871-ddc5-4e42-812a-ccd38101d82e/6a80aa9c-e893-48b6-b17d-0a5b972c7c77.jpg.256.jpg","country":"Japanese","stat":"8.74","status":"Ongoing","tags":["Romance,Girls' Love,School Life,Slice of Life"],"nutshell":"Unbeknownst to their friends and classmates, Nanoha and Chidori are dating. Watch as they try to keep their relationship secret!\nAuthor's Pixiv"},{"name":" Junji Ito Masterpiece Selection","avatar":"https://mangadex.org/covers/39f9219f-1323-4cba-ba8a-2d2761908f64/b613e1d8-76f9-4451-aed8-3d8f3f28c0f8.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Drama,Horror,Tragedy"],"nutshell":"A best-of story selection by the master of horror manga.\nThis volume includes nine of Junji Ito’s best short stories, as selected by the author himself and presented with accompanying notes and commentary. An arm peppered with tiny holes dangles from a sick girl’s window… After an idol hangs herself, balloons bearing faces appear in the sky, some even featuring your own face… An amateur film crew hires an extremely individualistic fashion model and faces a real bloody ending… An offering of nine fresh nightmares for the delectation of horror fans."},{"name":" Maou no Hisho","avatar":"https://mangadex.org/covers/669243b1-3a6c-4e25-9857-f57eee9ce18a/bf41f99d-c1c4-496c-a3e1-cadcf2833ae2.jpg.256.jpg","country":"Japanese","stat":"8.34","status":"Hiatus","tags":["Comedy,Adventure,Fantasy,Slice of Life"],"nutshell":"The Demon King has finally awoken. For the purpose of conquering the world, he decides to first kidnap some human. By the way, the one he was searching for was a stupidly capable \"Secretary\"…!\nShe does her work promptly and with unimaginable skill. Because of her, humanity is heading toward danger at Mach speed!!"},{"name":" PTSD Radio","avatar":"https://mangadex.org/covers/2954a23f-22c1-4bce-a2fc-0a0dc3e201a7/d41d17a7-c41a-4b1f-8a07-f9c06d75213e.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Hiatus","tags":["Monsters,Demons,Ghosts,Office Workers,Drama,Horror,Supernatural,Mystery"],"nutshell":"From the mangaka of Seeds of Anxiety comes another collection of short horror stories using introspection that will unhinge you… Best for midnight viewing!"},{"name":" Tokubetsu na Chuutohanpa","avatar":"https://mangadex.org/covers/927036cf-ae3e-48dd-b814-9cc774a1c8de/9f8eb632-58c2-4990-a961-10f1833e37c8.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Ongoing","tags":["Romance,Girls' Love,Drama,School Life,Gyaru"],"nutshell":"\"What does it mean to be dating exactly...?\"\nThey're not friends.\nBut they're also not lovers.\nIt's a story about these two's half-relationship."}]