[{"name":" Hotel S.L.","avatar":"https://mangadex.org/covers/9d5ce073-631b-4d8f-91bb-eabe416ccac4/c56f23c6-b7e1-4315-9ef4-836c820e4644.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Action,Mafia,Slice of Life,Cooking"],"nutshell":"Kouta who graduated from a famous culinary school, but also had poor grades and employment opportunities. But why not be introduced to the work of the hotel kitchen! However, the only information about said employment he was told was to \"Search for Stinger.\""},{"name":" Zone-Tan Adventures (Japan)","avatar":"https://mangadex.org/covers/9d5f06ed-26d2-4301-afd8-42079aec1d50/861b86b5-f375-42a6-82d1-0fd4b996c6ca.jpg.256.jpg","country":"English","stat":"6.84","status":"Completed","tags":["Long Strip,User Created"],"nutshell":"Zone-Tan goes to Japan!"},{"name":" Genshoku Tsundere Danshi Semekare","avatar":"https://mangadex.org/covers/9d5f77a7-b7da-4591-97a9-d881c411455d/57c1390f-d25c-4947-b4cc-cb8e099284d3.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Kimi ga Suki Plus Pink Passion Version by Watanabe Ayu\nAfter going out for only a year, their relationship is already in trouble?\nBoikore Boys’ Collection S Seitokaichou by Aikawa Hiro\nI’ve become a toy for a super S senpai, but I can’t defy him…\nAnata Nante, Kirai by Yoshioka Ririko\nHe’s such a frivolous person. Even so, he’s still the one I care about~?!\nShitsuji-sama to Himegoto ~Otona no Tame ni Atsui Chocolate~ by Aoi Saki\nEri wants to give the butler a Valentine’s chocolate that he will like, but…?!\nAkai High Heeru by Ishiko\nA good looking shop manager with spectacles… Just looking at his serious facial expressions turns me on.\nThis is one of 8 (as of 8/31/10) Genshoku Tsundere Danshi Anthology books."},{"name":" Look at me","avatar":"https://mangadex.org/covers/9d624f02-e2cc-4bb4-94d7-a6e4195fc753/377e80a4-27d5-425b-ac3b-304d759ce85c.jpg.256.jpg","country":"Thai","stat":"7.98","status":"Completed","tags":["Oneshot,Romance,User Created,Office Workers"],"nutshell":"He secretly loved her for a long time. He only hoped for her to look at him."},{"name":" The End of Unrequited Love","avatar":"https://mangadex.org/covers/9d63fb59-2d95-48c2-b089-68b2fa5c4856/c43a8fbf-54e4-4329-a426-0d712c2b3ec4.jpg.256.jpg","country":"Korean","stat":"8.09","status":"Ongoing","tags":["Long Strip,Romance,Drama,School Life,Web Comic,Full Color"],"nutshell":"One-sided love master Haeri has a confession success rate of 0%. Yechan accidentally witnesses the humiliating 19th confession scene. Haeri vowed never to like anyone again, but started having a crush on him again, and decided to get Yechan's help to prevent her 20th confession... Will this love be successful?"},{"name":" Your Instinctive Love","avatar":"https://mangadex.org/covers/9d64ee50-f0c0-4d32-8904-da6caa4298b6/ffc600ce-4181-473f-b5d8-81d5150ca2a2.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Police,Web Comic,Mystery,Full Color"],"nutshell":"Shin Yu-jin, a clumsy male friend with shaggy hair who only knew about studying. He, who was foolish, changes 180 degrees and shakes Kang-hee's heart. “I can’t watch you with other guys pretending to be friends anymore.” Her fluttering first love that started like that, Yoo-jin leaves in an unexpected accident, leaving Kang-hee with a trauma. Eight years later, Kang-hee became a homicide detective. She's been on an undercover job for a week and she meets a strange man in a hotel lounge. A face and coupling that resemble Eugene's. Confused by her confusion, Kanghee ruins his seat, and the two continue to get entangled due to an inevitability like a coincidence..."},{"name":" Ninkoi","avatar":"https://mangadex.org/covers/9d6b8d90-e22b-4e55-a2d4-9808661f5e4f/c14493a0-5eae-422c-a54a-27df89d27c52.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Romance,Ninja,Comedy,Martial Arts,School Life"],"nutshell":"A new love story series of a modern day ninja. The main character is Matsuei Anko. On the only remaining ninja hideout in modern Japan, Anko, a twelve-year-old child that trains from day to night just to have the strength and power of guys, but eventually becomes frustrated with the difference in strength.\n”I don't want to be feminine, I want to be a strong ninja instead,\" was Anko's wish to the owner of the prestigious Kazan-Inge (Kazan Home Temple), as she takes the exam to be a master specialist ninja…"},{"name":" God of War","avatar":"https://mangadex.org/covers/9d6dcd49-2cde-478f-9b19-775f3e53b980/e95cacd5-3f0b-4818-b984-0ec9134940f5.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.77","status":"Completed","tags":["Official Colored,Action,Long Strip,Martial Arts,Adventure,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Within the Nine Prefectures, there are many kingdoms. Rumor has it that deep in the desolate lands, masters are as common as the clouds. They have the ability to go against their fates! Outside the Savage Beast Mountain Range, in a small city called Stone City, there is only one person who goes against the will of the heavens and changes his fate."},{"name":" Nanba Deadend","avatar":"https://mangadex.org/covers/9d70a27c-b48e-49f1-ab6e-36f3af566379/afa8fdb3-3be4-43c0-ab4d-e64188e280cf.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Action,Romance,Comedy,Martial Arts,Drama,School Life"],"nutshell":"Nanba Tsuyoshi is leading a double life. He's part of a hardcore delinquent family, and he's supposed to go to their traditional Ichimatsu high school and be the top fighter. Instead, he's secretly attending the high-class Shirayuri high school, as a normal kid. For a while, things seem to be going well. He has the skills of a top fighter, so he just sneaks into Ichimatsu to knock out his competitors. Afterwards, he switches back to his mild-mannered, Art Club president, student council president alter ego. With a little help from a few trusted friends, he's kept the two lives safely separate.\nEverything gets a little harder when his little sister Ginko decides to attend Shirayuri high school. Will he be able to keep his identity secret from his own sister, as they attend the same school? And how will he deal with Yayoi, a Shirayuri student with a huge crush on his punk persona? Will he be able to keep up his double life until graduation?"},{"name":" Planet Ladder","avatar":"https://mangadex.org/covers/9d74def9-a995-4e11-a1c3-0bdd10bbaad5/8b57db36-9a1d-4832-a103-d9e8c17110a6.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Adventure,Drama,Fantasy"],"nutshell":"Kaguya is a weird orphan who was adopted by a japanese family. One day, she gets called \"princess\" by strangers who take her to a strange world which should be her home."},{"name":" The Road to Dragon Quest","avatar":"https://mangadex.org/covers/9d751491-a72d-41ae-8d95-3cb420a9d582/154b5878-02c2-44b2-8d02-3fb4eb7cb860.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Monsters,Action,Comedy,Adventure,Video Games,Drama,Slice of Life"],"nutshell":"A manga that is essentially the story of Enix from the time it starts working with games, until its release of the series it became known for, Dragon Quest. All the characters are real Enix employees at the time. You get to see the developers as real people, who agonize over everything, like how big to make the text boxes, what should NPCs say, etc, as well as how they get along with each other."},{"name":" The Mismatched Marriage","avatar":"https://mangadex.org/covers/9d77daf1-bc1f-4fd6-85c4-4cef82afb7c7/8c2e30b2-9c11-40bd-8a46-eb470fe8df8b.png.256.jpg","country":"Chinese (Simplified)","stat":"7.99","status":"Ongoing","tags":["Long Strip,Romance,Drama,Web Comic,Full Color"],"nutshell":"To help her aunt settle an enormous debt, June Qin reluctantly agrees to an arranged marriage. Yet, the person awaiting her at the wedding is instead Michael Zong, the brother of her fiancée. Through a series of sudden twists, so begins an awkward marriage that promises uncertain outcomes"},{"name":" Her Dirty Thirty Scandal","avatar":"https://mangadex.org/covers/9d7babbd-c534-45ec-af06-3bd9d0ec16cf/a80aee4a-2ebc-48aa-ab17-90eef4eb284e.jpg.256.jpg","country":"Korean","stat":"7.91","status":"Completed","tags":["Romance,Office Workers,Drama,Web Comic,Full Color"],"nutshell":"A lifetime of hard work has finally paid off for Serin. She's got a nice apartment, a promotion at work, but something's missing. A piece of her that she's pushed away for so long that when it comes back, it beats faster and throbs harder than she could've ever imagined. Flings are for students and teenagers. She may be all grown up, but that doesn't mean she's ready for her first scandal.\n[2nd Lezhin Comics Big Comic Contest Prize Winner.]\nOfficial Japanese translation:\nhttps://www.lezhin.jp/ja/comic/goldmiss"},{"name":" Jingai-san no Yome","avatar":"https://mangadex.org/covers/9d7efe58-a295-4858-9f22-d7ff156de389/109b039f-ea0c-4ef7-a5ea-b12b4e43655e.jpg.256.jpg","country":"Japanese","stat":"8.39","status":"Ongoing","tags":["Monsters,Comedy,4-Koma,School Life,Fantasy,Slice of Life"],"nutshell":"Hinowa Tomari is a normal high schooler, until one day he's told that he has to become the wife of a mysterious creature called Kanenogi.\nThis is the start of their newly married life."},{"name":" Love Live! - About who we have been until now, and who I will be from now on (Doujinshi)","avatar":"https://mangadex.org/covers/9d7f62ba-86a8-43cc-80ab-6732c64d5166/56b8263f-a0af-459b-9c40-821ae5e6358e.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Girls' Love,Philosophical"],"nutshell":"In which Honoka, Umi and Kotori are in a very healthy relationship. /s\n{ Honoka x Umi x Kotori }"},{"name":" Green","avatar":"https://mangadex.org/covers/9d85b738-9c29-4518-bccf-0ca6607abf56/03fe6151-cb04-4525-a358-27358dbb0f42.jpg.256.jpg","country":"Japanese","stat":"8.19","status":"Completed","tags":["Oneshot,Drama,Slice of Life"],"nutshell":"Kengo is overwhelmed. As his wife Ayumi gets hospitalized, he has to take care of his baby daughter Momo. He ends up asking Hitomi, who’s a little girl herself, for help…"},{"name":" Joubutsu Shimaseu.","avatar":"https://mangadex.org/covers/9d93dc64-b86c-4f26-84df-73d791236f6e/70f7b537-05c3-479a-9507-1688d9bd3845.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Sports"],"nutshell":""},{"name":" Gori-sen ~The type of PE teacher to die first during a panic~","avatar":"https://mangadex.org/covers/9da1aa3e-6bca-4423-89c2-af657f93ff78/3bdfd85f-fd38-4943-9173-092486d470cd.jpg.256.jpg","country":"Japanese","stat":"8.93","status":"Ongoing","tags":["Monsters,Comedy,School Life,Horror,Web Comic,Supernatural"],"nutshell":"This is a manga about the kind of PE teacher who dies at the start of a school horror film."},{"name":" Akizuki-san wa Otona ni Narenai","avatar":"https://mangadex.org/covers/9da3583f-541e-405b-95ce-2a3ad657f877/987d6637-8ead-46d4-be5c-34d20d9b63e1.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Comedy,4-Koma,Web Comic,Slice of Life"],"nutshell":"The story centers on Yusa, a 25-year-old nursery school teacher. Yusa's boyfriend is Akizuki, a 32-year-old president of a toy company. Akizuki is handsome and capable, but he unfortunately still behaves in childish ways. When they begin living together, their everyday lives become more and more strange.\n\nAuthor's  Twitter and  Pixiv"},{"name":" The Executioner who stops time is pretending to be my wife","avatar":"https://mangadex.org/covers/9da48dfb-c18d-422f-baa3-28e2c5f5d73a/40a12819-be5e-4324-9890-73f1a6ac0fe2.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Thriller,Action,Supernatural,Mystery"],"nutshell":"Musashi Mizoguchi, a humble taxi driver, lost his family and despaired of life.\nOne day, he meets a pair of mysterious little girls and is handed a million dollars to go to a warehouse. Unable to leave it alone, he goes to the designated warehouse, but there is a beautiful girl with a large number of corpses and a gun!?\nMoreover, she was a psychic who could stop time. However, the condition for activating that ability was that she had to take off her clothes and get excited!! On top of that, in order to be able to use her ability efficiently, Musashi had to act as both her driver and a fake husband!?\nA man with a sad past and a mysterious time-stopping assassin begin a strange and slightly shameful marriage!!!!"},{"name":" Yukemuri Biyori Koi Meguri","avatar":"https://mangadex.org/covers/9daddaa6-df9d-49fe-9b4f-f0edb5befccd/4d5577e8-3d0b-43fc-aaa1-d1ad6235277b.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama"],"nutshell":"Following in his mother's footsteps, Wataru became the onsen ryokan's male \"hostess.\" Minato, a handsome guy, confesses \"I love Wataru!\", giving the inn the reputation of Best Treatment for Love Relationships! Will Wataru, who is still learning his profession, react well to this passionate love attack?"},{"name":" Yoake no Inu","avatar":"https://mangadex.org/covers/9daff193-53b8-4ca1-8f47-900510c9b493/77cee973-bbcc-4e67-b471-f8e0b0e38397.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Boys' Love,Office Workers,Slice of Life"],"nutshell":"Koinui Akira lives with his senior co-worker and develops feelings for him."},{"name":" Jujutsu Kaisen - Le Plus Fort des Exorcistes","avatar":"https://mangadex.org/covers/9db0566f-cfe4-4975-bc1b-b941b0f59b4f/989b59dd-9e7e-444b-a998-4007fc3e42e7.jpg.256.jpg","country":"French","stat":"8.10","status":"Completed","tags":["Official Colored,Comedy,Full Color"],"nutshell":""},{"name":" Crazy Like a Fox","avatar":"https://mangadex.org/covers/9db3470f-2582-4ffc-931a-da8fa76b40f8/137d303d-ba9b-46ae-8be8-c514c74f735f.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Survival,Magic,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"When the emperor declared that his children must battle to become the last remaining heir, the only way Princess Lisbelle could survive was by becoming a mad woman. Feigning insanity kept her out of danger for years, but with only three children remaining, Lisbelle now finds herself a target. In a moment of danger, she discovers powers gifted to her by the goddess Hellare and suddenly finds herself in the company of a charming magician. But whether he’s friend or foe has yet to be determined…\n\n\"On the Moonlight Garden-! White evening primroses are in full bloom -!\"\nA strange succession ceremony has all princes and princesses fight each other as only the strongest member of the royal family may succeed the throne. After being poisoned to death, she returned five years into the past and decided to played the part of a crazy b*tch in order to survive. Yet somehow looking like the weakest was still not enough. The crazy princess, with no power or backing, was about to die yet again, but a suspicious wizard suddenly appeared before her.\n\"What should I do to get your kiss?\"\n\"A deal. If you help me, I'll kiss you.\"\n\"Good. I have no intention of letting you die in the hands of anyone besides me.\"\nI feel like I entered the tiger's den while trying to escape the wolves… Is it really okay if I make this deal? A fiery battle and romance between a woman walking towards life with all her might, and a man who lives for death.\n\nOriginal Webtoon: Daum, KakaoPage\nOfficial Translations:\n\nEnglish\nChinese (Simplified) / 汉语\nChinese (Traditional) / 漢語\nIndonesian / Bahasa Indonesia\nJapanese / 日本語\nThai / ภาษาไทย"},{"name":" Strategic Lovers","avatar":"https://mangadex.org/covers/9dba8d1f-9fe7-48e7-9c1b-868ca4144068/5cb49741-6154-403a-8372-af98c68c494c.jpg.256.jpg","country":"Japanese","stat":"7.09","status":"Ongoing","tags":["Psychological,Romance,Harem,Drama,School Life,Gyaru"],"nutshell":"Kouta, a high school boy whose father is the chairman of the Higashiyama Group, a large corporation involved in the development of railroads, department stores, and resort facilities, plays the leading role in a romantic survival game. As the son of his father's 23rd mistress, Kota doesn't really feel like the son of the chairman. Despite this, he's suddenly chosen as the next chairman of the Higashiyama Group and is assigned a girl to be his mistress."},{"name":" Friends Until the Fourth Verse","avatar":"https://mangadex.org/covers/9dbbbb34-bbd8-4c29-974e-801f1fff4fd7/167d3949-76aa-4af7-a787-2f90a11934a9.jpg.256.jpg","country":"Korean","stat":"7.89","status":"Ongoing","tags":["Romance,Boys' Love,Web Comic,Full Color"],"nutshell":"Soo Gyeom, an ordinary student on vacation, is surprised by his best friend Bum Jin Hyeong coming out to him.\nBut to be a good and reliable friend, he somehow winds up accompanying his friend to a gay bar.\nSomehow, he starts wondering about his own sexuality, and their relationship begins flowing in a strange direction…"},{"name":" Love My Cat","avatar":"https://mangadex.org/covers/9dbf5d66-5922-41b7-a24b-7ee21eb1a7f3/bf7fdbd2-83ce-4650-adf5-3b02f33a5d2c.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.53","status":"Completed","tags":["Animals,Long Strip,Comedy"],"nutshell":"It said that cats are unloving creatures and humans are meant to shovel…\n\nLinks:\n\nAlternative Raw (AC QQ)"},{"name":" My Lucky Star","avatar":"https://mangadex.org/covers/9dc21e16-5416-4f30-9a24-86beeed586ff/0feedc41-e5b9-4421-bcba-70953fc9ae8a.png.256.jpg","country":"Chinese (Simplified)","stat":"8.55","status":"Ongoing","tags":["Long Strip,Romance,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"Mu Zixing met a beautiful boy, Sinan, when she was five years old. He became her childhood friend. During their first meeting, Zixing was rejected by Sinan while she played with mud. Zixing grew to believe that she was hated, but did not know that Sinan, who was enraptured by her infectious cheerfulness and smile, had slowly fallen in love with her. And this love only grew deeper and deeper with time."},{"name":" Shishunki Miman Okotowari - Kanketsu Hen","avatar":"https://mangadex.org/covers/9dc2ce2b-3343-465e-8054-f5d12af8f3c6/629126b1-fd8c-400c-8e77-e6655a4341fc.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Romance,Anthology,School Life"],"nutshell":"Collection of short stories:\n\n\nShishunki Miman Okotowari Ending\nAs final chapter of the Shinshunki Miman Okotowari series, Manato returns from America, but he doesn't come with the best news for Asuka. This might be the last time he returns to Japan.\n\n\nCouple\nInaho has fallen in love with Takumi, the lead guitarist of a high-school band. With hand-made gifts and her strange personality, she gets Takumi to ask her out. But only with a special biwa (a Japanese lute) can their relationship last.\n\n\nChikyu no Arukikata\nAyuki just got dumped. On the same day, she hurt her ankle during track practice. Later, Ayuki gets trapped on the wrong train to the coast. On this train, she meets Hiroto, a guy who has quit school in search of himself. Ayuki wonders if she should do the same."},{"name":" Daruma no Kokoro","avatar":"https://mangadex.org/covers/9dc3753e-6e4f-4f0a-a867-f79da2888614/14e20c2d-e6b4-4658-9096-25c964026fea.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"I’ve always thought that if I were to fall in love, then I’d want to love someone who is kind and praises me!"},{"name":" Miss Me?","avatar":"/cover-placeholder.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"From CPM:\nA fashionable high school girl has a crush on the lead singer of a heavy metal band, but he seems indifferent to her feelings. After attending a concert she meets the lead singer's handsome friend who falls in love with her. It's too bad she doesn't feel the spark for him… Whoever said that romance was easy?"},{"name":" Namekawa-san Won't Be Mocked","avatar":"https://mangadex.org/covers/9dc7dc2b-8085-4840-a634-e479129922e0/efd5455a-ed57-42a4-b2ca-a0375661e87a.jpg.256.jpg","country":"Japanese","stat":"7.57","status":"Ongoing","tags":["Comedy,Girls' Love,School Life,Delinquents"],"nutshell":"A delinquent x discipline committee president back-and-forth comedy."}]