[{"name":" Piñata","avatar":"https://mangadex.org/covers/75dd89fd-cfd8-4063-a55c-2ab9bc798e39/abf033fc-e292-45ff-a2b4-64e6aaa89d32.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Long Strip,Drama,Web Comic,Full Color"],"nutshell":"\"네겐 좋은 것만 가득할 거야.\" 애정 어린 기억과는 모순된 삶을 사는 드류, 그리고 그런 드류를 걱정하는 친구 미켈의 이야기."},{"name":" Otaku Plays Basketball","avatar":"https://mangadex.org/covers/75e084b9-71b8-4f8e-b5b4-a7e203bc2c2e/a4ed1ca0-a73d-4ac1-b0c3-056e3ce66343.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.95","status":"Ongoing","tags":["Action,Long Strip,Sports,Web Comic,Slice of Life"],"nutshell":"Zhou Dahua was amazing as a student. He was handsome, superbly skilled and seemingly had a good life. But he lost the spotlight after graduation. In a blink of an eye, Zhou Dahua became a loser who was nearly 30 years old, someone who was living like a salted fish, and just waiting to die. On a cold night after a major betrayal, he realized that his life was completely different from how he imagined it 10 years ago. He was a complete failure without any goals and a future. Just when when he was frustrated beyond belief, a student who happened to be a loyal fan appeared and invited him to participate in the \"Treasure Island Community Cup 3V3 Basketball Competition\". Soon after, a team consisting of shrimp soldiers and crabs officially joined the tournament!"},{"name":" I Thought an Adventure of Swords and Sorcery Would Be Waiting When I Reincarnated, and Yet...","avatar":"https://mangadex.org/covers/75e0faaa-4dab-4aa6-8908-9553fa11fc07/c094a260-16ce-4f18-af6f-b31a244173f9.png.256.jpg","country":"Japanese","stat":"8.51","status":"Completed","tags":["Oneshot,Reincarnation,Comedy,Adventure,Isekai,Fantasy"],"nutshell":"A new oneshot from Kaneda Yousuke, the author of Kishuku Gakkou no Juliet!"},{"name":" Futsuriai na Chocolate","avatar":"https://mangadex.org/covers/75e12fe0-e691-4669-912b-4037069aaed5/8b244a7a-f81b-45bc-ab7e-bbbe2fe8e410.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"A collection of stories:\n1-2) Futsuriai na Chocolate & Aimai na Candy\nLately, a guy has been coming around to talk a lot to straight-laced library employee, Fukagawa. Oosawa is the manager of some very popular nightclubs and lives in a completely different world from Fukagawa. But no matter how Fukagawa acts coldly, Oosawa doesn't lose hope and every time he's touched, contrary to his demeanor, his heart stirs…\nThe bittersweet romance of an obstinate heart gently coming apart.\n3-4) Nakayoshi\n5-6) Yama no Mukou Sora no Mukou\n7-10) Moe Bara Special & Ore to Tora no Mikkakan\nExtra) Shinya Konbini nite"},{"name":" Kaitou Drugers! - Junjou Koi Dorobou","avatar":"https://mangadex.org/covers/75e356bc-b9c7-44c1-8df7-d125a9d18f51/cd45bfe4-d9b4-4a04-8c65-d027649cf745.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,Boys' Love,Fantasy"],"nutshell":"A boy at a mysterious school has been splashed with a 'reducing potion' and he's searching for a way to cure himself."},{"name":" Who Are You Creator?","avatar":"https://mangadex.org/covers/75e43ebb-7cd2-4a86-91c3-5bfa891972e9/9a794c79-ea2f-4093-91dd-6adadfc78815.jpg.256.jpg","country":"Korean","stat":"8.09","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Web Comic,Full Color"],"nutshell":"Lee Yuu is an aspiring actor who put aside the pursuit of a stable public servant career in order to become an actor…! Facing a dead end, a youtuber named Lee Hoo appears in front of him, suggesting he tries… “gay acting”?! What started as an acting business relationship, as time passes could this become… love?"},{"name":" South Park - Wonderwall (Doujinshi)","avatar":"https://mangadex.org/covers/75e86635-57c8-45ff-b4c4-81b98be06d20/b92c0314-9f16-4c03-8650-4b5f02f7a801.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"Pairing: Eric x Kyle"},{"name":" K-ON! - The Ritsu Ritsu Ritsu Ritsu Ritsu x Mio book (Doujinshi)","avatar":"https://mangadex.org/covers/75ebe370-711e-40ed-b448-a478c18fb335/139ac5fd-5554-47d2-9e10-d50fe148889a.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Comedy,Girls' Love,School Life,Fantasy"],"nutshell":""},{"name":" I Kill Zombies in Wasteland","avatar":"https://mangadex.org/covers/75f0eea5-1b99-4f96-9f4b-2e6814bb9b8c/8771a690-1130-4a84-a21f-6acb57f22a9f.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.04","status":"Hiatus","tags":["Action,Long Strip,Comedy,Survival,Zombies,Adventure,Post-Apocalyptic,Supernatural,Full Color"],"nutshell":"“Eternal Night of Poison Rain” The event that ended Human Civilisation in a single day, humans escaped, and built a New City in the wilderness. The old city was covered in the sea of miasma, and it birthed new monsters—— The Scourge, commonly known as Zombies. In order to fight against them, humanity evolved and awakened superpowers. The main character, Wu Chan, to get rid of the dangers caused by the superpower’s side effects, he sets out on a dangerous journey into the hazardous Old City. But first, he needs to open a Waste Incineration Center…"},{"name":" Fire of Megiddo","avatar":"https://mangadex.org/covers/75f62ec7-f875-4be8-be9f-1f111bb740c0/7458f2d4-21c5-408b-9f78-18f326e8bc30.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Comedy,Survival,Adventure,Military,Drama,School Life,Horror,Slice of Life,Aliens,Supernatural,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nOne day, strange incidents began to occur one after another around Hokuto Issei. One after another, people whom Hokuto found unfavorable began to disappear. And before he knew it, a birthmark of the Big Dipper appeared on Hokuto's face....\nWho are Kotoe, a glowing girl with an eerie secret, and the mysterious man, Cancer Shiratori, whom they met at the same time? And what is the key word \"Fire of Megiddo\"?\nThis is the story of a boy who was ordered by aliens to purge the earth!"},{"name":" A Story About Something Humans Forget, but Cats Remember","avatar":"https://mangadex.org/covers/75feefdd-cc86-45f1-addd-1d8ba72eec15/e90e89d7-15cb-4a01-b871-806f9b483969.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Oneshot,Sci-Fi,Psychological,Animals,Web Comic,Slice of Life,Full Color"],"nutshell":""},{"name":" I Will Not Be a Girl","avatar":"https://mangadex.org/covers/75ffe3fb-4d6a-4a74-b95f-63ec6d7381a1/db46999d-e694-440f-ae8d-ccc1ed09c761.jpg.256.jpg","country":"Japanese","stat":"7.54","status":"Ongoing","tags":["Genderswap,Comedy,School Life,Web Comic,Slice of Life"],"nutshell":"Takeru Saito is an ordinary high school boy with a powerful secret: with a flick of his wrist, he can magically change another person’s gender.\nWanting to become the top dog of his class, Takeru quickly turns the most popular of the guys in his class into girls. He expected confusion, but instead he got…"},{"name":" Hohoemi Ouji to Shinderera","avatar":"https://mangadex.org/covers/76024a28-e3da-47b5-927d-2da6e760304e/9323f2cd-ecd4-4ffc-82b2-4ca190cef9d1.png.256.jpg","country":"Japanese","stat":"7.81","status":"Ongoing","tags":["Romance,Comedy,Boys' Love"],"nutshell":"Akira, an ordinary high school boy, suddenly became step-brothers with Souichi Mikawa, a very popular actor, due to the marriage of their parents. Akira was hoping to have a real older brother, but instead he was suddenly forced to play the role of lover…?!"},{"name":" Kimi ga Suki Toka Arienai","avatar":"https://mangadex.org/covers/760be47f-12d0-476d-bed3-f1a9384d33c3/babae9db-25d6-41fc-b56d-c7080c2fe021.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Kana, who has zero experience with love and can't even talk to a boy, loves to read about it in her favorite manga, which according to her friends is completely unrealistic. Annoyed by their cynicism, Kana declares that she will finally get herself a boyfriend and prove them wrong. Suddenly, a handsome transfer student arrives. Is this love at first sight? Does she have a chance with this popular boy? Why does he seem to know so much about her?"},{"name":" Touhou GO","avatar":"https://mangadex.org/covers/761c0410-78e7-4e52-a579-13ebf8201feb/da32ab97-75af-4b0d-a78f-1adae9c10835.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Comedy,Video Games,Web Comic"],"nutshell":"Hakurei Shrine is suddenly overrun with people after the popular GPS game Pokémon Go leads people to Reimu's home. Reimu, Marisa and other Gensokyo residents try out the game and learn about it."},{"name":" Namae no nai Kaibutsu - Kumo to Shoujo to Ryoki Satsujin","avatar":"https://mangadex.org/covers/7622667c-6922-4003-9fc1-ded7a0598292/f632f613-88a1-4a19-929d-69aa67821d0b.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Thriller,Sci-Fi,Monsters,Action,Animals,Romance,Survival,Drama,Horror,Monster Girls,Web Comic,Supernatural,Mystery,Adaptation"],"nutshell":"Midnight. Awakened by the echoing sound in my room, I was met with a frightening pair of \"legs.\" Since then, as if wishing to merely make its presence known, it remained in my room without letting itself be seen. In the same way it was spreading its encircling net, little by little it encroached on my life until at last it appeared before me. Its true form was that of an exceedingly beautiful \"nameless monster.\" Desperate resistance was futile as the monster dropped its hand towards me. I could not escape or resist. Hiding it from my skeptical lover and friends, thus opened the curtain to our strange life together. Quietly, the senses I had as a human were dying as my normal life continued to collapse. The moment I knew what was awaiting me, I was presented with an important decision.\nAt the same time the monster first appeared before me, the public was disturbed by a string of bizarre murders. It was then that I began to wonder whether they and my beautiful yet eerie roommate were connected."},{"name":" My Goal Is to Live a Long, Healthy Life as a Golden Spoon (Promo)","avatar":"https://mangadex.org/covers/762429b2-5210-4121-ad5a-833c9635e9f5/ad7e1b23-a635-4685-a640-1413945c327b.jpg.256.jpg","country":"Korean","stat":"7.68","status":"Completed","tags":["Oneshot,Long Strip,Romance,Isekai,Adaptation,Full Color"],"nutshell":"“I was born with a gold spoon in my mouth but I’m being murdered miserably? I’ll survive thoroughly and live a long life!”\nI’ve been reincarnated as the younger sister of my favorite’s novel character who is destined to be poisoned by her step-mother at the age of seventeen. My brother is on an adventure with the heroine so I have to survive by myself. Should we start with survival plans? First, be sure to behave myself around my step-mother and step-sister. Secondly, become close with children of influential families. Third, is… umh… getting married?\nTo escape the fate of a miserable death, I, Adriana, begin to approach the Prince of the Empire, the suspicious Master, and the suspicious Demon!"},{"name":" Paper Memories","avatar":"https://mangadex.org/covers/762a85fd-c2e3-4cfc-97b3-9a95a3a8f150/7f3bccef-5114-4544-bd28-b23ddb8f3b5d.png.256.jpg","country":"English","stat":"8.02","status":"Completed","tags":["Romance,Comedy,Adventure,Drama,Music"],"nutshell":"Comic stories collection from To the Moon & Finding Paradise, illustrated by puré, co-written with Kan Gao."},{"name":" Shiroi Ori","avatar":"https://mangadex.org/covers/762c2c8d-acbf-43f7-bbdf-4f87b5959f01/fefe05e3-7a81-4f8a-aaba-771e9a12c2e8.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Psychological,Boys' Love,Drama,School Life"],"nutshell":"1-6) Heita was secretly in love with his classmate, Komai, and was found out by the infirmary sensei, Tsuge. Tsuge threatened Heita, “If you want me to keep it a secret, you'd have to listen to me.” From then on, Heita lets Tsuge have his way with him. Soon, Heita found that his rationality could no longer restrain his own overwhelming urge and desire. Did he fall in love with Tsuge?\n\n\nUntold Love\nA moment of kindness in a train station made Miyami Shigo pay attention to shy bespeckled Maki Shuuichi. But when they meet again, Maki doesn't remember Miyami, and is cold towards him.\n\n\nMoonlight Melody\nEdgar Lockwood is a beautiful young man with light hair and porcelain skin, so he's a favorite object of affection at the all boy's school he attends. Problem is, Edgar is straight, and all this male attention is totally unwanted! He even has to have a bodyguard in the form of childhood friend/servant Dick Clay. When Edgar gets the bright idea to tell everyone they're dating to repel his admirers, it's the perfect solution to his problem… right?\n\n\nA Certain Day in Winter\nHeita, Komai, Tsuge all end up at Imayasu's place for hotpot. Sure, why not."},{"name":" Wagamama Romeo","avatar":"https://mangadex.org/covers/76303330-2a52-45e9-b4fd-27f6743248ce/2689d148-c534-499c-80b5-e9fba6687dca.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Comedy,Boys' Love,Drama"],"nutshell":"Spoiled by his family, Kazuomi can't stand the feeling of someone clinging onto him and thus just can't seem to have attachment to any person - even his lover bothers him. But can he really dump his lover without feeling anything at all?"},{"name":" Shinpu-sama no Kyuuketsuki","avatar":"https://mangadex.org/covers/7635881c-5f0d-41f0-862f-68b1314570c3/9fc3b63b-71c3-41ea-a3ab-23e936996935.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Romance,Comedy,Boys' Love,Vampires,Supernatural"],"nutshell":"Claude, a vampire who just arrived in town seeking fresh blood, meets a handsome man, Father Ruslan. However, while thinking about making him his dinner, he's the one who gets eaten!\nClaude also ends up with a seal on his arm, putting him in a state of absolute submission. In the end, he becomes the one getting gently nibbled on by Ruslan's pet lycanthrope and by Imp the imp, among others!"},{"name":" Dairy's","avatar":"https://mangadex.org/covers/7638a141-d515-48a5-8a92-1c9e806a9b98/480b9e03-9893-4641-bec8-aa499c09bbc7.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Comedy,School Life,Slice of Life"],"nutshell":"This is a story about somewhat eccentric high school girls who hang out in the corner of a classroom at a certain high school, working on something with all their might. They bake gyoza and grind coffee beans in that classroom. Sometimes they fantasize about the struggles of the \"odens\"..."},{"name":" Gunjou Gakusha","avatar":"https://mangadex.org/covers/763b2694-624e-4af0-8586-5e28659775cc/f5bfc2f2-481b-4a1e-bd55-354d29a9f650.jpg.256.jpg","country":"Japanese","stat":"8.58","status":"Completed","tags":["Romance,Anthology,Drama,Fantasy"],"nutshell":"An independent collection of short stories — Ultramarine Schooldays highlights the color that evokes faithful memories, tenderness, and melancholy. These stories take place in Japan and in the West, in the past and in the present. They may involve a romance in the city, an energizing walk in the forest, the daily mundane life of a waitress working in a café, or a medieval intrigue; but what connects these stories are the powerful messages they deliver."},{"name":" Tsuwamonogatari","avatar":"https://mangadex.org/covers/7640f402-47ab-4d04-bdcd-7e9ea0d040f4/fe86987c-072d-4da3-8ddd-0c667d25059b.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Historical,Action,Samurai"],"nutshell":""},{"name":" Senshuuraku Made Matte","avatar":"https://mangadex.org/covers/7644c204-6aac-4f5c-8396-84c71f5092ba/77a140b5-3f57-4211-90f1-4e5158f0297a.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Boys' Love,Drama"],"nutshell":""},{"name":" Sloppy Advances","avatar":"https://mangadex.org/covers/7648a536-8a95-4539-8695-93d8a4f10b68/9c4e216a-e9b6-40f3-8162-cd42cd3239d1.png.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Oneshot,Romance,Comedy,Web Comic,Slice of Life"],"nutshell":""},{"name":" Compiler","avatar":"https://mangadex.org/covers/764a6727-0a60-40ef-b28c-82a35ae82472/8d7025de-4790-449e-8e0d-c3a865cfe246.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Sci-Fi,Romance,Comedy,Virtual Reality,Drama"],"nutshell":"COMPILER is a story about two brothers, Nachi and Toshi Igarashi, meeting two beauties from another dimension.\nOriginally sent to conquer Earth through a game of destruction and creation,\nCompiler and Assembler ended up deciding that living in our world is more fun than conquering it.\nThey moved in with Nachi and Toshi. A growing relationship began to develop between Nachi and Compiler,\nand Toshi and Assembler, though none of them can bring themselves to admit it outright.\nMeanwhile, the people who sent Compiler and Assembler to conquer Earth were outraged by their apparent betrayal.\nThey sent two assassins, Bios and Directory, to deal with the renegades and proceed with the invasion plan.\nAnd so, the misadventures begin…"},{"name":" Shoujo Kessen Orgia","avatar":"https://mangadex.org/covers/7652403f-8448-46d8-a664-369a2a0785fc/f33a7b81-ec27-4f01-9523-3bff68597250.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Action,Fantasy,Slice of Life,Supernatural,Mystery"],"nutshell":"Every 20 years, a secretive game is held, in which participants duke it out in a battle royale with sorcery, weaponry and hand to hand combat.\nOver a hundred different Japanese sorcery associations participate, sending a single Master each to compete. Night by night these participants fight, and take the lives of one another.\nOne participant is Maiko Mizumaki. She enters the tournament in order to save the life of her dear friend, Hino, who has been afflicted by an Anomaly. In order to save the life of her friend she must survive until the end and obtain the strongest Anomaly Sandalphon."},{"name":" The Great Godly Demon","avatar":"https://mangadex.org/covers/7658c36e-f20c-44d7-a94f-bc0331da9c2c/09fc79c3-cc9d-4316-8651-d3e79485ac67.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.03","status":"Ongoing","tags":["Action,Long Strip,Martial Arts,Wuxia,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"The countless martial artists were gnashing their teeth at Xia Ping, wanting to bury him in the ground. Xia Ping, in response to the hatred of so many people, calmly pulled forth the “Super hatred System” interface and looked at the various goodies on it, rubbing his chin: “I’ve accumulated so many values, I don’t know whether to exchange for the Sacred Pill Chaos Pill, or the supreme martial art Rulai Palm, or the divine weapon Qiankun Cauldron, what a worry. “"},{"name":" Shingeki no Kyojin - Honey Trip (Doujinshi)","avatar":"https://mangadex.org/covers/765a5792-39a2-44c7-aec0-6fa9954dead6/265348dd-225b-4264-8828-5dc25a3ff35e.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Anthology,Boys' Love"],"nutshell":"Pairing: Levi x Eren\nAn anthology containing short stories about RivaEre and their lovely honeymoon together!"},{"name":" Jaa Kimi No Kawari Ni Korosou Ka ~ Prequel","avatar":"https://mangadex.org/covers/76616e0d-d39e-4a73-9541-d49577838e89/680e9fd9-80a3-4a4c-b1c8-cb6fd5588d15.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Psychological,Long Strip,Mafia,Drama,Mystery"],"nutshell":"Phần tiền truyện của bộ Jaa, Kimi no Kawari ni Korosou ka? . Nhân vật chính lần này là Kumaoka Aizen (em trai cùng cha khác mẹ của Ameri xuất hiện ở chap 22 trong chính truyện), con trai của lão đại yakuza. Câu chuyện diễn ra vào hồi cấp 2 của Aizen và phần này tập trung miêu tả quá trình thay đổi nhân cách của Aizen và những anh em cùng cha khác mẹ khác mà Aizen đã gặp."},{"name":" Santa","avatar":"https://mangadex.org/covers/76676249-8ea4-4981-828d-3b33a9803cc3/b5e00c70-692c-4d91-b3aa-66cd78e47f7c.jpg.256.jpg","country":"Korean","stat":"8.18","status":"Completed","tags":["Long Strip,Romance,Drama,Fantasy"],"nutshell":"After years in an abusive household, Bell fled from her hopeless situation.\nAfter being left bloody and beaten on the side of the road, she experienced a Christmas miracle."}]