[{"name":" As the Lady Wishes","avatar":"https://mangadex.org/covers/8c88d78c-bb6a-41cd-bcb3-71735f55e0dd/b69c9413-8bfe-4d9c-8dc8-c36aa2104bee.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Completed","tags":["Long Strip,Romance,Comedy,Web Comic,Adaptation,Full Color"],"nutshell":"In this modern twist on a fairytale romance, Hyun Eunseo was adopted by a wealthy conglomerate family at the age of seven. She was treated like a princess from childhood, but Jinha, the calm and composed youngest son of her adoptive parents, had always been particularly devoted to her. When Eunseo’s grandfather collapses, his grandsons find themselves competing to win over her heart--which is also the key to inheriting the family business empire. She knows Jinha is the best candidate to be her Prince Charming, but she struggles with a lingering attachment to her childhood friend, and Jinha’s cousin, Seungyeon. Will the wicked members of her family succeed in ruining her life and love? Or, can Eunseo realize the difference between duty and desire?\nSource: Tappytoon"},{"name":" Shiki","avatar":"https://mangadex.org/covers/8c8bae4c-5dbc-4099-b889-8e118d674c76/4870476c-b0d3-45fd-af0c-033af70c59e4.jpg.256.jpg","country":"Japanese","stat":"8.24","status":"Completed","tags":["Drama,Medical,Horror,Vampires,Supernatural,Mystery,Tragedy"],"nutshell":"Sotoba is a village \"surrounded by death\", a small traditional Japanese village who's primary industry is creating grave markers out of the Fir trees that surround the isolated town. On one particularly hot summer, people start dying in droves, with some people living with the rotting corpses of their family for weeks before their own bodies are discovered by neighbors. Meanwhile, the residents begin to gossip about the new family who moved into the newly built mansion atop a mountain in the town. As the death toll mounts, the doctors of the town suspect it to be a new type of epidemic, until they begin to see the figures of the deceased walking in the night.\nShiki blurs the line between good and evil, following a story that has no true protagonists or antagonists, but rather two sides attempting to survive in a deadly environment. Can one be called evil because they didn't starve to death?"},{"name":" Dream Fossil","avatar":"https://mangadex.org/covers/8c91a89a-8315-412e-bc52-beb8194f94d9/f57cbddd-3d60-4103-b1f6-79e5f8f20380.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Oneshot,Thriller,Award Winning,Sci-Fi,Historical,Action,Psychological,Ghosts,Animals,Romance,Comedy,Anthology,Crime,Survival,Sports,Martial Arts,Samurai,Mafia,Adventure,Post-Apocalyptic,Magic,Military,Drama,School Life,Horror,Fantasy,Delinquents,Police,Slice of Life,Supernatural,Adaptation,Tragedy"],"nutshell":"Dream Fossil is a collection of 15 short stories by the late Satoshi Kon. These stories, serialized in a variety of magazines in the 1980’s, give a rare glimpse into the early stages of Kon’s uniquely compelling style of storytelling. The buds of dream-like themes and imaginative worldviews that would blossom in his later animated works are also readily apparent. Yet the flights of fancy are anchored by knowing, empathetic portrayals of the very human nature of each story.\nOfficial French\nOfficial English"},{"name":" Hoteri Hotette First Kiss","avatar":"https://mangadex.org/covers/8c953456-55a6-4294-913c-3f5f640711b1/0fceb9b6-d43a-47a3-8486-e3da18c14fbc.png.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance"],"nutshell":"Uzuki Coco's first anthology of short stories is here!\nStory One: Calligraphy club member Kure Otogi is a first-year high school girl who has feelings for Sono Kuranosuke, a third-year high school senior in the same club. From the first day she joined the club, Sono made a strong first impression on her that made her start to feel attracted to him, but while she spent her high school life looking forward to the club activities, Sono was preparing for his entrance exams..."},{"name":" RPG W(・∀・)RLD - Roleplay World","avatar":"https://mangadex.org/covers/8c9c7307-a21e-4e90-aac9-f6cd91cb6b18/c42eca06-6474-41cb-b4f2-f60b743e7b42.png.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Action,Romance,Comedy,Adventure,Video Games,Isekai,Fantasy,Adaptation"],"nutshell":"Yuugo went to the RPG world to play until he realized he was on the highest level. Thus, this attracted a lot of players especially cute girls there.\n\"I felt like I don't want to return to reality!\"\nWith his perverted mind, Yuugo took a dungeon quest and realized there's no reset button or even resurrection spells."},{"name":" Kuroko no Basket - Muro-chin Ano ne (Doujinshi)","avatar":"https://mangadex.org/covers/8ca82184-1aff-41ce-ae4a-7bb621818ee9/b735e8ee-6b70-4194-9694-185d9392af14.jpg.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Oneshot,Romance,Boys' Love"],"nutshell":"Pairing : Murasakibara x Himuro\nMurasakibara can’t help but wanting to touch Himuro more and more. After dreaming about Himuro, he stops hanging out with him."},{"name":" Rental Hearts","avatar":"https://mangadex.org/covers/8ca93c81-e052-4dd1-b77c-e18eacdbd442/20b34f03-795a-449e-9289-f41d04907f24.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Action,Romance,Drama,School Life,Supernatural"],"nutshell":"Amamiya Nonoka is a human that can see spirits. Because of the strange ability she posseses, she has no friends at school at all. Suddenly, one day two handsome brothers appear in front of the lonely Nonoka. Aki and Kou, the two of them came to borrow Nonoka's \"strange ability\"? Not to mention, they are renting parts of their bodies to continue living…"},{"name":" Hellsing - Innocent (Doujinshi)","avatar":"https://mangadex.org/covers/8caa73d1-2067-4793-b4ae-d5667653f5ce/3e40f547-b561-4648-8c4f-bc70d345fc33.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Girls' Love,Vampires"],"nutshell":""},{"name":" A Warm Sister and a Tsundere Brother","avatar":"https://mangadex.org/covers/8cadb75f-fc98-4b8a-b20a-4cb708f321e5/3a02dd8a-0ccb-480d-9a8e-e02fc6d6ccd9.png.256.jpg","country":"Japanese","stat":"7.92","status":"Ongoing","tags":["Web Comic,Slice of Life"],"nutshell":"A shy boy tries to get along with his out-going new step-sister."},{"name":" Otokotomodachi ni Tsugeraretara Dousuru?","avatar":"https://mangadex.org/covers/8cb025a9-eb1d-40df-acc5-084fa2c24bd8/cc85c113-0599-43d4-9f21-1430931eea73.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy"],"nutshell":"\"I like it,\"\n\"I thought I was a friend !?\"\nMiraka was confessed to her childhood friend, Roto, a boyfriend. What is love? What does it mean to be dating? While being puzzled by the world of love full of love for the first time, Miraka makes a proposal to Ryoto ...?"},{"name":" Kill Me Kiss Me","avatar":"https://mangadex.org/covers/8cb64398-8386-4cce-b79f-cfe933cc7e6e/c8df48a5-b8ca-4636-8127-24d44ee7ab30.jpg.256.jpg","country":"Korean","stat":"8.04","status":"Completed","tags":["Romance,Comedy,Crossdressing,School Life"],"nutshell":"When Tae Yeon Im finds out that the idol star that she's adored for ages is currently attending the same school as her identical cousin, Jung-Woo Im. She convinces her cousin to exploit their similitude and switch places, or maybe he just likes wearing a skirt? So, she will dress as him, attend his school, and try to get close to her lover boy. Meanwhile, he will dress as her, attend her school, and revel in its sea of babes. The plan seems flawless until Tae learns of a bully named Ga-Wun Kim who likes to beat up on poor Jung-Woo. While Jung-Woo finds that being a woman might not be as thrilling as perceived."},{"name":" Heroes of the Imjin War","avatar":"https://mangadex.org/covers/8cb69aad-acf7-4065-be7c-c3687835bbe6/309c87cb-047c-41b9-b03e-de1a0502d6c4.jpg.256.jpg","country":"Korean","stat":"7.69","status":"Ongoing","tags":["Historical,Action,Long Strip,Wuxia,Fantasy"],"nutshell":"Two centuries after the establishment of the Joseon dynasty, a long war breaks out because of the Japanese invasion. Four beings, both human and celestial, struggle to correct the balance of the universe: Eun-dong, a boy who lost his mother to the war and is now searching for his father; Tae-eul, the Angel of Death who seeks to solve the mystery of the lost souls, the honorable 800-year-old Tiger Heuk-ho, and the nine-tailed fox, Ho Yu-hwan. This is their story."},{"name":" Back to the Hero","avatar":"https://mangadex.org/covers/8cb6b378-b2ef-487a-8d2a-9347ce3a41fe/e21a5c2d-7ace-4103-a49f-451ea3f69fc0.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,Comedy,Drama,Mystery"],"nutshell":"The miraculous encounter that changed my entire world."},{"name":" Saji-chan no Yami Nikki","avatar":"https://mangadex.org/covers/8cc8a484-e0f0-4294-8db3-c02107a09e80/33aca76a-09a8-4589-88c2-dceff0693a51.jpg.256.jpg","country":"Japanese","stat":"7.22","status":"Completed","tags":["Psychological,Comedy,Girls' Love,4-Koma"],"nutshell":"Saji has a girl that she likes. That pure feeling is not understood by others, but surely love is the truth. Take, steal, stab, take away… it is also love."},{"name":" If You're Gonna Dress Up, Do It Like This for ladies","avatar":"https://mangadex.org/covers/8ccffe01-9d3a-47d2-b3cb-a1448053643a/5519c254-a880-41fd-8f22-569e7b517467.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Ongoing","tags":["Slice of Life"],"nutshell":""},{"name":" Himitsu","avatar":"https://mangadex.org/covers/8cd257a8-4b96-45ee-948b-f025e770862b/2b4c5aef-38f6-48c7-806c-35f9503a404c.png.256.jpg","country":"Japanese","stat":"7.19","status":"Completed","tags":["Oneshot,Drama,Web Comic,Slice of Life"],"nutshell":""},{"name":" Kocchi Mite yo, Hidaka","avatar":"https://mangadex.org/covers/8cd9b2d4-c347-43f1-b6cc-b0b3b1b8bf1f/989600de-4414-460c-b6dc-1be704a38278.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,School Life"],"nutshell":""},{"name":" Free! - When the Iwatobi Sakura Bloom (Doujinshi)","avatar":"https://mangadex.org/covers/8ce01f43-18ae-47fe-a74c-6f86e2120d7e/5ec2e2e3-3818-44d1-8e59-b9a64aa3bfc2.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Ongoing","tags":[""],"nutshell":"Finally the day of mobilization Makoto has been decided, he promises the artist Haru back alive, carrying a portrait of him that awaits you."},{"name":" An Inescapable Love","avatar":"https://mangadex.org/covers/8ce8c05b-775f-4073-9184-1246c2f99bbc/d1c2fb6b-3d2c-4347-9100-4325415930a2.png.256.jpg","country":"Korean","stat":"8.13","status":"Completed","tags":["Historical,Long Strip,Romance,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"For Princess Seollan, life as the twin sister and shadow of the sickly crown prince was a suffocating prison. So when the king commands her to marry Jihwan of House Choi, she knows it's her only chance to escape the palace and its shackles. Unfortunately, poor Jihwan was cursed by a vengeful white fox with a dangerous thirst for royal blood, and is dead set against their marriage. But in the end, the two are powerless to stop the wedding. Thus, Seollan is determined to find a cure for her new husband– but the truth that they uncover may be more cruel than the curse itself. Will their newfound love bloom bright in the snow, despite the harsh winds of fate that lie ahead?\nBased on the Original Webnovel by Mieun-lee"},{"name":" Heartrate Presto","avatar":"https://mangadex.org/covers/8cf02bc9-f484-469e-90f1-05aef478b9cf/cdf1886f-a02f-4eb7-8418-47ab337e07d0.jpg.256.jpg","country":"Korean","stat":"7.85","status":"Completed","tags":["Long Strip,Romance,Boys' Love,Web Comic,Cooking,Music,Full Color"],"nutshell":"21st century’s most successful chef, Roman Brenon. The one who saved him was unknown pianist, Yuri Jung’s music, when he was suffering due to the side effect of an accident.\nBut unfortunately he can never play the piano in front of people again because of his illness, when he finally found him.\nBut the moment he was rejected and going to give up, he realized. He was endlessly captivated by him."},{"name":" Ori no Kagi","avatar":"https://mangadex.org/covers/8cf19392-cd19-48c9-8646-fa61f1ab31f7/3478d1d6-bcfb-4ec4-b42f-137ed0bcbfb1.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Romance,Drama"],"nutshell":"Her body and heart has been captured, moving from one cage to another.\nThe sixth princess, Edith-sama, is moved to the Seiji canyon to marry the head of the tribe that lives there, Leica. As she arrives, she is escorted by her brother, Jui, through the tropical terrain.\n\"Once you set foot on the island, you're not a princess anymore.\"\n\"I am the sixth princess of the Gion Kingdom, and I came here for my wedding. If I am not a princess, I am nothing.\"\n\"Then... everyone is. We all build from scratch.\"\nEdith ponders Jui's words... and learns to discover her worth."},{"name":" Sukitte Iwasete?","avatar":"https://mangadex.org/covers/8cfb6113-99d3-4901-8f60-b5ed0b60acfc/a3fe735f-dfa6-4f7c-86c1-32e9ebda18d5.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"The cheerful and affectionate Hidekazu; the thoughtful and genial Eiji. They were my old neighbors, the super popular twins. I, Ueto Shun, am in love with the younger twin, Eiji. We study at the same university and share an apartment, although I do not pay the rent… I live under the same roof, but… I am in trouble! I'm happy, but I find it problematic: the excitement of living with the person I love."},{"name":" Boku wa Aku de Ii, Omae wo Koroseru nara.","avatar":"https://mangadex.org/covers/8d0412dc-c5d3-4fe5-b7ba-6ab567238b47/85c7adec-1ced-448b-bc67-61d8a4506a23.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Drama,Horror,Mystery"],"nutshell":""},{"name":" Jingai-sama no Oshi","avatar":"https://mangadex.org/covers/8d0b3607-6682-4ed7-85c8-15719024511c/636bdb20-f89a-45ee-8ebd-67422620a96d.png.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Oneshot,Comedy,Drama,School Life,Delinquents,Supernatural,Gyaru"],"nutshell":"There are beings that are able to surpass human knowledge, called the Jingai-samas. It's said that people who are followed by Jingai-samas are blessed with fortune, but as someone who's been followed by them, Tsukinami Mikeh grew uncomfortable with the need to live by a false persona for one. She tried to get rid of her Jingai-sama by leaving her past to pursue her true self, but...!?"},{"name":" Specimen M-51","avatar":"https://mangadex.org/covers/8d156ad1-adf7-48c3-be9e-5e2a61475782/f77eaab5-6881-46d9-8e9c-a47df6e79625.jpg.256.jpg","country":"Japanese","stat":"8.26","status":"Completed","tags":["Oneshot,Sci-Fi,Monsters,Comedy,Web Comic,Slice of Life"],"nutshell":""},{"name":" Confession Poem","avatar":"https://mangadex.org/covers/8d157341-b5c5-4f93-b5ee-76c010e92bbc/48986ce7-b924-46a1-9d2c-83072ac92e8a.png.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Action,Romance,Fantasy,Supernatural"],"nutshell":"Xiao Yan finally worked up the courage to confess to her childhood crush, Gong Feng Yao, but only received an ambiguous response. Was it not the right time to confess? Or was it because she wasn't outstanding enough? But no matter what, she doesn't want to give up after having been in love with Gong Feng for so many years. However, shortly after this unsuccessful confession, another sudden confession threw her normal life into utter chaosㅡthe sudden appearance of a gigantic monster who turned the entire city into a destructive abyss, an overbearing kiss that took her by surprise, and the appearance of a demon that destroys everything! And who is this man who has appeared suddenly in her life amidst the chaos?"},{"name":" I'm Not a Warrior!","avatar":"https://mangadex.org/covers/8d1a4a97-26f5-4bcd-a41c-398048ba29d0/f6d96185-5080-424b-b002-e549e864c636.jpg.256.jpg","country":"Korean","stat":"8.01","status":"Hiatus","tags":["Long Strip,Romance,Adventure,Magic,Drama,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"After a life full of hardship and heartache, Chon-Eun Ha died in the hospital all alone. However, she woke up suddenly in a lush forest, reincarnated as a witch an a wonderous fantasy world full of magicians, knights and other creatures. A world so wonderous, in fact, that suddenly she finds a fairy has moved into her house. \"My brave warrior! I've been waiting for you! I'm sorry I must have startled you!\" What is this fairy doing in my house?! \"My name is Ariel!\" No way, THE heavenly Ariel from the \"Tale of Ariel\"?!"},{"name":" Possession","avatar":"https://mangadex.org/covers/8d1b8d96-2052-499e-b78e-7f52921789e7/ef2ba427-066d-4baa-af1c-e82e876f4d10.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Long Strip,Fantasy,Web Comic,Full Color"],"nutshell":"Beneath the Overworld, in the Underground Empire Jeojeojeo, the 17th Great King suddenly declares that they are leaving the throne. A contest is announced and the winner will get to be the new Great King. A Rank-A prisoner, the dethroned half prince named Jet, follows his father's command and participates in this contest but…\n\"What? To be the great king I have to protect that loser?!\"\nThat is the \"Token\". Jet needs to protect it in the fierce competition of the Underground people, where each person has to protect a \"Prince's Token\"."},{"name":" Hozuki-san Chi no Aneki + Imouto no Omake","avatar":"https://mangadex.org/covers/8d1f7e2e-28fa-47f0-9f09-c4c2715defd3/751a96cf-533c-4a87-aba8-bca877b6de69.jpg.256.jpg","country":"Japanese","stat":"7.27","status":"Completed","tags":["Comedy,4-Koma,Slice of Life"],"nutshell":"(+ Imouto no Omake) Is a compilation of episodes drawn from all the different ideas that Igarashi had but didn't use in the main story."},{"name":" Great Land","avatar":"https://mangadex.org/covers/8d1fe9d9-1ba7-44ea-b45c-ab845899aab2/89e5a372-4ae7-4e97-b000-19153a68cf72.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.89","status":"Completed","tags":["Action,Long Strip,Adventure,Fantasy,Web Comic,Full Color"],"nutshell":"All living beings in heaven and earth are moving without a stop, everything is constantly flowing. In the future society with the rapid development of science and technology, an oasis in the desert of human emotions - \"Great Land\" was developed, 10 billion people online at the same time, and around this virtual world launched a once-in-a-decade competition. In this confusing game world, Guaidao X and Yu Shaoye chase each other, similar to meteors, turning into shining trails. Sparks ignite one by one in the night sky of civilization. The heroes awaken a storm in order to rebuild the civilized world."},{"name":" The Condemned Villainess is Reborn as the Villainess of the Sequel","avatar":"https://mangadex.org/covers/8d21295d-6ad0-4cb4-b071-a8c059b519f1/b8ea3eb3-7472-4bd3-94b3-fb80923954a3.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Reincarnation,Isekai,Villainess,Adaptation"],"nutshell":""},{"name":" Yawaraka","avatar":"https://mangadex.org/covers/8d224c08-626b-4a5a-9eb4-fcc7a937f137/d8f3370f-2a3a-46eb-b62f-d60872cae2c5.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Sports,Martial Arts,4-Koma,School Life,Slice of Life"],"nutshell":"かわいく、そしてたくましく！　ゆるかわＪＫ柔道部、その知られざる日常がここに!!\n『ウチコミ！』でおなじみの稀代の柔道絵師・村岡ユウが描き出す、「熱血」×「ほっこり」新感覚柔道４コマ!!"}]