[{"name":" Checkmate","avatar":"https://mangadex.org/covers/b9ac2847-16c7-4527-a16c-f9d618ff2a4e/503ed746-4350-4090-a40f-2e2c0bfa0ad6.jpg.256.jpg","country":"Korean","stat":"8.12","status":"Ongoing","tags":["Psychological,Long Strip,Boys' Love,Web Comic"],"nutshell":"When he was just a student, Soohyun, ranked second, felt envious of the perfect Eunsung. Although he tried catching Eunsung, his soul aflame with passion, it wasn’t enough, and he lost all his motivation upon graduation.\nAs time passed, Soohyun forgot everything. However, when he saw Eunsung collapse for the first time, he felt extreme pleasure. With his obsession for Eunsung rekindling, he has a desire to see him fall even further in front of him…"},{"name":" His Name is 101","avatar":"https://mangadex.org/covers/b9b35f81-64f5-4329-9aef-12e3ec635a2a/40287958-6c18-453b-b4d9-d4b304fcadd1.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Survival,Mafia,Adventure,Office Workers,Military,Drama,Fantasy,Supernatural,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nBabel II is back! Koichi Yamano, a 16-year-old ESPer boy, is now called 101 at a research institute, where he donates his special blood to give vitality to the sick.\nHowever, he escapes when he finds out that ESPers are actually being created and misused by a huge organization.\nThe battle between 101 and the organization has begun as 101 tries to dispose of his ESP abilites in order to keep the peace!"},{"name":" I'm Not The Cult Leader","avatar":"https://mangadex.org/covers/b9bcd5a5-23cc-47f4-a79d-752897cf3305/f93fc8e3-c712-40b4-ae87-cd5965fc139e.jpg.256.jpg","country":"Chinese (Simplified)","stat":"6.86","status":"Ongoing","tags":["Reincarnation,Action,Long Strip,Romance,Comedy,Martial Arts,Wuxia,Fantasy,Web Comic,Full Color"],"nutshell":"Who am I? Where am I? What am I doing? Wait, wait! Great Alliance Leader! Stop it already!! I really…… am not the Cult Leader! The entirety of the Jianghu thought that the Cult Leader of the Demonic Cult was a woman—who would've thought that the Cult Leader could even secretly start a harem?!"},{"name":" Rose Covered Labyrinth","avatar":"https://mangadex.org/covers/b9be7127-98c9-4c79-98e6-c23dd54dec0b/cba1eb07-b778-45a9-a360-3bf08da6ec0c.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":[""],"nutshell":""},{"name":" Tategami ni I Love You","avatar":"https://mangadex.org/covers/b9cc8f63-89f3-4c6d-913c-d0e2427df90a/94027cd3-542d-432e-a594-874632394ac9.png.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Boys' Love,School Life,Delinquents"],"nutshell":"At a high school full of delinquents, Leo Shishiyama, a boy who looked cute but was the best fighter, is puzzled. Takeru Kurosawa, who had constantly challenging Leo to fights that ended up in a draw, has sent him an eighth challenge letter. Leo likes winning, but he doesn't particularly like fighting, and enjoys gorging on strawberry rice cakes, his favorite snack, much more. He tries to ignore Takeru, but bumps into his beautiful little sister on the street, who shows him kindness. If he can beat Takeru, maybe he can make a move on her! Leo faces Takeru, but who comes out victorious...?"},{"name":" Maken Musashi","avatar":"https://mangadex.org/covers/b9cdbd07-a068-4168-9bd6-37a7e9b46364/34486f82-9571-4687-8f53-918ca876519e.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Action,Psychological,Animals,Comedy,Anthology,Survival,Sports,Adventure,Philosophical,Drama,Slice of Life,Tragedy"],"nutshell":"(from amazon.jp):\nThe King of Gekiga, Ikki Kajiwara (Asao Takamori), and the Genius of Animal Manga, KYUTA ISHIKAWA.\nThese two giants of strong creativity have teamed up for only two works. That's right, the two works you are holding in your hands right now are only \"Maken Musashi\" and \"The Winds of Kilimanjaro\"!\nAlthough the stories are set in Japan and Africa, they are both shocking works that question the nature of civilized society through the interaction between a boy and a wild animal.\nThe overwhelming depiction of a \"proud and powerful dogfighting dog that never bends its way of life\" and \"the law of nature\" are both depicted in this work.\nThe life-threatening message of the \"king of beasts\" who defies the laws of nature will inevitably leave an indelible mark on the hearts of those who read the work. The message of the \"King of Hundred Beasts\" against the laws of nature will inevitably leave a mark on the hearts of those who read it!\nIn addition to the two title stories, four animal short stories by Kyuta Ishikawa are also included in this volume!\nCome on, let's awaken the \"wild self\" that has been dormant!"},{"name":" The Warrior and the Deity","avatar":"https://mangadex.org/covers/b9d1cf8b-bbcd-4733-9c6f-964200d626c5/fca29821-a42a-48f4-b9b1-2baf98470f86.jpg.256.jpg","country":"Korean","stat":"7.77","status":"Completed","tags":["Demons,Long Strip,Boys' Love,Adventure,Magic,Fantasy,Web Comic,Full Color"],"nutshell":"Orr was cursed after drawing a legendary sword from the ground which made him lose all emotions. On his way to defeat the Demon King, he had to stay at a village to resolve the cases many people simply vanishing. In that place, he met Mayim, a mountain deity who seemed to be connected to the abductions?\n(Random Fujoshis Scans)"},{"name":" KAWUMM!","avatar":"https://mangadex.org/covers/b9d89512-f4ba-46a1-b799-13256f888b50/71d8cbbb-13fa-42f5-89fa-c59f0070bf18.jpg.256.jpg","country":"English","stat":"8.06","status":"Ongoing","tags":["Action,Demons,Comedy,Drama,Horror,Web Comic,Supernatural"],"nutshell":"\"Angels and Demons are invisible to the human eye\"\nHaniel and Balial are two Angels who need to exorcise a number of lowly Demons in order to advance in the pecking order. The problem is... they suck at it.\nOne day, Haniel is tricked into thinking he's somehow been demoted to a mortal when an old, seemingly human woman asks for his help grocery shopping.\nHe puts the blame on his partner's lacklustre performance, and follows the elderly woman. Unbeknownst to him, they're being misled into a Demon ambush. Strangely enough, their higher-ups are there to rescue them. Suddenly, Balial transforms and Haniel loses conciousness.\nThinking his only friend is gone forever, Haniel must continue facing Demons,\nwhile he's being tormented by extreme self-loathing for how he used to treat him."},{"name":" Hyakka Souen","avatar":"https://mangadex.org/covers/b9da112c-91b8-43ba-a370-0f6c96a73029/735cc93f-b8c0-4824-9587-61ae1eafc856.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Official Colored,Boys' Love,Full Color"],"nutshell":"Color BL pictures."},{"name":" Diego!!","avatar":"https://mangadex.org/covers/b9dc7b45-5378-4c2e-af5f-e9de819d970a/2b2b3737-79df-4112-b92f-d8b11b1a224e.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Sports"],"nutshell":"Story about an Italian boy that bears the same name as the Argentine and Napoli legend."},{"name":" Gohoubi Gohan","avatar":"https://mangadex.org/covers/b9dcc38e-9427-4742-b82b-50a009e7348b/809374eb-5398-4785-8648-6cba1b65e886.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Slice of Life,Cooking"],"nutshell":"Ikeda Sakiko has just moved to Tokyo to work as an office lady. It's tiring work, so once a week she treats herself to a good meal for a job well done."},{"name":" Dear Boy","avatar":"https://mangadex.org/covers/b9df001b-e0c9-4eab-9c32-410c0d7e0bf5/a49a2432-6880-41f0-a779-8b95c3d308a7.jpg.256.jpg","country":"Korean","stat":"8.27","status":"Completed","tags":["Action,Psychological,Long Strip,Martial Arts,Drama,School Life"],"nutshell":"A story of bitterness, hate, and revenge… Callous to the pains of his classmate being bullied by punks, Yongju one day finds himself the target. When Yongju's attempt to get back at the bullies goes terribly wrong, his brother Yong Jin pledges to enact justice - setting him on a methodical yet twisted path bent on ruthless vengeance."},{"name":" Haru Natsu Aki Fuyu - HaruNatsuAkiFuyu (Doujinshi)","avatar":"https://mangadex.org/covers/b9e0ab78-6931-40a6-ac66-680010291b92/da0a6a3c-62dc-4bf2-a672-fcd8bea0ffb5.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Anthology,Girls' Love,School Life"],"nutshell":"A collection of (very) short stories focusing on the four main schoolgirls of Saint Theresa Girls Academy we previously met in Haru Natsu Aki Fuyu manga.\n\nThe Present.\nHaruka & Breasts\nOver the Line"},{"name":" Neko to Kurasu","avatar":"https://mangadex.org/covers/b9ef03f8-22e4-4e9b-ba9d-7c1b289ac4e6/ba5a170c-dea5-45c9-8ce8-f834a24ba2f4.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Animals,Slice of Life,Tragedy"],"nutshell":"Two stories centering around people whose cats helped them through difficult times.\nStory 1: What \"Fuu\" Taught Me - A star model in full height of her career suffers an accident that leaves her paraplegic in a wheelchair. She has no will to live, but finds strength in the family pet cat.\nStory 2: What \"Black\" Told Me"},{"name":" I'm Not an Angel","avatar":"https://mangadex.org/covers/b9f12f69-7a48-4102-874d-65764181aef1/fbd06c89-9c70-4b65-a04c-938696e5cb98.png.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Fantasy,Supernatural"],"nutshell":"A witch tries to become an angel."},{"name":" Pin to Kona","avatar":"https://mangadex.org/covers/b9f23680-983c-4c69-9869-5b40b215a6f2/b9cc2f9a-0d36-4bf3-9da4-9495c1b4ac34.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Award Winning,Romance,Drama,Slice of Life"],"nutshell":"In the world of Kabuki, where family social standings are highly valued, Kyonosuke is inept even though he is born as the son of a duke of a famous household. Ichiya while being born in a family that has no connection to Kabuki, is trying to move from the absolute lowest rank to the top using just his ability. Through some kind of karma, these two completely opposite boys have fallen in love with the same girl, Ayame.\nThat’s where the story begins.\nPin to Kona won the 57th Shogakukan Manga Awards."},{"name":" Jinrou Chronicle","avatar":"https://mangadex.org/covers/b9f6e63e-766b-448b-b319-967302f94708/4a61c3ab-8542-4ff8-a27d-cee84bc1c94c.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Boys' Love,Drama,Fantasy,Supernatural,Tragedy"],"nutshell":"When the full moon rises, the sleeping beast's blood awakens. Which of fated twins will the Wolf God choose?"},{"name":" Facing Off Against the Scumbag Top","avatar":"https://mangadex.org/covers/b9f7c22c-9fee-42cf-a735-4bd37e3f8422/1aa27378-448e-4cc2-a910-e0bf29e4297b.png.256.jpg","country":"Chinese (Simplified)","stat":"7.82","status":"Ongoing","tags":["Official Colored,Long Strip,Boys' Love,Full Color"],"nutshell":"Yu Baoyuan bared his soul for five years but still ended up being driven away by the scumbag. Was he defeated? Impossible. Even if his entire life was a mess, Brother Yuanbao still insisted that he—the dauntless, stubborn and foxy man—was the chosen one. Hence, Brother Yuanbao did not waver when the scumbag poured his heart out to ask for forgiveness. Yuanbao stroked his cat as he drank tea and casually commented, “The weather has turned chilly, some men should be trained…"},{"name":" Guilty: Nakanu Hotaru ga Mi wo Kogasu","avatar":"https://mangadex.org/covers/b9f82217-6ba5-489b-ab63-dc13935b0e57/95351172-d763-43d4-82b9-04c74c7f1311.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Drama,Slice of Life"],"nutshell":"Affection, betrayal, desperation—love between grown-ups is never a rational thing. Sayaka, age 35, has lived with the perfect husband for ten years. Perfect, that is, except for his disinterest in raising a child—she wants one badly, but just can’t come clean to him about it. Instead she unloads her frustrations on her younger friend Rui at their favorite bar. They trust each other enough to talk about almost anything—but Rui has a secret she can’t even let Sayaka know about."},{"name":" Ghostly School Horror Diary","avatar":"https://mangadex.org/covers/b9f8b062-0a54-4480-ac36-e32de5132cba/3f619559-8a62-405a-8557-4b3423f3adbd.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Anthology,School Life,Horror"],"nutshell":""},{"name":" Material Puzzle - Zero Kreuz","avatar":"https://mangadex.org/covers/ba017bf1-1c81-4bfd-b1e1-0b81f8741109/9ea36705-6168-448c-a734-8f50474cf624.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Action,Fantasy"],"nutshell":"Set in the fantasy world of Material Puzzle, a manga done by the same author, Berji, Shuga, and Chrim live peacefully on a sparsely populated island. Berji and Shuga have unique talents that allow them to tame animals called Deathleon. On one peaceful day, an uninvited large ship arrives at their island. The ship belongs to the \"Ironclad Giant\" Suppression Team, and with them, they brought a piece of an Ironclad Giant. What this ship and its crew brings to the inhabitants of the island may change the world forever."},{"name":" My Oppa Is an Idol","avatar":"https://mangadex.org/covers/ba027e4d-a745-4010-9df9-cc9cfe511b58/fe43b6f8-98da-4a1b-ae9d-4eb95dd15baf.jpg.256.jpg","country":"Korean","stat":"7.84","status":"Completed","tags":["Long Strip,Romance,Comedy,Drama,Web Comic,Full Color"],"nutshell":"A chance encounter?! Through persistence Nam Dareum gets to work at her Oppa's company!\n\n\nOfficial Japanese Translation\nOfficial Indonesian Translation\nOfficial French Translation\nOfficial Simplified Chinese Translation\nOfficial Traditional Chinese Translation"},{"name":" THE iDOLM@STER Cinderella Girls - After20","avatar":"https://mangadex.org/covers/ba0bdc41-ccf7-4ffe-89ed-65ed131efc99/06216547-820c-4d1e-8a17-de28ea55bf48.jpg.256.jpg","country":"Japanese","stat":"8.21","status":"Ongoing","tags":["Slice of Life"],"nutshell":"A slice-of-life series about idols after 20 enjoying good food and drink.\nPart of THE iDOLM@STER series."},{"name":" Demon Accessory","avatar":"https://mangadex.org/covers/ba129667-91ae-414d-bca8-0d316e53b113/539fefd3-a667-4392-a189-79bebd88bd48.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Oneshot,Fantasy,Supernatural"],"nutshell":"There is a shop called “Terra” which creates “accessory demons” for magicians. One day, an accessory demon called Vienna is returned to Lock, the owner of Terra, because the man who bought her believes she is broken. However, Vienna, who is in the form of a human, seems to have lost her memories…"},{"name":" Futsugyou","avatar":"https://mangadex.org/covers/ba12a33b-fda7-49d8-9e2e-0f7bcb849ebe/617cce76-6ade-4bf4-be4a-f15fd15e2c2f.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Romance,Crossdressing,Magic,Isekai,Drama,Fantasy,Adaptation"],"nutshell":"'Would you like to make a bet? ーIf I survive, live for me and die for me.'\nHaruka, who got summoned during her high school year to another world had become a magician and got herself enlisted in the army, so she had no choice but to crossdress and proceed to the battlefield under the alias \"Haruka Clark.\"\nShe killed people per command, and to soften her sense of guilt, she continues to heal peopleー\nAnd during that extreme situation, she met a golden knight named Ricardo and Haruka feels angry as he's trying to use death to escape from reality.\n'I don't even have a place to run away to…'\nAnd while she's angry at Ricardo, Haruka proposes a bet that could be considered as her lastー!"},{"name":" Amanchu!","avatar":"https://mangadex.org/covers/ba13d045-955d-40bc-bcbb-48c8882e08dd/92b88561-4fd9-4714-b119-c4bfeabcf7c2.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Comedy,Sports,School Life,Slice of Life"],"nutshell":"Hikari Kohinata is a cheerful 15 year-old girl who lives near the ocean and she spends much of her time diving as a result. On her first day of high school, she meets a teacher who also likes scuba diving. There's also a 16 year-old classmate, Futaba, who gets dragged along in Hikari's maelstrom as soon as they meet at school.\n\nLinks:\n\nAuthor's Twitter\nAnime Season 1 on ANN\nAnime Season 2 on ANN"},{"name":" Kaiwa","avatar":"https://mangadex.org/covers/ba1631e2-a9e9-42bd-90c9-46ee60ee3903/9feecacd-06bf-4fa3-8b37-ae1088f73813.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["School Life"],"nutshell":""},{"name":" Shingeki no Kyojin - The Hand That Points Ahead to Puppis (Doujinshi)","avatar":"https://mangadex.org/covers/ba176c91-fe44-49c8-84da-6b99647880ee/3bc77f14-bc0a-4fd9-8355-bbe427b13590.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Boys' Love,Drama"],"nutshell":"Pairing: Levi x Eren"},{"name":" Akaya Akashiya Ayakashino","avatar":"https://mangadex.org/covers/ba17d211-54c7-498f-b42e-a0cc20aa21c6/0e07068c-e27e-4d8a-97e7-1e24f353220b.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Drama,Supernatural,Mystery"],"nutshell":"The story of AkaAka begins with a dream filled with red camellia and the passing of a strange mask.\nThe owner of this mask is a young boy named Yue who lives at a temple populated with rather unusual residents. The nearby town Utsuwa is holding a winter festival.\nKurogitsune, his fox spirit friend, decides it’s the perfect opportunity for the sheltered Yue to experience the sights, sounds, and most of all–the food! Even though Yue is forbidden to ever leave the temple, they sneak into town, not realizing what they’ve set into motion…\nOP: http://www.youtube.com/watch?v=P6g1tGqor4s\nAdapted from the visual novel of the same name."},{"name":" Himitsu no Bara Juujidan","avatar":"https://mangadex.org/covers/ba2f434f-adec-48ae-bcb3-1ec1daf298ce/21648447-344d-4b43-9350-f77b68bfb8f2.jpg.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Romance,Comedy,Adventure,Fantasy"],"nutshell":"A Poor High-school girl meets a magician!\nOne day, a suspicious Ikemen appears in front of Saga Honoka, a stingy highschool girl. He continuously tries to persuade Honoka that he is a magician of a secret organization, \"Rosen Kreuz\", realist Honoka refuses to believe him. A mean magician and a poor highschool girl; a magical romantic comedy begins!"},{"name":" Nogi - Inshuu Hakoku Sentain","avatar":"https://mangadex.org/covers/ba316296-8ee3-442d-a7a6-a3e624bc20fc/57fa8ba9-cd61-44d5-b68f-739285cac27b.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Adventure,Supernatural"],"nutshell":"Junior high student Ken Ishii is good at nothing but getting out of trouble. An unidentified man appears before Ken as he is running away from hoodlums trying to pick a fight, like usual. The man asks \"Do you know Zuieki Nogi?\" and Ken shakes his head. Two onlookers observe them from a hiding place.\nThe unidentified man unleashes a monster, catching Ken who is unable to get free. On the verge of death, something changes within Ken’s body…!? “Stand up as a ‘Shinobi leader!” This is his destiny, to be shackled to a dying shinobi family’s fate..."},{"name":" The Devil of the Gods","avatar":"https://mangadex.org/covers/ba322adf-e395-49ab-b8ae-4e5023620d6d/9e5b871a-b378-420c-b287-67721720f609.jpg.256.jpg","country":"Japanese","stat":"7.46","status":"Cancelled","tags":["Thriller,Monsters,Action,Demons,Psychological,Horror,Fantasy,Supernatural,Mystery,Tragedy"],"nutshell":"A mysterious man butchers his way through a busy train car in Tokyo. This marks the starting point of a series of mysterious incidents. Renji Amamiya is attacked by Toriko, a prostitute with whom he is in love with, but he is saved by father Mitakura, a renowned exorcist who reveals to him the existence of demons…\nTwitter"}]