[{"name":" Yano-kun ni Oshi Hen wa Dekinai!","avatar":"https://mangadex.org/covers/5c9ee3ff-aa82-493b-94b8-e99a707e48bf/32ada94b-5ddd-496a-a86b-ccf373ca1845.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":""},{"name":" Kono Ore ga, Ahe-goe Nante Dasu Wake ga Nai!!","avatar":"https://mangadex.org/covers/5ca382b7-51da-4c8d-b028-e22fe3037d6b/b603a4e9-dc8f-4037-be7c-124918df623c.jpg.256.jpg","country":"Japanese","stat":"7.64","status":"Completed","tags":["Boys' Love"],"nutshell":""},{"name":" 1001 keys","avatar":"https://mangadex.org/covers/5ca6ec3c-a4d9-48e7-b256-96beb04909e4/438f8d91-219c-47f4-b8cc-ad3c5246c4fc.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Psychological,Romance,Philosophical,Drama"],"nutshell":"This is a three volume collection of stories by the world renowned mangaka, Chiho Saito. English audiences may know her best for Utena, though Utena really is not representative of her manga. The stories in 1001 Keys are Love Stories between different people. They range in their maturity levels, but they are published in a more mature Shoujo manga. The one common element between all of the stories is the presence of a black and white cat named Chu - Chu (Kiss - Kiss)."},{"name":" Sineater","avatar":"https://mangadex.org/covers/5ca8d01c-6ef4-4a6c-be12-d4dda9593403/68c6d97c-2e06-4ea1-b6ad-426c6fbfa9b7.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Oneshot,Ghosts,Drama,Horror,Supernatural,Mystery,Tragedy"],"nutshell":"Possibly the weirdest student in the school, wearing a huge band-aid on her cheek, can see and exorcise spirits. But will she succeed this time, because she will have to deal with a very difficult case ..."},{"name":" Secret Love","avatar":"https://mangadex.org/covers/5ca95d5b-4aa0-4d22-96e1-6844ea7ed106/8cdba1e4-4aae-4781-bfd6-f88da944617b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.69","status":"Ongoing","tags":["Long Strip,Romance,Comedy,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"“I’ve recently come to like someone. He’s my classmate.”\nThe short and sweet snapshots of a blossoming romance between two unsuspecting students! Packed with fluffy interactions between adorable (not to mention handsome!) characters, this series is sure to satisfy your sweet tooth~"},{"name":" Unsaid Feelings","avatar":"https://mangadex.org/covers/5cae372e-bf89-43a8-8c22-da903112630f/234f4cda-ba2e-4f0c-ae53-1d7fe062f096.png.256.jpg","country":"Japanese","stat":"7.54","status":"Completed","tags":["Oneshot,Romance,Girls' Love,Full Color"],"nutshell":""},{"name":" Penguin Loves Mev","avatar":"https://mangadex.org/covers/5cb06b09-8dc9-4212-b8f0-7a078a78a53e/aebc8467-428f-470d-8363-5b4d0c1a085f.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Web Comic,Slice of Life"],"nutshell":"The English male Mev and the Korean female Penguin who had met through an online messenger are enjoying their successful marriage in England for three years, after a lovely honeymoon in Korea. The story of these two, who overcome whatever cultural obstacles they may face with love and affection, are sure to put a smile on anyone's face."},{"name":" Kyouran Reijou Nia Liston","avatar":"https://mangadex.org/covers/5cb6e7dd-0fd8-4aab-be7c-5446b007f9bb/f99da1f9-3e36-41b7-9c77-930cf5d76206.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Ongoing","tags":["Reincarnation,Comedy,Fantasy,Adaptation"],"nutshell":"The strongest reincarnated daughter goes on the rampage! A gripping, otherworldly entertainment!\n\"I wanted to die fighting anyway.\"\nThe great hero, who once even killed a god, wanted to fight even in death.\nWhat awaited her was her reincarnation as a sickly noblewoman.\nIn the future world, she becomes the beautiful but too weak Daughter Nia Liston, but in her second life, she goes on a rampage in battle, in delivery activities and in academy life!\nThis is a record of the brilliant battles of the hero who will eventually be known as the \"Wicked Rampant Daughter\".\nThe most powerful Warriors' Daughter presents the start of a painful otherworldly entertainment!"},{"name":" Book-bound Battle","avatar":"https://mangadex.org/covers/5cb76f8b-602f-4c3a-b70f-64c1a6dbcc56/5afba593-4845-4e4f-800e-e012d5af16e2.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Completed","tags":["Oneshot,Psychological,Long Strip,Adventure,Fantasy"],"nutshell":"A couple enters a bookstore, but it turns out to be more than just your run-of-the-mill bookstore."},{"name":" Inaka ni Kaeru to Yakeni Jiben ni Natsuita Kasshoku Ponytail Shota ga Iru (Pre-serialization)","avatar":"https://mangadex.org/covers/5cb94c41-43de-4af4-b67f-5826f7f3fdce/56ab2c11-079a-453b-914d-9bd9d3c9eabe.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Ongoing","tags":["Shota,Slice of Life"],"nutshell":""},{"name":" Yamakusa Yuu Today's Doodle","avatar":"https://mangadex.org/covers/5cbc4d38-77d2-408f-83bd-9ac780819ba8/204c07dd-3ee1-42a4-90dc-0263baf2b1f5.jpg.256.jpg","country":"Japanese","stat":"8.26","status":"Ongoing","tags":["Sci-Fi,Romance,Comedy,Anthology,Fantasy,Web Comic,Slice of Life"],"nutshell":""},{"name":" Osen","avatar":"https://mangadex.org/covers/5cc2520e-3f8a-4d58-ba61-c19eee1c9a96/dbead092-96ab-4465-87bd-09c2d7dbd900.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Comedy,Drama,Slice of Life"],"nutshell":"The story is set in modern day downtown Tokyo. Our heroine Handa Sen, known as “Osen,” is the star hostess of the longstanding Isho-an, everyone’s favorite restaurant in the town of Kasagi-no-yado. Osen not only loves sake and looks sexy in kimono, but she’s also a “jill” of all trades: She’s a master chef, entertainer and potter, as well as an art connoisseur. The comic is about how Osen settles all the happenings surrounding Isho-an. Sometimes she resolves them with the Japanese spirit of “wa,” or by just being plain logical.\nThe artist’s delicate depiction of our heroine Osen in kimono, various craft including pottery and food is a highlight of this manga."},{"name":" Kuroko no Basket dj - Ato","avatar":"https://mangadex.org/covers/5cc26442-c8f5-4de3-b1a6-c5dd0b18e0e7/4e96151d-bc0e-4cfe-b0bd-10d1ad7a8df0.png.256.jpg","country":"Japanese","stat":"7.54","status":"Completed","tags":["Comedy,Boys' Love,Mystery"],"nutshell":""},{"name":" Outbreak Company: Moeru Shinryakusha","avatar":"https://mangadex.org/covers/5ccca4ae-c54a-4b20-aadb-c822f1fa2960/e7458444-014b-45a6-b08d-e47e08911287.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Action,Romance,Comedy,Adventure,Harem,Isekai,Drama,Fantasy,Supernatural,Adaptation"],"nutshell":"Having a light novel author father and an eroge illustrator mother, Kanou Shinichi is a thoroughbred otaku. However he does not have any special power except for his broad knowledge, sharp insight, and impeccable instinct about \"moe\" and its products, from manga to anime to games to light novel to figures. One day he found himself transported to a fantasy world where elves live and dragons fly. And he is given a task—not to fight monster or embark on a quest, but to enhance cultural exchange by becoming a \"moe missionary\" in this fantasy world! He meets a palace guard who has a bit of fujoshi taste, a half-elf maid, and the empress who is a little girl. He comes up with the idea of building a school. At first it runs as a comedy but later there are serious matters that Shinichi needs to face: ethnic discrimination, social problems, conflict with neighboring countries, sabotage by opposition elements including Japanese government and the likes. Can he overcome the obstacles, successfully bring \"moe\" culture to the fantasy world, and help the people there as well?\nAdaptation of the light novel series written by Sakaki Ichirou with illustrations by Yuugen."},{"name":" Kiss wa Dolce no Ato de","avatar":"https://mangadex.org/covers/5ccdc477-510d-4ad0-a74f-7b8b5810fae1/0f6655cf-7df9-4673-8aa2-717f4a6bedc6.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Boys' Love,Cooking"],"nutshell":"LUCE Resturant's floor manager Kaji Mizuki looks delicately beautiful, but is draconian when it comes to training new employees. However, Ukimi Takeru, the new server from overseas, not only is undaunted, but also addresses the manager by his first name right off the bat, hugs him, and kisses him more than what is required of a greeting. Although Mizuki was outraged, his feelings changed when he saw how serious Takeru took his job."},{"name":" Fallin' In And Out Of Love Like A Rollercoaster","avatar":"https://mangadex.org/covers/5cd075f4-6a5e-4dbd-986b-0499bfa8827d/bce7dce4-8969-43e7-b462-788b897451f6.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Girls' Love,Slice of Life"],"nutshell":"A little slice of life story about two women, Haruka and Ami, and the ups and downs of their relationship over a single evening."},{"name":" Kinou, kyou, ashita","avatar":"https://mangadex.org/covers/5cd084f0-3923-4899-bc72-3abfd88e5a4d/71b28965-b605-4556-9c8a-943f770a1d9f.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Supernatural"],"nutshell":""},{"name":" Koisuru Bicchi-kun","avatar":"https://mangadex.org/covers/5cd707dc-ba84-45e1-94af-05ba6fcc6e00/4df9dfa4-8066-48ef-af43-b45fc2fbe4a3.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life,Fantasy,Slice of Life"],"nutshell":"Sugiura-kun became an assistant for the manga artist he admired most, only to find out he is a complete slut. Being attacked every day in bed immediately after working, he must deal with the perverted and frustrating sensei. Despite this, Sugiura-kun finds himself thinking \"maybe I like Sensei.\""},{"name":" Baseball Yuri","avatar":"https://mangadex.org/covers/5cd7d37f-8305-4ac7-b10f-ca5bd24bab93/fa075160-43cf-49cd-9f91-b24501b8d17c.png.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Oneshot,Romance,Girls' Love,School Life,Full Color"],"nutshell":"野球部員に恋してる子と、マネージャーのお話し"},{"name":" Sono Dekiai ni wa Uso ga Aru","avatar":"https://mangadex.org/covers/5cd86656-971c-42d0-99a8-c5eee5200456/5bec997d-52b8-49dc-8f89-c7400fe77156.jpg.256.jpg","country":"Japanese","stat":"8.36","status":"Ongoing","tags":["Oneshot,Romance"],"nutshell":"From the powerful duo behind “Marika-chan and her Gentle Love Slave”, comes a long-awaited new series!\nInukai Hagumi had the encounter of her dreams with a handsome customer at the cafe where she works. However, is this dream too good to be true?\nThis is a 2-part one-shot."},{"name":" Sugars","avatar":"https://mangadex.org/covers/5cd9c5ae-2853-4dce-8a9d-639f0fc67f80/e335c213-3b30-4fbf-b5aa-627c5a01c075.jpg.256.jpg","country":"Japanese","stat":"8.40","status":"Completed","tags":["Romance,Drama,School Life,Slice of Life"],"nutshell":"[from lost-translations]\nShe's hiding behind her real feelings.\nHe's an airhead who plays along with everyone…\nShe's the newbie everyone hates…\nHe likes her but can never admit his feelings to her…\nShe doesn't really bother with stuff like love…\n…are just few of the people who are a part of this intertwined connection from middle school up to university.\nWhat would these intersecting red lines of fate lead to?"},{"name":" Mobile Suit Gundam - The Revival of Zeon","avatar":"https://mangadex.org/covers/5cdbf5e5-50c3-492d-b1e2-8e92d8406e73/ee4e6592-5576-40a1-8937-8e6d0c22e9af.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Mecha,Survival,Adventure,Military,Philosophical,Drama,Tragedy"],"nutshell":"The year is Universal Century 0092. After the death of Vice Commander Haman Karn, Zeon control was thrown into chaos. Supplies, ammunition and weaponry to the forces remaining on Earth were cut off and they were forced into difficult battles on all fronts. Zeon Forces from around the world have decided to withdraw. This is the story of their heroic battle to retreat.\nNotes:\n\nThe story depicted is actually part of \"Kondoverse\" Gundam titles spawned from 1984's Record of MS Wars which later was finalized within MSG 0079, Kondou's manga adaptation of the original anime series."},{"name":" The Super Harsh Story of a Mangaka","avatar":"https://mangadex.org/covers/5cde047d-e60e-4b9a-8817-bf6613ec20b4/d98207ea-bab4-4bfc-8d7d-adb91ae13035.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Comedy,Drama,Slice of Life"],"nutshell":"Nawoki Karasawa is one of the longer-active and more prestigious names in the typically small time, lesser-known world of gag manga. In a genre where art skill is second to just about everything else, Karasawa's dialogue is hilariously sharp and witty.\nA gag parody of Shinji Nagashima's immortal Mangaka Zankoku Monogatari (Karasawa's title only differs by adding \"Chou\" (Super) to \"Zankoku\"), a manga about the dreams, ambitions, and suffering of a group of bright young mangaka. Karasawa brilliantly takes the piss out of just about everything involved with being a mangaka. It's lewd, raunchy, endlessly cynical and laugh-out-loud funny.\nOriginally published in Ikki and the Big Comic Spirits special issue \"Casual\" from 2000 to 2003, it was collected into a single book in 2005."},{"name":" Shoudou","avatar":"https://mangadex.org/covers/5ce6415f-360a-4fea-a807-bb841ceb5163/8666863b-e1c6-412e-a2c7-13bd88edf048.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Boys' Love,Drama,School Life"],"nutshell":"In order to approach a girl who works in the entertainment industry, Oga ends up forcing a friendship with Kunie, her younger brother. While going out for fun, they discover an extreme attraction for each other. Oga finds Kunie masturbating and that leaves him disturbed… but, at the same time, he can't help feeling dragged into the moment."},{"name":" Touhou - Thank You Cirno (Doujinshi)","avatar":"https://mangadex.org/covers/5ce71fb8-4cd9-4638-a448-ae6f63ec0b3c/049fe8ed-0b51-4fa7-aff5-039e793b5133.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Comedy,Drama"],"nutshell":"After hearing what humans are doing to nature, Cirno goes on a mission to stop them. But First thing first, ask someone to read a book for her…"},{"name":" Love Live - Kirakira Future (Doujinshi)","avatar":"https://mangadex.org/covers/5ce800cc-cfb7-4053-808a-405ea4d7b38e/64ea41d6-8f1c-4638-99a2-7b7548e42251.png.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Girls' Love,Drama"],"nutshell":"An Eli x Honoka Love Live! doujinshi about love in the face of an uncertain future."},{"name":" The Redemption of the Blue Rose Princess","avatar":"https://mangadex.org/covers/5ce9b650-fa46-4851-909d-4aacf2e1df1f/bea37559-a84e-462d-8ab4-3af4a7e4c679.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Ongoing","tags":["Reincarnation,Time Travel,Romance,Drama,Fantasy,Villainess,Adaptation"],"nutshell":"I’ve been given a chance to redo my life. I’m standing next to the man who once killed me.\nThat night was the “Star Festival,” a celebration for the founding of the proud kingdom of Hyland. Blinded by love, Queen Alicia had turned her back on the people of the country. She was then killed from a stab in the chest by a man who marched into the castle… Or at least, that was what should have happened. When she woke up, Alicia found herself ten years old again. Holding the memory of her murder, she was given a chance to redo her life.\nIn the midst of this, she reunites with Clovis, the man who once killed her…?!\nThis is the story of the Blue Rose Princess who will \"redo\" her life, and her future that is tossed around by the mischief of fate!"},{"name":" A Sister's All You Need. Side Story: All I Need Is To Become His Sister!","avatar":"https://mangadex.org/covers/5cedcc01-3209-4ef6-b378-9ae75362ade1/b9051e69-cb62-4624-a00a-bdbe61b4b675.jpg.256.jpg","country":"Japanese","stat":"7.71","status":"Completed","tags":["Romance,Comedy"],"nutshell":"Spinoff following Nayu as she endeavors to win Itsuki's affection by becoming his little sister by any means necessary."},{"name":" VILLAIN VILLAIN","avatar":"https://mangadex.org/covers/5cf5c884-ed6c-4e89-a862-a10aa19f1114/18fe499f-03cf-4662-b346-c5957a34657b.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Monsters,Action"],"nutshell":"A one-shot published in the December 2007 issue of Monthly Comic REX"},{"name":" Woman's Best Friend","avatar":"https://mangadex.org/covers/5cf83abd-6328-45b2-97b2-15be3b1917e7/78e156a1-3cea-4d88-ab36-5bd745ff6f5a.jpg.256.jpg","country":"Korean","stat":"8.04","status":"Completed","tags":["Long Strip,Romance,Drama,Web Comic,Slice of Life,Full Color"],"nutshell":"There’s a crazy dog at Sungwoon Publishing\nCompany. It has an expressionless face, a monotone voice, cold and dark eyes, and a difficult personality. Its name is Woojoon Seo.\nBut is this man really crazy?\nTaeryung is exhausted from love, work, and even her her own family. To the tired Taeryung, Woojoon’s gentle and tender actions seem more like of a loveable pet than of a crazy dog. She doesn’t know what to make of him! At times, he seems like a loyal doberman and others, a cute maltese. What's a girl to do?\nfrom Tapas.io"},{"name":" Shinkaigyo no Anko-san","avatar":"https://mangadex.org/covers/5cfc0518-5c98-4b79-a1c8-0f27d0c27b3c/5e4336ed-8dab-4607-8a2a-02af8689c007.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Comedy,School Life,Fantasy"],"nutshell":"Fish people have been welcomed to the town where the human girl Wakasa Otomi lives, and they are integrating well. The fish people can be identified by the physical marks of their fish species, though they take medicine to keep their lower bodies human rather than a fish tail. Otomi loves fish people, and is eager to meet as many as she can! One day, she meets a new transfer student, a lantern fish girl named Tsutsumi Anko. Anko is a bit self-conscious about being a deep sea fish, with a tail that is not cute like some other fish girls. At school, she and Anko deal with various fish problems that intersect with issues an ordinary human high-schooler would face."},{"name":" Metroid Prime 2: Echoes","avatar":"https://mangadex.org/covers/5cff4e88-e6b7-4a75-a1be-ec975f6bfd75/704cc365-c3b9-4e28-a46d-ef693ba46a42.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Thriller,Sci-Fi,Monsters,Action,Mecha,Crime,Survival,Adventure,Video Games,Drama,Police,Aliens,Adaptation"],"nutshell":"Metroid Prime: Episode of Aether is a manga series based on the events of Metroid Prime 2: Echoes that spans seven issues of Comic Bom Bom in Japan. Bom Bom is a monthly magazine published by Kodansha. This series was written by Matsumoto Hisashi from issue July 2005 to January 2006."}]