[{"name":" Itsuka, Kazoku ni Naru made","avatar":"https://mangadex.org/covers/4f9f1a6a-093f-4035-98e4-047aa476bf28/fdd0048f-c745-43b9-8eb6-1ba9868cae3e.png.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Romance,Comedy,Boys' Love,Slice of Life"],"nutshell":"The three lived together under a single roof. Takaomi is a single father, raising his only son. For some reason, he is persistently being hit on by his colleague, Nomura, who so happens to be able to do both work and housework. Taking overly good care of them, Nomura repeatedly visits Takaomi’s house uninvited and proposes that Takaomi should go out with him, telling him all about the advantages of doing so. Takaomi was perplexed since he’s never even dated another man before. But as they spent more time together, going out for meals and visiting amusement parks, Takaomi came to realise that he enjoyed the time spent together as a three and that it felt precious to him… A heart-warming BL between a flawless younger salaryman and a single father moved by affection."},{"name":" Fullmetal Alchemist - Junction (Doujinshi)","avatar":"https://mangadex.org/covers/4fa2ba9b-6d47-4134-8afe-1489b198e26b/d1a5815d-678b-431a-8cd9-7f81d7cef6ae.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,Boys' Love"],"nutshell":"Pairing: Hughes x Roy"},{"name":" Samurai ZOMBIE","avatar":"https://mangadex.org/covers/4face378-538d-4008-b36e-89c97b05df78/c4585135-d2e5-4e4d-b7ae-1188b8de93b0.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Historical,Action,Demons,Zombies,Samurai,Adventure,Horror"],"nutshell":""},{"name":" 22/7 (Nanabun no Nijyuuni) +α","avatar":"https://mangadex.org/covers/4fad2be6-cbf5-4e62-b317-7184d904abe8/877e970d-4ea2-4d1d-8957-97339705be09.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Drama,Music"],"nutshell":"Based on Japanese idol group and mixed media project by Yasushi Akimoto, 22/7.\nBerasal dari idol grup Jepang dan projek media campuran oleh Yasushi Akimoto, 22/7"},{"name":" Koi bakkari no Sekai de Watashi wa Kimi to","avatar":"https://mangadex.org/covers/4fae1153-e901-4773-8329-30ba67b41b1a/5cd8547b-c2fb-4b20-8fef-423432fc4d9f.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Romance,School Life"],"nutshell":"Chieri has just entered Middle School and joined a classroom full of people who only talk about romance. With a class like that, Chieri couldn't fit in. Fortunately, she met Sakura and Ichika who were also having a hard time socializing. Together, they can stay being themselves. But time stops for no one. Slowly, they're starting to change too…"},{"name":" I'm the Only One With Genius DNA","avatar":"https://mangadex.org/covers/4fb38bea-7ead-4b24-86d2-9d2cce43237a/18c10f7a-a818-4be4-a935-00e98d25e6cb.jpg.256.jpg","country":"Korean","stat":"7.51","status":"Ongoing","tags":["Sci-Fi,Long Strip,Medical,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"A status window appeared in front of Ryu Young-jun, a researcher at a pharmaceutical company.\nRosalin's status window, an artificial cell that knows everything about biology.\n\n\nOriginal Webtoon <Webtoon kakao>\n\n\n\nOfficial Japanese Translation"},{"name":" Nazo no genshou","avatar":"https://mangadex.org/covers/4fb65058-4387-439d-b91d-29576940ce3c/81ab4917-b980-410f-80ea-855e103f26d0.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Oneshot,Genderswap,Mystery,Full Color"],"nutshell":"seorang siswa yang setiap malam berubah menjadi gadis"},{"name":" Nani mo Iwanai","avatar":"https://mangadex.org/covers/4fb79f77-0df0-4efb-a9bc-d32daac2f790/41f4ceb1-95ac-4418-9dab-2e2674209630.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Oneshot,Boys' Love,Drama,School Life"],"nutshell":"A collection of oneshots with a unique spin on some typical BL tropes."},{"name":" The Cat Witch","avatar":"https://mangadex.org/covers/4fb83ee0-e9c5-483b-882b-099389f648ba/3dfbd8af-82ea-4e29-9897-05d5899d0892.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Oneshot,Animals,Drama,Supernatural"],"nutshell":"After his cat goes missing, Taichi gets a visit from a mysterious new transfer student."},{"name":" Remote Work is Over, Chihiro-san!","avatar":"https://mangadex.org/covers/4fbf6199-ac92-4167-a67c-d9b51d6261eb/023adf53-5b6e-46ed-ba14-46f9b9f831e5.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Comedy,Office Workers,Web Comic,Slice of Life,Tragedy"],"nutshell":"Life is a comedy or and a tragedy."},{"name":" Kyoumeigai","avatar":"https://mangadex.org/covers/4fc6392d-0d9a-4bf5-90fa-f8943b1cacb1/f3c712d9-4b93-4fa4-9b79-3b1f3e6f507e.png.256.jpg","country":"Japanese","stat":"6.60","status":"Ongoing","tags":["Action,Drama,Horror,Mystery,Adaptation,Tragedy"],"nutshell":"It all started with the sound of an insect…out of the blue they became feral. Women infected with this sound became known as the \"crazies\" who infect other women and attack men exclusively. The resulting chaos devastated Japans populations as 70 percent perished, forcing the international community to cut off Japan from the rest of the world."},{"name":" Touhou - Parenting","avatar":"https://mangadex.org/covers/4fca8a92-6f9c-41ab-ba64-b2ba981479a7/1d463d3c-1a18-476a-9bed-827af171ff04.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Romance,Girls' Love"],"nutshell":"Seems like Alice and Patchy have been getting pretty naughty with each other lately. But the latest consequences still come as a shock to Alice."},{"name":" Eres mi complemento","avatar":"https://mangadex.org/covers/4fd13519-ce5a-4d4d-bb1b-9457694e7fa2/56075880-fbac-4a12-bfe2-bb6d35712bdf.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Romance,School Life,Web Comic,Tragedy"],"nutshell":"Los ex alumnos de la escuela secundaria se conocieron después de 5 años, Kim Hyun-oh y Kim Chan-i. Sin embargo, ¡las circunstancias de los dos son completamente invertidas! Hyeon-oh, que pasó de ser un peleador popular a un libertino letárgico. Chan-yi, que sufría acoso en la escuela, se ha transformado en un niño bonito. Un dulce reencuentro en el que los dos curan las heridas del otro.\n\nEn la escuela secundaria, Kim Chan-yi era inusualmente blanco y gordo. Todos lo llamaban Piglet.\nAhora, su cuerpo se redujo a casi la mitad. Lo único que no había cambiado desde entonces era su piel blanca como tortas de arroz glutinoso. ¿Era tan alto y tenía los hombros anchos? Los ojos eran grandes y redondos, y la nariz puntiaguda. Fue una impresión amable y amistosa. Al igual que el protagonista masculino en un manga romántico, un efecto brillante parece flotar cerca. Si lo comparas con un animal, ¿qué debo decir? ¿perro? ¿ardilla? ¿Conejo? si es un conejo parecía un conejo Un conejo blanco delgado.\nEl cambio de Chan-yi Kim fue sorprendente. Ni siquiera pude reconocerlo a primera vista. Kim Chan-yi se aclaró la garganta un poco. Entonces me di cuenta de que había estado mirando su rostro durante demasiado tiempo.\n\"Has cambiado mucho.\"\nKim Chan-yi asintió. En un instante, sus orejas y mejillas se pusieron de color rojo brillante. Era así cuando estaba en la escuela secundaria también. Me recuerda la forma en que solía sonrojarse."},{"name":" Iken Senki Völundio","avatar":"https://mangadex.org/covers/4fd4f8c0-fab8-4ee5-ab9e-5907720afed9/8c63a089-9efa-498a-952e-c21242e963d3.jpg.256.jpg","country":"Japanese","stat":"8.96","status":"Ongoing","tags":["Action,Comedy,Adventure,Magic,Drama,Fantasy"],"nutshell":"On a desperate battlefield... I'll start running a tavern!\nCleo, a man who has been a mercenary for 10 years, meets a mysterious girl named Kohaku.\nIn order to survive on the battlefield, where \"different swords\" with great power are flying around.\nIn order to survive on the battlefield, the two of them start\nRunning a \"tavern\" where soldiers gather!"},{"name":" Shout!","avatar":"https://mangadex.org/covers/4fd64191-bce0-4ccb-936e-596d03be0da9/68e611a1-5588-439e-8ce3-a4a862bf9345.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Comedy"],"nutshell":"The weak-willed college freshman Okouchi Nagi and the super sadist Sadayama Rin… Watch as these two enjoy their fun and interesting college life in the drama club!"},{"name":" The Darkness Was Comfortable For Me","avatar":"https://mangadex.org/covers/4fdf828a-f639-4121-9c6f-5202b8832b1d/54c86afe-72e2-425b-abcd-90406f391a46.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Ongoing","tags":["Action,Psychological,Adventure,Magic,Harem,Isekai,Supernatural,Adaptation,Tragedy"],"nutshell":"“I will have the 1,000 people I have chosen go to a parallel world.”\nChaos spread once those words of God were displayed to the whole world.\nKurose Hikaru, whose childhood friend had been chosen, was killed together with her on the same day she was supposed to be transferred. However, for some reason, Hikaru didn’t die and, even though he wasn’t chosen at first, he ended up as one of the [Otherworlders that will have all their actions live broadcasted to Earth].\nTransferred without any preparations at all to that accursed land, he faced threats innumerable times and somehow managed to survive with his Gift, the Dark Spirit Abilities.\n“I must not die. I am sure the people on Earth are all rooting for me after all…”\nThis is the story of a young boy who is tossed about by the gazes of the viewers, yet eventually manages to raise his head and walk forward.\n(NovelUpdates)"},{"name":" Datte, Yue ni, Hatsukoi-chuu.","avatar":"https://mangadex.org/covers/4fe4bee0-db7d-4ecf-9e7d-0b7b7d37d40c/d57b3fea-e335-4a67-98e1-27f3c92ee694.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"Yutsui Akino is a girl who has never been able to show their feelings through their facial expressions, all this begins to change when a classmate Akira Mori starts to bother about your problem and begins to confuse heart Akino … Akino can take seriously the intentions of Mori-kun? … when this is an ex-boyfriend of her older sister who is a lively and popular girl opposite her …."},{"name":" Yuzumori-san","avatar":"https://mangadex.org/covers/4fec2716-6105-45c1-95f9-ae1e94cd5287/a46d0014-9e35-4fa1-a201-fd2f8a0a9cd8.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Romance,Girls' Love,Drama,Slice of Life"],"nutshell":"A laid back yet slightly fidgety tale about the daily lives of two girls, Yuzumori-san and Mimika, and their relationship with one another."},{"name":" Horizon of Oblivion: A Letter to the 16-Year Old Me","avatar":"https://mangadex.org/covers/4ff889dc-8add-4775-8edb-625f9ecf3be5/9cb35df6-4704-469e-a9ae-10bb103048db.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Comedy,Drama,School Life"],"nutshell":"The manga centers on a 16-year old high school student and amateur manga creator named Tatsuya Egawa, who perceives himself as unpopular and hated by the girls in his school. He tries to submit a manga manuscript to Shonen Sunday but is turned down. In despair, he turns to the Internet for advice, finding out that there is a manga creator with whom he shares the exact same name and birthday (the real-life Tatsuya Egawa).\nFrom Egawa's manga, the 16-year old Egawa takes away that he must draw from experience, and that he must learn how to draw cute girls. Since he has no experience talking to cute girls, he resolves to get to know one at his school."},{"name":" The Billionaire Boss's Forbidden Mistress","avatar":"https://mangadex.org/covers/4ffc7f13-e2b0-4d6f-a0b9-3adecea55a12/35dad98b-acee-4a8e-a409-80ee4011ccea.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Romance,Office Workers,Drama,Slice of Life"],"nutshell":"Blessed with brilliant beauty and abundant wealth; Lena used to be a prince of the fashionable society until an accident took everything away from her, leaving only ugly scar in her leg. Her husband despised the car and dumped her. \"I never trust a man...\" Since then, a smile has disappeared from her face and she has withdrawn and lived a quiet life. She never expects that her extremely sexy boss is determined to make her his own."},{"name":" Shojo Manga","avatar":"https://mangadex.org/covers/4ffdd63e-4e7e-412b-ac64-71c1f3b41a2f/dba5b95e-627b-45fa-bbb2-df4a273ceef9.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Oneshot,Thriller,Psychological,Crime,Survival,Post-Apocalyptic,Military,Drama,Delinquents,Tragedy"],"nutshell":"Set in the dystopic future:\nA girl steals a bag from an old woman, a fellow member of a homeless colony. All the bag contains are volume after volume of shojo manga. But even after the girl has finished reading all the volumes, our story is still not complete…"},{"name":" Beauty and the Beasts","avatar":"https://mangadex.org/covers/50006d88-9084-4ad9-a709-f8712e347583/67a20938-d30f-4ad9-ba59-8bc8e0ae5922.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.37","status":"Ongoing","tags":["Animals,Long Strip,Romance,Reverse Harem,Isekai,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"As soon as she fell into the world of beastmen, a leopard forcibly took her back to his home. Indeed, Bai Jingjing is at a complete and utter loss. The males in this world are all handsome beyond compare, while the women are all so horrid that even the gods shudder at their sight. As a first-rate girl from the modern world (she's even a quarter Russian) Bai Jingjing finds herself sitting at the center of a harem filled with beautiful men – at the very peak of existence."},{"name":" Yo-kai Watch","avatar":"https://mangadex.org/covers/500ac84c-959c-4d6d-bea4-1ebcee2aea67/680387ed-f5b3-4bfa-9a84-99af7b44fe9f.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Action,Supernatural"],"nutshell":"When Keita frees Whisper, a ghost-like youkai, from 190 years of imprisonment, Whisper pledges to protect Keita from supernatural dangers. Whisper also gives Keita a watch that allows Keita to see other youkai. Together with the twin-tailed cat spirit Jibanyan, they encounter many youkai-related problems and solve them.\n\nOfficial Release:\n\nEnglish Asia release by Shogakukan Asia - Singapore\nEnglish North America release by Viz Media\nIndonesian release by Elex Media"},{"name":" Love Live! - Love Scandal (Doujinshi)","avatar":"https://mangadex.org/covers/500d7b4b-48c6-43f1-9503-fa5bf23b9f40/45daff39-6d28-4fcf-a33b-b0c317c97f4c.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Girls' Love"],"nutshell":""},{"name":" Ruling a planet","avatar":"https://mangadex.org/covers/500e6e54-b34d-45a2-9e70-d37e0fc15eed/f9ffdb73-13fa-4019-ba82-5e5071bad19b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.03","status":"Ongoing","tags":["Action,Demons,Long Strip,Martial Arts,Adventure,Isekai,Fantasy,Web Comic,Full Color"],"nutshell":"The time when the immortal emperor Xia Guixuan and his nemesis were both wounded, the emperor retreated to the core of a remote planet in the universe to heal his wounds. The planet’s environment was gradually transformed by the spiritual energy emanating from him, and transformed into a liveable planet with abundant spiritual aura. The original creature that lived in this remote planet began to evolve into human beings to cultivate and develop their own civilisation. A few years later, human exploration spacecraft from the Milky Way discovered this new civilisation. Throughout the universe, unknown yet powerful beings began to target this planet. Many parties collided, and heroes rose together."},{"name":" Sky's Sea","avatar":"https://mangadex.org/covers/500f2333-b8b2-45b7-817b-4079cd193567/7639997b-8c38-438f-a326-9135265d340c.png.256.jpg","country":"Korean","stat":"7.72","status":"Completed","tags":["Long Strip,Romance,Boys' Love"],"nutshell":"The hot and sticky hot summer romance of five writers! Enjoy hot summer\nwith <Mr. Blue Hot Summer BL Short Story!>"},{"name":" Siren & Pirate","avatar":"https://mangadex.org/covers/501306ed-3515-465f-83c9-596f860ea225/65f0885c-4edc-4d6a-84e6-31f5f7eea1b0.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.04","status":"Ongoing","tags":["Historical,Action,Long Strip,Romance,Comedy,Adventure,Fantasy"],"nutshell":"Many years, years later, at the Mediterranean Sea, there's a legend about him. A young man with white skin comes from the deep sea, has appeared. By using the God of Death's dance, he's harvested many lives. His eyes are black like the starless night sky."},{"name":" Kiitarou Shounen no Youkai Enikki","avatar":"https://mangadex.org/covers/50165dc6-d7d8-4d66-811f-bb079641d772/b8233563-cdce-411b-b12f-dd8ba58c1911.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Ongoing","tags":["Romance,Comedy,Slice of Life,Supernatural"],"nutshell":"This is the visual diary of Kiitarou's experience with youkai. He's a boy with a very strong spirit sense, but when he entered a forbidden storehouse, he was kicked out of his home. He soon found a new place to live, where he met a zashiki warashi (house spirit) named Suzu. He and Suzu soon began to attract all kinds of spirit creatures, starting with a nurikabe (appears as a wall that impedes travelers) and mokumokuren (appears as eyes in a torn paper wall). What kind of folkloric creature will he meet next?"},{"name":" Detective VLOG","avatar":"https://mangadex.org/covers/501d5627-7740-4438-8fba-9b48e111aa53/54834ce8-e230-4faa-b3b4-f4195ac7bbae.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.89","status":"Ongoing","tags":["Sci-Fi,Demons,Ghosts,Long Strip,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"Rong Xiaoqiang is a photographer of a vlog team that specializes in shooting haunted events. The team is nameless and creates gimmicks through fraud. However, he got a DV player that could shoot ghosts, and what was captured in the viewfinder became treacherous and dangerous that ordinary people could not imagine. This camera has brought huge traffic to vlog, and the desire for money and popularity, the team members ignored the danger, followed the evil spirit's grave, and went all the way to death, every shooting became more and more dangerous."},{"name":" Shingeki no Kyojin  - Andromeda (Doujinshi)","avatar":"https://mangadex.org/covers/501e36d5-8f2c-4a72-b61a-24066f1cea12/5c98e6e5-bc8c-4996-97e3-e6d60bfc3c83.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Reincarnation,Psychological,Boys' Love,Drama"],"nutshell":"Pairing: Levi x Eren\nWhen they can't sleep at night, they look at the stars and remember the things of the past."},{"name":" Haraiso Days","avatar":"https://mangadex.org/covers/501f498d-dd26-401b-b0dc-fd3334d1f323/0240bd6f-31d9-4de3-95ee-df19823ceb36.jpg.256.jpg","country":"Japanese","stat":"8.24","status":"Ongoing","tags":["Sci-Fi,Comedy,Post-Apocalyptic,Drama,Web Comic,Slice of Life,Cooking"],"nutshell":"Fifteen years have passed since the end of the Great War. Thriving at the bottom of the Imperial City of Flowers is the bar Haraiso, run by an idiosyncratic owner, Miss Haru. Various customers visit the restaurant every night, attracted by the delicious sake and snacks..."},{"name":" Touhou - Yagokoro Syndrome (Doujinshi)","avatar":"https://mangadex.org/covers/501fcca9-0291-47da-a4f5-7958b0e31342/257b48b6-5938-40d5-bddc-14131fea4aa7.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Drama,Fantasy"],"nutshell":"Read order\nTouhou - Yagokoro Syndrome\nTouhou - Time of the full moon\nTouhou - Undying\nThis doujinshi explain Kaguya's sin, How and why she is exiled to the earth"}]