[{"name":" Exorcist","avatar":"https://mangadex.org/covers/caa0a488-2350-4395-be44-1bad6ab56bd7/41ebfc43-6867-4c44-bc7f-58e41e98206d.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Action,Fantasy,Supernatural"],"nutshell":"\"Exorcists\" are the protectors of the human world with sole responsibility to deal with the evil demons that come from the magic world….\nLan Ximing, a normal student, unexpectedly meets a demon named Nilu and a fantastic journey unfolds before them.\nHere lies an unimaginable tale that is just waiting to be experienced!"},{"name":" Bakemonogatari - Panaino! (Doujinshi)","avatar":"https://mangadex.org/covers/caa15e26-2a41-4951-887e-ea790e629b03/26132966-17fa-4edf-a5ef-c9c4b3bc1fd0.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":[""],"nutshell":""},{"name":" Collecting the Divine","avatar":"https://mangadex.org/covers/caaa3f33-3ac2-4170-9b3a-20b667be7d2d/b08bff1a-0dc4-42ca-a8e1-b82a4a24b8c0.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.01","status":"Ongoing","tags":["Historical,Action"],"nutshell":"Modern-day Daoist Fang Yi wakes up one day with a superpower—the ability to sense antiques and artifacts! From there, he becomes an artifact-collecting wonder. Countless treasures all become his, and he leads his band of brothers on a journey to the very peak of life!"},{"name":" Dragon Ball Beyond","avatar":"https://mangadex.org/covers/caac63d5-8269-4ad5-8939-e4bde6a570ab/a9fe8baf-2161-4462-86a5-48c6b34e531a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":[""],"nutshell":""},{"name":" El lugar donde sopla el viento","avatar":"https://mangadex.org/covers/caafb043-dac7-4a85-a146-018830a395f0/a458529f-f16a-41a7-8c13-39b1fe2a268b.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Ongoing","tags":["Long Strip,Boys' Love,Drama,Web Comic,Full Color"],"nutshell":"Para romper una antigua maldición que asola el linaje real, el joven príncipe Tasara está destinado a ser sacrificado a muerte. Nara se alista como sirviente de palacio para llevar a cabo la ejecución del príncipe cuando llegue el momento. Pero él desarrolla una debilidad por el príncipe maldito, y después de cometer un acto atroz e imperdonable contra Tasara, Nara está desesperado por corregir sus errores. Pronto, su relación lasciva que se había mantenido en secreto pone a prueba su resolución. ¿Nara se verá tentado de su misión original? No se sabe hasta dónde llegaría para ganar el perdón de Tasara."},{"name":" Kasumi","avatar":"https://mangadex.org/covers/cab204b5-7f8d-490a-a5ae-744cd86f349a/3fb70b0e-82be-486b-951d-592c2d22f2f9.jpg.256.jpg","country":"English","stat":"7.97","status":"Cancelled","tags":["Romance,Comedy,School Life,Slice of Life,Supernatural"],"nutshell":"Kasumi's father moves around for work frequently, meaning she constantly has to change schools. On one such move, while the two of them have stopped to take a break, Kasumi spots an odd glowing light. She chases it up a tree, but after catching it the branch she's standing on breaks and she falls. When she wakes up the next day, strangely uninjured, she heads to her new school, which turns out to be super exclusive! Kasumi has trouble fitting in with the snobby rich kids in the school, even more so after she gains the ire of the most popular boy in school's fan club, and now she even seems to have gained special abilities!?! How will Kasumi fare in her new school and what are these strange powers that are developing?\nNOTE: This is an OEL. Not an English translation of a Japanese version.\nWikipedia"},{"name":" 417","avatar":"https://mangadex.org/covers/cab5b832-4b10-4b74-8285-a8f92f14434d/eb48893d-f9f9-4537-8152-7d630d9d991c.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.79","status":"Ongoing","tags":["Long Strip,Comedy,Web Comic,Slice of Life"],"nutshell":"Short stories on the 417 group."},{"name":" MookHyang - The Origin","avatar":"https://mangadex.org/covers/cab9bbbf-5acd-4bc0-83b5-f803bec4a37e/a87c7d4b-4490-41ee-b18b-d72bcf285003.jpg.256.jpg","country":"Korean","stat":"8.22","status":"Completed","tags":["Action,Long Strip,Martial Arts,Adventure,Magic,Wuxia,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"In this prequel to “Mookhyang: Dark Lady,” we meet Mookhyang in Murim, or the world of martial arts, as a young member of the Demonic Sect. After years of rigorous training, he rises through the ranks and joins an elite squad of first-rate assassins. Despite his impressive achievements, however, he finds himself hungry for more. His obsession for martial arts ultimately leads him down a different path… one that few have ever dared to take. He spends decades learning the way of the sword and cultivating his inner qi, or mana, in hopes of one day reaching a state no warrior of the Demonic Sect has ever reached before—the State of Demon Transcender. Join Mookhyang as he fights powerful masters, takes down evil forces, and pushes himself to the limit... and beyond.\n\n\n\nWebtoon Promo\n\n\nOriginal Webtoon <Webtoon kakao>"},{"name":" Haikyu!! - Il Mio Caro (Doujinshi)","avatar":"https://mangadex.org/covers/caba060a-d4d7-491c-8c1a-68e73d11e43f/6f1f5518-cbcd-4a15-ad1e-59775eb65b78.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Boys' Love,Sports"],"nutshell":"OC x Ushijima Wakatoshi"},{"name":" Grandma in the Magical Girl","avatar":"https://mangadex.org/covers/cabcdaa5-9767-475f-b959-c7b0d629341c/121d9f82-2360-428f-82c9-e4447eb152ef.jpg.256.jpg","country":"Japanese","stat":"8.54","status":"Ongoing","tags":["Comedy,Magical Girls,Web Comic"],"nutshell":""},{"name":" Shinba Shounen to Nemuru Kyojin","avatar":"https://mangadex.org/covers/cabe9efe-af2e-45a6-acfb-a129950a2d7c/bf7ed2eb-4c9e-4320-a212-1c88fb1a6e7c.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Oneshot,Action,Supernatural"],"nutshell":"Shinba, who's always isolated himself and never made friends, finds stones that contain the souls of dead famous people. With his special power, he uses the stones to be people he thinks he could never be like."},{"name":" Kyoudai Gokko to Shoujo Bitch","avatar":"https://mangadex.org/covers/cac23a33-632c-41f7-8013-1ee08818416a/0384ceab-04dc-4acc-9a3a-05df48024597.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Boys' Love"],"nutshell":"Hisaki lives alone with his younger step-brother, Yuzuru, his only remaining family member. Before he realizes it, he starts developing feelings for his brother, who's grown into an attractive young man. Hisaki starts working at a call service for men for the money and to help get over his feelings. His cool, bossy persona makes him the most popular guy at the club. But, he's actually never gone all the way! Just as Hisaki starts worrying that he won't be able to hold his feelings inside any longer, a misunderstanding results in Hisaki and Yuzuru getting it on… It's a hot, steamy love story between two step-brothers. (From Renta)"},{"name":" Diamond Ni Naritai","avatar":"https://mangadex.org/covers/cac52e47-1e15-4fa5-86b5-e6561f6f1dff/15729f48-52de-4575-bec2-8312affc47ec.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"The single-minded love of childhood friends."},{"name":" Kill Your Honey","avatar":"https://mangadex.org/covers/cac76da3-192d-4a0d-8b82-cd041cb5bf8e/bda88d81-0dac-4454-81f0-00ec333e0455.jpg.256.jpg","country":"Korean","stat":"7.72","status":"Completed","tags":["Romance,Comedy,Boys' Love,Vampires"],"nutshell":"Do-hyun, an incompetent vampire and unemployed man, falls in a back alley and is found by Mu-hyuk, the conglomerate's successor, who forces him to work for the company. Do-hyun is being coached by Mu-hyuk every day on the condition that he procures a blood transfusion pack."},{"name":" I Am A Sukeban","avatar":"https://mangadex.org/covers/cace0b4c-6696-4d08-ae26-6c8be207ef36/6a988d07-c249-4691-92f5-246343d841b4.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Genderswap,Action,Romance,Ninja,Comedy,Incest,Crime,Martial Arts,Office Workers,Crossdressing,Drama,School Life,Fantasy,Delinquents,Police,Slice of Life"],"nutshell":"Summary and Preview\nBanji Suke, better known as Sukeban, and his family are forced to move away after destroying their previous town. In order to be able to attend his new school (which happens to be an all-female school), he must disguise himself as a girl! However, this situation coupled with Sukeban's rebellious nature will result in many comedic troubles, and his all-girls school may never be the same!\nThe manga has been adapted into two live-actions films and an OVA.\nsource:https://mangahelpers.com/m/oira-sukeban"},{"name":" Tales of the Abyss - Tsuioku no Jade","avatar":"https://mangadex.org/covers/cad2cda2-3eee-4185-8a12-712760f4f746/1d54006d-87a4-4e62-9bb7-a02d7942dd36.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Action,Adventure,Fantasy"],"nutshell":"A Tales of the Abyss side story that focuses on Jade Curtiss, also known as Jade the Necromancer."},{"name":" Konna Kaosaretara, Watashi...","avatar":"https://mangadex.org/covers/cad4db69-ba26-41ea-8f15-df39628d6306/0fb9ad51-f263-4cb7-b669-5fa02468cbe6.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance"],"nutshell":""},{"name":" Dragonaut - The Resonance","avatar":"https://mangadex.org/covers/cad6b437-37cb-4438-bd9d-2c4046f41f2d/d5ab30ff-e019-4bc5-8a44-1b47d7b4fed9.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Action,Romance,Drama"],"nutshell":"Twenty years prior to the story's beginning, an asteroid headed for Earth destroys Pluto. Due to Pluto's destruction, the asteroid, which is dubbed Thanatos, becomes temporarily stagnant in Pluto's orbit. Now, in order to avoid Earth's impending destruction, the International Solarsystem Development Agency (ISDA) works on the \"D-Project\", and secretly creates weapons called \"Dragons\" after finding a dragon egg under the ocean. However, they soon find out that the asteroid is not their only threat, as powerful, destructive dragons from Thanatos appear on Earth."},{"name":" Aria - AQUAmariners (Doujinshi)","avatar":"https://mangadex.org/covers/cad76ec6-ca22-42f6-96f8-eca164da6545/b105ede6-4a2d-46d2-9547-c473bdd42e0d.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Slice of Life"],"nutshell":"The Doujinshi & Manga Lexicon links:\nVolume 1\nVolume 2\nVolume 3\nVolume 4\nVolume 5\nVolume 6\nVolume 7\nVolume 8\nVolume 9\nVolume 10\nVolume 11\nVolume 12"},{"name":" XBlade","avatar":"https://mangadex.org/covers/caddfaef-9f94-49e2-9fb6-7514b3d2e2ca/cd0cfb42-0e5e-4df0-979a-820a2fd56efc.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Action,Drama,Fantasy,Supernatural"],"nutshell":"Four years ago, a large scale disaster in Tokyo claimed two million lives. The remaining thirteen districts of the city were isolated into the Tokyo Barricade Zone. Morisaki Harumi, an unruly kid with great fighting strength, is his family's sole survivor from the incident.\nOne day, in a traffic accident, Haru gets pulled into a world of violence and meets Mana, the girl who turned herself into an ancient sword."},{"name":" Kiss to Koukai","avatar":"https://mangadex.org/covers/cadf2a83-be5a-4474-9ea2-d26fc9f355dd/d2f2d384-28f9-41c2-b0cf-08eca552c2ef.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Anthology,Drama,School Life"],"nutshell":"Kiss to Koukai (Kisses and Regrets)\nThe distance between us wouldn't diminish. It's painful, lonely, and my heart squeezes in pain. At that time, if I had been more honest, would it change anything…? Yeah, right. That's why this time, so I won't regret it, I'll…\nItoshii no Senpai-sama (Beloved Senpai-sama)\nHinako is the only girl to receive special attention from Katsuragi-senpai, the popular Kyuudo club president protected by his male club-member guards from all girls, not just fangirls. But Hinako's preferential treatment resembles nothing so much as a senior's spartan training of a junior. At first happy over how Katsuragi-senpai diligently takes time to teach her \"many things,\" Hinako later questions why her so-called enviable position saddens her.\nIkenai Koto (Something I Shouldn't Do)\nYui vehemently refuses to have her little brother's friend Haruka stay over at her house for the three days his parents are away…\nKimi no Button Kudasai (Give Me Your button)\nYuki plays pranks on Tomoya because she likes him. Her last one before they graduate: writing Suki (I like you) on the back of his gakuran's second button. What is Yuki supposed to do when Tomoya says \"Yes\" to another girl before graduation?\nKieta Hanbun, Nokotta Real (Half Gone, Love Remains)\nA broken school festival sign and a common love for music makes best buds out of Naru and Yamato. That is until Naru loses all hearing in her right ear and she keeps her condition from Yamato a secret…\n[PL] Dzielący nas dystans się nie zmieniejszy. Ta świadomość sprawia, że moje serce boleśnie się kurczy i usycha z samotności. Czy na pewno nie mogę nic z tym zrobić? Może jest nadzieja? Muszę spróbować."},{"name":" Tomorrow's God Land","avatar":"https://mangadex.org/covers/cae2278d-f8e8-4a61-9058-f4096508f5ab/84d1b703-f2d9-4599-93b8-dbb044128652.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.95","status":"Ongoing","tags":["Sci-Fi,Comedy,Fantasy"],"nutshell":""},{"name":" Haikyuu!! - Kisu no Jikan (Doujinshi)","avatar":"https://mangadex.org/covers/cae2af51-cf8d-4672-a900-606f48e2ebf8/8fd1a7a2-ea9e-4bea-b30a-43e71a53b4b5.png.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Romance,Boys' Love"],"nutshell":"Pairing: Kageyama x Hinata\nKageyama and Hinata may not want to go home..."},{"name":" Seishun Forget!","avatar":"https://mangadex.org/covers/cae2d94d-29d3-45e0-a0f1-107726a995c5/574d7255-d171-4b1f-b142-427b8beee65d.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Comedy,School Life,Mystery"],"nutshell":"\"Live with Sincerity\" is Natsuki Taiyou's motto. It's first day of high school and Taiyou was heading to a school and Taiyou meets Hinata during the way there. He fell in love at first sight and suddenly confessed to her. Her answer was yes and she runs away without saying who she was, but it turns out that she was his classmate. Taiyou felt a destiny between them. However, on the next day, she doesn't remember who he is. why could it that be…?"},{"name":" Dense Girl","avatar":"https://mangadex.org/covers/cae46fc8-8064-496d-82b8-7849a1ee0492/8945417b-1070-4d06-b42f-d29f2350b771.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Romance,Comedy"],"nutshell":""},{"name":" Shokuinshitsu no Himegoto","avatar":"https://mangadex.org/covers/cae6d2ef-e53a-4f1d-b271-5b8f06c569cb/246b2628-4d7e-44c6-ada9-ab52bd3dd84f.png.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life,Slice of Life"],"nutshell":"Nishio, a stoic math teacher, doesn't get along very well with Sakaki, the beloved gym teacher. However, after one drunken night, Nishio finds himself in Sakaki's bed where he is suddenly kissed and confessed to…?"},{"name":" Wallaby","avatar":"https://mangadex.org/covers/caf4c525-adc4-4dc2-9831-6ad841394d41/0c27bc22-71e5-411b-996d-487dba6e3167.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Completed","tags":["Comedy,Supernatural"],"nutshell":"Kokoro Kosaka is shocked when her recently deceased classmate comes back to life in the form of a stuffed wallaby toy! How will she handle this new companion and what are his reasons for returning from the dead?"},{"name":" Mahou Shoujo Madoka★Magica - Magia Record:  50 Point Strawberry Milk (Doujinshi)","avatar":"https://mangadex.org/covers/caf4e2fc-13ad-421b-b857-32c41f4d7d82/0de7c61d-b93c-41d0-81be-f90b6ec0db22.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Oneshot,Comedy,Video Games"],"nutshell":"Based on characters from the game Magia Record.\nHijinks centered around Alina Gray."},{"name":" Take Dake Dake! - Takedakei Gentei","avatar":"https://mangadex.org/covers/caf51deb-1d4e-436a-8ae8-28f97a5fc2d1/2a4390a4-e7cc-4ad6-927d-b84a02125cae.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Action,Romance,Comedy,Sports,Martial Arts,Harem,Drama,School Life"],"nutshell":"Bushido Academy gathers people who are descendants of the military commanders from the Warring States Period to fight for leadership. As Takeda Shingen's descendant, Takeda Tetsuro is forced to join Bushido Academy. Joining him is Sanada Rieko, who is descended from Sanada Masayuki, a loyal retainer of Takeda. Can they unify everyone together in a school where various warlord students battle for control? The curtain rises on this magnificent picture scroll featuring a Warring States themed academy."},{"name":" The End of the World and a Witch's Love","avatar":"https://mangadex.org/covers/caf7e86a-1fc7-4dcd-820a-17d267153654/216fc22e-5a2c-4c88-9874-635c92b51cd1.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Magic,Girls' Love,Drama,School Life,Fantasy"],"nutshell":"In a world secretly run from the shadows by magic and those who wish to control it, a mysterious academy trains young witches to seek revenge on a world that treats them like tools. Alice, a young magic prodigy, has been taught to live for this goal - while Mari, an almost powerless human, stumbles through life looking for mutual understanding. However, when Mari’s reasons for attending the school become increasingly clear, Alice must cope with revelations of her own!"},{"name":" Dad is God.","avatar":"https://mangadex.org/covers/cafb940f-3d3f-47a3-a285-c1163453485e/5bcf3769-8cfb-49e5-b2a4-3f4484c67444.png.256.jpg","country":"Japanese","stat":"8.12","status":"Ongoing","tags":["Comedy,Fantasy"],"nutshell":"A god and a crying baby in a snowstorm. Have you been thrown away? Will you die? At the end of the conflict, the man hugs his baby. Until this snow stops … Time has changed and is now. Yuki, who has grown big, is going to enter elementary school from today!"},{"name":" Island of the Crying Fireflies","avatar":"https://mangadex.org/covers/cb026a31-40e2-4a24-94ef-92c8fdc87cac/2afbf233-0e5f-4d83-8974-2fdace8e9e54.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Psychological,Animals,Romance,Comedy,Anthology,Crime,Office Workers,Drama,Police,Slice of Life,Supernatural,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nThis is a collection of 11 short story masterpieces by Leiji Matsumoto, the well known mangaka of \"Galaxy Express 999\" and considered a master of the SF manga world, which depicts men and women in a surrealistic environment.\nTakashi Shiki, an insect maniac, stops by a park after being laid off from his job, and when he tries to remove a minnow from a tree, he is suspected of peeping on a couple's sexual activity and taken to the police.\nWhen Takashi manages to clear his suspicions and returns to his room, the female partner, Hotaruko Yamakawa, appears before him...!?"}]