[{"name":" I Need to Be a Good Person","avatar":"https://mangadex.org/covers/d40d99dd-e0bc-4d79-acdd-5bf3afb12a1c/33676ac0-89bb-43ac-995e-96190c8028c5.jpg.256.jpg","country":"Japanese","stat":"7.46","status":"Completed","tags":["Oneshot,Psychological,Web Comic,Slice of Life"],"nutshell":"I need to be a good person.\nI need to be a good person.\nI need to be a good person.\nI need to be a good person.\nI need to be a good person.\nI need to be a good person.\nI need to be a good person.\nI need to be a good person.\nI need to be a good person.\nI need to be a good person.\nI need to be a good person."},{"name":" Running on Empty","avatar":"https://mangadex.org/covers/d40f0bd6-7f75-416b-91d2-0ab599e4b74b/51c767ef-c146-4169-a1c5-900fb51b2a7a.jpg.256.jpg","country":"Korean","stat":"8.04","status":"Completed","tags":["Award Winning,Boys' Love,Adventure,Drama,Full Color"],"nutshell":"Han Soo-Bum has nothing to lose. Dying seems to be the solution to all his problems. How hard can it be to kill himself? Unless he gets abducted by a hot guy Lee Hyuk Soo running from the law who has been falsely accused. Where will they run to, and what are these feelings blooming inside our fugitive’s heart?\n\nWon Silver from The 3rd International MANGA Award."},{"name":" Kimi to Gattamelata","avatar":"https://mangadex.org/covers/d40ffb7b-014c-4fd6-8e9e-c47bd0382ada/c323e2e3-6793-4028-a171-d935fd910aaa.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy"],"nutshell":"After a brain injury, Susumu Kataoka was forced to retire from boxing and is now a nude model. The dull man who spent his days heartbroken over his lost dream is unable to \"react\" mentally or physically. But after meeting art student Yui Teshima, Kataoka decides to try for the art school entrance exam."},{"name":" Chuuken Kunshu","avatar":"https://mangadex.org/covers/d4142ecf-ee2f-4873-94a6-162e910a4d0b/9f2db9d1-8d64-43de-bc45-aff140092c93.jpg.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"Katou is a member of the high school swim club. Matsuoka has come to bring him lunch and once again to use Katou as his stress relief punching bag. To the sympathy of his clubmates, the impulsive Katou totally falls for Matsuoka, calling him cute with a shy smile. Even as Katou treats Matsuoka kindly and tells him that he loves him, Matsuoka remains a total tsundere, leaving doubts to linger in his heart!"},{"name":" Ikiru","avatar":"https://mangadex.org/covers/d41b265a-c8be-4011-aead-65527bab1620/a0c9fb51-a85e-4863-ac3b-7e09e5976a95.png.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Oneshot,Drama,Slice of Life"],"nutshell":"Every night a young woman would try to end her life under the moonlight, on one night she meets a man…"},{"name":" Fate/stay night - Sakurasiki (Doujinshi)","avatar":"https://mangadex.org/covers/d41ccf6c-2494-4cfd-87d7-79bdee0db340/52fb99ef-6db3-4c7f-b3f8-e2b28e3412cf.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Oneshot,Drama,Fantasy,Slice of Life"],"nutshell":"Sakura's inner state of mind one year after Heaven's Feel."},{"name":" Otona ni Nuts","avatar":"https://mangadex.org/covers/d422e3bf-1a1f-49b6-aaf2-9c8b8196a852/142d3307-5faf-4f1e-8b12-31ef685e0e77.jpg.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Romance,Comedy,Supernatural"],"nutshell":"Natsumi Kawashima, an energetic fifth-grader, is obsessed with her fantasy of being the ideal, sexy woman. Rejected at every advance by the cute guys that she fawns over, she finally gets a break when she picks up a package of mysterious pink nuts that are adults only.\nEating these nuts causes her to morph into a voluptuous adult, and she's offered modeling opportunities and suddenly becomes noticed by guys who wouldn't have given her the time of day before.\nBut, she's still a kid inside and is about to learn that things don't always work out exactly as you hope they will…"},{"name":" Love Live! - Kotori wa Zurui desu! (Doujinshi)","avatar":"https://mangadex.org/covers/d4241452-c148-436e-a538-3a67c01c46ef/371c7421-8f1d-418a-bf35-668ccfa58f77.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":""},{"name":" Hiyama Kentarou no Ninshin Ikuji-hen","avatar":"https://mangadex.org/covers/d425392b-22ff-4370-a495-e94b3a411a0a/903c1813-bc36-4574-b253-ce52293912ad.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Office Workers,Drama,Slice of Life"],"nutshell":"Set in a world where men can give birth.\nNow 35 years old, Hiyama Kentarou is busy supervising his subordinates as a section chief while also raising his child, Koutarou as a single father. Since the prejudice towards men who give birth is still strongly rooted in society, Hiyama now finds the cafe he produced specially for those men to be in trouble of staying afloat. While Hiyama was worrying over this, a certain pregnant man came to visit him..."},{"name":" I Don’t Want the Obsession of a Twisted Archduke (Promo)","avatar":"https://mangadex.org/covers/d42d0e05-2a04-4a1e-ba09-3cb020676279/622eb1f5-c26a-48ab-8eeb-3af59dd3172c.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Oneshot,Long Strip,Romance,Isekai,Drama,Fantasy,Full Color"],"nutshell":"Note: Promotional novel for the novel of the same name.\nI reincarnated as the wife of a cursed archduke in my own twisted novel. As the author, I took responsibility and set things right by lifting the curse, which was the key to returning home. I thought my job was done, and just when I was finally trying to go back, the archduke asked me, \"Did you really think I wouldn't know that you’re planning on returning to your fiance?\"\nHe had completely misunderstood!\n\"Whether you like it or not, I'm still your husband. I'm never letting you go back to that bastard.\"\nAll I want is for him to please let me go home!"},{"name":" Primo Piatto","avatar":"https://mangadex.org/covers/d42f00b9-207f-425a-9892-b9169568d2a3/e14f97e2-aeb4-480a-a33b-8476542f7a43.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Oneshot,Horror,Supernatural"],"nutshell":"A chef becomes indebted to the yakuza when his restaurant fails. To pay them back they force him to become the personal live-in chef for a girl they are holding captive."},{"name":" Type-Moon - T-Moon Complex  (Doujinshi)","avatar":"https://mangadex.org/covers/d42ff2ef-b818-4712-8c2b-4c821c8599da/885b3624-e8b7-427d-bee9-cf5d9ccae083.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Romance,Comedy,Harem,Supernatural"],"nutshell":"Bunch of short stories of the Type Moon gang filled with parodies and gag."},{"name":" Evil Son Does Not Want to Perish","avatar":"https://mangadex.org/covers/d43286ea-5989-458e-859e-a502b7b6fbf3/66383c5d-7afd-41d6-94e6-68da946001b5.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.83","status":"Ongoing","tags":["Thriller,Action,Demons,Horror,Fantasy,Web Comic,Supernatural,Full Color,Tragedy"],"nutshell":"Li Xiao, who is the whole strange side saint child, was attacked inadvertently. As a sacrifice, the clown broke the seal in Li Xiao’s body. From then on, his daily life was broken and he stepped into a new world. In order to explore his own secrets and truly understand the world, Li Xiao found Fu Siun, a weird detective, and formed a partner with her, just like Sherlock Holmes and Watson in the weird world."},{"name":" Gunka no Baltzar Gaiden - Yuukoku no Liebknecht","avatar":"https://mangadex.org/covers/d435de30-9bba-4018-9773-5a900c3a12c1/7717689d-94ca-4402-a1b1-968e64aab51a.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Historical,Action"],"nutshell":"The story of Liebknecht after he ran away from his country and before he met Baltzar again."},{"name":" Blood Loop","avatar":"https://mangadex.org/covers/d4363d57-fdd7-41da-9447-cb28834b594d/3da0fe57-41c8-461d-97c1-84a8739e4be0.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.90","status":"Ongoing","tags":["Monsters,Action,Adventure,Web Comic,Mystery"],"nutshell":"Venant d'endroit mystérieux, les créatures grises et pourpres entrent en collision sur terre. Ils réussissent à transformer autant d’humains qu’ils peuvent en leur propre espèce. Xiao Cheng et Zheng Yiren, meilleurs amis de l’enfance, ont été transformés en rouge et gris respectivement. Debout sur les idéaux opposés, face à ce monde en train de s’effondrer, quels choix feront les deux frères ?"},{"name":" Suki de Shikatanai","avatar":"https://mangadex.org/covers/d436b1c6-1ca4-4408-8f03-31093a839f3e/fe69e76d-64b1-4d02-85c1-b4da880cac9c.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life"],"nutshell":"Can't Stop My Love\n\"You like me. So I'm holding you now.\" Shiratsuka sensei held Isoyama after saying that. Holding each other without love, bodily contact without feelings… Even after sensei made Isoyama cry, the feeling Isoyama has just refused to back down. What does sensei really think of Isoyama?\n\n\nMy Love Overflows\nMomozono was heart broken when Isoyama expressed his love for sensei. When Kuwana stumbled into his life, Momo started to get confused. Why is he thinking about Kuwana all the time? Is he not that into Isoyama after all?\n\n\nI Don't Come To Like You\nAfter Momo moved out, Yone got a new roommate, Kei. The only problem is, he ran away from Kei three years ago. Did Kei follow him here?\n\n\nMy Love Overflows (Extra)\nMomo comes home sick… how will Kuwana help him get rid of the fever?"},{"name":" Mazinkaiser","avatar":"https://mangadex.org/covers/d437bad6-bcd3-425d-a411-114b3e533258/25c10489-1deb-4c92-b029-73ae255e5204.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Sci-Fi,Action,Mecha,Drama"],"nutshell":"Slight retelling of the 2001-2002 Mazinkaiser OVA series. Included in this volume is a short story called Mazin Kaiser: Shin Majin Densetsu (Mazin Kaiser: Legend of a New Demon God)."},{"name":" Jig + Zag","avatar":"https://mangadex.org/covers/d43832dd-756a-4758-909f-6c2684f74484/cb4fc3e1-9cfc-424d-afb4-2a7b4bf23dda.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Boys' Love,School Life"],"nutshell":"Fujisawa Kazui followed his recently departed grandfather’s will to stay in Seisou Gakuen’s Tsukigase Dormitory. The cowardly Kazui has two roommates- one is Kawasaki Ryouhei, who has a very big secret (!!) and the other is Mario Bertini, who talks in a strange Japanese accent. With these two as roommates, what kind of a school life would Kazui have?!"},{"name":" Betray in the Box","avatar":"https://mangadex.org/covers/d4383e6f-7592-4f6c-984e-6f17c5753c3c/efd8c2c3-6ce0-45e9-8320-ab8f0aa3e85c.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Action,Adventure,Fantasy"],"nutshell":"Young Jijii's Rookie Shonen Jump entry."},{"name":" Super-Class! Mobile Fighter G Gundam","avatar":"https://mangadex.org/covers/d43913d8-869f-4735-b0f3-89b2ee5b09b1/ab94133d-ee29-42b8-aac8-c3190a1271b7.png.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Romance,Comedy,Mecha,Survival,Sports,Martial Arts,Adventure,Drama,Slice of Life,Adaptation,Music,Tragedy"],"nutshell":"In F.C. 60, the 13th Gundam Fight begins. Domon Kasshu pilots the Shining Gundam as the representative of Neo Japan, the Japanese space colony. Along with his crew member Rain Mikamura, he battles the other countries' representatives in order to earn the right to rule Earth and the colonies for four years for Neo Japan. However, Domon seems to be more concerned with finding his brother and the stolen Devil Gundam."},{"name":" Kimi to Date","avatar":"https://mangadex.org/covers/d43bb51f-056a-4bd5-b28e-e00592301491/67e0a1a5-6876-4539-9a8c-34ed68155163.jpg.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Oneshot,Romance,Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"Tsuge Kazuma is arguably having the worst moment of his life. A chance meeting with the ever timid Nagano leads Tsuge to rely on a his kindness."},{"name":" The Girl in the Diary of Unrequited Love","avatar":"https://mangadex.org/covers/d43d5010-3171-4ba1-a41f-709d71cd938a/293ca03a-3a51-474f-b568-e7582720f864.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Oneshot,Romance,Comedy,Crossdressing,Drama,School Life,Slice of Life"],"nutshell":"A collection of six short stories centering around romance and family:\n1- Musume no Toshigoro no Musume\n2- Torikahebaya de Aimashou\n3- Genshoku Megane Danshi Hyouhon\n4- Machibito Kitari (New Year's Fortune: Waiting for the One)\nA chance meeting of two strangers at a train station on New Year’s Eve…\n5- Chichi to Musuko to Buridaikon (The Father, the Son and the Yellowtail Radish)\nMicha, formerly Hamada Mitsuru, is gay, in a loving relationship and living as a transvestite in Tokyo. Having kept this a secret from family what high jinx will follow when Micha's father turns up unannounced?\n6- Katakoi no Nikki Shoujo (The Girl in the Diary of Unrequited Love)\nTakashi accidentally found his father's diary and in it, it tells a story of his father's love for a girl with green flower hair pin. So who is this girl? What's Takashi going to do about it? Read it to find out the bittersweet story of an unrequited love."},{"name":" Renjou Sparkle","avatar":"https://mangadex.org/covers/d4446656-30a0-4e01-92c2-6d06e538fa70/7bc3a184-7c77-45a9-8217-39ea68c29adf.png.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Sawara Yume has been playing the violin for over 10 years now. She's not particularly good at it but she likes to play. Right before her debut in a violin duet, a student from her school tells her that she plays bad and that she should just give up. This doesn't stop Yume, actually, now she is even more determined to do good at the school's violin duet concert. Her plans don't go so well as she ends up playing the duet with Seima, the boy that insulted her violin skills earlier. Despite their differences, the performance goes really well, but what will Yume do after Seima kisses her in front of everyone after the concert?"},{"name":" The Result of Being Repeatedly Goaded by the Local Cheeky Brat-chan (Colored)","avatar":"https://mangadex.org/covers/d450e2d8-8b7f-4392-ad81-b79decdc3547/975839af-a6b6-41a5-bd8e-8959d15a3f36.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot,Official Colored,Romance"],"nutshell":""},{"name":" SOS Greater Tokyo Exploration Team","avatar":"https://mangadex.org/covers/d45698df-b76a-4046-9ccf-55b131336e96/dbc97cc7-8ff8-47aa-967f-2ec3cb7b5737.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Sci-Fi,Psychological,Comedy,Anthology,Adventure,Post-Apocalyptic,Drama,Slice of Life,Mystery"],"nutshell":"Collection of short stories, from 1979-1995, including;\n\nSOS! DAITOKYO TANKENTAI\nRUN\nSPEED\nNEKO HA YOKU CHOPO NI KAETERUKU\nABUNAI! SEITO KAICHOO\nHOOMONSHA\nSUN BURG HILL NO OMOIDE\nEIYOO MANTEN episode I\nEIYOO MANTEN episode II\nMADOROS KUN\nSUKIYAKI\nNIGHT FLAMES\nHomonsha (VISITORS)"},{"name":" Sakurahime Kaden","avatar":"https://mangadex.org/covers/d456cc59-852f-4cf1-83b4-71587f6d9644/9ba91412-88a1-4e8a-9d43-ef4aa9ccf184.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Historical,Romance,Drama,Fantasy,Supernatural"],"nutshell":"Sakura is a princess who lives alone with a few maids in a mansion deep in the mountains. She’s been betrothed to the prince of the country since she was born. She doesn’t like that fact, as she wants to decide her fate on her own. However, on the night of their marriage, Sakura finds out that she is the granddaughter of the legendary Princess Kaguya, and that her lifelong task is to exterminate youkos, man-eating mononoke. In doing so, she creates allies and enemies who both want her on their side."},{"name":" Akaku Saku Koe","avatar":"https://mangadex.org/covers/d4574bae-22b1-4c38-a7ca-d0ed5ed0445a/03a9b36c-2382-4946-91d1-d6bca391ce36.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Romance,Drama,Supernatural,Mystery"],"nutshell":"Karashima is a high school boy with a beautiful voice. So beautiful that he can make anyone do anything, just by saying the words. Because of his potentially dangerous ability, he distances himself away from people but soon finds himself in the middle of various criminal investigations that he can help solve, and a girl named Kokubu who seems in love with him."},{"name":" Spellward Bound","avatar":"https://mangadex.org/covers/d463cb08-13d4-473a-af4a-c9b292d0c2e9/dfff378a-fe4a-4328-aa28-c1751beee38a.png.256.jpg","country":"English","stat":"7.86","status":"Ongoing","tags":["Monsters,Adventure,Magic,Fantasy,Web Comic"],"nutshell":"English : Matteo’s greatest dream is to become an astronaut, but the chances of actually becoming one are astronomically low. With his teachers pushing him to start thinking about his future, Matteo begins to lack the confidence to pursue his dreams. After accidentally drinking a magical soda, Matteo finds himself teleporting to strange fantasy realms filled with elves and magical creatures. The catch? He is now slowly becoming a magical creature himself. Once that happens, he’ll be trapped in the realms of fantasy for good!\nNot quite ready to give up his dreams of exploring the stars, Matteo sets off on a journey to find a cure for his magical ailment. Now trapped spontaneously teleporting between worlds, Matteo tries to balance his school life and fantasy life with the help of his friends; a wannabe internet celebrity named Tyson, and an elven hero following a grand prophecy; named Gwen.\nRussian : Космические корабли? Научно-фантастические приключения? Исследование звезд было величайшей мечтой Маттео, но после магического сбоя он оказывается в ловушке между мирами и альтернативными версиями самого себя! Теперь Маттео должен найти способ исправить ситуацию, прежде чем он застрянет в захолустном фэнтезийном мире навсегда! Пришло время путешествовать по 3 мирам магии, но ответы на его вопросы могут оказаться ближе к дому, чем он думает."},{"name":" Free! - v082 (Doujinshi)","avatar":"https://mangadex.org/covers/d465271f-8b42-4d72-acff-e32cf8f74000/baca784c-2e10-4c80-9e3d-f06ce968cdc1.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Boys' Love,Sports"],"nutshell":"One night he sleeps Makoto but it can not suppress their urges to touch him … Haru and ends up being rejected. What will happen now between them?"},{"name":" Puchigonavis","avatar":"https://mangadex.org/covers/d4748f4c-72f5-4b53-81a5-038c8fd7e013/e8eab603-ea51-4fd1-b622-696c2f35dd97.jpg.256.jpg","country":"Japanese","stat":"8.32","status":"Ongoing","tags":["Comedy,4-Koma,Slice of Life,Music"],"nutshell":"A small and cute 4-koma manga serialization of ARGONAVIS from BanG Dream!"},{"name":" Dear Boys Act II","avatar":"https://mangadex.org/covers/d477300e-092a-42f9-8b04-4924c9d0876f/cd06cfb7-4cce-4482-839b-978463ebacf6.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Award Winning,Sports,Drama,School Life,Slice of Life"],"nutshell":"With its long-awaited freshman/student athletes aboard, Mizuho High's basketball team practices with a hope to play in the national tournaments. In the prefectural preliminary games, the young athletes compete with their rivals at Shonandai-Sagami, Honmoku-Higashi and Yokohama Gakuen Highs. Will Mizuho compete in the national tournaments and once again confront Narita-Chuo and Meiwadai-Hitachi Highs? And finally how will the players fare in a game against the high school basketball champion team at Tendoji? The struggles of the newly reborn Mizuho basketball team to become the national champion begin!"},{"name":" BANANA FISH - Futari no Eden (Doujinshi)","avatar":"https://mangadex.org/covers/d4786b44-e60d-4219-9b7a-16cded8423e8/dfdb3bb3-302a-4163-813a-9e163cbfd2a8.png.256.jpg","country":"Japanese","stat":"8.23","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Drama"],"nutshell":"Pairing: Ash x Eiji"}]