[{"name":" Lupin III: Ore no Juudan wa....... Suteki..... Daze","avatar":"https://mangadex.org/covers/c9f79494-ffbb-4761-9157-e8267f8bb12c/32cd3e44-51e7-4d6a-981d-6e9d7ea02864.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Oneshot,Thriller,Action,Comedy,Crime,Adventure,Police"],"nutshell":"Lupin III Ore no Juudan wa……. Suteki….. Daze (My Bullets are Nicer…) is a one-shot chapter printed during the airing of Lupin III Part 2. It was advertised as a competition between the manga and the anime to see which could make the better version of the same story (Episode 26 of Lupin III Part 2)."},{"name":" Red Data Planet","avatar":"https://mangadex.org/covers/c9f8af97-92aa-4d7a-8d42-aca0b33448a4/5b74aec9-a49a-4dd2-a606-6936fd6fffa7.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Sci-Fi,Action,Aliens"],"nutshell":"The morning after a meteor fell in Japan, a mysterious beautiful transfer student Monika appears in front of Leo Kuroishi, an ordinary high school student. But the moment she told him \"I will protect you,\" Leo's problem-free days changed forever. What is the value of life? The fate of humanity? A new disaster action manga begins!"},{"name":" This love is legal","avatar":"https://mangadex.org/covers/c9fc02da-ccd9-48e9-86c7-99f84fa10cc2/4b900dca-8b45-41a9-96f9-7ff78d20c9f8.png.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Romance,Shota,Web Comic"],"nutshell":"Ayana, de la familia de Ikuse, ha tenido recientemente un hermano menor como resultado del nuevo matrimonio de sus padres. ¡La Onee-San que intenta que no se conozca su amor por los shotas, y el pequeño diablillo que ama a las chicas mayores, se encuentran en una historia de comedia romántica con diferencia de edad!"},{"name":" Mutou Black","avatar":"https://mangadex.org/covers/ca0206e1-7baf-40b2-a65b-89ca49a77e0a/b9db2fd1-a730-4c4e-a4c2-4869993fecf9.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Historical,Action,Martial Arts"],"nutshell":"Wandering traveler Kurotsuki Yukiji goes from town to town enjoying the women, food, and culture each has to offer. He is the master of the Kurotsuki style martial art where instead of using brute force, it uses the aiki form where you use the opponent’s strength and manipulate their force against them. It focuses on settling the conflict without hurting both sides and harnessing the “bladeless soul.” Yukiji is traveling to perfect this style and trouble usually finds him although going by his outward appearance, he looks like a peace-seeking man.\nThe oneshot was released in issue 20/2012 of Weekly Shounen Jump.\nThe serialization for this series begins from issue 24/2013 of Weekly Shounen Jump."},{"name":" Boku Dake no Ou-sama","avatar":"https://mangadex.org/covers/ca055831-ec65-41f8-a214-9dea3bbc0f9f/5df2fe89-493c-4459-bf99-04a0e0a16955.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Comedy,Boys' Love,Crossdressing,Drama,Fantasy"],"nutshell":"Story 1 (chapters 1-4)\nIn the land of magic, a new king is being crowned. However, a mishap during the ceremonial rite causes the royal crest to be accidentally attached to a normal human, Kazuomi. To protect the crest from any villains who may be after it, Mewt, the cute and brave sorcerer, is dispatched to the human world. There, Mewt must live disguised as a girl, and as \"she\" and Kazuomi live under one roof together, the two begin to find themselves attracted to each other…\n\n\nStory 2\nThe students are obsessed with horoscopes.\n\n\nStory 3\nA ghost is haunting the bathroom of a salaryman.\n\n\nStory 4\nContinuation of Mix Mix Chocolate .\n\n\nStory 5\nIn a kingdom there exist 9 different kingdoms with 9 different kings."},{"name":" Himitsukichi ni Aijin","avatar":"https://mangadex.org/covers/ca0b1e4d-93aa-4e19-b87f-7a39ff96197b/01d624e3-eeb1-4298-a934-9f89b0584efe.png.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"An invitation to a secret base that suddenly arrived to Tetsuji, who is called \"Manbo-Sensei\" by the students. I was suspicious, but when I visited, there was a strange young man there. \"I will answer the question if you will make love with me one time\" The purpose of the invitee who boldly invites me is...!?"},{"name":" Spica wo Tsukamaete","avatar":"https://mangadex.org/covers/ca174012-a49a-4f20-a6ba-cb9543f8cc1b/6f09ba45-ddbf-4834-9e33-b9a19cbee6ac.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Ongoing","tags":["Girls' Love,Drama,School Life,Gyaru"],"nutshell":"Despite her gyaru appearance, Seirina Nekozuka is a serious and hard-working third-year high school student. She is trying her best to get first place in her grade to qualify for the scholarship she is aiming for, but she has been stuck in second place for years because Reiko Tachibana, the public morals officer she hates who always blames her for her flamboyant clothes, always gets first place. One day, on her way home, she sees Reiko having an affair with an unknown woman..."},{"name":" Color Kingdom 3","avatar":"https://mangadex.org/covers/ca17a2de-0f96-4df4-b49f-454491f9c4db/4c5467fb-82b1-47e7-a580-93dee59d48d6.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Oneshot"],"nutshell":""},{"name":" Saki - Lily on a Mountain 2 (Doujinshi)","avatar":"https://mangadex.org/covers/ca17cfe4-3d39-45af-8ab2-644d897a7322/c6c60c01-4284-4e75-afa4-c2d9e8de07a2.jpg.256.jpg","country":"Korean","stat":"7.90","status":"Ongoing","tags":["Girls' Love"],"nutshell":""},{"name":" Ane Log","avatar":"https://mangadex.org/covers/ca264439-ffa2-4334-91b7-ab42b8b3c684/42feb133-5080-4c43-bfbf-58ebd0d0d2b3.jpg.256.jpg","country":"Japanese","stat":"7.60","status":"Completed","tags":["Comedy,School Life,Slice of Life"],"nutshell":"When Konoe Moyako and her little brother, Akira, were young, he said he wanted to marry her. Naturally, Moyako decided that her little brother was a complete pervert who was obsessed with her. Now that they're both teenagers, Moyako is convinced she needs to 'rehabilitate' him. However, it seems that the 'perversion' is entirely in her imagination, and she can't seem to help turning completely innocent situations into creepy ones in her mind!\nLinks to AnimeNewsNetwork for the anime:\nOAV 1\nOAV 2"},{"name":" Zombie Hide Sex","avatar":"https://mangadex.org/covers/ca269034-b875-4b49-be09-5d4fddcd65e2/64c81d6b-aabc-4ce5-b28a-3b46ef8f30de.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Ongoing","tags":["Action,Romance,Comedy,Boys' Love,Survival,Zombies,Adventure,Drama,Supernatural,Tragedy"],"nutshell":"Out of nowhere, zombies begin to appear in the city. Mishiba, a simple store clerk, ends up running away. When he was about to die, an attractive young man who is part of the JSDF (Japan Self-Defense Force), Chigasaki, saved his life. But in exchange for continuing to protect him, he asks him to lend him his thighs so he can masturbate…?! A BL story full of eroticism and zombies!"},{"name":" Space Adventure Mugen","avatar":"https://mangadex.org/covers/ca2bf5e7-ed89-4a3f-96cb-2f5ebf744a43/8fbc84cd-059c-4818-92cf-a6f60aa1f4b1.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Sci-Fi,Martial Arts"],"nutshell":"This is a highly anticipated special manga about Mugen, a master of Tondemo Kempo, who will go on a rampage in outer space!!"},{"name":" Princess Is a Bloodthirsty Surgeon","avatar":"https://mangadex.org/covers/ca35494e-4711-48d3-ab1e-45ec0f026360/398a957a-f017-4dfd-b4fa-bb0edc60d79c.jpg.256.jpg","country":"Chinese (Traditional)","stat":"7.89","status":"Ongoing","tags":["Historical,Romance,Reverse Harem,Web Comic"],"nutshell":"La Princesse est une chirurgienne qui a soif de sang, un superbe médecin qui a voyagé dans le temps. Quand elle s'est réveillée, elle est devenue une pauvre fille. La propriétaire d’origine de ce corps a été intimidée à mort, mais cette fois, elle va intimider son retour. Mais avant ça… qui est ce prince dans sa baignoire ? !"},{"name":" Your Face Looks Like Cherry Blossom","avatar":"https://mangadex.org/covers/ca36d2a5-7f40-4f3a-b7be-f0e940ade20a/9f9d8448-74c9-4b9c-8f24-9ea607e3be12.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.01","status":"Ongoing","tags":["Official Colored,Historical,Action,Long Strip,Romance,Comedy,Reverse Harem,Adventure,Crossdressing,Military,Drama,Fantasy,Web Comic"],"nutshell":"A desire for love, A temperamental flirtation! A woman dressed as a male general captures the beautiful prince of the enemy? As the saying goes, a man can be killed but not humiliated, but she did the opposite! She has taken the beautiful prince into her harem to \"humiliate\" him! The \" impotent\" general disguised as a man dislikes the cold and dark-hearted male prince! They met each other and it was a shameful scene, really shameful!"},{"name":" Yururizumu","avatar":"https://mangadex.org/covers/ca37debf-0a55-494b-9980-6d83e6252a67/a8b678c9-9c9c-4763-9a32-5bed1a2c27a9.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Completed","tags":["Romance,Harem,Fantasy,Supernatural"],"nutshell":"The onsen world lies beneath our own has spirits which can only be seen by those who truly love onsen (japanese baths). After his grandfather dies, a japanese student summons one of these spirits…"},{"name":" Kuroko no Basket - Things I Learned About You (Doujinshi)","avatar":"https://mangadex.org/covers/ca37e4cd-9a53-4f9c-adeb-e0d814d5f1cc/336c0c6d-1dd6-4cc7-83e2-1864054e12ec.jpg.256.jpg","country":"Japanese","stat":"7.79","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Sports"],"nutshell":"Pairing: Aomine Daiki x Kagami Taiga"},{"name":" Taiyou-kun to Itsuwari Account-chan","avatar":"https://mangadex.org/covers/ca3aa385-869e-4d60-8cde-746ce99dc67c/1f2fc001-c187-4e02-a211-bd92a14c5021.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Hikage Chigusa is a dull high school girl with a secret... She has three social media accounts where she pretends to be a bright and happening girl. Ever since she fell in love with Taiyou, the popular guy in her class, the clash between her fiery feelings and her ideals have made her lose control!\nIn one account, she pretends to be in a relationship with Taiyou. In another, she pretends to be a charismatic girl with perfect make up who other high school girls even look up to and the third account is where she dances her heart out...\nIn between reality and her fake accounts, will Chigusa's love ever bear fruit?"},{"name":" My Own Contract Angel","avatar":"https://mangadex.org/covers/ca3cfc7e-3da7-41b0-bffb-b2a84d03cec3/f23fdaa9-977b-4160-a1a1-fd5c8060331f.png.256.jpg","country":"Korean","stat":"7.76","status":"Completed","tags":["Long Strip,Romance,Comedy,Boys' Love,School Life,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"After being traumatised from getting forcefully outed, Yeonho, a closeted gay, is a \"single-for-life\" who has never dated anyone. One day, Yeonho gets hit by a shooting star, and he woke up to see someone, who calls himself \"Cupid\", sharing his bed! The strange man promised to end Yeonho's one-sided crushes, but will he really…?"},{"name":" Koi no Ichibyougo","avatar":"https://mangadex.org/covers/ca3f0bb8-0603-4908-8db8-eaedd78bc72f/eed9051d-389c-4d84-9333-b467b5fa8dd0.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Comedy,Slice of Life"],"nutshell":"Contains a short story called Yamaarashi.\n\"Cute\" is not a word to describe Kaho. In fact, the best word to describe her is \"porcupine\" with her prickly personality and the tendency to say the exact opposite of what she means. All in all, even Kaho doubts that she would ever get a guy to like her. But then fellow basketball club member Arata asks her out (much to everyone else's confusion). Will these porcupine's spines keep Arata away, or will Kaho learn to speak from her heart?"},{"name":" Boku to Senpai no Tekken Kousai","avatar":"https://mangadex.org/covers/ca41a5c0-36a0-462b-b6ad-c0abc4a39081/4c6e111c-8ff1-4927-9736-10bc67a69feb.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Mystery"],"nutshell":"Japan's biggest company, the Koigakubo's daughter, Reijou Himeko has \"violence-seeking\" eyes. Aoyama Shuuji watches over her, employed by the Koigakubo as her bodyguard. They appear to be \"Senpai\" and \"Shuu-chan\" but perhaps… their relationship is not what it seems――"},{"name":" Shiaroa","avatar":"https://mangadex.org/covers/ca42e7ce-5768-407e-9c07-38554afe46ee/e39501bb-edf1-4e2b-b338-ff54b010bbd8.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Drama,Music"],"nutshell":""},{"name":" Did I Do Something Wrong?","avatar":"https://mangadex.org/covers/ca4b8f25-877f-4334-a265-b747de83c1db/ec3ba56a-318a-4430-8702-d2ed38483f22.jpg.256.jpg","country":"Korean","stat":"8.01","status":"Completed","tags":["Oneshot,Comedy,Crossdressing,School Life"],"nutshell":"The new guy at school had no idea what he put in motion being nice to the bully…"},{"name":" Akuma no Ikenie","avatar":"https://mangadex.org/covers/ca4cd385-404d-49bc-b99b-4c9ed17620b8/8f4a2c3e-6e73-4980-b9e3-8a3f1e719f7c.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Romance,Comedy,Harem,Drama,School Life,Supernatural"],"nutshell":"Hajime lives with the twin sisters of the family of the Komatsu shrine. Inori is of a very spiritual bent and often tries to use her 'powerful' heirloom rosary to protect her friends and family from evil. The other sister, Kanau, is more practical. She often spends time trying to keep Hajime from groping women, which he is always doing by accident.\nAmidst strange vampire-like murders in the community, Hajime has had a dream of a hot female demon called Satan that is lusting after his blood. Soon enough, she appears in his waking life, along with her alter ego Lucifer. After an embarrassing situation at school, Hajime and the shrine twins end up taking Satan/Lucifer into their home. Why are these demons attracted to Hajime, and what do they really want?"},{"name":" Girls und Panzer - Mika, Arrived At the Schoolship of Anzio (Doujinshi)","avatar":"https://mangadex.org/covers/ca570163-57db-4000-9760-3986150cb805/0e1e1c69-33e9-4b70-a2bf-934305cb3a29.jpg.256.jpg","country":"Japanese","stat":"8.37","status":"Completed","tags":["Oneshot,Adventure"],"nutshell":""},{"name":" I Buy a Amazon Device","avatar":"https://mangadex.org/covers/ca5a74b4-18e9-41d8-a09f-40fe9fd2018b/c1b7a895-7c7a-4723-84d8-619a482eb15f.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Comedy,Anthology"],"nutshell":"Scanned from my own book Akai Kiba vol. 5 2004. It's about a wife in the middle east that wants to buy a Nokia phone for her own trill.\nIt has no text, So it's an easy read;)"},{"name":" Kirika C.A.T.s","avatar":"https://mangadex.org/covers/ca5ad963-1064-43b4-92f3-729036a448ba/f7a08f45-8a9c-45bc-b43a-75145268a8b8.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Thriller,Sci-Fi,Monsters,Action,Psychological,Crime,Superhero,Martial Arts,Military,Monster Girls,Police,Aliens,Tragedy"],"nutshell":"Ark, the Secret Terrorist Organization make the first move revealing himself and their main goal …destroy Japan! The Kaijins, misterious beings with superhuman abilities begin their ounslaught, Tokyo is under siege!\nKirika Himeno, policewoman from the Public Security Department of the Metropolitan Police Department, on the verge of death after being injured during a monster attack, contacted by a mysterious police officer force has given a chance to survive and fight the Kaijins on the same level, by the use of a new techlogocical powered suit, the C.A.T.s. suit.\nNow with new gained superhuman abilities, Kirika is ready to stand against the new menace as the new cat-shaped masked Allied of Justice.\nThe Flame of battle is lit."},{"name":" Natsukashi Machi no Rozione","avatar":"https://mangadex.org/covers/ca5c93c0-82a9-4003-a003-6de04301887b/8982b518-9e3c-4129-b431-b236fa18ef74.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,Drama,Fantasy"],"nutshell":"Intent on being an independent young woman, high schooler Himeyuka lives on her own in an unremarkable apartment complex in a corner of the city. But one day, she discovers her ordinary building has turned into something extraordinary! Her beloved castle is covered in childish scribbles - both inside and out! And waiting for her at the end of this rainbow-colored messis the perpetrator of the crime: a little boy named Rozione, who seems to know quite a bit about Himeyuka, though she has no idea who he is. Is he really just someone's lost child, or is there a greater mystery behind his appearance?"},{"name":" Junjou Mistake","avatar":"https://mangadex.org/covers/ca5ea5bd-e219-4f75-9160-1dbd49af555a/6ae2fa76-4469-4f8f-a559-30a89d47bcd4.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"Isaka is secretly in love with his caretaker and former childhood friend, Asahina. However, Asahina is obsessed with Isaka's father… or so it seems."},{"name":" DCD Diamond Cut Diamond","avatar":"https://mangadex.org/covers/ca6261ee-82c1-464f-b8b8-0f15c315f805/2cfdd602-731f-4f27-8d0b-df2a320e0bee.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Action,Romance,Comedy,Supernatural,Mystery"],"nutshell":"When he was young, Kurosu Keisuke was in a special TV program showcasing children with supernatural powers, called \"Esper Shounen\". Seven years after the termination of the program, a murderer appears to be targeting the Esper kids, whom he/she considers to be monsters. Will Keisuke and his old friends be able to discover the murderer and avoid becoming the next victims?!\nWikipedia"},{"name":" Long Live the King","avatar":"https://mangadex.org/covers/ca698df5-2de5-46a3-a171-8211d5bbcede/7903cf0a-a748-41cc-a4ec-dd093115555a.png.256.jpg","country":"Chinese (Simplified)","stat":"7.57","status":"Completed","tags":["Action,Romance,Comedy,Adventure,Video Games,Magic,Harem,Isekai,Fantasy"],"nutshell":"An ordinary student accidentally traveled into another universe and became the king of a small kingdom.\nHe had gotten a “Cheating Code” of life and was able to complete something extraordinary.\nThis is the story about a king that was able to conquer continents and leave behind him an ultimate legend that will be recited between every generation to come.\nThe MC also travels to the world of Diablo 2, but it seemed a bit too real to be just a video game. People in that world are living their life, death permeates. There are evil machinations at play here.\nTo find out why he was sent to this world, look as he unravels the secrets in the story."},{"name":" Zetsurin de Kedamono na Shinyuu ga Ore wo Dekiai Shiteita Nante Hajimete Shittaga","avatar":"https://mangadex.org/covers/ca6d0791-bca0-497b-af51-3b153825d4e5/d5892f9a-b738-40b9-9bda-75267f11eccb.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":[""],"nutshell":""},{"name":" SCATTER - Wish You Were Here","avatar":"https://mangadex.org/covers/ca7850f2-1c3e-424f-b840-1a61ced71efa/91661ab1-ea25-48ee-b93a-c69a0ca6cce3.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Psychological,Drama,Supernatural"],"nutshell":"From the author of The World is Mine.\nA young, unemployed, seemingly unmotivated young man is moving through his life. As a teenager, he and some of his friends formed a \"Boyz 4 Men\" club, which was based on a hatred of sex and women. As arguably the most opinionated member, his view of sexuality as an adult is far from normal. After a highly sexual encounter in a park at night, he has decided to attempt to draw perverted fetish manga. This brings him once again to the presence of a woman from the park, Sawada Kazumi. She's a manga editor and single mother with a perverted and intense personality of her own. What will happen when their worlds collide?"}]