[{"name":" Touhou - It's Possible! (Doujinshi)","avatar":"https://mangadex.org/covers/eed0c431-2ad6-4115-8397-c1923b5b1e41/bed9fcf2-e44e-45eb-ab64-ec661ef49856.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Comedy,Fantasy"],"nutshell":"Satori decides to check out the surface world just when am incident is gripping it. And due to the nature of this incident, Reimu is actually happy to see her and \"request\" her to become Hakurei Shrine's representative."},{"name":" Watashi ga Oneechan Nan Dakara ne!","avatar":"https://mangadex.org/covers/eed216e3-72b5-4e2f-9505-44b2340bdfb5/c927dbd1-622f-48b5-90c8-67b4b7ac0097.jpg.256.jpg","country":"Japanese","stat":"7.27","status":"Completed","tags":["Comedy,School Life,Slice of Life"],"nutshell":"Takatsuki Misora is a 15 year old high school freshman with one glaring problem: her height. She is extremely short and is often mistaken for an elementary student and her friends jokingly tease her for being so cute. Her self consciousness is further complicated because her younger sister, Kotori who is only 11 years old looks like she should be in high school or even older. Kotori loves her big sister and wants to play with her but Misora, as the older sister, is embarrassed with what looks like a reversal of roles in a sibling relationship."},{"name":" Diotima","avatar":"https://mangadex.org/covers/eed3cb6c-7440-4f34-9d86-388bcef3e717/2126d86a-db05-4fb5-bda7-35d101be3738.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Completed","tags":["Sci-Fi,Psychological,Romance,Comedy,Drama,Slice of Life,Tragedy"],"nutshell":"Diotima is set in 2092, far in the future. This manhwa is considered sci-fi for that. However, the manhwa's plot is \"life\". The episodes involve lives of captain Namer Joon and her crew onboard the space vessel, Diotima. The plot goes a little further and tries to convey conflicts between Earthians and Moon settlers. There are clearly some mysteries about Namer Joon, Diotima, and its creators."},{"name":" Penguin Highway","avatar":"https://mangadex.org/covers/eed41ada-6f8e-4ff9-978a-d94bb3e64066/a2e9a866-7290-40a1-b930-856b8631af85.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Animals,Romance,School Life,Supernatural,Mystery,Adaptation,Tragedy"],"nutshell":""},{"name":" Interview With a Murder","avatar":"https://mangadex.org/covers/eed85a4f-1db9-4161-aaed-f4691ee5f826/c5b2d136-6cde-411b-ab7a-51fc6bb6a20c.jpg.256.jpg","country":"Korean","stat":"8.13","status":"Completed","tags":["Psychological,Long Strip,Boys' Love,Crime,Drama,Horror,Web Comic,Mystery,Full Color"],"nutshell":"As a reporter, Clark has interviewed many criminals but never a murderer. Enter Alex, the Triage Killer. A serial killer who kills in three, he agrees to an interview so long as Clark offers one thing in return: himself. Murder after murder, question after question, Clark will learn why Alex kills. And Alex…he will learn Clark isn’t as innocent as he seems."},{"name":" Triangle Blood","avatar":"https://mangadex.org/covers/eedbad21-7143-4931-adee-6d8323f1f706/980ed4cd-3d23-43d2-a9bb-42828ca58911.png.256.jpg","country":"Korean","stat":"7.98","status":"Completed","tags":["Official Colored,Action,Demons,Long Strip,Romance,Military,School Life,Fantasy,Web Comic,Full Color"],"nutshell":"'Won', the guardian angel, is sealed in the body of 'Hana' for the crime of saving 'Hana', an ordinary girl who was destined to die after breaking the will of heaven... The dark beings are aiming for the power of the guardian angel sealed by Hana and begin to stretch out their demonic beasts!"},{"name":" High School Bold Legend - Performance Iwajiro","avatar":"https://mangadex.org/covers/eedc644f-f9c0-4215-9dca-7cda6f23c7a0/0394b197-c338-454f-b62f-f529b0d54dca.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Psychological,Romance,Comedy,Philosophical,Drama,School Life,Delinquents,Slice of Life"],"nutshell":"(from ebookjapan):\nIwajiro is an out-of-control high school student. He rides around on his moped and ponders the meaning of youth, but when he sees a woman, he repeatedly asks her, \"Let me do you.\" He is unable to lose his virginity and struggles with his power. What kind of performance does Iwajiro give?"},{"name":" Lipstick Combat","avatar":"https://mangadex.org/covers/eee234f9-6f50-4957-baac-c65ac6fc49b8/4d9ab2dd-e8bb-4952-ad04-9f720a7ab520.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Action,Romance,Crime,Drama"],"nutshell":"Action-drama about two multimillionaire highschool girls who use their wit (& money) to sort out all the trouble they encounter."},{"name":" Wan Gu Shen Wang","avatar":"https://mangadex.org/covers/eee5d348-9a2a-4797-9824-380909a2b88c/1c5d3b02-d3d1-470e-8899-6c0432ff5fda.jpg.256.jpg","country":"Chinese (Simplified)","stat":"6.99","status":"Ongoing","tags":["Reincarnation,Monsters,Action,Long Strip,Martial Arts,Fantasy,Web Comic,Full Color"],"nutshell":"The past life died because of the imperial concubine, and he was born again in the high school era. It coincides with the recovery of the aura and the great changes in the world. When rejuvenating a teenager, he will follow the path of his journey, and he will protect his own friends. Loved ones. When he does not choose to stay, he will push him all the way."},{"name":" Boku no Idol","avatar":"https://mangadex.org/covers/eee5dcec-edf9-454e-a683-1fe6e6519d80/72c92a18-d70b-4f1a-8db0-273c3dcf7653.jpg.256.jpg","country":"Japanese","stat":"7.64","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life"],"nutshell":"This year, the student council has decided to add an exciting new contribution to the school's culture festival; an Idol performance! However, they don't actually have the money to hire any real Idols, so someone's going to have to train up an idol group from their female classmates. Hirano Harufumi is that unlucky someone. He has no interest in Idols at all, but he must put together a performance or risk expulsion from the school for his failure.\nNot surprisingly, most high school girls are too embarrassed and self-conscious to dance and sing in front of their classmates in a skimpy outfit. When Harufumi tries to think about who he would like to see as an Idol, his thoughts are drawn to his cute, shy, clumsy childhood friend Aizawa Momoka. Will Harufumi be able to convince her to be an Idol before it's too late?"},{"name":" Sword Art Online - Pina Edition (Doujinshi)","avatar":"https://mangadex.org/covers/eee91093-c46a-455f-904c-b9c2a34edab2/eb3b2626-7a90-42ad-8014-2411978ca209.jpg.256.jpg","country":"Japanese","stat":"7.42","status":"Completed","tags":["Oneshot,Comedy,Fantasy"],"nutshell":"A doujinshi co-authored by Kawahara Reki, under the pen-name of Kunori Fumio, and Kurusu Tatsuya on Sword Art Online.\nNote: Part 4koma/novel doujinshi. Novel (not included) by Kawahara Reki, 4koma by Kurusu Tatsuya."},{"name":" Major: Yuujou no Ikkyuu","avatar":"https://mangadex.org/covers/eeef92e9-dda5-4a20-a010-483a3637c0f0/973b7a64-237f-4153-8665-0865f614b31d.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Sports"],"nutshell":"After losing his father, Goro must face the new life that awaits him along with his adoptive mother, Momoko, who decides to marry the star of the Marine Stars, Hideki Shigeno, and move to Fukuoka. During the three years that Goro lives in Fukuoka, he continues playing baseball, until his shoulder, at the limit, is fractured. This special tells us a small period within these three years that could be placed between volumes 13 and 14, a story just mentioned above in the original manga."},{"name":" Wakusei Sanpo","avatar":"https://mangadex.org/covers/eef5bd90-2bc6-46f0-a3ac-161338b93319/25e810e7-e279-4616-8041-221538e36274.png.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Sci-Fi"],"nutshell":""},{"name":" Aura from Another Planet","avatar":"https://mangadex.org/covers/eeff0856-5ad2-40d8-aa50-4016e061c265/f630c5e8-d991-44d1-a94f-86edf3d7b61e.png.256.jpg","country":"Korean","stat":"8.08","status":"Completed","tags":["Sci-Fi,Action,Long Strip,Comedy,Drama,School Life,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Aura is a certified buff spell caster from Planet Leviathan that came to earth by a portal accident. She attends school on earth as a way of adapting, and never fails to find friends, old alien frenemies, and troubles with her buff spells."},{"name":" Ge's Spirit Weapon","avatar":"https://mangadex.org/covers/eeff587a-8142-4816-9e07-5d299b5cf00f/2847a1f6-dadf-4b4f-8451-fda598b2dea3.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.92","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Martial Arts,Adventure,Wuxia,Isekai,Drama,Supernatural,Mystery,Adaptation,Full Color"],"nutshell":"Based on the novel of the same name (Completed at 167 chapters) by Shui Qian Cheng (水千丞), and from the team that brought you \"The King's Avatar\", comes a fantastical adventure story about the twelve ancient sacred beasts.\nWhy is it that others get to enjoy all the glory, wealth and love when they travel to another world, while he's wanted as a criminal throughout the new world? Even the supposed \"sacred beast\" he summoned to protect himself is just a damn brat that's incredibly rude.. Jiang Chao Ge now just wants to return home from this blasted trip to another world!\n[Side note: 戈 is part of the MC's name, which means Dagger-axe; it's also homophone with song 歌, so the title can also be interpreted as \"A Song of Spirit Weapon\"]"},{"name":" Ai to Yokubou wa Gakuen de","avatar":"https://mangadex.org/covers/ef039bfe-e889-4f2e-8869-2cf90852e965/70821235-d75c-4a0d-a85f-2c51cd718d35.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Comedy,Boys' Love,Drama,School Life"],"nutshell":"Because the way people have a high interest in \"sex,\" a sex school was formed in order to fulfill the students' desires and help them become more advanced in their skills. Ion, in order to help pay off the debts in his family, has enrolled in the school, hoping to gain knowledge and sell out his body in the future to gain money. But Ion gains more than just \"knowledge\" in the sex industry, and he starts to fall for his Instructor Asagi… but love is strictly banned from the school…"},{"name":" Mimiyori Harmonia","avatar":"https://mangadex.org/covers/ef04c9f8-9b50-4b24-88a4-d00d1623ccc0/cbe4f792-de0b-4997-8ba4-10c96fab5f7e.jpg.256.jpg","country":"Japanese","stat":"7.53","status":"Completed","tags":["Comedy,Girls' Love,School Life,Slice of Life"],"nutshell":"\"Headphone,\" Japan world class audio item. Nene-chan the girl had came across headphones by a chance. From here on she start her road to become a headphone maniac."},{"name":" MofuMofu","avatar":"https://mangadex.org/covers/ef0869fe-1291-4e51-85b1-fe52e24ddb23/74cc837f-d0cf-4e30-af0f-3944a6a77c12.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy"],"nutshell":"What is… \"MofuMofu?\" The daily life of MofuMofu by the genius mangaka Yahagi Hayato"},{"name":" Poltergeist","avatar":"https://mangadex.org/covers/ef09c916-6924-4241-9185-5315e8168ab8/191e1141-c40e-4a17-b83e-77f69063490b.jpg.256.jpg","country":"French","stat":"7.97","status":"Ongoing","tags":["Oneshot,Action,Comedy"],"nutshell":"A boy,whose father abandoned before he was two years old,achieves leading a normal life with his mother until 15 years later: the day before his 17th birthday. He starts having strange nightmares…"},{"name":" Ellie Golden to Itazura na Tenkan - Busu de Debu demo Ikemen Elite","avatar":"https://mangadex.org/covers/ef0a18a8-c6c6-4bcf-a065-414e4dec6a7e/f3848016-f28d-4670-9237-31c68b269411.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Reincarnation,Genderswap,Comedy,Isekai,School Life,Fantasy,Adaptation"],"nutshell":"Web Novel Raw\nAuthor's Twitter"},{"name":" Strike Witches - The Witches of Andorra","avatar":"https://mangadex.org/covers/ef0dd925-3d30-4fdb-b9a0-ab49123c1f1c/8cc7082f-349e-4e03-bc86-462e40f2d6e0.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Sci-Fi,Action,Anthology,Military,Fantasy"],"nutshell":"An anthology of short stories by Nogami Takeshi in the Strike Witches universe, some new as well as a retelling of older chapters. The volume includes:\n-\"The Witch of Andorra\", the story of Iris Monfort and her friend Maria, told by Keiko.\n-\"The Witch of Stuka\", the story of Friederike Porsche and Michael Schmitt, told by Marseille.\n-\"The Witches of Eiger\", a story about explorers on Mount Eiger rescued by Britannian witches, told by Miles.\n-\"Sengoku Witch\", the story of Mori Ranmaru and Nobunaga, told by Mami.\n-\"Shopping at the market\", a retelling of 'The Witches of the Sphinx Vol.2' events showing different parts of the combat with new illustrations.\n(*paraphrased from World Witches Series wiki)"},{"name":" Meng Wu and Chu Zi","avatar":"https://mangadex.org/covers/ef0f5191-c1ec-4b06-a063-d19708a4a50f/59166a34-ec67-44c0-a89a-89b21731ff33.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot,Historical,Action,Drama,Tragedy"],"nutshell":"A one shot situated in ancient china, around the Spring and Autumn period. Two childhood friends meet on the battlefield, reminiscing their past before the final battle.\nWARNING: Contains spoilers to the main story of Kingdom"},{"name":" 9 - Kimi ga Iru Machi de Koi o Shita","avatar":"https://mangadex.org/covers/ef12b9bc-85b7-4924-91f8-cd4c07351682/492814f5-ebf8-4d5b-852b-6213cc28e360.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Comedy,Sports,Drama,School Life"],"nutshell":"Kouki was the ace of the baseball club. But for some reason, he became unable to play and then return to his hometown. Over there he'll meet his destiny and love…"},{"name":" Captain Tsubasa World Youth","avatar":"https://mangadex.org/covers/ef13b636-2a2b-4213-9ed7-c748b158ed5f/c984ecd5-0775-4be4-ac68-9aa4efe39920.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Sports,Drama"],"nutshell":"Tsubasa and his teammates want to win the World Youth, the under-20 world cup. They discover new talented teammates, but also new rivals in Asia and in the rest of the world, and this time, Brazil will be here…"},{"name":" Kemono no Noroi wa Koi de Hodoku","avatar":"https://mangadex.org/covers/ef144daa-2db0-4160-93ac-17dee70eec85/fa2fb0cf-dda3-49be-9399-38789d5909d1.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Boys' Love,Fantasy"],"nutshell":"Wizard Iori and Werewolf Hanao. In order to find a solution to break the curse that transforms beasts during a full moon, the two have lived together for 10 years. Eventually, they found the link between transformation and sexual desire.\nIori teaches the inexperienced Hanao how to relieve himself, demonstrating the solution to curbing the transformation. But after what happened, Hanao is starting to developing serious feelings for Iori.\nAfter noticing these feelings, Iori casts upon Hanao a magic that erases these romantic feelings–\n“If you are to live in the human world, you cannot have relations with a non-human like me.”"},{"name":" Ai ga Omoi Kishi Koushaku wa, Tsuihou Reijou no Subete wo Ubai Tsukushitai","avatar":"https://mangadex.org/covers/ef1484bb-3984-496f-9e23-ac1bd4ed034c/46f7c66e-cb95-4eaf-a396-c19b73525020.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Romance,Magic,Fantasy"],"nutshell":""},{"name":" Juuza no Ulna","avatar":"https://mangadex.org/covers/ef1d242f-964f-429e-9ddc-9f0f485f8ab9/7086a783-19ee-41da-9481-926a169b5691.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Award Winning,Action,Military,Drama"],"nutshell":"Ulna Trop Jonk is a sniper who assumes her first military job on the front line of a remote island.\nThere, the soldiers must fight against a wild village of monstrous aspect.\n\nWon the 21st Japan Media Arts Festival Excellence Award's Manga Division in 2018\nNominated to 24th Tezuka Osamu Cultural Award"},{"name":" Dirt-Poor High-School Girl and the Gentlemanly Monster","avatar":"https://mangadex.org/covers/ef229b9c-25c2-4931-9c22-f6e89a6389e3/2122e74a-e9d7-4e5c-953b-acdd81227253.png.256.jpg","country":"Japanese","stat":"8.13","status":"Ongoing","tags":["Comedy,4-Koma,Slice of Life,Supernatural"],"nutshell":"Shino was a dirt-poor, female high school student. For the sake of money, bring on the suspicious, live-in part-time job where \"interviews aren't needed, and you can be hired right away as soon as you send your resumé\"!!!\nHowever, when she went to the residence for the first time, her employer was a cyclops–?!\nThe monster x human life with a master who gets way too heated in his love of humans and a female high school student who was so poor she tried eating the weeds in the garden!"},{"name":" Another Face","avatar":"https://mangadex.org/covers/ef24722c-0a90-4623-8eb8-715badcb0a8c/90271b9e-7af2-4bec-b257-a19e7289dc98.png.256.jpg","country":"Japanese","stat":"7.64","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life,Delinquents"],"nutshell":"Hiding his unrequited love for his childhood friend, who is a beautiful girl on the outside but gorilla-like brute on the inside, our main character lives his life torn on how to approach her, leading him to develop two sides as well?!\nJoin our two clueless love-birds in this high tension romance comedy!"},{"name":" Princess Army","avatar":"https://mangadex.org/covers/ef24ac2a-b28e-4f51-a219-ab8478defe33/cafa5994-4aaf-4d9e-bfd1-f080221b5f38.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Romance,Sports,School Life"],"nutshell":"Once upon a time, there was a little girl. One day she played a trick on a drunk and made him angry. The drunk was going to hurt her, until a boy appeared and saved her. It's been eleven years since that incident, but Nonoka is still looking for the \"prince\" who saved her.\nThis manga's got a love triangle and lots of judo!"},{"name":" Dokkouren","avatar":"https://mangadex.org/covers/ef256982-aeba-4076-8899-e51d79d971a0/2582b564-52db-4484-9fc1-6d3d682af172.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Action,Survival,Sports,Martial Arts,Adventure,Drama,School Life,Slice of Life,Tragedy"],"nutshell":"Suddenly, Kyouhei's father hands him an unusual-looking school uniform and orders him to enter a certain high school. Just what strange fate will this decision bring? Get ready for a hot-blooded school life action extravaganza!"},{"name":" Akai Me o Shita Shounen wa","avatar":"https://mangadex.org/covers/ef2750ca-c3ce-464c-a73b-8d6a928c6ddb/6c9624e2-8b5f-4b27-bcfa-2dc470af2519.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Boys' Love,Slice of Life"],"nutshell":"When his friend's younger brother, Ryou, cried and confessed to Yoshiyuki, Yoshiyuki accepted his confession. However, he always drew a line between them because Ryou was still a high schooler. As Ryou's love grew and became more passionate, Yoshiyuki ended up kissing him. Will their love advance to the next level soon?"}]