[{"name":" Imawabi no Dakini","avatar":"https://mangadex.org/covers/a56698e8-b6c4-4e3c-9303-4c172465dd4d/dbebd8bc-089f-4120-8028-725595e68106.jpg.256.jpg","country":"Japanese","stat":"7.67","status":"Completed","tags":["Monsters,Action,Romance,Martial Arts,Magic,Drama,School Life,Horror,Fantasy,Monster Girls,Supernatural"],"nutshell":"Fushimi and Toume were just a normal boy and girl going to high school until one day they stumble upon a phantasmal mountain known to legend as \"Mount Hagure\" . Before either of them knew it, Toume was possessed by a Yoko named Dakini, a goddess who grants wishes.\nWhen asking what Fushimi's wish is, it is only this: Give Toume back. Dakini says she can grant the wish but in return he must become her servant. The deal is struck. Fushimi has now become Dakini's servant and Toume has been returned. Darkness, however, is afoot and now Fushimi must take on a more active role as Dakini's servant. Is he up for the task?!\n(From: MU)\n\nLinks:\n\nAuthor's Twitter\nAuthor's Pixiv"},{"name":" Daikirai!! Demo Honto wa ne...","avatar":"https://mangadex.org/covers/a568e2ce-4e05-43cf-a261-a98101dc6234/beb3746e-637d-4e02-b796-3628796a90f2.png.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Romance,Boys' Love,School Life"],"nutshell":"Kohashi Juri, a guy with a beautiful face, always gets irritated if someone calls out his girly name. But he is infuriated when Kouta, who is famous with the girls, started calling his name \"Juri Juri\" passionately everyday. Juri once thought \"He's the opposite type of mine\" but when Kouta said to him \"Let's touch each other, this thing'll be our secret\", he did something he shouldn't have done with Kouta…!?"},{"name":" Strange Babies","avatar":"https://mangadex.org/covers/a572220c-c356-4ec8-97fc-7912d20e12e2/bdd1c80c-0ad5-447c-a3cc-ee20e852db47.jpg.256.jpg","country":"Japanese","stat":"7.44","status":"Completed","tags":["Comedy,Girls' Love,Drama,School Life"],"nutshell":"Sequel to Black Goat and the Powerful Drug Madeleine."},{"name":" Izakaya Bottakuri","avatar":"https://mangadex.org/covers/a57235a9-2e1a-4afe-9720-bb7f60cb109d/ad19e511-9181-418f-9e32-5973875e4e75.jpg.256.jpg","country":"Japanese","stat":"8.35","status":"Ongoing","tags":["Slice of Life,Cooking,Adaptation"],"nutshell":"Bottakuri, a bar in the deserted downtown of Tokyo. In the special shop which doesn't match its name, you'll get tasty cuisine and liquor. Also, there are times when you'll find social obligations. Portraying delicious things and interactions of people, this super popular short series novel crossed the 980,000 mark, its comicalization is long awaited!"},{"name":" Boy Meets Girl","avatar":"https://mangadex.org/covers/a5734db2-c938-47f0-9074-cce7963de488/a53b1b70-485b-4ba0-9cfd-c899b4bbde69.jpg.256.jpg","country":"Korean","stat":"7.62","status":"Ongoing","tags":["Genderswap,Psychological,Long Strip,Romance,Boys' Love,Drama,Web Comic,Full Color"],"nutshell":"Lee Cheo-Hoo is obsessed with his first love, Jin Tae, in high school. And after hearing his statement, Jin Tae decides to put a stop to it, telling him that the only way he can think of dating him would be the day he becomes a woman. Years later, at a party, Lee Cheo-Hoo gives him a drug that will change his life.\n\n\nWebtoon Trailer"},{"name":" Frankenstein Syndrome Girl","avatar":"https://mangadex.org/covers/a57bed4c-3c52-46d3-9085-78531eef4b9b/8cd1140b-8f14-493c-9648-a5929557d23e.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Romance,Comedy,Drama,School Life,Horror,Slice of Life,Music,Tragedy"],"nutshell":"(from ebookjapan):\nA high school girl, Enue Dei, auditions as a jazz dancer and is liked by the judge, Johnny Kawahara, because of her strong physical strength, which allows her to dance hard without breaking a sweat. Later, after passing the qualifying round, Enue and her boyfriend Dai are involved in a car accident during a road trip, but Enue quickly recovers completely with her amazing resilience. Enue then becomes curious about the term \"genetic modification,\" which her father had mentioned on the phone ......!"},{"name":" Ni Mo Kakawarazu","avatar":"https://mangadex.org/covers/a57fd8a5-0a21-4272-8731-93d0a85bc9a7/8093528a-3c12-42ac-9bf3-f4887a36762a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Romance,Adventure,Drama,School Life"],"nutshell":"Story of Kiyo, a 20-year-old \"yankee\" tomboy, and what happens when she once again meets Tara-chan, her kind former step brother.\n(Source: MAL)"},{"name":" Kitsuen-sha ga isekai ni tensei shita manga","avatar":"https://mangadex.org/covers/a58daeff-1945-47d3-a079-b8a15928d969/5964a9ee-b23f-4f7b-a856-66b6b1b51b84.jpg.256.jpg","country":"Japanese","stat":"7.33","status":"Completed","tags":["Oneshot,Reincarnation,Action,Romance,Comedy,Isekai,Medical,Horror,Monster Girls,Tragedy"],"nutshell":"An ordinary salaryman gets sent to another world. He’s totally ready to enjoy a slow life there, until…"},{"name":" Ookami-kun to Cinderella","avatar":"https://mangadex.org/covers/a58df1b1-1487-44ca-bc6a-5c06b97e8005/577cfc56-0fad-4461-8e7b-a96324db1652.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Oneshot,Genderswap,Romance,Comedy,Supernatural"],"nutshell":"Fujinomiya Satoru is a pretty girl from Tokyo, transferring to a countryside middle school. There, she catches the attention of a boy named Okami Hayato who develops a crush on her. But little does Okami know that the real reason why Satoru transferred is because there is an old curse on her she's trying to break.  (From: MAL)"},{"name":" Kurama no Hiramek","avatar":"https://mangadex.org/covers/a590bb93-202d-408d-8e73-4a1668f39f88/54351c73-b4d3-4bd6-892e-cdb067ccc659.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot"],"nutshell":"The forth entry in the 2015 Golden Future Cup"},{"name":" Shingeki no Kyojin - Yandere no Heichou ni Shinu hodo Aisarete Yoru mo Nemurenai!! (Doujinshi)","avatar":"https://mangadex.org/covers/a594c62d-8b55-4dc3-b8c5-f75ec32b04dc/ca035b42-ee84-487b-b5ee-81582916e3c0.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Pairing: Eren x Levi"},{"name":" The Remarriage Contract","avatar":"https://mangadex.org/covers/a59c26de-6b1b-4f5e-a784-7aac0238d1e7/1fec89a5-7934-46ad-a1ba-6dcc9262f399.jpg.256.jpg","country":"Korean","stat":"8.13","status":"Ongoing","tags":["Long Strip,Romance,Office Workers,Drama,Web Comic,Adaptation,Full Color"],"nutshell":"Gun-ha and So-yeon were strongly attracted to each other, but because they lived completely different lives their marriage ended short and eventually they chose to divorce.\nFive years later, Gun-ha proposes to Seo-yeon again to be a ‘contract couple’.\n“Please marry me again. This time, we stay as an ordinary couple.”\n\n\nOfficial Indonesian Translation"},{"name":" Dr. wa Ijiwaru na Kiss de","avatar":"https://mangadex.org/covers/a5a020f7-c566-402f-b316-3241395114bc/914f1933-6186-4ab3-82ad-ed6e939441b8.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance"],"nutshell":"Four oneshot stories with some focus on hot doctors. There's a Dr S (sadist?). And then there's a Dr G (gay?). Hokusan Graduate Medical School boasts of ikemen* young doctors toiling away day and night despite the whacky nicknames they've gained. Read along as their beautiful love stories unfold.\n*ikemen = good-looking/attractive"},{"name":" The Game of Survival","avatar":"https://mangadex.org/covers/a5aea313-ce3b-47f7-b9ef-8d269f4479ae/ac5554f5-e796-4c71-af44-3d11a8581a33.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.03","status":"Ongoing","tags":["Long Strip,Romance,Reverse Harem,Isekai,Drama,Fantasy,Villainess,Full Color"],"nutshell":"Yu Luna, a modern social animal suspected of sudden death from excessive overtime, was lucky enough to get a chance to return to reality, but only if she succeeds to capture all the male protagonists in a Western fantasy-themed Otome game.\nIf you have the aura of a heroine, even if you haven't played Otome games much, it should be okay, right?\nBut how could that I have crossed to be the good-for-nothing daughter who often bullies the heroine in the game!"},{"name":" Population Zero","avatar":"https://mangadex.org/covers/a5aea31f-dd0f-455f-be75-a0816eccb532/427cdb12-9ad8-4af9-ba32-7784b75793ea.jpg.256.jpg","country":"Indonesian","stat":"7.97","status":"Hiatus","tags":["Action,Long Strip,Survival,Zombies,Adventure,Horror,Web Comic,Full Color"],"nutshell":"In a post-apocalyptic Indonesia, the human population became immensely depleted. Elias is a young man who formed a group together with other survivors to fight off zombies. On top of that, they must fight an enigmatic being that created more mysteries to uncover\nNote: The original serialization on re:ON Comics version is not a long strip comic.\nInternational release is an edited version."},{"name":" Kimi to Tokei to Uso no Tou","avatar":"https://mangadex.org/covers/a5bf128d-16b4-4e7a-90d1-7186d25a27cb/5701e561-c613-4dfd-a6d4-4f3fe6a3d7aa.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Drama,Supernatural,Mystery,Adaptation"],"nutshell":"From the morning I saw that nightmare, everything began. High school sophmore Kijou Souchi is struggling to search for his friend who has been absent from school for days. What kind of mystery lies behind this?"},{"name":" Shuuen:Parallel - Shuuen no Shiori Koushiki Anthology","avatar":"https://mangadex.org/covers/a5c099c2-8e24-44e7-91d3-0d7b050d2dba/7d64877c-acf1-45d4-9c41-414a196b7446.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,Anthology,School Life,Horror,Supernatural,Mystery"],"nutshell":"An anthology of Shuuen no Shiori by various mangaka."},{"name":" Takuhai Cupid","avatar":"https://mangadex.org/covers/a5c8a7fe-badd-45ad-9591-ec1de6557d00/a37f7a7c-9741-4424-95e2-e8addbe84e32.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Anthology,Boys' Love,Fantasy"],"nutshell":"Story 1: Delivery Cupid (Takuhai Cupid)\nDelivery Cupid is a collection of six short stories. The title story is a romantic comedy about Tsubasa, who is half-human and half-cupid. In order to become a full cupid, he must successfully unite a couple. However, the target is an evil man named Norimasa who shows no love for anyone. When Tsubasa accidentally ends up as Norimasa's match, the trouble begins. Are Tsubasa and Norimasa attracted because of cupid magic, or is it true love?\nStory 4: Forever With You\nStory 5: Ice Cream\nStory 6: Under The Big Night Sky (Ookii na Yozora no Naka de)\nRyou is in trouble because he is fired from his part-time job, from the famous La Fee restaurant. What does he to do? He ends up meeting a homeless guy? What? Who is this homeless guy anyway?"},{"name":" Peach Love","avatar":"https://mangadex.org/covers/a5c919ac-a8c5-466c-9738-10fa801f1f93/7574239f-f519-4557-a7bc-753c4831be41.jpg.256.jpg","country":"Korean","stat":"8.06","status":"Completed","tags":["Action,Long Strip,Boys' Love,School Life,Delinquents"],"nutshell":"Mae High School’s number one, Peach, ends up falling for the wooden doll carving innocent boy Love! However, Peach is the man who stands at the summit of a bloody world where only the fittest may survive. From his conclusion that there will be a limit to protecting Love, Peach makes a reckless plan of making Peach the number one… A manhwa with action and zeal as good as shounen, and with love between diverse wacky teenage boys is beginning!"},{"name":" Rebirth of Legendary Doctor","avatar":"https://mangadex.org/covers/a5ca50c2-2620-42b2-9fc1-48c25b54a74e/0a9f2e06-0d3b-49a2-9ae8-8c92a180f3b8.png.256.jpg","country":"Chinese (Simplified)","stat":"7.47","status":"Ongoing","tags":["Reincarnation,Action,Medical,Full Color"],"nutshell":"Because of the making a mistake in the capturing soul operation, doctor Xing Aofei was banged by a car and died, but he got a chance to be reborn because of the accident. Unfortunately, once again, Xing Aofei is destined to only be a doctor, and he is also included with the so-called Wrap You Up to the Human’s Pinnacle of Life System’s various pits? The road of Xing Aofei ’s rebirth, is destined to be a sad path……"},{"name":" Mado no Mukougawa","avatar":"https://mangadex.org/covers/a5cda876-502c-406e-93f2-0125a768d8cc/845d6d01-12ab-42b3-b42f-834d777bd6e4.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Comedy,Drama,School Life,Slice of Life,Supernatural"],"nutshell":"Kei Sonofuji is trying to get a new start by changing her image before getting into high school. But just as it seems everything is going to go well, she gets sick and has to miss the first week. Just as she thinks she's missed out on everything, she gets a surprise from one of her classmates!\nKirara Carino, the magazine it was serialized in was cancelled, and it is unlikely to return."},{"name":" Kyuuki no Adabana","avatar":"https://mangadex.org/covers/a5cdfc61-43b0-4f87-b387-01e0949e2449/0e3d706a-a49c-47ff-9a05-0d7879e6a38d.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Action,Fantasy,Supernatural"],"nutshell":"Tamaki Haru moved to a rural town with a Binbogami Shrine. He has the ability to see kami and spirits, and one day, he ran into a girl named Kazura when she fell off an electric pole. She claimed to be a kami herself, and that she was being chased by something. Tamaki was still confused when they were suddenly attacked by a mysterious monster. Set in Takamagahara, known as the home of the gods, this is the start of an action-packed tale of Japanese mythology!"},{"name":" Azusa Yumi","avatar":"https://mangadex.org/covers/a5cfebe8-511e-48f3-a71c-c497ecf77126/64b8988a-7d03-437c-a8a7-63076fc4406d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance"],"nutshell":""},{"name":" End of Arcadia","avatar":"https://mangadex.org/covers/a5d4089a-8039-40f2-b111-9ea5bbecd033/feec1b0c-fe59-498d-b7b5-330c8cbc5cab.png.256.jpg","country":"Japanese","stat":"7.90","status":"Ongoing","tags":["Sci-Fi,Action,Psychological,Military,Drama"],"nutshell":"Due to advancement in clone technology, mankind had finally obtained eternal life.\nArcadia, the ultimate life regeneration system. Through it, the frail mortal human received salvation from absolute death… Or so it was meant to be.\nFor some reason, the implantation of memories into duplicated bodies were only successful in the case of teenagers.\nWith the onset of war, this defect meant the deployment of these undying children to the frontlines.\nIchinose Akito was one of them, a second lieutenant in the United States of Elmea Army. As penalty for his militaristic underperformance, the platoon he led was ordered to undertake a salvage operation for top secret information with a survival rate of virtually zero.\nIn the midst of a sudden enemy encounter, Akito covered his teammates from a crustal collapse and found himself face-to-face with his arch-enemy: Philia Loadrain of the Lorelia Federation. To make things worse, they were cut off from the surface and the ability to respawn.\nThe two of them with opposing personalities and skillsets must put aside their differences as they make their way up the surface—."},{"name":" Lian Ai Makeup!","avatar":"https://mangadex.org/covers/a5d7a72d-f7db-4c5b-ac90-7245073d385c/eb4e6f9e-063a-4af6-95e6-b3be7f12b9b3.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.91","status":"Ongoing","tags":["Romance,School Life"],"nutshell":"Xiao Mei is a normal high school girl whose hobbies are reading and drawing manga. To encourage her because of her failed love confession, Xiao Zhu gave her a makeover. However, after the photography club's president took pictures of her and published them in the school magazine 'CLOVER', she becomes the 'MYSTERY BEAUTY' the whole school's looking for!\nIncludes a 80 page extra."},{"name":" Shinsetsu Ookami to Koushinryou: Ookami to Youhishi","avatar":"https://mangadex.org/covers/a5d7f06b-740e-4901-a3a5-700104c7972f/d3b2f604-0627-4d60-9f5a-f4df77b40db3.jpg.256.jpg","country":"Japanese","stat":"8.36","status":"Ongoing","tags":["Romance,Comedy,Adventure,Drama,Slice of Life,Supernatural"],"nutshell":"Once upon a time, Tote Col, a wandering student of barely ten years, was saved by a traveling merchant and a wisewolf. Their journey ended fifteen years ago, but Col's is just beginning. The priest hopeful, accompanied by his wolf sister, Myuri, sets out with an ambitious plan in mind-to translate the sacred scriptures into the common tongue with the help of the kingdom of Winfiel and the Debau Company. But the Our Bookof God project challenges the authority of the all powerful Church...! [Yen Press]"},{"name":" Chekera!","avatar":"https://mangadex.org/covers/a5da08f4-344e-4250-8cec-9f7c99dc59b8/a498d9bc-b3d9-4d53-a7b2-3026acb383f8.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"Aika is an ordinary high school girl. She likes memories and photography. Those things involve her in an unexpected incident.\nA tough guy at school wrecks the lens of her camera and she demands that he fix it. They end up skipping school for the day and…"},{"name":" Kuro Bara Alice D.C. al fine","avatar":"https://mangadex.org/covers/a5e13d23-74a3-40c0-9be4-97e11083c34d/cc73f9f7-7169-463b-8145-28ab82193dbd.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Ongoing","tags":["Romance,Drama,Horror,Vampires,Supernatural"],"nutshell":"Sequel of Kuro Bara Alice."},{"name":" Oingo Boingo Brothers Adventure (Fan Colored)","avatar":"https://mangadex.org/covers/a5e82ab3-4a85-442d-bf64-c37e9de1602a/2f399f89-5c3f-4c3e-9256-62a1447b14fe.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Action,Comedy,Fan Colored,Adventure,Fantasy,Supernatural"],"nutshell":"Thoth, the stand of Boingo from Stardust Crusaders, is reprinted in a special volume. Many blank pages fill the end, as Boingo’s story was unfinished. Rohan Kishibe also gives criticism in discovery of strange objects and stands, and the manga itself. Fan-colored."},{"name":" Elite Douryou wa Sugoude no Ikase Yadeshita","avatar":"https://mangadex.org/covers/a5eddc31-8d60-46d7-8261-b3e33f26dcb2/1b88ddde-8647-44bc-936e-1fcd81139360.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance"],"nutshell":""},{"name":" Pikari-chan wa Nakanaka Shinanai!","avatar":"https://mangadex.org/covers/a5ef3d2f-79c8-44d5-815d-75a2eb22ae73/dcfd3a3c-d88f-4b7c-9c21-c2af0757c1c5.jpg.256.jpg","country":"Japanese","stat":"7.63","status":"Completed","tags":["Comedy,School Life,Supernatural"],"nutshell":"Naruto Shiohito, a cook at a not really well known and not that great ramen shop has his day shaken up by a cockroach…that's transformed into a cockroach girl!"},{"name":" Alice Royale","avatar":"https://mangadex.org/covers/a5f1e36e-3041-45d1-a38e-1840513a33fc/55aef4f6-7a12-4d42-b9e3-9b9e74a0831c.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Comedy,Adventure,Crossdressing,Fantasy"],"nutshell":"The story focuses on the world of Alice Grounds where it is said that the person who has the brilliance of Alice Royal conquer all.\nThe great thief of the continent Rizel Raffles appears in the wedding ceremony of King of Swords to steal the ring Princess Viola where he is forced to escape on his second attempt and after several events, the King of Swords and Princess Viola will propose to Rizel be part of the \"Numbers\"?"}]