[{"name":" Lovely and Cute (Doujinshi)","avatar":"https://mangadex.org/covers/2c61779c-62c7-4f15-a1da-532c06c58e80/523b3206-adf4-4229-a00e-4d9ebf39f05d.jpg.256.jpg","country":"Japanese","stat":"7.56","status":"Completed","tags":["Oneshot,Girls' Love,School Life"],"nutshell":"Ship: You x Riko"},{"name":" Haikyuu!! - The Lips' Secret (Doujinshi)","avatar":"https://mangadex.org/covers/2c6e0687-8fbd-41ad-9ed2-74a9c76be79a/95c5899f-7d96-44dd-b9a0-36040f27e21a.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Oneshot,Romance,Boys' Love,Sports,School Life,Slice of Life"],"nutshell":""},{"name":" Knot","avatar":"https://mangadex.org/covers/2c6e4395-77fc-4a79-b7ee-fa7ec8a54ff2/476d09a8-13c0-4ae8-bf42-d5d1f45fc3f3.png.256.jpg","country":"Japanese","stat":"7.64","status":"Completed","tags":["Psychological,Romance,Boys' Love,Drama,School Life"],"nutshell":"It was in the spring of the third year of junior high when Shizuka Morimoto and Tou Oowada first met again. They met again with bitter memories of their middle school days.The two were separated again after graduating from junior high without mending their relationship. But they met again for the second time in the summer of their second year of high school. Even if it was awkward this time, the distance between the two gradually became closer. But what came at the end of their closeness was their third separation..."},{"name":" Hishoken!","avatar":"https://mangadex.org/covers/2c6f0348-6508-4ddc-92d8-1ed149e0bba7/c7faa762-03ca-4696-804f-b8bb4ce97ca6.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"Saito Yo has just been assigned to be the secretary of the company's new director, Nabeshima Hisatsugu, who has supposedly \"never worked a day in a company\" before. Saito is taken aback by the new director's seemingly non-professional demeanor, and he works hard to reform Nabeshima and get him accustomed to the role of director.\nA comment Nabeshima makes one day, however, devastates Saito: Nabeshima mentions that Saito wasn't what he thought a secretary should be. Shocked and frustrated, Saito carelessly blurts out while drunk one night that Nabeshima should \"take advantage\" of his services. From then on, Nabeshima changes his attitude and leaves Saito feeling even more bewildered."},{"name":" You and Tree","avatar":"https://mangadex.org/covers/2c7653db-58c0-4e12-8f88-60dec9ff2a34/7067b9c1-d7aa-4ec4-9fb9-e6e9f472b17a.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Oneshot,Web Comic,Supernatural,Tragedy"],"nutshell":"A disease that causes people to turn into trees."},{"name":" Fatal Code","avatar":"https://mangadex.org/covers/2c7d4807-5455-492c-8714-3098beeeb104/72885289-55ba-41ef-b159-194366b9d0b4.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Psychological,Long Strip,Web Comic,Full Color"],"nutshell":"Ian Wilson, the CEO of Wilson Corporation, was unjustly accused of murder after his company’s artificial intelligence robots were involved in murder incidents. While making his escape from arrest, he met Colin, his new staff, who was then being dragged into the case. As they set out to find out the truth, they discovered a series of old events, and to their surprise, everyone around them seemed to be connected to the hidden truth…"},{"name":" Strike Witches - Strike Days 6 (Doujinshi)","avatar":"https://mangadex.org/covers/2c7eaa58-f828-497a-a347-c2f78aca463d/d2b49d02-2b5d-4b8d-8345-47070e54bd89.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Action,Psychological,Martial Arts,Adventure,Tragedy"],"nutshell":""},{"name":" Tensai Kusoyarou no Jikenbo","avatar":"https://mangadex.org/covers/2c8e740a-2481-4fcd-b035-07dd157ab366/3b1757e9-65d8-49c1-b897-b68f02cbe71b.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Long Strip,Romance,Comedy,Drama,School Life,Web Comic,Mystery,Adaptation,Full Color"],"nutshell":"Amano Yuji: a demon in white coat. He's smart and handsome, but his personality is the absolute worst; he even calls himself a \"genius son of a bitch.\" Although he is no hero, he doesn't forgive criminals and scum. The story revolves around him helping others solve their problems in a harsh and unorthodox way, but at a price of course…"},{"name":" Koi to Shinzou","avatar":"https://mangadex.org/covers/2c902406-6272-4c03-a298-25d2455fbf77/0e0ba2e2-3aaa-43df-a4db-8ceba81d504a.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Comedy,School Life,Horror,Mystery"],"nutshell":"University freshman Yagisawa has a lot on her plate, but the last thing she expected to add was a surprise male roommate! Handsome Haruma claims to be a childhood friend, but for some reason, Yagisawa doesn't remember him at all, and his history isn't the only oddity—disturbing things begin to happen and Yagisawa may really be in over her head!"},{"name":" Shoushaman no Isekai Survival ~ Zettai Hito to wa Tsurumanee ~","avatar":"https://mangadex.org/covers/2c96dd59-388b-47cb-aefd-a09ddd2ddcf2/bb2fbe18-d286-4c31-af63-c4854c5d7f83.jpg.256.jpg","country":"Japanese","stat":"7.71","status":"Ongoing","tags":["Reincarnation,Action,Isekai,Fantasy,Adaptation"],"nutshell":"A merchant by the name of Okuda Keigo put everything into his work, day and night, until one day he won a lottery of 1 billion yen! With his money worries solved for life, he moved to the countryside far away from civilization to live the slow life. Then, suddenly he was transported to another world, along with his chicken coop?! In a world where he’s unable to communicate with others, you think his merchant skills will help him?! A man in his forties who hates people retired to another world. The story of his slow life has begun!"},{"name":" Ikuseisou no Yoru wo Koe","avatar":"https://mangadex.org/covers/2c971edb-4c20-4f6a-a054-4bda084a9f71/eaa8c524-53fa-461f-ac5f-2977a9a56017.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Psychological,Romance,Supernatural"],"nutshell":"Kyoushirou the mercenary is cursed with immortality after a battle with a strange man, and after years of wandering in loneliness, he finds himself out of place in modern day Japan. There, he discovers a young girl who is the descendant of his former enemy, Tokino. Though he desires revenge, can Tokino's kindness mend his tortured heart?"},{"name":" Part Time Partner","avatar":"https://mangadex.org/covers/2c98aa6d-5432-48c2-8056-6083dbc86507/33eee0c8-2940-4e23-8ef1-0b4d10b525b5.png.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Long Strip,Comedy,Boys' Love,Drama,Full Color"],"nutshell":"“Kyuho, I’m saying this in case you’ve misunderstood me, but…”\nShin Kyuho (25) and Seo Yoongun (25) meet at a university club meeting. Shin Kyuho feels compassion towards Seo Yoongun, whose looks are to his liking (or ‘who’s his type’), as Yoongun confidently stands his ground against the seniors in the club, leaving a favorable impression on him. He tries his best to protect Kyuho from the kkondaes* of the club, but Yoongun seems to have formed a misunderstanding about this…\nOne day, the angel-like Yoongun ends up blurting out something embarrassing.\n“I don't swing that way. So... don't get any weird ideas.”\nThen, Yoongun makes Kyuho out to be one of the club's kkondaes*.\nI may be gay but this is not it!\nKyuho felt oppressed and ridiculed. But he wasn't one to be a pushover either...\n“I'll give you a taste of real trouble now, bastard.”\nWhat will take place between the two on a campus where things have gotten heated up?\n*Kkondae: Slang for someone who acts in a condescending manner like a grumpy old man."},{"name":" Derorinman","avatar":"https://mangadex.org/covers/2c9a27cd-5998-4d1c-88c6-13b717db0816/615bf06c-e3be-48fa-bb1e-ec6d0f56fe73.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Psychological,Romance,Comedy,Drama,Horror,Slice of Life,Supernatural,Tragedy"],"nutshell":"The humorous yet pathetic tale of a father who had failed to commit suicide, and is left with a scarred face. Derorinman ('derorin' from 'derelict') hangs around the children of the town, tries (and fails) to get the affections of women, and has frequent confrontations with Orokamen, a masked man who's always ready to call Derorinman a fool (\"orokamono\").\nAn early work of Weekly Shonen Jump.\nNote: A remake of Derorinman ran in Weekly Shonen Magazine shortly after the Shonen Jump one ended. Among other differences, the ending is altered and the cast is now older. In the 70's, this distinction was made by having the Jump Derorinman be known as 'Ganso (Original) Derorinman' when under Asahi Sonorama's Sun Comics imprint.\nThere was also a brief novelization that ran in Kadokawa's Variety magazine. This is collected in the Tokuma bunko.\nAll editions of Derorinman exclude its infamous final arc, the Black Ship Arc. The arc was not collected until Fukkan.com released it as its own volume in 2017.  The Black Ship Arc features parallels with the United Red Army and the New Left movement. It is also where The Moon (from the titular work) also originates from. Fukkan's edition also contains \"Derorinman Heisei Version\", a 3-chapter short serial done in Comic Legend Magazine in 2001."},{"name":" Kyodai Shuffle","avatar":"https://mangadex.org/covers/2c9ee025-f010-44df-bf89-d68d54aad244/9320ab2a-6573-46ae-8640-71c8a8b69516.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Romance,Comedy"],"nutshell":"¿Es un amor prohibido o no? Touya, el hermano gemelo mayor, se pelea con su hermana menor, Maasa, por un asunto trivial y se escapa de casa. Cuando se dirige casualmente a la azotea del condominio, se encuentra sentado allí a su amigo Kazuma, que también es gemelo. Los dos hablan de la situación del hogar de cada uno y se envidian mutuamente. “Ojalá pudiéramos intercambiar de hermanas.” Los dos chicos lanzan esas palabras al cielo nocturno. ― Ocho años después, la relación de Touya y Kazuma sigue siendo la misma de siempre. Excepto en un punto… \"Me gustas Touya\", Touya suspira ante las palabras pronunciadas por Maasa. Este es el inicio de una historia de gemelos cruzados, donde sus sentimientos y percepciones se cruzan."},{"name":" Resign","avatar":"https://mangadex.org/covers/2caa303c-d903-4344-bfd9-2da45ecd141e/1e7c4a5f-6b9e-41df-b752-ae182a6972cd.png.256.jpg","country":"Japanese","stat":"8.68","status":"Completed","tags":["Oneshot,Drama,School Life"],"nutshell":"Oneshot by Hanzutsu/ ハンズツー."},{"name":" The Fabled Warrior","avatar":"https://mangadex.org/covers/2cab36fa-c600-4cdf-8b4c-62523a12dc76/2016ac70-cd5f-47d3-9560-6fef750a0033.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Award Winning,Action,Demons,Long Strip,Adventure,Magic,Isekai,Fantasy,Web Comic,Full Color"],"nutshell":"Myeongok is just your typical 49-year-old mother living her life with her family--at least, that’s what she’d want you to believe. When two people from another world suddenly show up and ask her to help save their world, she refuses. She has a family now and can’t risk putting her life on hold... but will she be able to say no if her daughter is involved? Will Myeongok be able to find some way to save this other world and protect what’s dearest to her as well?\n\n\nGrand prize 2019 네이버웹툰 최강자전 | Awards Ceremony\n\n\n\n\nOfficial English <Tappytoon> Translation\n\n\nOfficial Japanese Translation"},{"name":" Dream to Be an Idol","avatar":"https://mangadex.org/covers/2ccdc0df-143e-4fed-900d-c9488cc78966/ae1e8d62-88d8-4f8e-ad28-307fff5a8804.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Oneshot,Slice of Life,Music"],"nutshell":"A 4-page manga with 2 interpretations on the idol's journey"},{"name":" Touhou - A Spell To Make You Warm!","avatar":"https://mangadex.org/covers/2cd13b0a-28c2-437a-9d5b-33c25a0a370e/8d60053d-5195-4508-a670-69898dc6e162.jpg.256.jpg","country":"Japanese","stat":"7.72","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":""},{"name":" I Have to Be a Great Villain","avatar":"https://mangadex.org/covers/2cd5946a-270a-4ff2-bc46-2b22b18e9294/29c0968f-a57e-4bad-8641-00d53b920eb3.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.13","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,Crossdressing,Fantasy,Villainess"],"nutshell":"A true villain is ruthless! Evil! A troublemaker! And after beating the male lead black and blue, he walks away as explosions go off on the back. Wang Yi was determined to act as this kind of villain. Unfortunately... the male protagonist can read minds. (:з ∠*)\n\"You bastard!\" Mr. Yi sneered, glaring and looking down at the novel's male lead. The young gong, Qin, suddenly sees his inner thoughts plastered on his face, with cute emoticons （///ω///）: You're so cute...\nHe gradually wonders: ?"},{"name":" I Was Rocked to the World's Richest Man in a Matchmaking Office","avatar":"https://mangadex.org/covers/2cd624e6-9b8a-4d8e-8f93-7421f5aa6369/4e548ce3-126a-47cc-b764-fddcedef0468.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.57","status":"Ongoing","tags":["Long Strip,Romance,Drama,Supernatural,Full Color"],"nutshell":"As soon as I graduated, the country assigned me an object, and it was also the super diamond king Ye Junqing on the Forbes rich list. As the leader of the top ten cancers of unmarriage that have spread wildly outside, Ye Xingguang thought that such a big man must be very It's hard to get along with, but in the end, you hold her in the palm of your hand! Who knows that the greatest luck in this life is not to win you in the crowd.."},{"name":" Love in the Underworld","avatar":"https://mangadex.org/covers/2cd6a27f-c13e-4768-8376-dc14e550f154/4c1cccce-6c47-45e3-95a9-df4981f730ba.jpg.256.jpg","country":"Korean","stat":"7.87","status":"Completed","tags":["Demons,Long Strip,Romance,Boys' Love,Fantasy,Web Comic,Full Color"],"nutshell":"The prince of hell and the son of Hades, Ha Ji-wook (Haderius) appears in front Song Si-hoo, a student from the music department and names him as his bride. A reckless love story of the prince of hell that fell in love with a mortal!"},{"name":" Onnanoko wa Yoyuu!","avatar":"https://mangadex.org/covers/2cd7c920-5e1b-433c-9e08-adf8f6baf706/ca3396d3-005e-42cf-8ce5-cab0f662b41c.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Romance,School Life,Slice of Life"],"nutshell":"From Stage Storm:\nTomomi is secretly in love with her classmate Sawada. But her love couldn't be fulfilled as Sawada is in love with another girl. Meanwhile, Ojika, the head of the broadcast club, is trying to win Tomomi's heart with his handsome voice. Finally Tomomi's gloom is driven away. She starts to see the hidden beauty of the things around her which she has never noticed before."},{"name":" Gorgon","avatar":"https://mangadex.org/covers/2cd98eaf-092f-40cc-99c4-a8b36d2b4956/ec0294a4-9cab-433a-a369-cc59fc9f7301.jpg.256.jpg","country":"Korean","stat":"7.99","status":"Completed","tags":["Action,Psychological,Long Strip,Drama,Horror,Web Comic,Supernatural,Full Color"],"nutshell":"The story follows Im Soohyun, an orphan who is cursed with the ability to kill people by looking them in the eye."},{"name":" Is It Wrong To Write a Gag Manga For a Contest?","avatar":"https://mangadex.org/covers/2ce106c5-d902-4efe-963b-cb5cd2698fcd/fafe2c55-a04f-48bc-8510-b95f628f1baa.png.256.jpg","country":"English","stat":"7.62","status":"Completed","tags":["Oneshot,Action,Comedy,User Created,School Life,Gyaru"],"nutshell":"Animan's dream is to become an anime protagonist, but he's stuck in a manga…?"},{"name":" Haikyuu!! - The Story of Those Who Live in This Town (Doujinshi)","avatar":"https://mangadex.org/covers/2ce80d07-04ab-48d4-a9f1-71e895b12d6d/8871e890-583b-4f32-bc11-11171ab27cc4.jpg.256.jpg","country":"Japanese","stat":"8.35","status":"Completed","tags":["Oneshot,Boys' Love,Slice of Life"],"nutshell":"Pairing: Iwaizumi Hajime x Oikawa Tooru\nSequel to Haikyuu!! - Ano Machi ni Sunderu Karera no Koto"},{"name":" Elite-sama Koi Shiyou","avatar":"https://mangadex.org/covers/2cea4a88-0ab1-4cf2-be91-1c796c164562/d9987f95-c890-4086-a024-8709bdfd6d17.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Yukio, is a cold girl with a poker face, not to mention that; she is cute, and works like president of student council with the most popular two guys on school. But under all that seriousness, is her throbbing heart desperate to be loved by someone.\nEven so, Why cant she tell him?\nExtras:\n\nLove Progression of an Honour Student extra\n\n\nCute Prince\nThe Idol and the Jealous Girl"},{"name":" Shusse Shika Atama ni Nai Otoko","avatar":"https://mangadex.org/covers/2ced010d-df2a-4fac-9766-c55dc5cd44db/527fc8cd-8d35-4cad-8844-2bad4fb7a1d4.png.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Oneshot,Romance,Comedy,Office Workers,Web Comic"],"nutshell":""},{"name":" Oretachi wa Shinkon-san Kamo Shirenai","avatar":"https://mangadex.org/covers/2cfbfa98-a4e2-4f8c-b29f-968cf5c58aba/c6a0ba14-dde3-4d98-b88b-ca463fe5804c.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"\"Should we just go for it? Marriage?\"\n\"…That's it!\"\nLove that blossoms post marriage can be a thing too, right?\nNasukawa, a pragmatic graduate student in science, and Kaburagi, an elite office employee, are university colleagues and very good friends. They've been living together to save money, but are told by their landlord, that two male friends are prohibited from sharing a room, so the two get married as camouflage.\nNasukawa notices that ever since their marriage, his heart is throbbing for Kaburagi, who's supposed to be just his friend.\nMeanwhile, when Nasukawa's bed breaks and ends up sleeping with Kaburagi in his bed, Kaburagi makes a move. A mildly intense physical intimacy between two adults. When Nasukawa's body inadvertently reacts, and he's trying to calm himself down, Kaburagi suggests, \"practical mutual masterbation\" and…!?\nA heart throbbing and steamy story of a twisted newlyweds' life between a thoughtful elite office worker, and a kind and laid-back graduate student."},{"name":" Melon no Aji","avatar":"https://mangadex.org/covers/2cff0a72-8e33-4df3-ab64-5fc62bba4ee7/8b516593-aee8-41d9-9a88-46a755fb3a1d.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"“I want you, Nakajou-kun!”\nNakajou, who works at a live music club, and Kiuchi, a regular, suddenly starts living together. Kiuchi has recently broken up with his live-in girlfriend and was searching for a place to sleep for a while. Moreover, because he cannot sleep without the warmth of another person’s body, he requests to sleep with Nakajou, who refuses by revealing he’s gay. Kiuchi, on the other hand, declares “gotchu!” instead…"},{"name":" Inu mo Arukeba Koi ga Hajimaru","avatar":"https://mangadex.org/covers/2d059466-6775-44cb-ba28-bb6213bdd9ea/c9fff288-9400-4382-8142-d9030d97bfa1.png.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"Sora Pometani, a sober high school student, has a peculiar constitution: when he's anxious he turns into a Pomeranian. One day, his classmate and secret love, Makito Matsuda, bumped into him in his Pomeranian and ends up taking him home.\nMakito takes Sora in his pomeranian form home because he resembles his grandmother beloved but deceased dog, \"Pometa\". Makito finds out about Sora's true constitution and, in order to make his grandmother happy, he asks Sora to keep visiting her in his pomeranian form. Sora is promoted from a mere classmate with a secret crush to one of Makito's friends."},{"name":" Tsukiuta. Anthology","avatar":"https://mangadex.org/covers/2d072a77-c650-422b-974d-7b44dcbd2c2d/30446433-d2ae-4b3e-86f1-ed277618740b.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Anthology,Slice of Life,Music"],"nutshell":"A collection of stories centering on the idol groups Six Gravity and Procellarum."},{"name":" Perfect Relationship","avatar":"https://mangadex.org/covers/2d0a472e-94fb-4bab-8dd7-81a875fd6839/9bfeb058-fc5e-4820-b990-131d0d893bce.jpg.256.jpg","country":"Korean","stat":"7.83","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Drama,School Life,Web Comic,Full Color"],"nutshell":"One day, she stumbles upon two boyfriends kissing.\nA strange relationship they had to bear since that day!\nBut even before the the shocking incident and the confusion setting in, they were already living under the same roof!"}]