[{"name":" Gendai Majo Zukan","avatar":"https://mangadex.org/covers/207fb8ea-7590-410a-a2dd-38819af19c7d/be67363e-4f3e-4a77-85bc-739bca88b5fd.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Comedy,Drama,Fantasy,Slice of Life,Supernatural"],"nutshell":"In a modern day setting, witches make up about 1% of the world population. Most people look up to them and envy their power, but the gift of magic isn't all sugar and rainbows… Follow the witches in this slice of life series as they face the ups and downs in their daily lives, finding love and friendship in the most unexpected places."},{"name":" Rambo-Sensei","avatar":"https://mangadex.org/covers/2083a60b-4b74-42ef-b1e8-9352b332a825/702491e3-908e-4365-8719-ba30269570d2.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Action,Comedy,Military,School Life"],"nutshell":""},{"name":" One Step From Hell","avatar":"https://mangadex.org/covers/2084c658-1cd4-422e-9545-62bb2e293520/38d44848-4e1d-4ae3-851d-859a7bd4d51e.jpg.256.jpg","country":"Korean","stat":"8.23","status":"Ongoing","tags":["Monsters,Long Strip,Boys' Love,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"“If you don’t need God… what about the devil?”\nThe whisper of the devil’s salvation offering sweet temptation to a child fleeing abuse.\n“Make a contract with me, and if it’s your desire, I’ll give you three wishes.”\nGambling the life of a child who escaped abuse through a devil’s deal, the child safely escapes from the devil and takes on a new life under the name Daniel Barton.\nYears later, Daniel, now an adult, found himself on his way to work. However, at the front of Washington Hotel stood a dazzlingly handsome man–"},{"name":" I’ll Become the Tyrant's Tutor (Promo)","avatar":"https://mangadex.org/covers/2087b5a6-5efd-435c-a1c3-a78ec19d0ebe/019a97c9-9e5a-492e-ab62-faa85d4555f9.png.256.jpg","country":"Korean","stat":"8.61","status":"Completed","tags":["Oneshot,Historical,Long Strip,Romance,Isekai,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"Note: Promotional webtoon for the novel of the same name.\nPrimabelle is astonished when she wakes up to find herself in a novel of her own creation as an obscure painter who gets killed by the male protagonist, Prince Rainsis.\nThe world she created has not been kind to Rainsis. In addition to being colorblind, he has been shunned and feared his entire life, for a prophecy had been made that “the one trapped in a black and white world shall drench the empire in blood.” Primabelle resolves to disprove the prophecy after witnessing his misery firsthand.\nTo do so, she must track down his destined other half. The only problem? All she knows about the fair beauty is that she has black hair and crimson eyes. Will Primabelle be able to help Rainsis see the world in all its splendid colors and find true happiness?"},{"name":" Deception","avatar":"https://mangadex.org/covers/20894236-26bd-44d2-ae47-82b9449b48d6/ff267dfb-211b-434c-b8b8-c9277dbde08c.png.256.jpg","country":"Korean","stat":"8.17","status":"Completed","tags":["Thriller,Official Colored,Historical,Long Strip,Horror,Vampires,Web Comic,Mystery,Full Color"],"nutshell":"The story of an artist who becomes entrapped by the charms of his beautiful client and is unable to escape from the mysteries surrounding the identity of the captivating woman."},{"name":" Touhou - Kurai Tokoro de Machiawase (Doujinshi)","avatar":"https://mangadex.org/covers/208a2c8d-72d8-4a6d-ba59-f8f970e3b2ac/e519837d-0d4f-4490-95fb-5caec80d5903.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot"],"nutshell":"After Merry’s health issues after Trojan Green Asteroid, she wonder’s if they should keep their activities. But Renko is determined to stay by her side no matter what."},{"name":" The iDOLM@STER Cinderella Girls - WILD WIND GIRL","avatar":"https://mangadex.org/covers/208a6c92-bd13-4de0-b38d-deade1aea045/0c8c6453-4a9b-460c-8285-4b9679a98b59.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Comedy,Drama,Slice of Life,Music"],"nutshell":"Mukai Takumi is the head of her own Motorcycle Gang, but a chance encounter with a certain person ends up leading her down the path of becoming an Idol.\nA manga spinoff of the IDOLM@STER Cinderella Girls series of games starring the Delinquent turned Idol, Mukai Takumi.\nPart of THE iDOLM@STER series."},{"name":" My Little Sister Whose Boobs Keeps Getting Bigger And Bigger","avatar":"https://mangadex.org/covers/208ec2d4-b78e-4131-ac18-3cae9657bd0f/74edc9c2-730b-483a-9ed5-6f23e2f2f8e1.jpg.256.jpg","country":"Japanese","stat":"7.11","status":"Ongoing","tags":["Romance,Incest,Web Comic,Mystery"],"nutshell":""},{"name":" Okitsune-sama no Iutoori Yakan","avatar":"https://mangadex.org/covers/20928fd5-9228-4465-b1b7-e5547bb17f5d/b0efc62f-b132-492b-b28c-108d84a2be49.jpg.256.jpg","country":"Japanese","stat":"7.70","status":"Completed","tags":["Oneshot,Animals,Boys' Love,Supernatural"],"nutshell":"A drunk man asks a bartender for one more story for the road."},{"name":" Enjigakari","avatar":"https://mangadex.org/covers/2094340a-3993-4d4d-8a16-1ff8f9b3acd0/3b144b40-8322-4663-a0f1-16f4f29399e3.jpg.256.jpg","country":"Japanese","stat":"7.55","status":"Completed","tags":["Loli,Comedy,School Life,Slice of Life"],"nutshell":"Enji is a cute little android girl with cat ears and a tail. She came from a foreign country to become a student at the same school Ai goes to. Back in the country where she hails from, she has only experienced all-android schools, so this is her first time as a student in a all-human school. Ai Kodama has been assigned as \"Enjigakari,\" meaning that he will have to take care of the little android girl and show her the life of a normal human."},{"name":" Wu Ling Jiutian","avatar":"https://mangadex.org/covers/20969a94-41b8-45f7-977d-c13458431e1c/255cb874-16ba-4f92-83c9-266e7ed54b69.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Official Colored,Action,Martial Arts,Adventure,Wuxia,Fantasy,Web Comic,Full Color"],"nutshell":"This is a world where the strong are respected, and the cultivation system is roughly divided into four types: cultivation of immortals, martial arts, cultivation of Buddha, and cultivation of demons. Takeo: The master depends on one breath. Talent is as important as the advancement of ideas, but it needs to have an indomitable momentum. Mortal bodies can also be cultivated, but the training process is too painful for ordinary people to persist. In addition, Wufu is very fast. , So the life span is shorter than that of the immortal cultivator, and must reach the Martial God Realm in the shortest time. Martial arts training will not increase the lifespan."},{"name":" Our Rainy Days of Melancholy","avatar":"https://mangadex.org/covers/209d5199-08f0-4957-8e0a-db2af53c269c/df61eabd-d961-442e-9150-d6380cb882f0.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.02","status":"Completed","tags":["Romance,Drama,School Life,Web Comic"],"nutshell":"You Qiuzi. Who in the school doesn’t know her name? With a terrifying aura that screams antisocial, her overbearing attitude and a face laden with heavy makeup repel others with little difficulty. However, under her fierce appearance is a wounded heart, and all that unfriendliness is simply a mask to detach herself from social interactions. After five long years, her mundane daily life was once again lit up by the return of her childhood friend, Gao Tuoyi. At the him who is now both unfamiliar yet familiar, in order to see his smile again, she who is bad at socializing will just have to take action."},{"name":" BUTLER","avatar":"https://mangadex.org/covers/209d7511-16f9-4f9f-8d8a-99b133b69c41/38277ddd-9b83-49c6-a6a6-86add590e8f8.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"A new butler, Natsuo, has come to the residence of Wadou family where Aki works as a butler. Actually, both of them have made love in the past…? Their reunion brings back the memory of sexual pleasure–."},{"name":" Just Friends","avatar":"https://mangadex.org/covers/20a01e92-9988-4d00-9804-87fe163e05fa/5c40b672-f62e-4988-a874-0aafe73fe554.png.256.jpg","country":"Spanish","stat":"7.72","status":"Completed","tags":["Girls' Love,Drama,Slice of Life"],"nutshell":"During one summer in her teens, Erika’s mother pressured her into going to a local overnight camp. Despite her reservations, Erika ended up meeting a girl named Emi... and Emi didn't let Erika’s anti-social front prevent them from forming a special bond.\nNow in their 30s, Erika and Emi reminisce about that fateful summer and consider what could have been."},{"name":" Kantai Collection - Battleship Above the Hill (Doujinshi)","avatar":"https://mangadex.org/covers/20a20986-3780-4647-aa66-5d9cddb29712/55b058fd-1845-4a5d-83e9-172350b154ed.jpg.256.jpg","country":"Japanese","stat":"8.19","status":"Completed","tags":["Oneshot,Historical,Girls' Love,Military,Philosophical,Drama,Slice of Life"],"nutshell":"The title of this Kancolle one-shot Oka no Ue no Gunkan (“Battleship Above the Hill”) is likely a play on Saka no Ue no Kumo (\"Clouds Above the Hill\"), a Japanese historical novel by Shiba Ryōtarō originally published from 1968 to 1972 in eight volumes. A thirteen-episode television drama based on the novel aired on NHK from 2009 to 2011."},{"name":" I tried to run away after eating the male lead","avatar":"https://mangadex.org/covers/20a4589e-b2f8-4bd0-8bac-376990cce3ae/02f63292-6aff-4ad2-ab07-c4ef82282ccf.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Romance,Fantasy,Full Color"],"nutshell":"I was starving, begging at the temple for food, when suddenly, the temple began to collapse.\nIn a hurry, I snuck into the storage room to steal some bread when I found a shiny, sweet smelling piece of candy.\nI put it in my mouth, looked up and saw the man called the demon without blood or tears in front of me.\n“If you ate it, you should take responsibility, right?” Oh god, I have to give the candy back somehow before this crazy guy cuts my belly.\n“The most effective way of exchanging strong power between humans is through physical contact, preferably by sleep… … to-?”\nMy voice faded to a wisper out of embaressment. With a slow smile, he stretches out his hand, and I became flustered.\n“This is true. I can’t help it.”\n“What? What?””\n“You read it yourself. The solution to our little problem...”\n“…Yes?”\n“Step by step, shall we try?”\nEnchanted by his beautiful face and deep eyes, I couldn’t even ask what he means by trying step by step. Are you… are you a villain who destroys the world with your beauty?\nOriginal Novel\nOriginal Webtoon Less..."},{"name":" Kirishima, Bukatsu Yamerutteyo","avatar":"https://mangadex.org/covers/20a75d59-27e5-4f08-9a01-9b441569c1bb/92f8199d-9171-4a35-9580-7da4e9f49582.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Drama,School Life,Slice of Life"],"nutshell":"Kirishima, is a popular teenage boy and a star athlete at his school. For some unknown reason, he seems to have vanished off the face of the earth after quitting the volleyball team. His disappearance eventually became pivotal to the collection of stories about various individuals who are connected to him in some way, with each having a unique point of view about connections, relationships, social boundaries, and the similar events that revolve around them.\nThis story is based on the omnibus novel \"Kirishima, Bukatsu Yamerutteyo\" by Asai Ryou which was first published in February 2010."},{"name":" Blood and Steel: Tale of the Fighting Freak, Path of the Warrior","avatar":"https://mangadex.org/covers/20ac11fa-eb8f-4c52-b1e9-326578267ab5/5418cdcf-6a2b-4f31-9a1f-b49c62968a72.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.89","status":"Ongoing","tags":["Historical,Action,Martial Arts,Adventure,Drama"],"nutshell":""},{"name":" Kekkon Suru kara... Shite mo Ii yo ne?","avatar":"https://mangadex.org/covers/20adac11-0861-4e87-80d1-eeb4e5991a2a/8e00efe5-b87b-4180-a60d-3476e4ab304b.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"Shizuku and her boyfriend, Daiki are high school students that live together. On top of that, they're married?! As \"newlyweds\", Shizuku has insecurities, particularly taking their relationship into the next level…\nContains the following stories:\n\nKekkon suru kara… Shitemo Ii yo ne?\nKekkonshiki wa, Seifuku de\nOuji-sama wo Akaku Sometai\nAmaetagari no Ouji-sama♥\nHitoribocchi no Ohimesama"},{"name":" NECRO","avatar":"https://mangadex.org/covers/20b59ae7-84a4-43c1-8f76-0b00ca5cbeea/db8b7a82-ffdb-4790-ab8d-0163b8aafe5a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Action,Demons,Ninja,Adventure,Fantasy"],"nutshell":""},{"name":" Uchi no Maid to Kekkonsuru Tame nara Ore wa Harem wo Tsukuru","avatar":"https://mangadex.org/covers/20bf5194-61f3-4e8a-80f6-64b56a03acf3/813aa99a-c8be-4c4e-9114-400837a0f45a.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Comedy,Harem,Fantasy,Adaptation"],"nutshell":"The great empire Graushroud controls 80% of the world.\nAlex, who was born as the next master of the Gilliam family, a nobleman who owns a quarter of the empire, had a dream.\nHe is to marry his exclusive maid Chloe, his childhood friend who has lived with him for many years. However, there should be no freedom of marriage for the next head of a leading aristocrat ...\nAlex's father, Isaac, also ordered Alex to marry someone, saying, \"On the way to subdue the demons, make a child with a wife of a powerful aristocrat outside.\" Alex, who wants to marry Chloe anyway, must rebel against his father !!\nAuthor Twitter:\nhttps://twitter.com/hinoakari999\nArtist Twitter:\nhttps://twitter.com/mori70"},{"name":" Yokujo Sakurifaisu","avatar":"https://mangadex.org/covers/20c21eb2-a366-4c0f-aa07-4d4686c8e43b/106d2975-4813-47a0-86c9-c4fe6bf61cc7.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot,Romance,Comedy,Drama"],"nutshell":"Desde que Katagiri fue se incorporó a su oficina, Misuno y él han sido camaradas de comidas y bebidas. Tienen los mismos gustos… así que Misuno por primera vez siente esa conexión con un compañero de trabajo (a pesar de que en su oficina son más hombres que mujeres). Así que para no perder esa bonita amistad, Misuno decidió no confesarle sus verdaderos sentimientos a Katagiri. Pero ahora, debido a que él es apuesto y popular, ella teme perderlo… Para no hacerlo, Misuno decide usar la táctica que llama la atención de todo hombre: \"Sexo\"… ¿Será el sexo casual suficiente para Misuno?"},{"name":" Goodbye, Ryo","avatar":"https://mangadex.org/covers/20c223a9-869a-48b0-b840-ae62607473ea/365b8c31-3411-4309-80e3-f94049ef9dc9.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Official Colored,Long Strip"],"nutshell":"Like the ultimate hidden line collection play, a mystery novel that finally ended, seemingly unrelated things are spun in a single line, from a live disturbance to YouTube planning, music video scenes to past SNS posts"},{"name":" Marble","avatar":"https://mangadex.org/covers/20c3a175-0475-40a1-8c4f-cd3eba7ad2c6/bb1887e0-5772-4782-a81d-2df0100e73d4.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":""},{"name":" The Dragon Emperor","avatar":"https://mangadex.org/covers/20c461f3-392d-44d2-ba53-5a850f1e6c42/a3ab78ba-4da3-42c0-9642-5a831ab4447b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.84","status":"Ongoing","tags":["Action,Long Strip,Martial Arts,Adventure,Wuxia,Web Comic,Full Color"],"nutshell":"The young man Lu Ming bloodline was taken, inadvertently obtained the Supreme Divine Hall, through which to reshape the supreme bloodline, continued on the path of cultivation, since then embarked on a hot blood brilliant martial dao path, along the way began to make continuous adversity, wandering the heavens, and finally achieved the Ten Thousand Dao Dragon Emperor.\n\nLinks:\n\nAlternative Raw (AC QQ)\nAlternative Raw (KuaiKan)"},{"name":" 1 + 1","avatar":"https://mangadex.org/covers/20c47a70-480f-4ad8-a6cf-cbfd1bb46128/396d0e5c-ef1e-499d-89e3-52983689fd6a.png.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Mei and Takeru are twins who have a very close, if slightly flirty, relationship, and are quite popular within the school. Their relationship is both a source of amusement and dismay to both the male and female school population, especially with Mei, whose massive brother complex keeps her oblivious to serious confessions from other males. Their relationship becomes even more complicated, however, when the two of them learn that they are not related by blood."},{"name":" Handsome and Cute","avatar":"https://mangadex.org/covers/20ccd512-8b71-4e5a-b66a-315e56a94fa8/5d173a92-1bf6-462c-a574-59dd3d100f5c.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.80","status":"Hiatus","tags":["Genderswap,Long Strip,Romance,Comedy,Drama,Web Comic,Slice of Life,Full Color"],"nutshell":"Tang Xiaohan (Han-Yi) almost lost her life in a traffic accident, but a miracle happened — she was revived in the body of a brain-dead vegetative patient. However, something isn't exactly right… The patient was a man!\nES: Charlie sufre un accidente y para salvar su vida, usaron el cuerpo de un paciente recién fallecido por muerte cerebral…"},{"name":" Ghost's Dilemma","avatar":"https://mangadex.org/covers/20cf726a-cc78-489c-9f36-de05c4efed23/89be7452-2653-4405-a4c0-bd9344d949e3.png.256.jpg","country":"Indonesian","stat":"8.05","status":"Completed","tags":["Romance,Drama"],"nutshell":"Railo who had died suddenly returned to this world. What do he need to do?\nCooky scans is working on it"},{"name":" Madan no Ou to Michelia","avatar":"https://mangadex.org/covers/20df8f80-b91d-48d5-abb5-9d24ddb85565/dff0eab7-8050-49ab-b2e3-b1751978c85e.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Ongoing","tags":["Historical,Action,Romance,Comedy,Harem,Fantasy,Adaptation"],"nutshell":"The Lord Marksman and Michelia novel series is an alternative parallel world to Kawaguchi's Lord Marksman and Vanadis light novel series, with Ludmila instead of Eleonora as the main heroine. In this alternate world, Zhcted does not declare war on Brune, but instead forms an alliance to wage war against the kingdom of Muozinel. A young man named Tigre goes to war in his father's place, and his first taste of battle begins to go well, until Brune's battle lines crumble to an ambush. The commander of Tigre's unit flees, until Ludmila, the Vanadis warrior of Olmutz, comes to the rescue. Two years after that battle, Tigre and Ludmila have a chance reunion, just as the curtain is raised on a new war, and a legendary evil awakens."},{"name":" Anecdotes About Spirits and Immortals","avatar":"https://mangadex.org/covers/20e51389-fbaf-47c9-be49-539b921cdc11/07efc438-7ee4-4176-a8b9-5f05a2d9ac6f.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Completed","tags":["Action,Martial Arts,Adventure,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"In the ancient era of the legendary Three Sage Kings and Five Virtuous Emperors, with the death of Shen Nong, the heroes of various clans began to stir. In this turbulent era, a young man appeared out of nowhere…"},{"name":" Kurama-chan ni Guitte Shitara Pisha tte Sareta!","avatar":"https://mangadex.org/covers/20e9b7fe-aff5-4f48-947a-b288a022b897/74318308-c9f1-4e01-b6a2-08628f41576a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,4-Koma,School Life"],"nutshell":"ひねくれ根暗女子中学生・くらまちゃんはグイグイ美少女・喜多尋夢に迫られていた。そんな二人の泥仕合を幼なじみやクラスメイト、たまにそれ以外と一緒に見守る友情フワフワ4コマが、待ちに待った単行本第1巻発売です"},{"name":" Shinigami-chan Is Gullible","avatar":"https://mangadex.org/covers/20e9d7ef-45ee-4f56-a444-8394e13e76ea/5d8eaf93-f666-4978-9774-cc5ca335c57e.png.256.jpg","country":"Japanese","stat":"8.24","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life,Supernatural"],"nutshell":"A grim reaper infiltrated a high school to kill a boy."}]