[{"name":" Tapioca","avatar":"https://mangadex.org/covers/518c6492-b720-476e-b3dd-f33470d38662/ec7f75c1-bee1-48c6-a8bb-b16212fad67c.png.256.jpg","country":"Japanese","stat":"7.41","status":"Completed","tags":["Oneshot,Comedy,Horror,Supernatural"],"nutshell":"A stranger teaches a girl about a new breed of tapioca.\nAlt. Raw"},{"name":" Supernova wa Kiss no Mae ni","avatar":"https://mangadex.org/covers/518dde13-a33c-42d3-b64b-422046e4165b/068712bc-a464-4b60-a04a-3bc73b84e872.jpg.256.jpg","country":"Japanese","stat":"8.22","status":"Completed","tags":["Sci-Fi,Time Travel,Romance,Comedy,Drama"],"nutshell":"In an unexpected turn of events, Toki, a high school boy, started dating Fumi Munetsugu, the school's superheroine. After hitting it off to a good start, they faced the next hurdle in the path of romance: a kiss.\nCompletely out of his element, Toki was unable to go for it.\nThe fate of the world, however, depended on it…"},{"name":" Pact","avatar":"https://mangadex.org/covers/518faa34-1e7c-4424-b93e-66203d85f00b/da396cd6-8795-4fe4-b6e8-4a49c2c1130f.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Drama,Tragedy"],"nutshell":"A terrorist group has declared independence on the South Pole, and they have placed extremely powerful nitrogen bombs off many coasts. They plan to take revenge on the world, by forcing them to live briefly in fear and then die. The US tragically failed to defuse the bombs. There are three of them off the coast of Japan, set to explode in 10 days. Luckily, the Japanese bomb disposal team has a powerful resource.\nThat resource is a little genius girl, Machida Machiko. She's looked after by Aranagi Nagito, a trainee bomb defuser. She's made a pact with him, and with the leader of the bomb disposal program, to clear out the bombs and clean up the world. After certain events in their first defusing operation, though, it looks like all they'll have left to use is a defusing program written by Machiko. Will they be able to save Japan and stop the powerful terrorists?"},{"name":" Dai-46-dai: Natsume Kirou Emon - Kouryuu no Mimi Hatsugenhen","avatar":"https://mangadex.org/covers/51952be4-4516-4ffe-b42d-abb9db5eb987/90c1e689-eacc-4c8c-acb5-c32212c8c9b1.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":""},{"name":" Kimio Alive","avatar":"https://mangadex.org/covers/519a12bb-b926-4f24-9cc0-82708c524a91/391858e4-3633-4cb2-8f44-0224f6acd51b.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Cancelled","tags":["Comedy,Drama,School Life,Slice of Life"],"nutshell":"To realize his dreams, Hasegawa Kimio set out to become a YouTuber."},{"name":" Love Love Game","avatar":"https://mangadex.org/covers/519f10a8-8f14-45d0-8872-57c0c04a2795/5b2d9feb-94ce-40c5-8070-74dc3602dc70.jpg.256.jpg","country":"Japanese","stat":"7.44","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Normal face, normal style, bad at sport, bad marks. The middle of middle (no, lower!?) girl, Kotoha, is a childhood friend of Kanade who is handsome and clever. Secretly Kotoha loves Kanade, but Kanade always act cold towards her….\nKotoha wants to be able to be friends again with him by calling him 'Kana-chan' like in the past, but he got angry because of that….\nThat time, she got close to the class playboy Haruta…?"},{"name":" True Beauty","avatar":"https://mangadex.org/covers/51a0cd0c-3254-47f0-a7fd-4b9bb178f813/22679123-1072-4cc2-baf0-95603e0e2a1a.jpg.256.jpg","country":"Korean","stat":"7.74","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Drama,School Life,Web Comic,Full Color"],"nutshell":"From Webtoon: A high school girl who rises to pretty girl fame in her school after she masters the art of make-up via YouTube.\nFrom Naver: Everyone has a secret. Then what kind of secret does a goddess have?"},{"name":" Kyoukai Senjou no Horizon","avatar":"https://mangadex.org/covers/51a29af2-0fc8-4c78-9d4f-75ceedbca1d6/0298b2c5-5210-4856-b6fa-fb1c18800f3c.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Sci-Fi,Action,Romance,Adventure,Fantasy,Adaptation"],"nutshell":"In the distant future, Earth has been devastated and its inhabitants seek a new home in the heavens. However, constant warfare forces humans to return to Earth, which has turned into an uninhabitable planet except for a certain area called the Divine States.\nThe Divine States are too small to accommodate all the humans, so they duplicated the area and created the Harmonic Divine States. In order to retrace their steps and rediscover their journey to the heavens, the returned humans began to reproduce history from the year 10,000 BC, using a mysterious history book called Testament.\nHistory reproduction proceeds smoothly until A.D. 1413, when a war broke out in the Divine States. This causes the Harmonic Divine States to crash onto the original world. The humans living in the Harmonic Divine States lose their land and invade the original world. The people of the Divine States surrender and they are divided by the invaders from the Harmonic Divine States. They try to resume the reproduction of history from A.D.1457, but the update of history terminates in A.D.1648. A rumor of apocalypse begins to spread around the world."},{"name":" Mirai no Koibitotachi","avatar":"https://mangadex.org/covers/51a5195f-ef4c-4b5b-b327-4134e98bfd5e/78cca894-3d52-4ebd-b406-6d9092a38e7a.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance,Crossdressing,Drama,School Life,Slice of Life,Supernatural"],"nutshell":"6 - My Little World\nNakayama Saori reunites with her old classmate, Tokito, and they reminisce about the past and a girl named Tasaki Mina."},{"name":" Flower (MATSUMOTO Taiyou)","avatar":"https://mangadex.org/covers/51a7676a-f726-4c92-a9ad-0d21cc4104a2/ef39137c-112b-4a45-8b5a-b24e9cffbe54.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Oneshot,Psychological,Fantasy"],"nutshell":"The story follows a family of mask-makers and their reclusive son who has completely shut himself off from the world…"},{"name":" Ore no Imouto ga Konna ni Kawaii Wake ga Nai - Siblings Really Can Get Married Now (Doujinshi)","avatar":"https://mangadex.org/covers/51acc111-39b6-488e-a936-ad8f9af7675a/126a4792-2468-4229-a98a-3f5db7626cbe.jpg.256.jpg","country":"Japanese","stat":"7.58","status":"Completed","tags":["Romance,Comedy"],"nutshell":""},{"name":" Yuri VTuber Face Reveal","avatar":"https://mangadex.org/covers/51affee0-928f-4f40-afeb-3ee6da9f1863/58e8f067-3f5a-4402-b130-02347107a018.png.256.jpg","country":"Japanese","stat":"7.18","status":"Completed","tags":["Oneshot,Comedy,Girls' Love,Web Comic"],"nutshell":"A girl obsessed with a Yuri VTuber couple gets more than what she bargained for.\n\nLinks:\n Artist’s Pixiv"},{"name":" Flying Leaves - Another Wild 7","avatar":"https://mangadex.org/covers/51b28ae8-0330-464d-9cca-9989153df885/297076e4-27e4-4513-a41f-bf87fb89c393.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Action,Psychological,Comedy,Crime,Survival,Mafia,Adventure,Military,Philosophical,Drama,Police,Slice of Life,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nIn a rural town in Central America, there was a Japanese man who had lost his memory, called Hapo by the locals. When the man, who blended in with the locals while living on the ship, regained his memory...\nAnd at the same time, a ship is attacked by terrorists while sailing to commemorate the opening of a second shipping route between the Pacific Ocean and the Caribbean Sea.\nWild 7's flying leaves come to life again!"},{"name":" Night Fish","avatar":"https://mangadex.org/covers/51b560bd-5215-48d0-a7c5-5d69df11e0f3/b5c768d7-2965-4c75-89a4-9ed3311f93ca.jpg.256.jpg","country":"Korean","stat":"7.91","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"Joo Ye Eun tiene una vida perfecta, una buena carrera, un novio y amigas que siempre están a su lado. Nada le hace falta pero, ¿por qué se siente tan vacía?. Más tarde se entera que su novio la engaña con una de sus colegas. ¿Cómo se resolverán las cosas?\nEnglish:||\nJoo Ye Eun had a perfect life - having a good career, boyfriend and friends who always stay by her side. She lacks nothing but why does she feel empty? Later she finds her boyfriend cheating on her with her colleague, how will things evolve from here?||"},{"name":" The Band of Young Ruffians","avatar":"https://mangadex.org/covers/51b71281-1fe0-443f-a214-6b09fc9bf4a5/c408f001-a311-4fd0-8781-e39fd7a5e728.png.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Romance,Comedy,Crossdressing"],"nutshell":"A 1978 Takahashi Rumiko doujin from her college days. Written under the \"Kemo Kobiru\" pseudonym and released in the Bibitto doujin series."},{"name":" Boku no Tsukuru Sekai","avatar":"https://mangadex.org/covers/51b73469-5d16-4490-8e11-9e72ba51111d/4e75d15e-cb24-4e65-931d-cb04fd01cc0e.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,School Life,Fantasy"],"nutshell":"This isn't an ordinary high school—these kids have magical powers! Having the ability to cast a four-dimensional image can bring you fame and fortune, but you've got to be good at it. And that's what goes on every day in this school for \"Projectionists.\" Some, of course, have an easier time at it than others. And sometimes having magical powers just gets in the way of the usual concerns that complicate a teenager's life. This complete in one-volume collection features stories that focus on different members of the student body. Step into this multi-dimensional world with these magical kids and see how each student deals with his or her special gifts! —CMX\nContents:\n\nThe Sky That Enchants You\nLast Platonic Blue\nLittle Girl's Close Game\nThe World I Create\nSummer Vacation (Bonus Manga)"},{"name":" Tada no Doukyonin da to Omoitai","avatar":"https://mangadex.org/covers/51b8c042-d94c-4fbe-a1f2-0ce7798e5148/8623fba5-8f01-44d4-bf81-e5461d020406.png.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Oneshot,Romance,Comedy,Office Workers,Slice of Life"],"nutshell":"The sudden reunion of childhood friends. Office lady Kanzaki Makoto and temporary healing companion Asano Wataru. The start of a perfect cohabitation situation!"},{"name":" Furikaette Mite Mireba?","avatar":"https://mangadex.org/covers/51bd7fc4-2724-4986-b1d2-5ebb591bc07d/29cdb3db-9b0b-4d5b-8508-2a462a3ea7c3.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"Two university students are renting a friend's old dorm room to couples for making out. One is a notorious playboy that had never been in love. The other one tends to get attached to his girlfriends so much that he always gets dumped in the end."},{"name":" Kao ni denai Kashiwada-san to Kao ni deru Ota-kun","avatar":"https://mangadex.org/covers/51c1e7cc-23f4-4a08-a961-c1ab75e2bb33/d717c14a-322f-4c29-8677-169f69da4a0d.jpg.256.jpg","country":"Japanese","stat":"8.56","status":"Ongoing","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"Meet Kashiwada-san, a female middle-school student, who remains emotionless regardless of how she is meddled with.\nAnd Oota-kun, unable to control his facial expressions, is the complete opposite of Kashiwada-san–but he keeps messing with her, against his better judgment?!\nThough the two of them are the exact opposite, will a mutual love eventually develop between them…?\n\nLinks:\n\nOfficial Korean Translation"},{"name":" Niwatori no Umi","avatar":"https://mangadex.org/covers/51c30924-463f-4fb7-8ccf-4e1f6c5b18d1/317a7813-3c6c-41f3-9898-b09704c721fe.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Oneshot,Historical,Action,Comedy,Samurai,Magic,Supernatural"],"nutshell":"A cock-a-doodle-doo rings out in an era of peace! The traditional-style fantasy tale of a witch, a masterless samurai, and a chicken! 49-page oneshot! (Published in Shonen Jump GIGA 2017 Vol. 1.)"},{"name":" Blind Love","avatar":"https://mangadex.org/covers/51c35b03-1d2d-4b01-a433-666f041a51dd/cf69c3d8-54eb-4bd3-9982-ce65a057d2de.png.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"Shou, the son of a gang member, became the right hand man of Taiki, the gang leader's son. On the way back from his high school entrance celebration, Shou runs into his long-time crush, Kunie, Taiki's cousin. Shou goes to Kunie's home on his request, but once there, Kunie asks him to become his. Shou refuses because of his allegiance to Taiki, but Kunie drugs Shou's drink and takes advantage of him!"},{"name":" I'm A Heavy Drinker and All I Want Right Now Is To Pretend I’m Drunk and Be Held","avatar":"https://mangadex.org/covers/51d3b92b-c729-40fe-a430-3b3d7e59ec57/a078da68-0f38-4832-bc8f-3fc4a8e7c71d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":[""],"nutshell":"\"Can I do more than just kiss you?\" Pushing up your hips like you're nasty and blending in like you're perfectly sucking it... It's the first time I've ever had such pleasant sex! Suzu Yagami works in an office and enjoys alcohol more than three meals a day. A miraculous reunion with handsome Naoe-kun, who met his eyes at the bar where he was entertained! We hit it off and toasted with beer and edamame at an izakaya. We share the same taste for alcohol, and it's really fun to talk to her. If you hug me and say, \"I don't want to go home like this,\" this is destiny! ―― However, he has a \"certain circumstance\"... This love has to end..."},{"name":" Azur Lane - Spare Time (Doujinshi)","avatar":"https://mangadex.org/covers/51d455dd-b8c6-42db-bb82-f85aa08ef58f/4245341f-2848-4220-814b-91b8e09fcc3a.jpg.256.jpg","country":"Japanese","stat":"8.21","status":"Ongoing","tags":["Comedy,4-Koma,Web Comic,Slice of Life,Full Color"],"nutshell":"A fanmade weekly 4-panel manga series by Take Nekonetoru based on Azur Lane. This series offers a Slice of Life side of the KAN-SEN where everyone is casually interacting with each other, except for some.\nTake Nekonetoru's Twitter:\nhttps://twitter.com/tk_nkntr\nTake Nekonetoru's Pixiv:\nhttps://www.pixiv.net/en/users/50304618\nNekonetoru (The Artist's Circle)'s DLsite:\nhttps://www.dlsite.com/maniax/circle/profile/=/maker_id/RG32795.html\nTake Nekonetoru's Skeb:\nhttps://skeb.jp/@tk_nkntr"},{"name":" Hitorigurashi no OL wo Egakimashita","avatar":"https://mangadex.org/covers/51d5995e-275b-45ba-9b2a-8b59e489de71/d02f7759-5f57-467f-bf87-fbe3015be810.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Office Workers,Slice of Life,Full Color"],"nutshell":"The life of a Japanese salaryman or OL (office lady) can be a thoroughly depressing one. Waking up early, working all day, staying out late for (mandatory) drinks with clients and coworkers, and then catching a few hours of sleep if you’re lucky, only to repeat it again and again and again.\nThis is the story of a \"Single OL\" and her pitiful lifestyle.\nAuthor's Twitter."},{"name":" Vinegirl: Mercy Killing","avatar":"https://mangadex.org/covers/51d8e9a5-de8e-4180-bd03-df5727da91f2/5c9d5128-955c-4989-ac98-0f630bbc6038.png.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Thriller,Action,Long Strip,Drama,Horror,Fantasy,Web Comic,Supernatural,Mystery,Tragedy"],"nutshell":"Qiao An le was tortured and killed by the supernatural girl group KAK. By coincidence, she was transformed into a plant,changed her appearance, and became the supernatural person who controls the vines. Facing the tragedy of family destruction, she vowed to avenge herself and her family from the group of supernatural sisters!"},{"name":" Katekyo Hitman Reborn! - That's Tough Luck! (Doujinshi)","avatar":"https://mangadex.org/covers/51d9cbb0-1443-4a1c-864f-871e464c52d7/26865b78-6788-4235-9bc5-58fd584de640.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Oneshot,Boys' Love"],"nutshell":"Pairing: Yamamoto x Hibari - TYL! 8018"},{"name":" Para-Dice","avatar":"https://mangadex.org/covers/51dc5684-ec31-4911-ad6b-83f2e2f6f84e/1fd336f0-54ad-4550-afa5-ce5c0d44e9d4.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Romance,Comedy,School Life,Supernatural"],"nutshell":"Saikawa Rai was known as the Goddess of Luck throughout her school and nobody knew what the source of her luck was. Hanabusa Mitsuru confesses his love to her and finds out the source of her luck… Dice.\nWikipedia"},{"name":" Harry Potter - Kodomo Century (Doujinshi)","avatar":"https://mangadex.org/covers/51dd6940-5589-45ed-b98a-37961a21a2f5/ac0e350d-d9ba-4987-a1a1-0e239fed42c5.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Comedy,School Life,Fantasy"],"nutshell":"A Harry Potter doujinshi."},{"name":" Terebi Bakari Miteru to Baka ni Naru","avatar":"https://mangadex.org/covers/51dde4ad-3431-4a57-8ebe-99c1691fdf6a/37699dde-c788-4056-b735-bf11c51c9623.jpg.256.jpg","country":"Japanese","stat":"7.50","status":"Completed","tags":["Psychological,Anthology"],"nutshell":"The title story \"Terebi Bakari Miteru to Baka ni Naru\" (\"Watching TV All The Time Makes You Stupid\") is about a hikikomori, a man trying to help her with her situation and another man taking advantage of said situation.\nThis anthology also contains 7 other short stories;\n\n\"Nayamanai\" (なやまない)\n\"Hidoi Yatsura wa Minagoroshi\" (ひどいやつらは皆殺し, \"Their Terrible Massacre\")\n\"Hidoi Yatsura wa Minagoroshi 2\"\n\"Kisaku na Anoko\" (きさくなあのこ)\n\"Mikata\" (「味方」, \"Friend\" / \"Ally\")\n\"Benri na Doraibu\" (便利なドライブ, \"The Convenient Drive\")\n\"Oyogu\" (泳ぐ, \"Swimming\")"},{"name":" That Inferior Knight, Lv. 999","avatar":"https://mangadex.org/covers/51dfc353-4047-4e56-986c-eee230c15981/21aa3bfb-66a8-43de-9e36-41cd1b7f7821.jpg.256.jpg","country":"Japanese","stat":"5.99","status":"Ongoing","tags":["Action,Comedy,Martial Arts,Adventure,Magic,Fantasy,Adaptation"],"nutshell":"Due to his misunderstandings, he makes both enemies and allies angry! The supposedly weakest boy who mastered martial arts and magic, the world shakes his misunderstanding!? \"Hmm…I have no talent.\"… is what Yuan grew up in the mountains thinking. He's a normal kind-hearted boy, but of the unusual things about him, is that his parents are a sage and a master martial artist. In other words, the world's strongest. Since Yuan was told he was the weakest, he leaves home to make his dreams of becoming a knight come true. \"Eh!? Is it really possible to be defeated with a mere finger-flick by an 8-year-old kid?\" \"You heard the hero was the weakest member? You'd have to be out of your mind to fight that!\" \"Armies of Angels? You mean the harmful birds? I'll just remove them altogether!\"\nNow, the boy who sees dragons as just lizards you can eat regularly thinks (I am weak. I'll have to get even stronger or else I'll never become a noble knight), will he ever be free from his misconceptions!?\n\nJapanese Web Novel: syosetu"},{"name":" The Disappearing Classroom","avatar":"https://mangadex.org/covers/51e2113a-6d92-4922-858f-352b11224fe5/790f409e-21d8-4b1a-866e-4e86b550284e.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.04","status":"Ongoing","tags":["Long Strip,Adventure,School Life,Horror,Web Comic,Full Color"],"nutshell":"There is a classroom in the school. No one except me can see it and I accidently entered it one night…After that I have to study in that class with my ghost classmates and ghost teacher who all died in a fire. Why didn’t they go reincarnation but choose to stay in the school? What’s the secret behind the ghost girl that is pregnant? I have to find out truth…"},{"name":" Shingeki no Kyojin - Utsukushiki Kimi no Tame no Aria (Doujinshi)","avatar":"https://mangadex.org/covers/51e31bd3-958d-4550-8cd5-b82d1f23d9c9/e51bd91f-278c-44d7-81ae-e42461e7ea35.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Boys' Love,Supernatural"],"nutshell":"Pairing: Erwin x Levi"}]