[{"name":" Miracle Wanda","avatar":"https://mangadex.org/covers/6c782a87-bdac-4810-a43a-f3112ef78491/72fe5ec6-89f2-4393-817b-3afb88b436bf.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sci-Fi,Comedy,Mecha,Adventure,Fantasy,Adaptation"],"nutshell":"In a world where every event was computer programs, mysterious monsters known as \"Promin\" maintain the world. However, many Promins have corrupted into bugs known as \"Bugmin\" like real-life viruses and bugs. Left alone, they may eventually turn into a big problem. The boy Yuuto, with Wanda, and the pair use a camera-like device and essential items to capture Bugmin. Promin themselves can do things like \"accelerate,\" \"spew fire,\" or \"create,\" through an ability known as \"Kamiwaza\" (miracle), and can fend off Bugmin with it. At first, the Bugmin only cause little, bothersome things, but it will soon elevate into a global scale threat. Can one boy and one dog save the world?"},{"name":" Near Equal","avatar":"https://mangadex.org/covers/6c7833c5-beb1-4801-9de4-ee60adeb52d1/22c7170b-3122-4b2c-a88c-aa7ef16b46ab.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Comedy,4-Koma,Slice of Life,Supernatural"],"nutshell":"Tsubaki is her school's most proficient student, is polite, and is absolutely good at everything, and little by little, people are hailing her to be the school's queen…. And she absolutely despises that. She quietly admits to herself that being a \"perfect student\" is not her real personality, but a clever ruse to become a more likable person.\nShe is, however, still not able to interact normally with students and thus is dissatisfied–a fact that prompts her to follow the advice of a magazine on finding happiness: the magazine states that by meeting your doppelganger, you will achieve long-lasting happiness. Determined, Tsubaki follows the instructions in the magazine and opens up a door that will allow her to meet her doppelganger….\n…And the one she meets at the other side of the world is not who she was expecting…. Well, it is someone who is strangely identical to her when it comes down to it, but it is also essentially different."},{"name":" Your Turn to Die: Death Game by Majority","avatar":"https://mangadex.org/covers/6c7d3ff8-fef3-42af-a033-d82de930fca3/28456295-8bb1-48ca-bd4d-16f05572753b.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Ongoing","tags":["Survival,Horror,Adaptation"],"nutshell":"Based on a popular game from Niconico.\nSara Chidouin returns home from school late one night to discover that something's gone terribly wrong.\nWhen she comes to, she finds herself, her friend Joe, and 9 other people trapped in a mysterious place.\nPlaced in life-and-death situations, they must come to an agreement about what they should do - and who should die.\nLink to the original game. (Free, translated to english, and can be played in browser)\n\nYour Turn to Die (English Translation)"},{"name":" Wakabaka-sama","avatar":"https://mangadex.org/covers/6c7df5df-8be7-482b-aed9-7ea8a48bf7b8/41363a68-1900-4965-9675-5c8503e9e7c6.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Comedy"],"nutshell":"A fool may be a fool, but this idiot is different from other idiots. After all, this fool is the sergeant of the Great Phoenix Castle and its large castle town, and his legitimate name is Wakabaka-sama (Young stupid lord)! With the involvement of Grandpa, Grandma, Grandpa's father, Grandma's mother, and even Kurihime-chan from the castle next door, the Phoenix castle is in full clamor even today!"},{"name":" The Winning Actor Wants Divorce","avatar":"https://mangadex.org/covers/6c860005-a870-4d3e-a065-2d09e45a485a/297affd1-4675-4c37-b3c6-585ed2fe8aa0.png.256.jpg","country":"Chinese (Simplified)","stat":"7.95","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Web Comic,Slice of Life,Full Color"],"nutshell":"[ Phoebe Scans ]\nI thought that losing your memory was bad enough.\nDidn’t think that after 7 years of marriage, my husband wants to divorce me.\nGu Qingyang states \" If you want to, then do it.\" I forgot everything anyway, I can always find another one if you leave.\nHe’s just a wild horse on an open field, loose with endless freedom.\nJiang Zhong was invited by the media to attend a meeting. The reporter asked, \" if you don’t want to start a company, what is it that you want to do?\"\nJiang Yizhen replied, \"A horse tamer.\""},{"name":" Satsuma Gishiden: The Legend Of The Satsuma Samurai","avatar":"https://mangadex.org/covers/6c885c78-e282-4392-965b-58231809a29d/0809be13-51b4-459e-9f29-0a3fb9d900c9.png.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Historical,Action,Martial Arts,Samurai,Drama"],"nutshell":"Japan's samurai past is riddled with stories of great fighting prowess and deeply ingrained systems of honor and discipline. But behind the stern demeanor was a society coming apart at the seams. Clashes in class systems and the need for a nation to come together threaten to break up the old ways of warring samurai–these are tales of such struggles. This is the story of Japan's history, and the beginning of the end of the samurai era."},{"name":" 5 Cats","avatar":"https://mangadex.org/covers/6c894f65-57eb-4ea0-9aeb-eda31322238d/eae011c8-1b30-4c3c-b4c4-2f380596e3a1.png.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Fantasy"],"nutshell":"In the space between the magical world and the human world, there is a cafe called 5 CATS, which is a meeting place for the residents of the magical world. After a series of events which lead to him helping out at the cafe, ordinary high school student Kei is inspired to become an apprentice magician himself."},{"name":" Ni Ming Shi","avatar":"https://mangadex.org/covers/6c8f73ff-330b-4202-ac6d-75736131e2af/d4bde280-0dfe-4816-a9df-d8af1b1b9718.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.99","status":"Hiatus","tags":["Historical,Action,Martial Arts,Adventure,Fantasy"],"nutshell":"A blind person known as Ni Ming Shi was ambushed by Imperial Guards while traveling through the Bamboo Forest. While they almost managed to fool the Imperial Guards their identity was unfortunately exposed by the commander. Now with their life on the line, what kind of fate awaits Ni Ming Shi?\n(Credit: OSTNT)"},{"name":" Love Live! - Little By Little (Doujinshi)","avatar":"https://mangadex.org/covers/6c925eeb-3580-4413-a9a3-acefaf4a414a/1831c2d6-97aa-42c6-a67f-4dfe79c297a3.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":""},{"name":" Harem Days","avatar":"https://mangadex.org/covers/6c9a1bc1-3a72-4d9d-82e9-cf8d2c13dc3d/20d29351-841e-41c4-863a-165f559d1207.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Romance,Comedy,Boys' Love"],"nutshell":"Harem Days\nMadoka Mitsuru (Enman to his coworkers) is a rough ex-yankee, so he's not really sure how he got a job at a prestigious company. He works in \"the harem\", the name of the gofer department because of all the attractive ladies, under Chief Suzunari, a cheery middle-aged man who doesn't understand the meaning of personal space!\n\n\nHareta Yoru no Hikari\nMedical intern Chikada Tomoharu is always being called a \"nice guy\", especially when he's being dumped. When his lover dumps him by email, text message, and he's roughed up by the yakuza outside his apartment building he's having the worst day ever. Building caretaker Fukiage Tatsuru scares the gang off, and he and Chikada become friends. But does Tatsuru only see him as a \"nice guy\" too?\n\n\nItsuka no Himitsu\nIt's been ten years since Yuuya was home. That was the last time he faced Asato, the blind neighbor he's always had a crush on. He's spent the time trying to forget the one night he acted on those feelings. But he's been fired and evicted; with no place to go he returns to his childhood home and the man he's never forgotten.\n\n\nMy Secret: Itsuka no Himitsu bonus"},{"name":" The Subway Dog","avatar":"https://mangadex.org/covers/6c9baa31-0c36-4faf-91c5-06a2b15180f9/3bc4908d-17e0-4506-83c5-1c4cc5af64ea.jpg.256.jpg","country":"Japanese","stat":"7.68","status":"Completed","tags":["Animals,Romance,Boys' Love,Slice of Life"],"nutshell":"Shinoda is still reeling from the sudden separation from his wife when one evening he's lured into a peculiar little shop by the smell of coffee. There, Asukura, the shop's proprietor, converses with him about the beauty and usefulness of broken things. Despite himself, Shinoda keeps coming back for coffee… and conversation."},{"name":" A Close Call Romance","avatar":"https://mangadex.org/covers/6ca0fdac-1ec0-4f10-8c0e-427bb88980f0/177a5fb5-7640-49a4-b10d-690b054bd9d1.jpg.256.jpg","country":"Korean","stat":"8.01","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Survival,Office Workers,Drama,Medical,Web Comic,Mystery,Adaptation,Full Color"],"nutshell":"An obscure actress named Kim Eun-hong, who alternates between minor roles and extras.\nOn her way home drunk after being dumped by her boyfriend of nine years, Kim Eun-Hong became involved in an accident with Lee Kang-il, the CEO of LJ Pharmaceutical.\nBut then Kang-il suddenly asks me to act like his fiancée. You’re giving me a billion won just for getting engaged? Why me?\n“I can’t live without Kim Eun-hong.”\nI’m pretending to be his fake fiancée to avoid being thrown into jail…\nCan Eun-hong be reborn as a veiled French girl with a gold spoon? And will she be able to keep her contract with Kang-il, who harbors a lot of secrets?\nA man who dies if he’s not confident?! And Eun-hong’s life-threatening (?) romance act for him!"},{"name":" EX-ARM EXA","avatar":"https://mangadex.org/covers/6ca30e11-a79d-40f4-994e-5b659de00016/2b0b672a-a445-4fd4-9ac1-a4d2cbaae640.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Sci-Fi,Action,Mecha,Crime,Drama,Police"],"nutshell":"Matsuri Amamori, a newbie policewoman, is just doing her daily job when she suddenly encounters the renowned terrorist who destroyed Tokyo, ||Akira Natsume||"},{"name":" Hana Furu Futari","avatar":"https://mangadex.org/covers/6ca6f597-b4f6-4ab8-bc89-884651d763ff/0b9eee79-7fcb-4565-8e4c-14f3be3b7063.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Official English by Renta! (February 2022)\nMinakami is a successful man tormented by his past.  When he meets Kakuta, an upright colleague with a strong sense of justice, he uses his secret to lure Kakuta into his embrace.  But Fate turns the past that haunts him into a catalyst that brings them closer together."},{"name":" The Human World is Hell","avatar":"https://mangadex.org/covers/6ca7089b-4049-491d-bd1b-594abc019986/3e004c8d-342f-4487-9a3d-e7bd01ad0a78.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Oneshot,Animals,Comedy,Web Comic,Slice of Life,Tragedy"],"nutshell":""},{"name":" High School Girl X Dragon","avatar":"https://mangadex.org/covers/6cbf4a54-fa56-4458-aaf4-707d9b556c81/12278830-505b-47c7-a5b4-208340bfed71.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Ongoing","tags":["Long Strip,Comedy,Fantasy,Slice of Life"],"nutshell":"A light-hearted slice of life about a high school girl and her new friend, a dragon."},{"name":" Love Disasters of a Meddlesome Girl","avatar":"https://mangadex.org/covers/6cc14b57-500e-42ff-9753-3f02ac0cf9b4/15a3b5e0-6167-4f14-8ae9-33f30108f1fa.jpg.256.jpg","country":"Japanese","stat":"7.26","status":"Completed","tags":["Romance,Comedy,Girls' Love,School Life,Web Comic"],"nutshell":"A meddlesome girl, Setsuko, tries to speed along the painfully slow progress of the relationship between her two childhood friends, Yusuke and Saori. Problem is, they like someone else… A LOT!!!"},{"name":" Dragon Ego","avatar":"https://mangadex.org/covers/f27d2f93-577f-497d-8e96-80278bf93618/0e914b4a-47ac-4411-8ca7-e392887f033e.jpg.256.jpg","country":"Korean","stat":"7.60","status":"Ongoing","tags":["Official Colored,Action,Long Strip,Adventure,Fantasy,Full Color"],"nutshell":"World's most popular MMORPG, \"Hidden Ego\"… One day, the dragon named \"Ignis\", who was nothing more than a monster, becomes self-aware. And her brother \"Tafras\" is raided by the strongest guild, composed of 6 top-rankers. After Tafras' defeat, he's divided into 6 items, which is taken by each of the 6 guild members. And Ignis must defeat them all and unite those items in order to resurrect her brother! This is the story of a game monster's vengeance – Dragon Ego! genre: webtoon; shounen publisher: FANSIA reader age group: All story & art by Takoongi"},{"name":" NEO: The World Ends with You","avatar":"https://mangadex.org/covers/f27db797-3d16-40a0-89c6-2741391db7ba/ed1def8a-288a-4049-96fb-2114f90038f7.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Action,Comedy,Adventure,Video Games,Magic,Cooking,Supernatural,Mystery,Adaptation"],"nutshell":"Comicalization of the Nintendo Switch/Playstation 4/PC video game \"NEO: The World Ends with You\"!\nRindo, a high school student, becomes a participant in the \"Reapers' Game\" where he will be erased if he fails to beat it. He gains the ability to rewind time and return to the past and manages to complete the missions smoothly, but...?\nManga: Amano Shiro\nCharacter Design: Nomura Tetsuya/Kobayashi Gen/Yamashita Miki\n(source: Gangan Online)"},{"name":" Kotonoha","avatar":"https://mangadex.org/covers/f2803978-d999-4c98-8e77-cfbfbdb903d8/6ae824c4-2436-40f8-82bb-a055cf38b26d.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Girls' Love"],"nutshell":"When Fujita was in high school, she had but one romantic encounter – and it was with another girl. It happened one day when they ended up kissing. However, somewhere inside her, she knew a girl kissing another girl was wrong, so she chose to remain as just friends. Even when graduation came, she could not confess her feelings, and so the two girls split ways. Five years later, Fujita still thinks back to that romantic encounter. Meanwhile at work, due to one of her colleagues going on maternity leave, a new designer is brought into the company… and who does that designer turn out to be? None other than her high school crush!"},{"name":" My Heart Within Yours","avatar":"https://mangadex.org/covers/f28130f5-06c5-4841-bed7-1f774878c25c/6d5a05a3-7273-478b-8785-e74791c40919.png.256.jpg","country":"Chinese (Simplified)","stat":"8.07","status":"Completed","tags":["Historical,Romance,Drama"],"nutshell":"The only male of the Siyou clan has finally found another partner to call his own. They settle together in their own home, learning to manage the household and care for their child. A love story filled with intimacy that also focuses on the responsibility that comes with romance"},{"name":" Pen Saki ni Syrup","avatar":"https://mangadex.org/covers/f28ef7a6-7ecd-4a94-a604-e5286952ef60/274fddf5-e3b4-49c1-852e-503814e4e476.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance"],"nutshell":"Our hero is a high school boy who is also a mangaka. A handsome mangaka! A hard worker mangaka! And he attends a famous school for mangaka! He also always finishes his work before the deadline!\nOur heroine is a clumsy editor. She’s always doing her best but she’s still an idiot. She never finishes her work before the deadline and makes mistakes in the number of pages.\nSo what will happen when the two of them meet…?"},{"name":" Sea God's Law of Love","avatar":"https://mangadex.org/covers/f290593c-30cb-4205-8a6c-30109799eae8/368b03b2-f3d0-429f-9c81-b7ad72925740.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Ongoing","tags":["Historical,Long Strip,Romance,Isekai,Drama,Fantasy,Full Color"],"nutshell":"After transmigrating to the modern age and being an idol for 3 years, Ophelia, the Princess of the Nariel Empire, wakes up and finds that she has returned to her original world, but she has become a player Sea God! The gentle and lovely Holy Saint, the healthy and bright Paladin, and even the rich second generation playboy have all become a fish in her fish pond! She didn't even let go of her own second brother! However, her first love, Holst, is distancing from her, and it seems that her transmigration may very well be a well-designed conspiracy..."},{"name":" Wish We Were","avatar":"https://mangadex.org/covers/f295f3d1-03d0-4da9-9fde-1c1a53f43381/b1a4c0f6-2c60-4217-bac5-599aaed4e368.jpg.256.jpg","country":"English","stat":"8.10","status":"Hiatus","tags":["Romance,Girls' Love,Web Comic,Full Color"],"nutshell":"Sólo el día a día."},{"name":" Shindere Shoujo to Kodoku na Shinigami","avatar":"https://mangadex.org/covers/f29f2c48-af07-4c14-bc79-151fa430fbb3/1ca945ea-6ab3-4548-9158-392e0426e74a.jpg.256.jpg","country":"Japanese","stat":"8.21","status":"Completed","tags":["Psychological,Romance,Comedy,Drama,School Life,Supernatural,Mystery,Tragedy"],"nutshell":"The heroine, Akira, a 2nd year middle school student, lives on an island that being peaceful is its only feature.\nEveryone in her class are her childhood friends. they were thinking that this year too like the other years would be a peaceful year with the usual classmates.\nBut at a time like this a transfer student called “Matsushirou Nishigami” appears, saying: “Anyone who gets close to me dies”.\nWhat is the true meaning of his words…?!\nNote: The author died before completing this work."},{"name":" Adeotoko Shichihenge","avatar":"https://mangadex.org/covers/f2a3a303-088a-40a0-91e6-0a77491fa0b1/a0bd05f1-1df4-40c0-9ab0-dc96a999cd55.png.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,School Life"],"nutshell":"Misono has a secret… she's a yakuza's daughter! In order to cover up her background, she has attended a famous private school with her seemingly \"plain\" assistant/boyfriend Yuuki. Although they are lovers, things are going nowhere in their relationship, how can Misono take the relationship to the next level when her boyfriend acts too much like a servant?"},{"name":" Yume Nikki Indification Project","avatar":"https://mangadex.org/covers/f2a48b26-1297-487b-82f5-657e0cadc151/b0be57a9-a0fd-458e-8c02-cad6911d35f5.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Oneshot,Psychological,Comedy,Video Games,Fantasy,Cooking,Supernatural"],"nutshell":"Madotsuki is looking out on her balcony, delaying the time for dropping the effects in the Nexus. She then hears a child ask her mother what's for dinner. She then decides to cook curry with the rest of the dream dwellers."},{"name":" Shima Shima Hanako","avatar":"https://mangadex.org/covers/f2a61896-4363-489b-abc9-39436e1538ac/2d831ce5-1f71-4c81-8779-2d2f14864ae5.png.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Comedy,School Life,Slice of Life"],"nutshell":"Fu Yamanaka is a high school girl. She lives with “Uncle,” who runs the “Shima Shima” coffee shop. One day, an adorable girl falls from the sky right in front of their shop! The girl, whose name is Hana, is a fox who was saved in the mountains, and she’s here to repay that act of kindness. Along with her watchdog Tsugo, the two girls begin their adorable and carefree days together! This sweet comedy about repaying kindness will warm your heart!"},{"name":" Goddamn","avatar":"https://mangadex.org/covers/f2a65134-6ec7-4ea9-88b2-32193d5dcb29/ec0f83d9-2525-4d11-bfe0-0226f9d7b780.png.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Comedy,Survival,Sports,Adventure"],"nutshell":"Gen Todoroki, a talented but accident-prone rally driver, gets offered a contract deal from a big-shot car company\nand the deal comes with a chance to prove himself in the world of rally racing.\nHowever, the road there is bumpy and rife with tough competitors..."},{"name":" Fight no Akatsuki","avatar":"https://mangadex.org/covers/f2aef7a7-479f-4ed9-8f13-857c20eb17de/e8e83e90-7c68-41cf-8806-cb435cb1a54d.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Comedy,Sports,School Life"],"nutshell":"Akatsuki and his good friend Kiyoharu (called Kiyo-chan by Akatsuki) have been playing 'two player' basketball for quite sometime. Unfortunately, things started to change after they have joined in a very strong basketball team in their new school. Both of them were forced to separate into two groups: Kiyoharu was in the 'B' group and poor Akatsuki was put under 'F' group, which is known as the 'Failure' group. However, Akatsuki was not discouraged at all. He continues to train hard and always has a smile on his face. Will Akatsuki succeeded in his promise to Kiyoharu to become an official player? And what is blocking the path towards reaching his goal?"},{"name":" The Right-Eyed World","avatar":"https://mangadex.org/covers/f2b941b2-74f6-43ad-ad70-669e4c71b4b3/0fb0baf6-d3ce-4ab5-bab7-d0bab876270a.jpg.256.jpg","country":"Korean","stat":"8.15","status":"Ongoing","tags":["Sci-Fi,Psychological,Long Strip,Drama,School Life,Web Comic,Full Color"],"nutshell":"\"Human beings must be happy no matter what\"\nA society where emotions are controlled by a chip. and hackers that can hack the chips to make the people hallucinate.\nThe survival of Ah-Yeon, a white hacker who suffers from depression in a world where negative emotions are forbidden.\nArtist's Twitter\n\nOfficial Chinese Translation"},{"name":" Love Live! - June 9 (Doujinshi)","avatar":"https://mangadex.org/covers/f2ca5503-1167-4437-b0df-56d424bb0b83/a7ae232b-bd12-45b7-86d8-8d61ec8fbbd1.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":[""],"nutshell":"In which Nozomi gets to enjoy her birthday with the people she loves the most.\n{ Nozomi }\nWith permission from the author! Only got told to include the original name and URL but here's a few more links:\nSource: https://www.pixiv.net/en/artworks/69136416\nArtist's pixiv: https://www.pixiv.net/en/users/30210951\nArtist's twitter: https://twitter.com/azrr_yuri"}]