[{"name":" Really? Really! - Remember Memories","avatar":"https://mangadex.org/covers/133efef4-e111-48fd-90af-52fe7e1a82c2/492722ad-ac1a-4581-be81-5ca44adb976b.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Romance,Comedy"],"nutshell":"Kaede loses her memory so Rin and friends must help her recover them! Phoenix Wright style!\nRin and Kaede's childhood friend, Sakura returns and a new love triangle begins."},{"name":" Hyakujitsu no Bara - Halloween Special (Doujinshi)","avatar":"https://mangadex.org/covers/13490245-7beb-45bb-9485-bebb4eee9c70/3bbbc41a-09c4-4c42-bd3a-e426e7f9d9e8.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Comedy,Boys' Love"],"nutshell":"Pairing: Klaus x Taki\nTaki Reizen is reborn as a vampire and attacks Klaus and sucks his blood. Lots of OOC moments and comedy.\nContains:\n~ Halloween Special I (2008)\nThe first of the AU vampire Taki series. Klaus meets a baby vampire who turns him into a Sacrifice.\n~ Halloween Special II (2008)\nTaki makes Klaus have a sexy dream.\n~ Halloween Night (2009)\nOn the night of Halloween, Taki takes Klaus to see his family.\n~ Halloween Special I (2010)\nVampire Taki is on a mission to stamp out evil in a nearby castle… Which turns out to be a love hotel.\n~ Halloween Special II - Evil Castle (2010)\nKlaus has Taki trapped in the S&M room of the love hotel! Then things begin to get strange…"},{"name":" Ojōsama wa Oshioki ga Suki","avatar":"https://mangadex.org/covers/134f3945-cab8-4b64-91c8-5231e2b739a7/d71b8af1-9d2e-49e0-a1ed-cfa2878ea055.png.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Romance"],"nutshell":"Momo is a young student who welcomes her private teacher, Natsuki-kun, in her home every day. She is in love with her teacher. As handsome as he is strict, his methods are questionable to say the least, and whenever Momo makes a mistake in her homework, he spanks her! But for Momo, what should be a punishment turns out to be a source of pleasure..."},{"name":" BanG Dream! - Day to Day Fairy Tale (Doujinshi)","avatar":"https://mangadex.org/covers/13514153-7405-42e9-adaa-3e759d27e884/654b2d2b-1978-4564-bea7-c249311b4f09.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":"Link:\nThe Doujinshi & Manga Lexicon"},{"name":" Touhou - Azayakanarishi wa Tasogare no (Doujinshi)","avatar":"https://mangadex.org/covers/13539f82-24f7-43f5-82f2-d69abb5e58f2/f5a98ea7-473e-450b-81e0-c7f510646b59.png.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Oneshot"],"nutshell":""},{"name":" The Taming of the Shrew","avatar":"https://mangadex.org/covers/1356756d-33c5-4b52-bc53-2e4c36886d47/db85043c-a1d7-41b7-b2c9-b4e863313150.jpg.256.jpg","country":"Korean","stat":"8.57","status":"Completed","tags":["Historical,Long Strip,Romance,Comedy,Drama,Web Comic,Adaptation,Full Color"],"nutshell":"A playboy named Petruchio accepts a request to seduce the unfriendly Katherina…?\nThis webtoon is based on Shakespeare's comedy play, \"The Taming of the Shrew\"."},{"name":" Suginami-ku Isekai Dungeon Kouryaku-ka","avatar":"https://mangadex.org/covers/135c4b2f-b168-4558-bd5e-32d30fa1cd95/b1c50112-1bf1-4a82-94d8-27b04caf9bb5.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Action,Adventure"],"nutshell":""},{"name":" The Cloud that became Rain","avatar":"https://mangadex.org/covers/1365739c-f6da-41bd-9de9-c8dbbe5e75de/ec2d5245-fe1c-4f6a-8202-f3745152d93b.jpg.256.jpg","country":"English","stat":"7.53","status":"Ongoing","tags":["Reincarnation,Historical,Action,Demons,Ghosts,Long Strip,Romance,Ninja,Boys' Love,Martial Arts,Samurai,Adventure,User Created,Military,Wuxia,Drama,Fantasy,Web Comic,Supernatural,Full Color,Tragedy"],"nutshell":"Sometimes, not even reincarnation is enough to get the blood off your hands. A love blossoming between an emperor and a former child soldier comes to a tragic end during a merciless war. However 400 Years later the soldier is reincarnated with faint memories of his past life, and sets out to uncover the mysteries surrounding the fate of his long dead love. Along the way he is accompanied by a mysterious man who seems to know a little bit more than he lets on."},{"name":" Miho to Yuko","avatar":"https://mangadex.org/covers/1366cfd7-49d2-4b81-8a37-cffe9aab64d3/408460d6-1b21-4e48-a1c1-6c6d4a5e2001.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"Miho and Yuko are complete opposites, but they’re the best of friends. They fall in love with people together, they worry together, they cry and laugh and get mad together… They're girls you can find anywhere, but their daily lives, friendships, and romances are just a little bit different. No matter how harsh the world might be, they'll keep strutting on in their heels!"},{"name":" 21 Seiki no Kimi e","avatar":"https://mangadex.org/covers/136903bb-2e2e-4b38-9659-ee63fc2d350e/757587f1-4c7a-4160-9b43-243b3e82de4a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":"Because her parents divorced, she stopped believing in love. While skipping class one day she knocked into Math teacher Takada sensei and accidentally fell from the 4th story.\nAt first she thought she was dead... but it turns out she had actually travelled back 18 years ago?"},{"name":" Yuki to Sumi","avatar":"https://mangadex.org/covers/136c516e-a9dd-411b-93b7-2f5c78be4ae8/d4e3c162-5808-4110-ab06-ef3da0b8bb30.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Cancelled","tags":["Romance,Comedy,School Life"],"nutshell":"Yukino Tachibana is a calligraphy prodigy.\nAt the tender age of 16, she is already one of Japan's most exciting young artists, performing live calligraphy demonstrations to sell-out crowds on worldwide tours.\nWith her refined, beautiful, and mysterious air, she is so popular at her new high school that she has earned the appellation of 'The School Madonna'.\nShe is also as dumb as a post.\nAs artful her brushstrokes, as demure her outward demeanor, the real Yukino Tachibana is far-removed from the image her classmates see on television and in the school hallways - in reality, apart from her calligraphy genius, Yukino is completely useless, rude, and possessing of a distinctly inflated sense of self-worth.\nThere is only one classmate who fails to be fooled by her facade: run-of-the-mill protagonist du jour Tarou Nakamura. Sitting next to her in class, Nakamura doesn't really get why the rest of the school finds her so enthralling - he's much more interested in his crush, Amano-san. But this indifference might prove to be his downfall, as circumstances cause Yukino to set her eyes on him…\nThis boy, this poor, poor boy, is burdened with a Herculean task - to keep Yukino's true nature a secret from the rest of the school, while trying to win the heart of his sweetheart. Can Nakamura really keep this brainless beauty's utter idiocy a secret!? And can he win Amano's heart through the power of calligraphy at the same time!?"},{"name":" Divine Abuse","avatar":"https://mangadex.org/covers/1371d930-a903-4ca3-bf6a-e3b44fc58838/e2e4221e-ebd4-498b-a63c-f762ed16f117.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.05","status":"Ongoing","tags":["Historical,Action,Romance,Adventure,Fantasy"],"nutshell":"As the towns and cities grow, the people who have Ascended to immortals disguise themselves as mortals in the cities, part of them can’t help themselves but to devour humans, but other than these cases showing up in headlines and on the news, there aren’t any other effects.\nBecause of this, monsters and demons are almost extinct, and Gods rarely descend to the mortal realm. In the mortal realm there are Ascended who know the rules of the mortals, but few still disrupt those rules, Gods descend to deal with demons from time to time.\nEven though some Ascended do descend to the mortal realm as they miss the realm, they still do have their own goals to achieve, so the Heavens sends Guardian Gods to return those Ascended, and also to keep them from harming the mortal realm…"},{"name":" Shichifuku Mafia","avatar":"https://mangadex.org/covers/1374ab6c-3a28-4d9a-8535-a58f383b1e44/9475b446-3334-4160-92fd-ebed7ecd6322.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Action,Comedy,Fantasy"],"nutshell":"As a vigilante group loved by the local residents, the Alfano Family spent their days living peacefully. However, ever since the rise of a rival Mafia, dark clouds have been hovering over them.. “Go to your late mother (former Yakuza)’s homeland, Japan, and bring the seven strongest people who were once her subordinates.” Accepting this secret order, Leo heads to Japan. The seven people he seeks for are… The Seven Gods of Fortune that were sealed away in a hanging scroll!"},{"name":" Zeze-kun and Nagahama-san","avatar":"https://mangadex.org/covers/13756621-f70d-4c6f-bb8d-e345ff25e03b/e4bc537d-0502-42dc-bdfa-991ce7a81cd4.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"A rom-com about a couple who smother each other with love and praise."},{"name":" Two Pages Ecchi JPEG","avatar":"https://mangadex.org/covers/1377d9d6-87b9-436a-b9c3-41ceb1632833/d4ecf513-6104-4d6e-bb54-54056b024c08.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Ongoing","tags":["Romance,Incest,Web Comic"],"nutshell":"\"Short and simple ecchi manga\"\nAuthor's Twitter Account\nAuthor's Pixiv Account\nAuthor's Skeb Account"},{"name":" Neverland","avatar":"https://mangadex.org/covers/137ae1db-e741-4096-8caa-97375a2b97a4/78f051fb-3381-4bab-a0b7-d7c7f9e5ba23.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Music"],"nutshell":""},{"name":" Arch Villain","avatar":"/cover-placeholder.jpg","country":"Chinese (Simplified)","stat":"8.07","status":"Ongoing","tags":["Action,Harem,Drama"],"nutshell":"Yin Wudao, seorang pria tampan yang sangat kaya. Karena pencuri Cao, dia disiksa dan dibunuh oleh menantu Raja Naga. Namun, dia secara tidak sengaja memicu Sistem Penjahat Agung tingkat dewa, dan hidupnya dimulai lagi. Karena Anda telah memilih untuk menjadi Penjahat, Anda harus menjadi penjahat terhebat dalam sejarah. Raja Naga, Tabib Ilahi, Dewa Perang, Shura, Master Bela Diri Kuno, Abadi... semua orang jenius yang dipilih oleh surga akan kukirimkan ke neraka!!!! dengan cara itu generasi Raja Penjahat akan segera keluar..."},{"name":" Futari no Polarisu","avatar":"https://mangadex.org/covers/1387848e-532c-4c34-a76f-cdf03f19c26f/eed786a5-2853-4be4-9924-478ccd62b74a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Drama,School Life,Slice of Life"],"nutshell":"Classmates Hikari and Mizuki suddenly became sisters-in-law due to a remarriage between parents. Although they have completely different personalities, and collide with each other, they start to gradually start to become friends."},{"name":" Evil Again","avatar":"https://mangadex.org/covers/138c3987-c9fd-4d04-82dc-736c1b7d409d/04505bc7-70bd-49a1-b665-4d23c59c5c37.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.74","status":"Completed","tags":["Thriller,Psychological,Long Strip,Crime,Web Comic,Mystery,Full Color"],"nutshell":"One rainy morning, in a small church on the outskirts of the city, it was found that Jin Min Jun, the second year of Yingcai High School, was hung on a cross, tortured, and then killed. This technique was used 16 years ago. This happened in the first year after the team leader of an investigation team, Team Leader Zhang, became a policeman, where a chain of serial murders that used these techniques resurfaced, making old criminals nervous."},{"name":" Alice in Mirrorland","avatar":"https://mangadex.org/covers/139081b5-fda2-45b6-bfec-a19ebbcd6bd3/a8db1476-2760-456f-bd6c-c382938b321c.jpg.256.jpg","country":"French","stat":"7.52","status":"Completed","tags":["Oneshot,Psychological,Supernatural,Mystery"],"nutshell":"Alice waits with her mom in an elevator. All the men look at her mom's breasts. Alice doesn't see the reason in it.\nAlthough, for some reason, it doesn't seem right.\nWhile pondering the reason why, she realizes she's in another world just like her namesake in that one story.\nThere, strangely enough, she too has the guys' eyes glued to her, for she was an adult woman just like her mother.\nThis is a French artist guesting in a Japanese publication."},{"name":" Dr. Queen","avatar":"https://mangadex.org/covers/13920f03-fb53-4e13-b239-ca57b67364a2/f8a3cf53-eb4b-48fa-89a7-37ef7a8b3fbb.jpg.256.jpg","country":"Korean","stat":"7.76","status":"Completed","tags":["Long Strip,Romance,Drama,Web Comic,Adaptation,Full Color"],"nutshell":"\"Where do we find any female in this place? I'm non-binary, Doctor!\"\nThe exclusive place of male doctors, Gaya Hospital, especially the orthopedics department. That is the jungle-like place where the only female orthopedic surgeon, Yoon Jisoo lives.\nA graduate of a countryside medical school, not Gaya medical school, female and young age\nDespite suffering in the cruel hell, she does nothing but devotes herself to her patients and makes a harsh living in pressure.\nThe story of a passionate doctor, Yoon Jisoo finding her happiness after she met the iron-hand-in-a-velvet-glove-like man, Yu Kang, who knows how to enjoy life.\n\nOriginal Webtoon (Lezhin)\nOriginal Webtoon (kakao)\nOriginal Webtoon (RidiBooks)\nOriginal Webtoon (BomToon)\nOriginal Webtoon (BookCube)\nOriginal Webtoon (Daum)\nOriginal Webtoon (Naver)"},{"name":" Mahou Tsukai no Reikoku","avatar":"https://mangadex.org/covers/1397b159-fc84-4530-8f8d-d9ba22c2d8bd/773b385f-9a67-4190-bad7-8c9f51cdfe6e.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Romance,Supernatural"],"nutshell":"What would you do if you had the choice of having sex with the person you wanted and erasing all your memories of it or having the memories but not actually doing it? A magazine series drawn with all the delicacy and burning excitement to be expected from Ninomiya Hikaru."},{"name":" Bad Company – Dragon Ball Zdj","avatar":"https://mangadex.org/covers/13a06f36-ad35-48fd-8c63-a97cea330709/90733e2a-a374-4597-81b0-d11be90dfe47.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Boys' Love"],"nutshell":""},{"name":" If I Touch Your Hand","avatar":"https://mangadex.org/covers/13a10dda-2cc6-43d4-9cfe-7b5a51695c2d/f68db501-4730-4393-8d9f-e68074889040.png.256.jpg","country":"Korean","stat":"7.85","status":"Completed","tags":["Ghosts,Long Strip,Comedy,Boys' Love,Web Comic,Full Color"],"nutshell":"\"A story of a ghost and a human told in a sexy and comical way.\"\nFrom the author: This is a manuscript I just put together for a contest. Please don't wait for more uploads. Thanks for reading!"},{"name":" Informal Romance","avatar":"https://mangadex.org/covers/13a325b5-330b-4388-8348-cea0182be261/6cc5d791-9a03-4be9-99e3-af96abd90a0c.jpg.256.jpg","country":"Korean","stat":"7.90","status":"Completed","tags":["Long Strip,Girls' Love,Drama,Slice of Life"],"nutshell":"Informal! And their special love begins"},{"name":" Puri Puri","avatar":"https://mangadex.org/covers/13a5b10a-e26d-4e62-8e26-5438c07cdf19/6fdb9331-dd92-4d7a-8474-5e0d08edb5cc.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Romance,Comedy,Harem,School Life,Supernatural"],"nutshell":"All he ever hoped for was to be one step closer to becoming a priest, but Masato Kamioda gets more than he bargained for when he suddenly finds himself as the only male student in a pilot program at an all-girls divinity school."},{"name":" Yokujou © Max","avatar":"https://mangadex.org/covers/13a9e760-6335-4439-9ce8-73f43223e0cc/dbabe59c-1a0d-4d6e-a994-7d0db3cc8623.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Completed","tags":["Romance,Drama"],"nutshell":"Omori Mio is 17 years old. To help out her desperately poor family, she takes on a part-time job. Then, one night, a boy snatches a kiss from her and offers her money, saying, \"I'll buy you.\" Who is the boy who stole Mio's first kiss…!?"},{"name":" Bokura wa Itsumo","avatar":"https://mangadex.org/covers/13adf99c-bde5-406d-afa7-af6842be2102/cf9cf18c-802a-4e22-a468-9ea7b7b002f9.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"The series is composed of four protagonist.\nNori: An energetic, upbeat girl who was heartbroken sometime ago due to her childhood friend. Now she is headed to meet Haruna, the lonely kid she always played with back then, but to her big surprised grew up into a hunk.\nKyou: The school's prince. From a distinguished family: he is handsome, smart, athletic and rich. He has never struggled for anything in his life, be it money or women. Haruna's sudden return throws him off momentum.\nSaeka: She, Nori and Kyou are childhood friends. She is mature, composed and understands the two quite well. Although beautiful, she has been in love with her teacher since middle school and therefore never gone out with anyone. Will her feelings be answered or will she find an unexpected love around the corner!?\nHaruna: The boy who comes back after having been away for many years. His reason for returning is unknown. The guy who’s clouded with mystery shows interest in Nori. Does he really like her or is there something else behind it…\nSummary: Nori Sakurada is riding her bike one day, when she meets up with a boy she used to know when she was little. He has grown, but doesn't look very happy…\nAlso contains a side story called Himitsu no H-kun in vol.1:\nThe well-known and popular Hakozaki-kun is the dream of every girl in Miwako’s school. However, he's hiding a secret! One day while walking down the street, Miwako notices him secretly taking photos of elementary schoolers!! Could it be that the famous Hakozaki-kun is actually… a… a pervert?!"},{"name":" Infinite Stratos - BOOST ON!! (Doujinshi)","avatar":"https://mangadex.org/covers/13af96b7-9545-4782-a2fb-4f268959d4d0/0f64919d-b879-4927-bfbd-6d00bc144184.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":[""],"nutshell":""},{"name":" Human Use","avatar":"https://mangadex.org/covers/13b1469a-b141-495e-adcf-a484dd7da764/6cb08152-0744-48de-b0f1-96674018bb4d.png.256.jpg","country":"Chinese (Simplified)","stat":"7.50","status":"Ongoing","tags":["Sci-Fi,Action,Long Strip,Survival,Adventure,Military,Full Color"],"nutshell":"In the near future, human science and technology will stagnate, accompanied by the decline of the global economy and civilization. The use of technology by mankind, the redemption method that was once highly anticipated, and the only way to realize human evolution using potential, has now become a costly criminal tool.\nThe 18-year-old Shen Daiyu is the earliest experimental sample to be transformed and become a \"user\". He has the special ability to project fantasy into others' brains. At this time, Xun was in the post of Investigation Bureau, while investigating and hunting down illegal users, while correcting the mistakes that his family had made in the first place."},{"name":" The Infernal Devices","avatar":"https://mangadex.org/covers/13b626b5-479b-48a3-9cd6-8e3593587de4/e085d0a9-5140-4fb1-bab1-30bc79b1d14e.jpg.256.jpg","country":"English","stat":"8.07","status":"Completed","tags":["Historical,Action,Romance,Adventure,Drama,Supernatural,Mystery"],"nutshell":"Tessa Gray thought her journey to London would be the beginning of a new life, but she never could have envisioned the dark turn that life would take… Abducted upon her arrival, Tessa is introduced to London’s Downworld, the sordid supernatural underbelly of the city, and informed that her future will be recast to service a man known as “the Magister.” Only the intervention of the London Institute’s Shadowhunters delivers the girl from this fate, but sinister forces are still gathering around Tessa. Even so, Tessa’s attraction to two of the young Shadowhunters who have taken her under their wings may prove more dangerous by far…\n(From: Yen Press)"},{"name":" Supreme Taoist","avatar":"https://mangadex.org/covers/13b918e3-f82d-4cc1-bc9b-424e2c3788ce/c0e3d60a-cff3-4121-8b9b-bcb5a77b1c43.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.56","status":"Ongoing","tags":["Long Strip,Comedy,Martial Arts,Isekai,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"In the 21st century, Lin Fei, a Mansao young man, accidentally crossed from the earth to the Yuanwu realm. Sadly, the object of the crossing was a fool. Alas, accept your fate. But what about fools and idiots, like practicing magic, leveling up, making beautiful girls, and aspiring to the world."}]