[{"name":" Chimoguri Ringo to Kingyobachi Otoko","avatar":"https://mangadex.org/covers/22b833d0-9869-44de-9824-098231c03c6d/95e63da9-2b3a-41d5-a44c-46404c016258.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Action,Romance,Comedy,Drama,Horror,Supernatural,Mystery"],"nutshell":"A terrible creature has been plaguing the community: a man with a fishbowl for a head. When he attacks someone, the goldfish leaps out of his bowl and drinks their blood. The victim is irreversibly transformed into a goldfish! This terrible crime has happened to high-schooler Kousuke's little sister. With no other option, he takes care of his goldfish-sister as best he can.\nOne day, he comes across a strange girl named Ringo, who wears a school swimsuit, carries an umbrella, and keeps a gun hanging around her neck. Ringo is an apprentice blood diver, and the gun is her way of shooting herself into the wounds of the fishbowl man's victims. If she can get to them in time, she can prevent them from turning into goldfish. Ringo's mentor, Ichigo, says that she's heard of a way to turn people back from goldfish into humans. Kousuke is determined to help Ringo find a way to help his sister and the loved ones of his friends at school who have met the same fishy fate!"},{"name":" Turning the World into an Enemy","avatar":"https://mangadex.org/covers/22b88af9-7f38-4f10-9480-24412b10a266/94fe338d-ee09-43f6-bbde-f4cb7c575de2.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"Since her dad's death when she was in elementary school, Kamura promised to always protect her mother. Since then she has taken the role of being the responsible one in the family, including cooking, cleaning, and even getting her mom up for work. But then her mom tells her that she is getting remarried, and Kamura finds out her future stepbrother is the homeless guy she saw on the streets just the day before! And now her friend Youhei, who always teases and makes her feel like a fool, is acting differently…and even tries to comfort her?! Will Kamura be to able accept her new family life with a father and brother, and be able to let go her feelings of being responsible for her mother?"},{"name":" The Villainess' Lazy Sigh","avatar":"https://mangadex.org/covers/22baef38-43f2-4f48-8855-51a877251dcb/ccc5454c-b981-43dd-84a3-10801292adb8.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Ongoing","tags":["Reincarnation,Romance,Comedy,Isekai,Villainess,Adaptation"],"nutshell":"I was reincarnated as a villainess from an otome game I was playing. At this rate, I'll be exiled for being in the heroine’s way of conquering love. However, in this world… there are no entertainment materials! No doujinshis, no otome games, no smartphone! I'm really bored! Of course, I should be avoiding the destructive bad end… but before that I’m going to die from boredom!\n\"If there's no entertainment, just create it!\"\nUsing the knowledge from my past life to create toys and romance novels, I'll make this boring world fun! After becoming the queen’s favorite entrepreneur, I thought this scenario change will bring me to my wonderful future… But now the novel I wrote has brought me to the destruction flag–?!"},{"name":" Shoujo Sosuu","avatar":"https://mangadex.org/covers/22bc607a-6e32-4f91-9a34-12ee03b6692e/deeaadb9-4e0b-4e22-b91d-8cb5e5bb36a1.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"Anzu and Sumire are half-blooded twins living in a port town. They love their big brother, Fujio, a legendary modeler of figurines. A nice slice of life family story about a brother and his young sisters who turn to be ladies."},{"name":" Qingwu Master","avatar":"https://mangadex.org/covers/22bea7d9-7c2c-4da7-8773-bf30076dbc61/8da229ac-7d09-456f-be9d-f02ffd4d4dfa.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.96","status":"Ongoing","tags":["Action,Fantasy,Web Comic,Full Color"],"nutshell":"The ancient \"Qingwu Art\" can shake the Earth and even take charge of the world. People who master this technique are known as \"Qingwu masters\". One hundred years ago, Qingwu master Shen Yi sealed an evil Qilin in an artifact called \"Xuan Hao\". A hundred years later, a young man named Ye Yao, who is chosen by destiny, accidentally breaks the seal and is drawn into the great battle of \"Xuan Hao\"!"},{"name":" Yona Yona, Amaku","avatar":"https://mangadex.org/covers/22c0bc4d-a61b-447f-96b7-06b185337338/b5c477ee-530b-4dd2-a4c3-45bc178b9f98.png.256.jpg","country":"Japanese","stat":"7.68","status":"Completed","tags":["Boys' Love"],"nutshell":"Roma, who works as a high-end call boy by night, suddenly starts living together with the son of a wealthy man, Sharaku, due to his mother’s sudden remarriage. The lifestyles of the cheerful Roma and the straight-laced Sharaku are exact opposites, and just when Roma thought there would be no common ground between them even if they lived together, Sharaku shows up as his customer for the night…! Rather than refusing him, they continue their play at Sharaku’s request. They go all the way and have sex and the next day, he suggests an exclusive contract…!?"},{"name":" La Mosca","avatar":"https://mangadex.org/covers/22cb8236-187b-4853-b2c9-4aa69bf2589b/fed2dc13-20f5-404e-9b99-036322835af2.jpg.256.jpg","country":"Korean","stat":"7.96","status":"Completed","tags":["Action,Drama,Supernatural,Mystery"],"nutshell":"Kashoo, the incredibly popular confectionery and coffee company, produces the most addictive products. However, there is a mystery behind how the company obtains its raw materials. What lurks on the island from which they obtain their caffeine-laden goods? Just what type of contract are people hired to work on this island signing to?"},{"name":" Room 207","avatar":"https://mangadex.org/covers/22cc0106-e989-442d-a82e-9f059a031725/22994e38-e387-4d86-bad0-adcf9ba7b4ae.png.256.jpg","country":"English","stat":"7.63","status":"Completed","tags":["Oneshot,Romance,Drama,Tragedy"],"nutshell":"What happened in room 207?"},{"name":" It's My First Time Being Loved","avatar":"https://mangadex.org/covers/22d171ce-82c5-4338-a8c1-5e17c6a187b7/e22d9138-e765-49a5-b4c2-ee8b2cc67858.jpg.256.jpg","country":"Korean","stat":"8.02","status":"Ongoing","tags":["Reincarnation,Long Strip,Romance,Comedy,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"\"A baby girl was born!\"\nI started my 100th life again.\nOh, my God. I didn't want to be reborn anymore because I always had a terrible life. But this time the Duke is a little weird?\n\"Can't you show us your smiling face?\"\n\"I made a knight's order for my baby!\"\nWhy does my family love me so much? But there's a lot of kids trying to get close to my family. So I cleaned up the area.\n\"Did you think you could touch my daughter and survive?\"\nMy parents were angels only in front of me. They were relentless with the bad guys. I paid a lot of attention to the heir of the Grand Duke.\n\"Don't you like me?\"\nWhy is he so into me?\n\"I think I'm going to die because you're so cute.\"\n\"Do you think I'm going to let you go?\""},{"name":" Asa no Jumyou","avatar":"https://mangadex.org/covers/22d7eb19-2218-44f5-be88-999933f7ae19/04970b98-da3c-4f4b-a050-d2e1eb65dbf4.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Romance,School Life,Slice of Life"],"nutshell":"A boy and a girl set out to determine the lifespan of morning."},{"name":" Hana no Niwa Ame no Mai","avatar":"https://mangadex.org/covers/22d86b53-9cd8-40a9-b941-1e03d0f84744/a5fa8098-2087-4ce4-b758-3e0ea12e9a1c.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Hiatus","tags":["School Life,Slice of Life"],"nutshell":"Sougo Amagai has no friends at school and spends day after day alone. The only thing that gives him comfort is the feather memento a girl gave him years ago during a traditional dragon dance. Her bright smile is also engraved in his memories. Even though so long has passed, that same feather will bring them together again in the world of dragon dancing."},{"name":" Kutsunashi Hime","avatar":"https://mangadex.org/covers/22db81d6-b0f2-48e7-a18e-de9f52398666/8179b113-eabc-463b-a515-5c918c513a32.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Oneshot,Drama,Fantasy,Supernatural"],"nutshell":"A collection of oneshots:\n\nKutsunashi Hime (The Barefoot Princess): A kindly cobbler becomes the Earth Princess' exclusive cobbler.\nNinjinka\nNightingale Canary\nNadenade\nSuiyou Buranko\nOoishi-kun, Maji Tenshi\nSouchou Gakkou Trip\nSomething Crystal Sweet\nKamisama Chokinbako"},{"name":" Voice of Love","avatar":"https://mangadex.org/covers/22dff274-8ea6-4d6b-b0e9-6c400d588ed1/3e61e5e0-35d2-4bd8-bc90-f29a94ff0db8.jpg.256.jpg","country":"Korean","stat":"8.03","status":"Completed","tags":["Official Colored,Long Strip,Romance,Boys' Love,Web Comic,Full Color"],"nutshell":"A love story between Sun Soohan, who can read thoughts and the cute Jiho who has a crush on him\nJiho who fell for his classmate Sun Soohan is having a hard time with his one sided love, trying not to confess him due to a trauma regarding his outing incident. However, when Sun Soohan suddenly confessed him, the two finally start to date… Will the sweet love story that Jiho dreamt of begin?"},{"name":" Persona 3 4Koma Kings","avatar":"https://mangadex.org/covers/22e0f2ba-a2fe-4620-a1dd-b0fbfb341af0/64064e55-521c-405b-8fa8-a748f745c240.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["4-Koma,Drama,School Life,Supernatural"],"nutshell":"Collection of 4komas made by various artists, based on the Persona 3 game."},{"name":" Somehow, I Started Living With a NEET Otaku Kunoichi (Pre-Serialization)","avatar":"https://mangadex.org/covers/22e2af18-0469-4e91-9947-dd68b767664a/c0897030-4eac-4f3a-84e2-e00a8f5a3493.jpg.256.jpg","country":"Japanese","stat":"7.62","status":"Ongoing","tags":["Monsters,Romance,Ninja,Comedy,Web Comic,Slice of Life,Supernatural"],"nutshell":"A man is the target of a kunoichi's mission, and a lot of blood was spilled for him to learn this.\nHowever, said kunoichi is taking some \"liberties\" with the mission… Or are those part of the mission too?\nApproved scanlation by @kotatsu358"},{"name":" Red String","avatar":"https://mangadex.org/covers/22e43e15-c95d-4f2a-83b1-1563d50cb754/5fe6da11-38f5-4b2f-8455-c1dad8246754.jpg.256.jpg","country":"Korean","stat":"7.99","status":"Completed","tags":["Action,Long Strip,Romance,Drama,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"The story of a boy and girl whose lives were one day entwined by red string. Literally."},{"name":" Sing, Erinna!","avatar":"https://mangadex.org/covers/22e6aacd-db7e-4899-9daa-3a3f6197770b/0e664be1-552c-4dae-8947-8eb4b96448e5.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Historical,4-Koma,Slice of Life,Music"],"nutshell":"Ancient Greece. Erinna is a bit of a strange girl who aspires to join the ranks of Greece’s finest artistsーthe poets. Taken under the wing of Sappho, the greatest poetess of her day, Erinna wholeheartedly ignores her maidenhood and domestic training to throw herself into song and harp! She’ll be participating in a choir competition in the spring, but…?! Set in an Ancient Greek girls’ school, experience the story of Erinna’s wonderful youth with her best friend and upperclassmen!"},{"name":" Oredake Minaito XX Shichauzo","avatar":"https://mangadex.org/covers/22e8533d-dbc7-459c-8169-31eaaf365ed7/848891c9-7f33-4fca-8d4c-ca81163bdd2e.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Comedy,Boys' Love,School Life"],"nutshell":"Keiichi is good looking, yet he can't get a girlfriend and he worries about still being a virgin! However, the reason why he can't get a girlfriend is because his cute childhood friend Michiru is obsessed with him and has secretly been blocking any girl who goes near him!"},{"name":" Akkan Baby","avatar":"https://mangadex.org/covers/22e9ae0d-dd88-4a9c-a152-52eb2b789976/2d502eae-5dd6-4cfa-93c7-8744091603d4.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"High schoolers Yuki and Shigeru aren't dating, but still enjoy a highly active sexual relationship. Naïve and still very child-like in the way they think, it comes as a great shock to them when Shigeru discovers she's pregnant. The two are confronted with the decision of aborting the baby and wounding Shigeru, or to keep it and face great opposition from their parents and high school, and gasp miss their beloved Conflict concerts!"},{"name":" Sword Art Online - Progressive","avatar":"https://mangadex.org/covers/22ea3f54-11e4-4932-a527-89d63d3a62d9/555159b2-eb84-43c9-b3af-472ed02ee1bf.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Action,Romance,Adventure,Video Games,Drama,Fantasy"],"nutshell":"Please be advised that the side stories in this series have some changes from the original Light Novel versions of the Sword Art Online main story.\nThis series is a retelling of the SAO Aincrad Arc starting from a day or two before the clearing of the First Floor Boss, and continuing onwards. The first chapter was included in the Anime as Episode 2."},{"name":" Martial Streamer","avatar":"https://mangadex.org/covers/22ec995c-969a-4642-b184-b112b199f7de/b599194c-ad55-425f-b49e-5cf47eeddd80.jpg.256.jpg","country":"Korean","stat":"8.11","status":"Ongoing","tags":["Reincarnation,Official Colored,Action,Long Strip,Adventure,Isekai,Web Comic"],"nutshell":"TaeMin was a student taking a gap year, when he ended up electrocuting himself while trying to become a Youtuber.\nHowever, he ends up being reincarnated as Zhao Ga-hui in a world of martial arts, with livestreaming abilities to boot!\nWith the special ability to access Youtube when he closes his eyes, he starts streaming his daily life in ancient China, with the goal of becoming the ultimate merchant and martial artist!"},{"name":" Land of Silver Rain","avatar":"https://mangadex.org/covers/22edb058-f420-408b-83c9-a2d8cc3b1452/5e72e362-644c-4ed6-9467-002a77603e08.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Romance,Fantasy"],"nutshell":"Abandoned in a cabbage patch as a baby, Misty-Rain is saved from certain death by a witch who brings her up as her own. Far from the company of humans, she is raised as one of the Dokebi, a magical race from Korean myth. Among them she is happy and content, until one day she loses the trust of her protector, causing the enchantment that had kept the secret of her true identity to be broken. She is cast out to the world of her birth and must find her place among her own kind.\n\n\nOriginal Web Version <Naver>"},{"name":" My Hero Academia dj - Kyoumi Nanka Nee wa!","avatar":"https://mangadex.org/covers/22ee82ac-9658-431c-81f0-086ba61dd5d0/c468bac6-7462-47e0-ad33-30062b16025b.jpg.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"Todoroki Shouto x Bakugou Katsuki"},{"name":" Love Seeker","avatar":"https://mangadex.org/covers/22ef8097-893b-4b41-aff7-cbf84b11801b/33044017-fc7c-4150-85e5-b0228ef1be20.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Ongoing","tags":["Romance,Boys' Love,Drama"],"nutshell":"Love Seeker vol 1 is a series of two stories and one extra. While the two stories have little to do with each other, there are characters who are a part of each of the stories.\nStory 1 (chapter 1-2) Tomura is an office geek; small, shy, and someone easily picked on/forced to finish other people's work. He has decided to finally confess his love to his female co-worker Shinoyama. Mistakenly though, he ends up confessing his love to Miura Keijirou because he took off his glasses. Keijirou is Tomura's opposite; handsome, tall and the girls love him. After going out for a meal Keijirou offers to help Tomura by being his \"love messenger\". Will Keijirou really be of help, or will he be more of a hindrance to Tomura?\nStory 2 (chapter 3-4) Nanjo is asked by his friend Kenji to be a replacement gigolo for him. After giving Nanjo the information Kenji bolts so Nanjo can't refuse the job. It turns out that Kyousuke, the client, buys gigolos just to talk to. Because of his position where he works it's hard for him to find someone he can just talk to. With Nanjo's egotistical and blunt way of speaking will this one night job last as long as it should, or is this the start of a wonderful friendship?\nExtra story (chapter 5) Misaki is an average business man. One night trying to get away from someone he runs into a fast food place and ends up crying in front of Fujita, an employee. Ever since then Misaki goes there after work ordering the same thing. Seeing how the girls swarm to Fujita, Misaki becomes annoyed that the girls cannot see the true Fujita…or is he not realizing what his real feelings for Fujita are?"},{"name":" I Want to Listen to xx","avatar":"https://mangadex.org/covers/22f03571-5ea7-4d0c-b3f8-ca8b51a028e0/806825e3-061a-4d83-abec-84bf438aa295.jpg.256.jpg","country":"Japanese","stat":"8.22","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life,Web Comic,Slice of Life,Supernatural"],"nutshell":""},{"name":" Kyuukyoku Shinka shita Full Dive RPG ga Genjitsu yori mo Kusoge Dattara","avatar":"https://mangadex.org/covers/22f1ed48-c584-422a-abc5-5ae6df3e5cfa/69c2f7d2-b3c7-44c2-ab11-4697fe1993b6.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Ongoing","tags":["Action,Comedy,Virtual Reality,Video Games,Magic,Harem,Fantasy"],"nutshell":"In an unexpected turn of events, dull high school student Hiro Yuuki obtains the full dive role-playing game Kiwame Quest. Created by the best of technology, the game claims to take \"reality to its extremes,\" from stunning graphics, NPCs' behavior, to the scent of vegetation, and even the sensation of wind brushing against the skin—everything was the result of an ultimate workmanship.\nExcept, the game is a little too realistic and messy to clear. Kiwame Quest features over ten quadrillion flags and reflects the players' real-life physical abilities in the game. Being hit in the game also hurts in real life and slash wounds take days to heal.\nThe only reward here is the sense of accomplishment. Conquer the most stressful game in history that can't be played casually!"},{"name":" Lamento - Metriam (Doujinshi)","avatar":"https://mangadex.org/covers/22f827f6-5371-4344-af51-492f16dddd56/fa4e6d4e-5481-432d-bce8-e45897915cd3.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":""},{"name":" Inappu Tech!","avatar":"https://mangadex.org/covers/22f96a6b-1224-4817-9ca8-613f8bcd9d43/59b5dfe5-e931-4798-98b6-f2ec0f702560.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Oneshot,Video Games"],"nutshell":"A One-shot that appears in the book \"Inazuma Eleven Bakunetsu Soccer Battle Official Koryaku Book (Wonder Life Special)\""},{"name":" Ms. Mayple's Afternoon Tea Time","avatar":"https://mangadex.org/covers/22fe3fa0-73ff-467f-8c49-dc18f74ef518/b6820011-c795-4e94-8043-cead459a8d03.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Drama,Slice of Life,Mystery,Tragedy"],"nutshell":"The story opens several years after a devastating war, where incredibly strong 'mechanical dolls' slaughtered many, many people. These robot weapons, which look exactly like humans, are still feared and hated. During a storm, Craw finds one of these 'dolls.' She is nothing like the weapon he would expect, but is instead gentle, cheerful, and very eager to be of use to the people around her. She claims her name is Mayple, and she seems to be programmed as a maid and cook.\nSoon, Craw has set up a cafe for Mayple to run, where she can cook sweets and tea for everyone in town. It's going to be a rough road ahead of her, as many townspeople hate her on principle and will not shrink from violence against her. But maybe Mayple, who always keeps a sunny attitude, will be able to find a way through the prejudice and make a place for herself in the post-war world."},{"name":" Fallout - Kodoku no Fallout (Doujinshi)","avatar":"https://mangadex.org/covers/230020d5-c718-45c6-94e3-3ececbf573b8/024ee191-88fd-4d3c-9767-dfcef1859416.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Post-Apocalyptic,Slice of Life,Cooking"],"nutshell":""},{"name":" Koi suru 1/4","avatar":"https://mangadex.org/covers/23036c3f-4e61-4dd1-8414-58fe14f9ad8b/9915629f-760a-46a4-9988-0868d381b269.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Drama"],"nutshell":"From Impossibility:\nYoshida Miake is a charismatic first year high school student who is in love with her best friend whom she has known all of her life. The only problem is the fact that he has no interest in her whatsoever. Heartbroken, she finds comfort from \"Mr. Black\" and slowly begins to develop feelings for him. But how can she develop a relationship with a person who exchanges kisses for lunch?"},{"name":" Salvation","avatar":"https://mangadex.org/covers/230b1a11-3797-4e39-bf90-b199f04454df/60417e7b-1cf2-4907-8999-f846db5add11.jpg.256.jpg","country":"English","stat":"7.89","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":"Published in Imagine #6, July 1979"}]