[{"name":" Unbreakable Machine-Doll","avatar":"https://mangadex.org/covers/ef80395b-22ba-441d-b4e5-d272867e5acb/72efade0-36c2-4eb1-bfc0-a031e1d93521.jpg.256.jpg","country":"Japanese","stat":"7.66","status":"Completed","tags":["Action,Romance,Comedy,Harem,Drama,School Life,Supernatural"],"nutshell":"During the early 20th century, along with technological advancements, scientists were able to develop sophisticated magic. The combination of science and sorcery was Makinot, circuits made from spells that were put into objects to bring them to life and even gain a personality. It was developed as a military weapon and has now spread throughout the world.\nAkabane Raishin is now attending the Royal Academy to become the best in the world. Accompanied by the lovely teenage girl Yaya, who is actually Raishin’s puppet weapon, he plans on rocketing to the top of the class. However, his test scores come nearly dead last although his combat skills and determination are second to none. Raishin has to compete with the most deadliest of classmates if he wants to come out as the king."},{"name":" Otto ni Dakare nagara, Furin shimasu","avatar":"https://mangadex.org/covers/ef879f79-c53a-41e5-8572-d8b3e8ff4341/70227a20-e422-46ac-868e-20f00f7d1fde.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Ongoing","tags":["Psychological,Romance,Drama"],"nutshell":"\"Am I just a sex tool for you?\" He's a husband who only sees his wife as a sex tool. She's a woman who lives in fear every day because he seeks her for pleasure every night... They're a husband and wife who are at odds. On the other hand, there's a couple who is pressured to make children. A husband and wife who suffer from conflict with their mother-in-law. Gradually, the wife starts to behave erratically, and her husband becomes exhausted... In the midst of all that chaos, she meets him as if they're destined in the first place! The two people who are attracted to each other so as to quench their thirst. Exhausted and having nowhere to go, they finally..."},{"name":" Clock Tower","avatar":"https://mangadex.org/covers/ef8b3d52-56c6-4df3-a278-854fd7a80177/f14df2f2-2b9f-4ebc-a584-deb587dd3175.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Action,Psychological,Adventure,Drama,Horror,Supernatural,Mystery,Tragedy"],"nutshell":"A comic that shows different paths of HUMAN Entertainment's panic horror adventure game: \"Clock Tower\".\nDue to the comic being released in different methods, the page ratio will be different: the Prologue chapter was bundled with the PS1 complete re-release and the First Fear chapter was included within The Method to Capture Victory Guidebook."},{"name":" Love Live! - Naite mo Ii yo. (Doujinshi)","avatar":"https://mangadex.org/covers/ef8d9890-9482-413c-a2da-f977fb2e5c79/04d0d414-6a0a-48f5-99f8-4f827d92449f.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":"A Hanayo x Nico doujin."},{"name":" Let's Go! Nanastar Comms","avatar":"https://mangadex.org/covers/ef91a6b3-2747-45a8-9da0-3c9430dde39a/dde5d111-0330-48ac-8768-58deee23b5f8.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Ongoing","tags":["Comedy,4-Koma,Slice of Life"],"nutshell":"Featured as the in-game comic series in the mobile game Tokyo 7th Sisters, Let's Go! Nanastar Comms details the musings of all the 777☆SISTERS girls (pronounced \"three seven sisters\") in Nanastar!"},{"name":" Saikyou Mahoushi no Inton Keikaku: The Alternative","avatar":"https://mangadex.org/covers/ef97dcf8-9ecb-4a71-96c2-c09302dc6d7d/8f1769cb-f2e7-4cba-8311-8f5b7ec90575.jpg.256.jpg","country":"Japanese","stat":"7.13","status":"Ongoing","tags":["Magic,Harem,Fantasy,Adaptation"],"nutshell":"This is a reboot of the original manga adaptation and will go down a different route, it starts right at the beginning of the original.\nOriginal Description:\nAlusu Reigin is the strongest magician in the country at the age of 16. He joined the army at the age of 6 and after 10 years of fighting the demons, he now wants to retire. But the governor is reluctant to let the top magician retire so he proposed that Alusu attend the magic academy to learn to \"live like a normal person\". Alusu now has to attend the magic academy while hiding his true power as a harem of beautiful girls throw themselves at him despite him showing zero interest in them."},{"name":" Manga Old Testament","avatar":"https://mangadex.org/covers/ef9a63f3-e3b9-4e0f-a0ed-8cb41a420b54/0a0ca71a-11d3-4423-b429-de763c3fc54a.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Historical,Psychological,Romance,Philosophical,Drama,Supernatural,Adaptation,Tragedy"],"nutshell":"The \"Old Testament,\" often called the world's best-selling book, which has formed the basis for Islam, Judaism, and Christianity. Follow the trials and tribulations of God's people, depicted with the unique touches of Satonaka Machiko, one of Japan's most famous manga authors."},{"name":" Tokyo ESP","avatar":"https://mangadex.org/covers/efa1976e-1364-44d2-8225-980691ecedd6/30430f0e-b95e-40f8-8c2c-6000923c4e77.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Action,Romance,Comedy,Martial Arts,Drama,School Life,Supernatural"],"nutshell":"Urushiba Rinka was a fairly normal high school girl, though she was a bit poor and her only family was her father. Then one day, she saw a penguin and some glowing fish swimming through the sky. Rinka might have thought it was a hallucination if there hadn't been another witness with her, a boy from her school with a strangely scratched-up face.\nContact with a fish caused her to pass out, and when she awoke, she had developed the power to move through inanimate objects… such as the floor of her apartment! Later, a call from her father showed her that she was not the only one the flying fish bestowed with hard-to-control superpowers! What exactly is going on here? And does Rinka's classmate know more about this situation than he's letting on?"},{"name":" Rocky","avatar":"https://mangadex.org/covers/efa31df6-7a5a-437b-86c3-1a5fe5fe1dd0/6a906087-e92c-4324-9e7b-9bc79544294c.png.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot,Comedy,Slice of Life"],"nutshell":"Rokutarou \"Rocky\" Hatanaka lives in the Japanese countryside with the belief he is an Englishman at heart. After working at a convenience store, Rocky was able to afford a British car, taking one step closer towards his dream of moving to  England and living true to himself."},{"name":" Boku to Kanojo no Koi Log","avatar":"https://mangadex.org/covers/efaa2c58-0e2d-4f2a-9317-9e9f50d2e03b/2cff64b5-de84-4dd3-9247-5f03a59d87b5.jpg.256.jpg","country":"Japanese","stat":"7.50","status":"Completed","tags":["Romance,Comedy,Harem,Drama,School Life,Supernatural,Mystery,Tragedy"],"nutshell":"Mizuhara Ritsu loves both the 2D beauties of eroge and elementary school students. Also, his friend Bungo is jealous of how he seems to be surrounded by cute girls–there's his little sister Miri, his tsundere childhood friend Akari, and kuudere Hatori.\nOne day, Bungo tells Ritsu about an anonymous blogger who writes about the future, and whose vague online self-description seems to match Ritsu. While initially assuming it to be a prank, Ritsu ends up letting his actions be guided by the blog's horoscope-like hints for the upcoming day…"},{"name":" Banshou Shaonian","avatar":"https://mangadex.org/covers/efab036d-be4d-4d18-a95d-562205aa1d79/5c23d849-ec02-4aa3-b46e-a7860abea5e1.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Sci-Fi,Action,Comedy,Adventure,Fantasy"],"nutshell":"Several thousand years ago, a meteorite fell on Earth. The meteor fragments held a powerful energy, so they became highly sought after items. A war broke out! as a result of the desire of many to acquire the fragments. At the end of the war, the mechanics rebuilt the cities and became the protectors of its inhabitants."},{"name":" Suzumiya Haruhi - Megassa Nyoro (Doujinshi)","avatar":"https://mangadex.org/covers/efb10204-16a0-46c9-90a3-c6d545145d91/af032b74-fd66-44fa-bec3-c5b47d26dfe5.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":[""],"nutshell":""},{"name":" The Shet Note","avatar":"https://mangadex.org/covers/efb34a01-c3f6-4a1e-a4fa-262130e41567/4e9f0f9b-5111-4161-99cd-adec96a515d9.jpg.256.jpg","country":"Vietnamese","stat":"7.86","status":"Completed","tags":["Web Comic"],"nutshell":""},{"name":" Candy Pop!!","avatar":"https://mangadex.org/covers/efb9acbf-780e-4d6e-9eea-ad7706f5b26f/78aafafc-4808-4654-88cb-c537c43b1498.png.256.jpg","country":"English","stat":"7.97","status":"Ongoing","tags":["Official Colored,Adventure,School Life,Web Comic,Slice of Life"],"nutshell":"In a peaceful city named Kipsouku, Takei Michie wishes to become the best girl in the world! Will she ever achieve it?! Find out in this new Slice Of Life-Iyashikei book as you await crazy and wacky stuff!"},{"name":" Owari Nochi, Asanagi Kurashi.","avatar":"https://mangadex.org/covers/efc3ed46-3b43-4e4f-917e-aacba02560f9/9ab8b2c1-820f-4c42-9826-ebeddb25dbb9.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Survival,Post-Apocalyptic,Slice of Life,Cooking,Supernatural"],"nutshell":"A young girl named Nagi and a giant spider make an unusual pair in this post-apocalyptic story, but living in the mountains is lonely, and they've managed to find each other. Join them in their strangely sweet domestic bliss as they spend their days sharing tea and throwing picnics, proving that love (and delicious food) can bring together even the most unlikely of friends."},{"name":" DANGEUM & JIGYO","avatar":"https://mangadex.org/covers/efc850f9-f116-4eb7-8d03-7259bdddc9a3/90206d4c-6ff3-4e76-93ae-c0788aa69a85.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Ongoing","tags":["Boys' Love,Fantasy"],"nutshell":"\"Nuestra historia comienza con Jigyo, un príncipe heredero, que ha sido exiliado del palacio con un guardia, Dangeum, y el hombre que lo crío, Chunggeum. Los tres son forzados a pasar sus días en una tranquila aldea en la que casi todos sus residentes son gente mayor. Esto nos deja un apático y solitario Jigyo, que comienza a presionar a Dangeum para abandonar su condición de sombra silenciosa, y pronto se vuelven cercanos. Insinuaciones de una sangrienta conspiración, el misterioso origen de Dangeum y un Chunggeum que al parecer sabe más de lo que dice saber… ¿Cómo es que éstos tres personajes están conectados?, ¿Qué pasará con ellos durante su exilio?\""},{"name":" Star-like Words","avatar":"https://mangadex.org/covers/efcc0766-d883-4528-b6bf-bbedf2ea1d89/cb09d96e-d03a-4ab1-9232-b37b974b4d2c.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"High-school student Subaru wouldn't reject a sexual favor, but dating is out of the question when he's not in love. Stumbling upon a beautiful painting in school, he knows he's found his first love – the artist behind the work. But winning the heart of his love interest isn't going to be easy, particularly with his promiscuous lifestyle…"},{"name":" I Determine My Own Destiny","avatar":"https://mangadex.org/covers/efd3098f-7dea-4f7f-be2a-ebdd153a2023/5e1b5739-335f-4f20-8d52-e5d220e5936e.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.04","status":"Ongoing","tags":["Action,Long Strip,Martial Arts,Adventure,Harem,Isekai,Drama,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Jiang Beiran's journey to the Xuanlong Continent began in tragedy. He had finally gotten the system, but he had not anticipated it has its own rhythm. As a result, Jiang Beiran chose Gou, avoiding all opportunities to brag and living the practice in quiet.\nHowever, reality prevents him from salting a fish; even if he merely displays his might, he has established himself as a mystery powerhouse in the eyes of all, and he has gathered a pack of licking dogs.\n\nJiang Beiran traveled through time and space and arrived at the Dragon Continent with a miserable beginning. And when he was lucky enough to obtain the system, it didn’t work as he expected. Therefore, he chose to stay low-key, avoid any chances of showing off, and only concentrate on cultivation.\nHowever, reality didn’t allow him to be ordinary. He still became a mysterious powerful cultivator with a lot of flatterers even when he showed off his strength a bit."},{"name":" Gajuu: The Beast","avatar":"https://mangadex.org/covers/efd744d7-fc6b-4ec4-bdb0-304c4899ce56/381b9a46-ce1e-4d82-af1b-1aebbb19e9d3.jpg.256.jpg","country":"Japanese","stat":"7.50","status":"Completed","tags":["Thriller,Monsters,Action,Psychological,Animals,Adventure,Drama,Horror,Supernatural,Mystery,Tragedy"],"nutshell":"Satsuki, a high school boy and his childhood friend are riding in an underground train until it suddenly stops. Upon closer inspection the denizens of the train discover a mysterious beast! Panic sets in as the passengers struggle to survive the beast and escape to the surface."},{"name":" Bakusou Kyoudai Let’s & Go! Return Racers!!","avatar":"https://mangadex.org/covers/efd99e8a-3ecb-4951-8559-39c65520c6e3/58c5284e-7d8b-4608-b515-8022588221ff.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Action,Sports,Drama"],"nutshell":"The manga is set decades after the original series ended, focusing on the Seiba brothers who are now in their 30's, and a boy named Tsubasa who is taken care of by Go, the younger of the Seiba brothers.\nIn addition to the story arc sets in present, there's flashback stories that takes place during the original series. (http://mini-4wd.wikia.com/wiki/Bakusou_Kyoudai_Let's_%26_Go!_Return_Racers!)"},{"name":" Sabaku no Harem: Eien no Chigiri","avatar":"https://mangadex.org/covers/efddb93a-8c16-4ed8-9587-04ec5a024a82/b92e35c5-d191-4a14-9132-41f818cb8e90.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Historical,Romance,Drama"],"nutshell":"Mische became the wife of King Jarbara Karum.\nOne day after returning from the honeymoon, Kalum's birthday festival is scheduled to be held. When asked what he wants for a birthday present, he says, \"I want you\"?\nThe first night is too sweet!"},{"name":" My Cultivator Girlfriend","avatar":"https://mangadex.org/covers/efdf2e6a-3752-49b3-9013-56bba614a2ef/cbafa615-c0ba-4d64-ae87-c2274827c85d.jpg.256.jpg","country":"Chinese (Traditional)","stat":"7.40","status":"Ongoing","tags":["Action,Romance,Adventure,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"In the modern cultivation world, everywhere is law of the jungle, everyone feels insecure. After saving a cultivatior girl, the security guard Ma Yingxiong accidentally starts the journey of practicing cultivation."},{"name":" Chikashitsu Dungeon: Binbou Kyoudai wa Goraku wo Motomete Saikyou e","avatar":"https://mangadex.org/covers/efe4fd60-c53a-4f79-a92f-55dd694d762d/a9e7fbf7-f0b3-48e7-87a0-adc841540255.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Monsters,Action,Comedy,Adventure,Magic,Fantasy,Adaptation"],"nutshell":"Countless dungeons that suddenly appeared all over the world. And the mysterious creatures that live there.\nThe government of each country were making every effort to investigate and manage \"dungeons\".\nMeanwhile, a new dungeon suddenly appeared in the basement of the Boro family where Touka and Haruka, brother and sister living in poverty!\nThey begin to explore this dungeon on their own, looking for treasures and meat that monsters will drop …\n(Google Translate)"},{"name":" Katakoi Gokko","avatar":"https://mangadex.org/covers/efe50f06-f037-4ff9-a986-298895887eab/5413e35c-712d-40a2-a5c7-ae76745b628c.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Boys' Love"],"nutshell":"Ryou, who has always admired his deceased father's best friend and doctor, Kougami, decides to confess his love after becoming a university student. Somehow, that disastrous confession ends up in them dating?! A smooth sailing love story that sinks into rocky waves, since the only thing Kougami talks about is Ryou's father, Shun."},{"name":" Corona-kun no Tsuioku","avatar":"https://mangadex.org/covers/efe6501b-2123-4cc0-9612-fbf4e5ab862e/573b41c6-ea5e-455f-a4d8-99884394a5b6.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":[""],"nutshell":"The manga follows \"Corona-kun,\" an anthropomorphic version of the new coronavirus (COVID-19). The story is set in a world where humanity failed to contain the virus and all life and culture perished. Corona-kun looks back on history and asks what humanity could have done to survive while making amusing observations."},{"name":" Touhou - Miss Patchy's Diet (Doujinshi)","avatar":"https://mangadex.org/covers/efe9b57e-d45a-4289-a406-2c3928f0076b/78a455f4-87fe-4e90-a5e8-bd3487d1ea5a.jpg.256.jpg","country":"Japanese","stat":"8.20","status":"Completed","tags":["Comedy,Fantasy,Slice of Life"],"nutshell":"Take a guess at what this one's about."},{"name":" Mousou Elektel - Gosouteki Mannerism (Doujinshi)","avatar":"https://mangadex.org/covers/eff36872-67a1-4d0a-873a-5defe3fea19e/c84a28c9-49d6-4eb5-872e-6d00de79bdd0.png.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Boys' Love"],"nutshell":""},{"name":" The Bride of Amber Vanilla","avatar":"https://mangadex.org/covers/effefba8-731f-4bbf-9728-3595bd4d85c1/79c99d1d-a3e3-43dc-aa18-23eaf1a5c04c.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Ongoing","tags":["Romance,Boys' Love"],"nutshell":"Mizuki is an ordinary office worker who came to Haidar, a country in the Middle East, for business negotiations. After he arrived, he was suddenly struck by a white luxury car and fell unconscious. When he woke up, he was already in Prince Basil’s gorgeous mansion! Mizuki cannot refuse Basil’s forceful demand to treat him as his apology for the accident. Thus, he is treated with extraordinary hospitality. However, when he was too relaxed from the food and alcohol, Basil, who’s starting to like Mizuki, forced him to stay with sweet words saying, “If you let me hold you overnight, I will consider the business negotiations”. What was requested from a foreign land was a one-night pillow business!?"},{"name":" Kindaichi Shonen no Jikenbo - 20th Anniversary Commemoration Series","avatar":"https://mangadex.org/covers/f0041879-9652-4863-9564-ce569f7de083/4cfab8be-5aa0-4d5f-be35-9c08adffcf6d.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Psychological,Drama,Mystery"],"nutshell":"Official Release:\n\nIndonesian release by Elex Media Komputindo as Kindaichi - 20th Anniversary Series (2020)\n\n1- Kindaichi Case Files (AKA File Series) 1992-1997 (27 volumes/19 cases)\n2- Kindaichi Case Files -Case Series- 1998-2001 (10 volumes/7 cases)\n3- Kindaichi Case Files -Shin (New) Series- 2004-2011 (14 volumes/8 cases/6 short cases)\n4- Kindaichi Case Files - 20th Anniversary Series- 2012-2013 (5 volumes/3 cases/1 short case)\n5- Kindaichi Case Files R -Returns Series- 2013-2017 (14 volumes/10 cases/3 short cases)\nSpin-offs:\n1- Kindaichi Case Files -Short File Series- 1997-2000 (6 volumes/20 short cases)\n2- Akechi Case Files 1998-2000 (2 volumes/7 short cases)\n3- Takato Case Files 2013-2014 (1 volume)\n4- The Akechi Files (4 volumes/ongoing)"},{"name":" Trick Or Treat","avatar":"https://mangadex.org/covers/f0074ac7-8e23-4fad-9fe6-674e4fe006c0/e9eff827-3c8e-44e4-8525-35e16f71ee66.jpg.256.jpg","country":"Korean","stat":"7.93","status":"Completed","tags":["Ghosts,Long Strip,Romance,Comedy,Boys' Love,Web Comic,Supernatural,Full Color"],"nutshell":"I’m Woo Shihyuk: A serial-dating attractive man who has the combination of good looks, good hygiene, and good manners. But one day, I--the perfect man that I am-- suddenly got erectile dysfunction.\nWhen he was ready to give everything up, an unknown person’s hands started to touch Shihyuk down there…."},{"name":" Alexis Teikoku Kouryuuki","avatar":"https://mangadex.org/covers/f009952b-e572-4a2b-bfcf-31fc804afa4d/b1882868-52eb-4fe1-9222-f3e07c0c0a6c.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Historical,Action,Romance,Comedy,Survival,Adventure,Military,Drama,Fantasy,Adaptation"],"nutshell":"The brave tale of the peerless Great Emperor Leonard the First was evaluated as a universal truth.\nHowever, in his younger days, before he managed to unify the continent, he was a boorish and clumsy young man, he got his homeland taken away from him and was branded with the infamous name of “Nosferatu”. This is the story of a great counterattack, a great revolt.\nLeonard vowed to recover his homeland and truly became a mighty warrior. Several great generals, sages, talented women and geniuses comparable to gods and demons got attracted to the single-minded Leonard and congregated around him. Eventually, they became a great force able to engulf their depraved fatherland and contended against rival countries."},{"name":" 007 Series","avatar":"https://mangadex.org/covers/f00b732a-9f5d-4249-ac8e-235a2b807a3b/ba9c6724-4355-440a-b9ba-3acba05daa01.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Action,Crime,Adventure,Adaptation"],"nutshell":"A series of manga adaptations of Ian Fleming's James Bond novels.\nFour novels were adapted in total: Live and Let Die (volume one), Thunderball (volume two), On Her Majesty's Secret Service (volume three) and The Man with the Golden Gun (volume four).\nLivedoor blog has a detailed listing of what went in each volume."}]