[{"name":" Penguin Brothers","avatar":"https://mangadex.org/covers/2aec1634-1aee-4d43-a345-21bf36a8df3a/d8591aea-ff00-4e76-b87e-e03738b49735.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Hina moves back to her old home town only to find that the high school is run by two opposing factions, and students identify themselves based on the color of their school uniforms: Black for the followers of the ostentatious, violent Nishizaki, and white for the followers of the misanthropic, clean-freak Isshiki. And, as if it wasn't complicated enough, there are the \"grays,\" who wear their own clothing, deciding to be their own people. Hina finds herself stuck between the leaders of the two factions, and it seems to be turning violent."},{"name":" Cherry Juice","avatar":"https://mangadex.org/covers/2aed40d3-beb1-4b0d-bbd5-ed73408a4820/51010e33-a39f-4f4a-ad41-298dfb28c084.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,Incest,Drama,School Life"],"nutshell":"Cherry Juice is about Otome and Minami, two step-siblings. Minami is a popular boy who takes cooking at school, and Otome is an average girl who is in love with Minami's best friend. Cherry Juice's main focus is on the love lives of Minami and Otome, who are in love with other people….or are they?"},{"name":" A Tree Without Roots","avatar":"https://mangadex.org/covers/2af8d86c-f9e0-4cfc-8892-427256d14a41/f12d8ad3-3124-4ea6-bca1-6b544fc37379.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Psychological,Long Strip,Boys' Love,Drama,Mystery,Full Color"],"nutshell":"Hee-seo, who lost his only family member, his mother, in an accident when he was young and is now raised by his adoptive parents and is curious about who his secret supporter/sponsor is. That night when he was hospitalized for causing an arson, he meets the person he has been looking for so much..."},{"name":" Kankinkon","avatar":"https://mangadex.org/covers/2b033433-d72e-4f99-aae3-794d898c4aa9/8f6e5e55-174d-4d15-8885-3e9519074d26.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Drama"],"nutshell":""},{"name":" An Earth Immortal Reborn","avatar":"https://mangadex.org/covers/2b11b865-2886-4947-9cfc-d490cadd21d7/9d7f3459-e02b-4581-8c2b-83a1eb27945a.png.256.jpg","country":"Chinese (Simplified)","stat":"7.79","status":"Ongoing","tags":["Official Colored,Long Strip,Fantasy,Full Color"],"nutshell":"Chen Mo, an Immortal Transformation cultivator who died when exploring the forbidden grounds with his junior, has returned to his Senior High days. He has to rebuild his cultivation foundation to regain his strength and look for his junior. Taking advantage of his memories of past life, he has laid out plans to undo all regrets. This time, he will protect his family and friends, crush his enemies, and overturn all malicious schemes!"},{"name":" Ge~sen Fishing","avatar":"https://mangadex.org/covers/2b194cd0-3d7a-458c-a8d9-73ae788be964/83413ccc-0772-4d8a-91e9-69797caec37e.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Drama"],"nutshell":"Collection of 6 separate stories.\n\n\nGame Center Fishing - Saki likes older partners, but has never been successful, even after having four relationships. When she was trying her luck at the plushie catcher in the arcade, she met a cute high schooler. Will her relationship work out this time?\n\n\nCome Over Here - Umi loves to dress up as a highschooler, even though she is 19 years old, ever since a painful separation from her long-time boyfriend, who said that she looks plain without a school uniform. With the return of her childhood friend, she's touched by his effort to show that she is cute just the way she is now. Can she get over her own self doubt?\n\n\nConnection is Good - Komachi's friend recently met a boyfriend, whom the friend had met online, and was seriously disappointed when she met him. Komachi talks online with a woman who is a Makeup Consultant, which Komachi wants to become. But what happens when they meet and Yuki isn't a girl, but a boy?!\n\n\nSweet - Tooru and Mika spend allot of time together, but when Tooru decides to get a job so he can buy a car, Mika becomes lonely.\n\n\nOne Step - Sakura sees her boyfriend's you-know-what.. And compares it to a turtle, a reptile which she doesn't like very much. Follow their relationship as Sakura becomes comfortable with sex.\n\n\nRainy Face - Kayama and Hidaka work together, talking about each other's lives together. When Hidaka meets with Kayama to buy an Omamori at the temple, Kayama is delighted to find that Hidaka is actually very warm himself, and isn't as cold as she thought he was."},{"name":" Sunao Janai Kedo","avatar":"https://mangadex.org/covers/2b196957-1c94-4386-b5aa-41a5a88f2eb7/b540180d-66e1-465d-9c07-e88f3fef8b86.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Comedy,Boys' Love,Drama,School Life"],"nutshell":"Shinonome finally made Yuki-chan his boyfriend, but wait… the storm is not over yet. Who's that person taking Shinonome away to the counselling room? Is Yuki-chan…. feeling jealous?! And why is Yuki-chan's brother here?"},{"name":" Sylph Theme Anthology: Literature Boys","avatar":"https://mangadex.org/covers/2b1f79ef-17a4-4be5-908f-6c209a5e32c8/45b12439-fae5-49b1-ad2c-fa0947c0f202.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Romance,Comedy,Anthology,Fantasy"],"nutshell":"Sylph Anthology containing short illustrations and comics.\nPart 1: Fairy Tales\nPart 2: Tales of Old Japan\nPart 3: Western Literature\nPart 4: Japanese Literature\nPart 5: Myth & Legend\n(From: Fallen Syndicate)"},{"name":" Lazy Cooking","avatar":"https://mangadex.org/covers/2b21eecd-11b0-487f-8ce7-9ecfa4522a12/3c5997c6-737f-4eaa-806d-d9931ad82ad3.jpg.256.jpg","country":"Thai","stat":"7.94","status":"Ongoing","tags":["Long Strip,Slice of Life,Cooking,Full Color"],"nutshell":"Everyone loves tasty food! But… If you keep buying ready-to-eat food… You can't save money! So, you want to cook by yourself… But you can't cook! You want to learn how to cook… It's frustrating and you're lazy! It's hard! Hold up, don't find excuses anymore. This comic will teach you how to cook simple, cheap, and delicious food. Try it!"},{"name":" Touhou - Far East Hallucination (Doujinshi)","avatar":"https://mangadex.org/covers/2b23aff8-9e06-4556-b2f5-eacdaa8fda57/34a09159-2ab6-480a-b76a-baa2a0626f21.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Action,Fantasy"],"nutshell":"New series by FLIPFLOPs.\nGensokyo has transformed into a modern world. The Old Gensokyo residents have a new way of life. They have forgotten about old Gensokyo. Only a few do retain memories of old Gensokyo.\nEverything looks normal on Reimu’s life, and at the same time it all looks not normal. Has Reimu notice the change? Will she choose to adapt to a modern life? or perhaps she is wishing to revert back to the old Gensokyo"},{"name":" Kappei","avatar":"https://mangadex.org/covers/2b23b8e3-e8d8-4c53-85a7-9902162796bf/78adb314-ac65-428d-95b3-2c3d0d0c0ac7.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Comedy,Post-Apocalyptic"],"nutshell":"survive tricked disband muscle and parody"},{"name":" Vanishing Starlight","avatar":"https://mangadex.org/covers/2b2d0a74-1284-44d9-bb10-0c3901925e77/056652b2-89f1-4660-852a-b331b2e9d3e3.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Hiatus","tags":["Drama,Fantasy,Mystery,Adaptation,Music"],"nutshell":"A meeting on a moonlit night with the mysterious man, Revo, will guide the young Noël to \"a story\" of fate…\nThis comic adaptation is based on the fantasy band Sound Horizon's Anniversary Maxi Vanishing Starlight.\n(Chapter 13 is the end of \"Part 1\")"},{"name":" Countach","avatar":"https://mangadex.org/covers/2b2e7c95-9e4d-4199-9ea6-52add4c22cfa/4ea4a407-76b4-4fd1-836e-41f68508e857.png.256.jpg","country":"Japanese","stat":"8.31","status":"Completed","tags":["Romance,Comedy,Sports,Slice of Life"],"nutshell":"The day after he finds himself dumped by his girlfriend, Sorayama Shun recieves a letter… from himself? The letter was from Shun 25 years ago for his future self. The letter reminds him of the time when he dreamed of owning a Countach and being a successful professional racer. With loads of luck and his ambition to make his childhood dream come true, he finds himself as a new owner of an LP400 Countach."},{"name":" HUVAHH","avatar":"https://mangadex.org/covers/2b39d206-977b-4a9c-8844-7f85c5dac2ca/77f1ed51-7141-4874-8f29-12610a91262d.jpg.256.jpg","country":"Japanese","stat":"7.25","status":"Completed","tags":["Oneshot,Horror"],"nutshell":"Oneshot that appeared in the Shadows of the Damned artbook (which Hayashida contributed designs to), starring George Reed."},{"name":" The Wicked Little Princess","avatar":"https://mangadex.org/covers/2b3ca0e3-4d7f-4f45-9b2e-ccfa51caddec/686a03a1-e7fc-473f-bdd8-adf5193d92da.jpg.256.jpg","country":"Korean","stat":"8.04","status":"Ongoing","tags":["Reincarnation,Long Strip,Romance,Magic,Isekai,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"I may be a witch who is over 300 years old, but I died by the hand of the human I trusted. I thought I’d be stuck in the soul world, but I reincarnated as a princess of a Royal Palace where we kill each other. Since it became like this, in any case, I should become the Queen. “You. Be my subordinate.” I thought everyone would be afraid of me if I did this. “Can’t I touch it once? Everyone would be jealous of me because I patted your head once.” …What nonsense is this?“ Again. Do it again, since it’s cute.” But they’ve started to show me so much affection to the point that they seemed to have all gone mad as a group. …I’ll be able to become the Queen, right?\n\n\nOfficial Simplified Chinese Translation"},{"name":" I got stuck in real life, so it's okay to get addicted to an MMO, right?","avatar":"https://mangadex.org/covers/2b3e3815-d507-464f-b7ac-71b192136383/439a247c-5733-4257-a289-82f79716a069.jpg.256.jpg","country":"Japanese","stat":"7.75","status":"Ongoing","tags":["Sci-Fi,Action,Comedy,Adventure,Girls' Love,Drama,Fantasy,Web Comic,Slice of Life"],"nutshell":"A long-running web-manga hosted by Neetsha, by Muu-Muu."},{"name":" Otokonoko Layer ni Kouryakusarete Imasu","avatar":"https://mangadex.org/covers/2b416905-6577-4b40-a2e4-183ea7c61a0a/1e1fb7fc-cb9b-4058-bee5-46dfb437cfec.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Boys' Love,Crossdressing"],"nutshell":"I'm Getting Conquered by a Beautiful Male Cosplayer \"You can even do something more amazing. I don't mind, if it's you.\" Sudou, a university student who loves games, has a difficult job-hunting experience. Thanks to a former student who he's friends with, he gets to meet Nagi, a crossdresser he admires. Sudou drinks a bit too much when Nagi shows up looking like his favorite character and listens kindly to his complaints... so he ends up bringing him home and stealing a kiss. Nagi resists at first, but gradually becomes more and more assertive!? The sound of the godly cosplayer's moans keep fueling Sudou's wild excitement...!!"},{"name":" Touhou - Tenco no Tabi (Doujinshi)","avatar":"https://mangadex.org/covers/2b4310d5-0b57-4025-9307-6a3ac4b9dd17/439489da-9f0f-4541-8847-6ec5d9107fb2.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Adventure,Fantasy"],"nutshell":"A bored Tenshi goes out on an exotic journey with Iku, one that looks more like a Makoto Shinkai movie. Full Colour. <br />"},{"name":" Sounashi no Ningyou","avatar":"https://mangadex.org/covers/2b453d2b-feed-4f48-916d-cb9d11c3657d/81197fbe-1c93-4395-913b-80db8bbf668c.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Sci-Fi,Action,Adventure,Fantasy,Web Comic"],"nutshell":"Dolls, similar to robots, are an essential part of everyday life in this world. Dolls shaped like horses pull carriages, while others are pets. Doll doctors are in short supply, and though she is young, Mercia is one of the best. When her master asks her to visit a friend's house, she meets a doll who looks like a child, another that is a murderous warrior, and a man who covers his burns with doll parts. Together, they begin a quest to recover the 76 dolls of the mysterious Nimo, in order to create the ultimate, original doll."},{"name":" My Righteous Older Brother","avatar":"https://mangadex.org/covers/2b45e010-8afc-48a5-9508-e9c1636e842d/56377ba3-0406-4d89-a1f1-3e9e895220b5.jpg.256.jpg","country":"Japanese","stat":"8.33","status":"Completed","tags":["Psychological,Romance,Crime,Drama,Slice of Life,Mystery,Tragedy"],"nutshell":"Rize, who’s a university student, met Kairi at her part-time job at the supermarket. While lending her shoulder to Kairi who has trouble sleeping, she is reminded of her older brother who left her when she was young, and Rize starts to feel affection towards him. However, she was shocked when she saw Kairi’s diary in his apartment saying that he had killed someone. What is the truth behind the person she likes? As the truth slowly comes to light, Rize starts chasing after her love for Kairi! This is Morie Satoshi’s rollercoaster work that has crime, mystery and love!!"},{"name":" H.P. Lovecraft's The Shadow Out Of Time","avatar":"https://mangadex.org/covers/2b4b4e2f-229a-4547-bd4f-f61d8ff20082/b22a391f-717c-4de2-9ec1-1ddcda2cc0b0.jpg.256.jpg","country":"Japanese","stat":"8.46","status":"Completed","tags":["Sci-Fi,Psychological,Horror,Supernatural,Mystery,Adaptation"],"nutshell":"Manga adaption of H. P. Lovecraft's \"The Shadow Out of Time\""},{"name":" Osa and the Five Wastes","avatar":"https://mangadex.org/covers/2b4d30da-29b2-47a3-a3e4-b0fd4fdc7e1c/26ce0e49-eeda-4a8b-b7b6-9f75052b6217.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Long Strip,Comedy,Drama,Web Comic,Slice of Life,Full Color"],"nutshell":"A peek into the everyday life of Osa (@oreohunter)\n~\n[오사 (Osa) is an abbreviation of 오레오 사냥꾼 (Oreo Hunter)]"},{"name":" Silent Witch Chinmoku no Majo no Kakushigoto","avatar":"https://mangadex.org/covers/2b5a3b43-effb-4f54-aa9b-d6093d523452/52cf8092-b453-49b6-b61e-231041f28080.jpg.256.jpg","country":"Japanese","stat":"8.23","status":"Ongoing","tags":["Comedy,Adventure,Magic,School Life,Fantasy,Adaptation"],"nutshell":"Monica Everett is revered as “The Silent Witch.” She’s the only magician in the world who can use magic without an incantation... In reality though, she’s just shy— the only reason she practiced chantless magic was so that she wouldn't have to speak in public! Before even realizing her own talent, Monica is chosen as one of the “Seven Sages,” and is assigned the secret mission of protecting the kingdom’s second prince...?\nThe antisocial young prodigy will have to hide her true nature while secretly rescuing the prince from encroaching danger in this thrilling fantasy story!"},{"name":" Yuukyuu no Gusha Asley no, Kenja no Susume","avatar":"https://mangadex.org/covers/2b5c2f34-6de4-4a81-8671-bca8c9409f79/6b357295-7b5f-48cc-ba1a-735c1c585a52.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Ongoing","tags":["Action,Romance,Comedy,Adventure,Magic,School Life,Fantasy,Adaptation"],"nutshell":"When he was young, he failed at the Magic Academy and was ridiculed by his classmates.\nIn order to get revenge on the people who made fun of him, he began researching magic and magical artifacts outside of the academy. However, by chance he discovered a mythological medicine, and with it he obtained an immortal body.\nBefore he realized it, 5000 years of research had passed and he had become an ancient magic user.\nAnd thus, the people he was seeking revenge against were long gone. Losing his purpose in life, Asley went on a journey with his familiar, Pochi, to see how the world had changed after 5000 years.\nAfter an unexpected turn of events helping many humans, he is now living at the magic academy.\nAsley. A 5000 year old ancient magician who looks like a young man. How will he live his second life’s youth?"},{"name":" Old Home no Haibane-tachi Bangaihen","avatar":"https://mangadex.org/covers/2b5dfd19-07c1-4eb6-adf5-a3f527c9a027/dd2b1bd1-be27-43a5-856c-0a72761cd3aa.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Drama,Fantasy"],"nutshell":"A short story that supplements the Haibane-Renmei show - hugely spoilerific if you haven't watched it.\nTranslation by Charp."},{"name":" The Strongest Conqueror","avatar":"https://mangadex.org/covers/2b5e8024-58e1-4d51-a137-bf3a88d679c7/e23a77c6-8014-4151-a03b-d189d1db61ac.png.256.jpg","country":"Portuguese (Br)","stat":"7.91","status":"Completed","tags":["Oneshot,Sci-Fi,Monsters,Action,Demons,Martial Arts,Adventure,User Created,Fantasy,Web Comic,Aliens,Mystery,Full Color"],"nutshell":"O universo é infinito e tem mais do que suficiente para satisfazer a todos que nele vivem.\nMas há seres que, por mais que tenham, querem mais, até o que é de propriedade dos outros.\nEsta longa história conta a jornada de um rei espacial tão ambicioso que conquistou tanto a imortalidade quanto inúmeras galáxias e acabou se tornando o maior monarca de todo o universo, nada mais era uma ameaça para ele, com isso ele se tornou arrogante, mas só até descobrir a existência de seres superiores que vivem em um plano inacessível ao que conhecemos."},{"name":" A Breeze of Kanome","avatar":"https://mangadex.org/covers/2b5ef364-a7d2-42b1-915e-93c5e7140952/2a278a7d-4cac-4f09-9525-c19780a02071.png.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Oneshot,Sci-Fi,Drama,School Life,Slice of Life"],"nutshell":"Aiblinger's Horn Syndrome. A disorder which causes the afflicted individuals to have horns sprouting from their scalp. It's been known to cause psychological and emotional issues from the stress of society's stigma and the individuals' struggles to hide their horns and fit in. This exact condition is what has been plaguing Mio's classmate, Kanome. And yet, how can he be so happy? How can he smile so easily? She just doesn't understand. Not only that, she also has turmoil and confusion brewing inside her related to this classmate of hers which frustrates her even further. This is their story."},{"name":" Neko no Mail - Igai na Kareshi","avatar":"https://mangadex.org/covers/2b604612-37be-4193-a36a-05583ecd3db5/920d8d5e-edab-4071-82a3-b5d486d6783c.png.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Oneshot,Comedy,School Life"],"nutshell":"Nemoto, your average teenage airhead, has her highschool life flipped turned upside down when she accidentally volunteers to be class rep with the most serious guy in class! Can the two overcome their differences and become friends…or perhaps more?"},{"name":" Mainichi Seiten!","avatar":"https://mangadex.org/covers/2b63068b-c579-4246-a58d-6c2a5616fe4c/7d9da06a-15c2-4ada-9914-0803b3bac7de.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"On a particular night, an unexpected guest suddenly turned up outside science fiction magazine editor, Obinata Taiga and his family's home! The person was actually Asuoo Shuu, who had married their elder sister; the dictator of the family, and since became their brother-in-law. What's even more incredible is that he is not only the writer that Taiga is responsible for, but was also Taiga's high school classmate! But, just when everyone was vehemently expressing their objection to Asuoo, they received news that their all-important sister has gone missing! Out of ideas, Taiga had no choice but to let Shuu stay on, they could only wait until their sister comes back to decide everything!"},{"name":" Pocha Pocha Suieibu","avatar":"https://mangadex.org/covers/2b696f83-e197-45a7-9b4c-4703e8d0adbb/91964a16-a428-42da-be92-7c7399c68ce6.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Comedy,Sports,4-Koma,School Life,Slice of Life"],"nutshell":"Oota Katsuyo is a 15-year-old girl just entering high school. She's short and plump, thanks to being the daughter of a family that runs a tonkatsu shop. She's followed her crush from middle school to the same high school, and she's devastated when she finds out he's not interested in chubby girls. As she's looking for ways to lose weight, the free-spirited president of the swimming club, Itou Hatsume, and her serious and demanding vice-president, Kaji Rinko, are looking for new members to supplement their roster of two. When Katsuyo meets Kaitani Ayumi, a rail-thin girl with an appetite that matches her own, Ayumi drags her to the swimming club to join up. Will Katsuyo have problems measuring up to the demands of the swimming club, or can she make a big splash?"},{"name":" Fukai Nemuri no Hana","avatar":"https://mangadex.org/covers/2b6c0ed8-c79e-41de-aeb8-c64b33565d0d/1e49d30b-5a16-4c2c-8e4e-df3dd7ef36e0.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Drama,Supernatural,Mystery"],"nutshell":"From Tokyopop:\nYuuki is an energetic teenager who carries the disturbing power of foresight in her dreams. She finds that this is tied to the mysterious Deep Sleep that has overtaken her sister, Yuuka.\nClues left on her cell phone and visions that come to her in her dreams begin to reveal a strange puzzle… and then in one dream, a glass wall stands between her and her sister while a faceless little girl stands by Yuuka. The mysterious girl hands Yuuki a kaleidoscope–which Yuuki discovers she still has when she awakens from the dream the next morning…"},{"name":" Watashi, Idol Sengen","avatar":"https://mangadex.org/covers/2b6e26fd-d1d6-4000-958c-ca15e7c9715a/d757ff90-dcf1-466a-b85e-06e6d3b5b894.png.256.jpg","country":"Japanese","stat":"8.32","status":"Ongoing","tags":["Long Strip,Drama,School Life,Slice of Life,Adaptation,Music,Full Color"],"nutshell":"A female idol named Mona (Mona Narumi) of the project \"Confession Executive Committee -Idol Series-\" born from HoneyWorks' songs is adapted in manga! In contrast to her sister model, Sena Narumi, Mona is an ordinary high school girl. An idol story with HoneyWorks as original and Mogelatte as mangaka!\nOfficial Kadokawa Page"}]