[{"name":" A New World Awaits","avatar":"https://mangadex.org/covers/00f2e453-ee19-494e-8add-3fba131f10fb/aa83c032-94ec-4f38-a54e-dee8a31be392.jpg.256.jpg","country":"English","stat":"8.02","status":"Ongoing","tags":["Action,Adventure,School Life,Fantasy,Slice of Life,Supernatural,Tragedy"],"nutshell":"Some are chosen by the 3 guardians of the Universe that\nprotect the balance of all worlds and to stop a great evil.\nThese soon to be heroes are selected from different worlds and are gifted supernatural abilities and unique weapons to fight of The god of all evil and his force and take back the keystones which hold the source and balance of worlds."},{"name":" After Five & Five","avatar":"https://mangadex.org/covers/00f91afc-906a-4ebc-aab1-7a70ab9091da/896a3848-977f-4bea-8371-99954aae4773.jpg.256.jpg","country":"Japanese","stat":"7.71","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,Office Workers,Drama,Slice of Life"],"nutshell":"Shimizu, the sales manager of a company, turns into a completely different person after five. He strips off his suit and becomes ‘Jonathan’, seducing men at the club he frequents. Then a familiar face shows up. Okino is a straight-laced, by-the-book guy from the company’s legal department and Jonathan decides to have a little fun messing with him… But what if Okino manages to get a peek under the mask?The latest salaryman BL gem from Higashi Nishida!"},{"name":" An Omega's Love Affair","avatar":"https://mangadex.org/covers/00f9a938-2f38-44b8-896b-aea6ce49da2c/29719f93-4ae5-43ab-afb6-9d04ae0beeba.jpg.256.jpg","country":"Korean","stat":"7.96","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Web Comic,Full Color"],"nutshell":"Hyun, who had no usual contact with him, is embarrassed by the voice actor's cheonggyeong-wall edifice, famous for his rich alpha. However, in order to avoid marriage and good, the contractual romance is concluded, and one day the two of them have a hot night of sweet pheromones. Their future steadily began to worry about each other…?"},{"name":" Kaze no Yari","avatar":"https://mangadex.org/covers/00fb4d6e-6b8f-417d-a0ed-78d1217a70d8/a56867d1-ce5c-45d4-88ac-c4a95c6e7980.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Historical,Action,Martial Arts,Samurai,Military,Drama"],"nutshell":"Based on real historical figure called Honda Tadakatsu, the strongest military commander during the Japanese civil war/Sengoku period who served Tokugawa Ieyasu from the start of his career to become the unifying Shogun of Japan."},{"name":" Keron","avatar":"https://mangadex.org/covers/00fc012b-8d52-489c-9529-ee60934cbb0e/1aa6d0db-547f-4b94-8738-f57b0f43f324.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot,Sci-Fi,Comedy,Adventure"],"nutshell":"A frog meets an alien spaceship and ventures to the stars.\nA oneshot from Garo 1998-08."},{"name":" reSudden Quest","avatar":"/cover-placeholder.jpg","country":"English","stat":"8.07","status":"Ongoing","tags":["Action,Long Strip,Comedy,Adventure,4-Koma,Fantasy"],"nutshell":"3 Noobs that have to face the daily struggles of not knowing anything…"},{"name":" Torokeru You ni","avatar":"https://mangadex.org/covers/01032477-8a98-4240-9b34-f480772d3c5c/a8c754a4-afe2-484e-ba78-45d6116b06e8.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"An straight good looking guy in a gay bar, an interested uke made a pass on him. Now how this uke is going to handle the \"I hate people!\" straight man.\n\nContinuation of Ubatte Choudai."},{"name":" Ghost Hunter","avatar":"https://mangadex.org/covers/010932f2-3a76-43f1-bc83-ecb126a17a1c/33ff7333-7102-4ef0-9463-1782e9292fea.jpg.256.jpg","country":"Korean","stat":"8.00","status":"Ongoing","tags":["Action,Supernatural"],"nutshell":"They have been maintaining the balance of Yin and Yang since ancient times. Whenever the world is in chaos, there are many cases where evil spirits come to do harm to humans. The gods select talented humans and they are given their own guardian god for them to calm the over flow of Yin. This has continued all the way up to the present, so those that are chosen by god are hunters that eradicate ghosts, they are called Ghost Hunters."},{"name":" Yoru no Manimani","avatar":"https://mangadex.org/covers/010a2e68-b80f-4546-a146-54406544b4dc/c821d851-d19e-4753-9a47-5834b1532e4e.jpg.256.jpg","country":"Japanese","stat":"8.21","status":"Ongoing","tags":["Romance,Slice of Life"],"nutshell":"Chika is energetic and cheerful, and Kazuya is shy and quiet. These two opposites only talk on Wednesdays at the convenience store. A coming-of-age love story that slowly brings them closer together during the night!\n\"A quiet boy & a cheerful girl getting closer thanks to their brief talks after his konbini shift every Wednesday after 9pm\""},{"name":" Allegro Agitato","avatar":"https://mangadex.org/covers/010a4fda-4e13-48bd-be3f-8d6ac4dcdbcd/fb230ca6-4cc2-4323-b2d8-69ed5e47c499.png.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Romance,Drama"],"nutshell":"Shouko is still a virgin, and hasn't met a man yet who lives up to her standards. Her friends look up to her – and would in truth like to give her more than just their respect – but the only one Shouko looks up to is her famous actress mother, for whom no man is good enough to dedicate herself to. That's when Shouko meets the rumor and reality of her mother's new boyfriend, Ujou. Ujou is different from the others – an aloof college student 17 years younger than Shouko's mother. The passion that Shouko sees between them becomes what Shouko desires for herself, but while forbidden fruit may be sweeter… it is also more deadly."},{"name":" Brundage no Mahou no Shiro","avatar":"https://mangadex.org/covers/010db7f3-385a-467c-afdc-1223989d23f3/49851a2e-f04f-4d74-a124-8ea9977a6d4b.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Supernatural"],"nutshell":"Once upon a time, there was an arrogant ex-prince called Donatian Charles. He decided that he wanted a son to inherit his magical powers, so he kidnapped Adrienne, a girl from the nearby village. Adrienne was, at first, confused by the sudden marriage proposal, but then she gradually fell in love with Donatian Charles. What will become of these two and their stormy engaged life together?"},{"name":" Ai towa Yoru ni Kizuku Mono","avatar":"https://mangadex.org/covers/010f39bd-d73f-44f4-a6d0-b1e0202a986a/c103b5f1-dc04-480a-9a3b-265cb4fff601.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Historical,Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"Hired as a servant by an Aristocrat family, Claude works hard to care for the family that took him in. But when the master of the house and his wife eventually pass away, Claude must keep spoiled son Antoine in line and teach him to be a proper gentleman. As the two become closer, a forbidden love develops between them…"},{"name":" Tokyo Counselor","avatar":"https://mangadex.org/covers/011000b8-2f83-4b67-b91c-aeb54b34981c/4deab1ab-e543-4074-9a00-12995c454078.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Drama"],"nutshell":"It was highly acclaimed even in the newspaper book review section!! A man who was involved in a girl confinement case in the past and received rehabilitation counseling had auditory hallucinations!  A very ordinary housewife was chosen as a judge.  She has a secret when she falls down on the day of her sentencing!  While searching for the lesion in her heart, the clinical psychologist arrived at the darkness of the truth."},{"name":" Kirikagohime to Mahoutsukai","avatar":"https://mangadex.org/covers/0110603c-92ec-463e-8d13-7651211e492e/823e1799-2063-485a-b145-564ac7b5c61c.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Romance,Comedy,Fantasy"],"nutshell":"Deep in the forest, in a tower shrouded in mist, there lives a reclusive wizard by the name of Nebelhaut. When he happens across a beautiful fairy who's being held captive and made a public spectacle, he knows he has to take her with him. He names the creature Sti and orders her to call him his master, but her heart remains closed to him. But as time goes on, she sees a different side of him?a side that's both caring and awkward. The distance between the eccentric wizard and strong-willed fairy grows shorter day by day!"},{"name":" Neung Neung","avatar":"https://mangadex.org/covers/0111ec91-d174-43e1-9395-2dceb80ac68b/f388d82e-057e-4cd0-bbf5-ec16c92c3284.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Cancelled","tags":["Official Colored,Action,Psychological,Long Strip,Comedy,School Life,Web Comic,Mystery,Full Color"],"nutshell":"About a class full of espers."},{"name":" The Rain Spirit That Will Disappear in 30 Days","avatar":"https://mangadex.org/covers/01168c96-d2b0-4c56-bc03-6a6bf5fffd24/6a8d7962-b08c-4a58-9b9c-1cc623a761d9.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Comedy,Office Workers,Web Comic,Slice of Life,Supernatural,Full Color"],"nutshell":"Note: Tsuyu is the rainy season in Japan which occurs in the late spring through summer months."},{"name":" Undead King","avatar":"https://mangadex.org/covers/01170729-06db-4c63-85da-39de276d78b7/1faa1ad1-8b63-4094-b2fb-d494c4a899c2.jpg.256.jpg","country":"Korean","stat":"7.99","status":"Completed","tags":["Long Strip,Survival,Zombies,Adventure,Horror,Web Comic,Supernatural,Full Color"],"nutshell":"A group of people who are running away from the masses of infected corpses, aka zombies, are trying to fight back. Will they succeed? Or will they die and become zombies themselves?\n\nOfficial Chinese translation"},{"name":" Koyoi, Lorenzi-ke de Kanbi naru Chuusei wo","avatar":"https://mangadex.org/covers/011a438a-1984-46e8-aa96-76cdf3f8fa12/7dcc8d5c-4104-4387-a852-ecfa12193d98.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Ongoing","tags":["Action,Romance,Mafia,Drama,Fantasy,Adaptation"],"nutshell":"Rita, a girl with the legendary \"Golden Eye,\" was caught by a human trafficker and put up for auction in the black market. It was the mafia boss, Albert Lorenzi, who won the auction, taking home Rita who lost her voice and was in despair due to past trauma.\nRita follows his sweet whisper, \"You'll be my bride,\" but discovers the ruthless side of him who points a gun at people with a smile on his face!\nWhat kind of fate is awaiting Rita who’s greeted by a dangerous mafioso?!"},{"name":" Kantai Collection -KanColle- Shikinami o Hisho ni Shitaku Naru Hon (Doujinshi)","avatar":"https://mangadex.org/covers/011add68-d61a-49b6-8c6f-d8d4aca153a9/eb35172c-ed2d-4319-92ab-fda06778c145.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Girls' Love,Slice of Life"],"nutshell":"Part of the Kantai Collection franchise.\nA Kantai Collection Doujinshi starring a Female Admiral and her Secretary Ship, Destroyer Shikinami, Shikinami's sister ship, Ayanami, and occasionally other members of the fleet."},{"name":" Jog! Jog! Jog!","avatar":"https://mangadex.org/covers/0129cd56-8bf6-4237-aab1-b1b599a151d9/a7ab15ab-a116-42af-b7da-729b8d38cd4b.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Ongoing","tags":["Comedy,Sports,School Life"],"nutshell":""},{"name":" Calorie","avatar":"https://mangadex.org/covers/012b944b-9a62-46ad-8830-18fcb0a7a8cd/b14625da-06ea-478b-b329-1de133f4b53e.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"Toshiyuki had kept on loving his best friend Yasuhira for fifteen years but he ultimately decided to give up this fruitless love. Then, Jun, a mutual friend, comes forward as a potential lover. Toshiyuki is glad, though he knows Jun may only be trying to comfort him and he himself cannot forget Yasuhira easily. Many obstaclies lie ahead for Toshiyuki and Jun's relationship…"},{"name":" Hentai Shinshi to Kisekae Dansho","avatar":"https://mangadex.org/covers/013a0259-f76e-4f04-92ed-80af51a8c8e4/1ab84438-fae6-415f-a85d-8384c8d0911a.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Romance,Comedy,Boys' Love"],"nutshell":"A dress up man Hina, is repeated customer by Furuya which he is dissatisfied with. Even though he said his dream “I want to see you in a naked apron and garter every morning while making miso soup” He did not ask and lust for his body and said its only for the eyes.\nHina’s pride wont allow it, somehow he approach aggressively but still lost to this pervert Furuya..\nUntil one day, A sleepy half awake Furuya push him down, Hina who found out recently the adult charm of Furuya’s which become desire, what will he do?"},{"name":" Koryuu Nara Sude de Taosemasu Kedo, Kore tte Joushiki Janain Desu ka?","avatar":"https://mangadex.org/covers/0142cd5c-c0ea-49c6-a81c-2379587d114b/61a1652a-3270-4ffe-8c1a-cef9398befbf.jpg.256.jpg","country":"Japanese","stat":"5.94","status":"Ongoing","tags":["Action,Comedy,Adventure,Drama,Fantasy,Adaptation"],"nutshell":"Fil was picked up and raised by the [Great Sage], who once saved the world.\nFil, who was raised as the grandchild of humanity’s strongest great sage, inherited his talent, worked magic without chanting spells, and defeated dragons with his bare hands.\nHowever, one day, the great sage summoned his grandchild and told him:\n“Fil, I was silent so far, but you’re a [female].”\nSeriously!? By the way, what’s a female?\nFil’s general knowledge didn’t even contain gender. The great sage, who was concerned about his grandchild’s future, decided to enroll Fil into the Royal Institute."},{"name":" Blue Lantern","avatar":"https://mangadex.org/covers/014531bf-646c-4736-a938-229e72ab7080/d9b56817-e36a-4bde-96be-aac0acec74d2.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Psychological,Long Strip,Romance,Drama,Supernatural"],"nutshell":"A diver has died, but five years of his life have been accidentally destroyed from his blue lantern. Now he must live again. Will he be able to make all the right decisions?<br /><br />Note on the title and premise: A \"lantern\", as it relates to this story, is a vessel, floating on the water, that contains the memories of a person's life that they will see when they die."},{"name":" Qin Xia","avatar":"https://mangadex.org/covers/01453642-9d95-438d-baac-8c362cbe1a6f/cb7e8e19-bba2-49d7-85c2-011caade976e.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.60","status":"Ongoing","tags":["Historical,Action,Martial Arts,Adventure,Fantasy,Full Color"],"nutshell":"Mo Xiaoyu, disciple of the Mo family, was made into a Qin terracotta and sealed for a thousand years. He was woken up in the modern city and decides to find his sister-in-law. Meanwhile, he is being hunted by treasure hunters. What will happen to the young man from the Qin dynasty in a completely different world?\nDonghua/Anime\nhttps://www.youtube.com/playlist?list=PLBakWosU0sfi84psQjXASSl5-usIkb4aV"},{"name":" Souiu Koto Nara, Watashi ga.","avatar":"https://mangadex.org/covers/014be943-b6bb-4f70-ba5d-d3fa8664d21b/9eb1d446-0631-4c1b-9cb7-68b249e45bfb.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Ongoing","tags":["Romance,Comedy,Office Workers,Web Comic"],"nutshell":"I love you so much so just why do I have to wait until I turn 30!?\nNagase Kana (28) is the daughter of a company president and she now works as an OL at the company. Kana is actually secretly dating her boss, Haruhiko (40) and her current source of worry is the fact that he still hasn't made a move on her.\nMeanwhile, Shindou Haruhiko decided on his own that, \"I won't lay a hand on you until you turn 30!\"\n\"If that's the case then I also will...!\", and that's how Kana began to put into action her unexpectedly warped plan!\nHere's a chaotic love comedy about a straight-laced boss and a tomboyish heiress!"},{"name":" Love Sniper 60","avatar":"https://mangadex.org/covers/014d7647-52f5-4e39-8e87-bbd9ee27ca3d/7d8e7643-fb2e-49e6-b5dc-0c7d4870c211.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"「君の泳ぐ姿が、あまりにも美しかったから――」\n妻を亡くして早20年。娘も結婚し、孫も生まれ、あとは穏やかに余生を過ごすだけ…のはずだった。\n趣味ではじめたスイミングの、イケメン年下インストラクターから、まさか告白されるなんて！？\n20年ぶりの恋に、心臓が止まりそう！新感覚、還暦BL！"},{"name":" Metroid: Samus & Joey","avatar":"https://mangadex.org/covers/01586f0f-6bab-4984-9b55-235fb40d1505/8e3958d4-ed6c-48da-87da-66f7268b0c1c.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Sci-Fi,Action,Comedy,Mecha,Adventure,Video Games,Drama,Adaptation,Tragedy"],"nutshell":"A comic based on the action game series Metroid. Samus Aran, a legendary warrior, and Joey, a young boy who wants to be as strong as his late father, are about to embark on an epic adventure across the galaxy!"},{"name":" Mousou Keikenchi Joushouchuu","avatar":"https://mangadex.org/covers/01593237-8a8f-48dd-9483-9844d6b59f8d/bea11cb5-2e19-475b-b2be-2b9143a06aaa.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Comedy,Boys' Love"],"nutshell":"Collection of extra stories previously published as doujinshi."},{"name":" Himegoto wa Hanazono","avatar":"https://mangadex.org/covers/01593760-623b-49b9-a9cc-a6bd4bbe19ce/b7f3224e-ba47-4bb5-a0ec-ee820777e862.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Romance,Comedy"],"nutshell":"Tanaka Ai is a 12-year-old boy who is the youngest of his 7-brother family. After being rescued from bullies by the neighborhood 'yankees' (delinquents/gangsters), it has been his dream to become one of them. He's about to start middle school with his friend Suzuki You and his (older) twin brother Koi, when something very strange happens. Ai transforms into a girl overnight! His older brothers seem to think this is nothing out of the ordinary, but Ai is devastated. As they start school together, with Ai in his new female school uniform, Ai decides not to give up on his dream. If he tries his hardest, maybe he can become a badass lady gangster!"},{"name":" Demon Breeder","avatar":"https://mangadex.org/covers/015d7710-3924-465a-b302-6731773e9ed2/8536415c-eb16-424a-a143-2790a511f309.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.85","status":"Ongoing","tags":["Demons,Psychological,Long Strip,Comedy,Boys' Love,Drama,Supernatural,Mystery"],"nutshell":"Inferiority, cowardice, desire to be loved, but always running away. A human and a demon are in the midst of the uncertain struggle to find a place where they can belong and carry their own way of life."},{"name":" Peerless","avatar":"https://mangadex.org/covers/0162a86d-cd21-4c87-9a7e-d6cb7eabdb20/631b1500-425b-4637-846e-96821187ee82.png.256.jpg","country":"English","stat":"7.80","status":"Ongoing","tags":["Action,Long Strip,Drama"],"nutshell":"Lisa Hart is a Special Enforcement Officer in Gammon City, she operates with other individuals with super powers. For a long time she's been perceived as the lowest rung, but it isn't her ability holding her back…\nNote: Read from left to right."}]