[{"name":" Kakegurui Twin","avatar":"https://mangadex.org/covers/a1422bad-4598-4018-95ae-888435bafe67/671c81fe-8852-4c2d-a522-10f57c3abdf6.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Ongoing","tags":["Psychological,Drama,School Life,Mystery"],"nutshell":"As a first-year student of the renowned Hyakkaou Private Academy, Mary Saotome knows her future is set for a one-way cruise to the top...\nThat is, until an encounter with an old-classmate-turned-housepet throws the newbie princess into the world of gambling! Can a normal girl like Mary make friends and survive debtless through only wit and luck? Find out in this prequel to the mega-popular Kakegurui!"},{"name":" Mahou Shoujo Madoka★Magica - Less Than Friends, More Than Lovers (Doujinshi)","avatar":"https://mangadex.org/covers/a144dbfa-f00c-42d4-ae22-4565cd59a47d/28e74684-cbee-4d61-91f8-05c55ea8734f.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Girls' Love"],"nutshell":""},{"name":" Makura Uo","avatar":"https://mangadex.org/covers/a14aefaa-473c-4824-b297-1d16c4899737/2f3cc961-9b10-425d-8fc6-4bdcf9faa4f5.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Slice of Life"],"nutshell":"I thought I could keep moving forward, but in an unexpected instant, I’ve lost myself in the gaps of this vast universe. Where have I seen this, this landscape that doesn’t exist? Right over there, in a time that will never come to pass. Welcome to the world of panpanya.    The 22 chapters of Makura Uo, which include stories like Ame no Hi (Rainy Day) and Gomi no Sakebigoe (The Cries of Trash), were either serialized in the special web edition of Hakusensha’s Rakuen Le Paradis magazine or published as doujinshi. Included are entries from panpanya’s diary as well as annotations from the author herself.    (Source: Anilist)"},{"name":" Kare no Ondo","avatar":"https://mangadex.org/covers/a1537852-054c-4362-87bd-be22438ab7e9/789c4a3e-d8ef-440e-8333-dba3feeaf148.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Drama,Tragedy"],"nutshell":"Ito, a girl who is physically abused by her father, nonetheless hides it from the people around her. But when things spiral out of control only Ibuki is willing to reach out his hand to try and save her. As the two are drawn together, however, he is simultaneously tied down by obligations difficult to break away from no matter where his heart lays."},{"name":" Light vs Shadow","avatar":"https://mangadex.org/covers/a15ff3b1-cca6-435a-90ec-8516fc16e958/ebcc6d8c-b8dd-44f7-9c99-e19d3d9bb7c6.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.90","status":"Ongoing","tags":["Action,Romance,Comedy,Adventure,Fantasy"],"nutshell":"A badly injured boy was luckily saved by fencer Isabella and Ana, but unfortunately lost all his memory.\nTen years later, the teenage fencer Ryun got a magic sword by accident and all have changed since then.\nHe's eager to explore the mystery of his own life and to solve it.\nThe quiet life was over, the teenage boy, Ryun, started the adventure on his own.\nMeanwhile, in the North Pole - Savage Land, a grand plot was being hatched.\nThe continent Irmo was protected by a sphere of light, so evil spirits could not enter the Kingdom. But one day the monsters start to get out of the forest. Is that dark energy driving them crazy? Ren, a guy who has forgotten his past, goes on a journey to find himself and the missing answers…\nКонтинент Эрмо был защищён сферой света, поэтому нечисть не могла проникнуть в королевство. Но в один из дней монстры начинают выбираться из леса. Неужели это тёмная энергия сводит их с ума? Рён, парень забывший своё прошлое, отправляется в путешествие, чтобы найти себя и недостающие ответы…"},{"name":" Efforts Never Betray","avatar":"https://mangadex.org/covers/a161ff99-04c7-420a-bdf0-ae57941c86ff/f401ddde-ce59-44f9-b2e4-36dbca23b23e.jpg.256.jpg","country":"Korean","stat":"8.58","status":"Completed","tags":["Thriller,Psychological,Long Strip,Drama,School Life,Web Comic"],"nutshell":"Jae-kyung, who grew up under a perfectionist father, must keep first place in the entire school."},{"name":" Kitchen Paradise","avatar":"https://mangadex.org/covers/a16627a1-db24-4268-85ad-3e26f159fc89/2ae6f101-8302-4fa1-a5e9-17033355861d.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":""},{"name":" Lucifer's Right Hand","avatar":"https://mangadex.org/covers/a166ca4c-55cd-469c-941a-5b56016f6859/196a791c-c263-4091-913c-98b501561577.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Psychological,Drama,Medical,Tragedy"],"nutshell":"Three years ago, Katsumi Yu headed to Africa for a volunteer project as a doctor. However, soon after, a civil war erupted and he was captured by a guerilla group who was desperate for a doctor to treat the injured. He kept doing what he came to do, help people in need, and he does this for several years. But with the regime change in the country, the guerilla group was hunted down and Yu was forced into a situation of kill or be killed. He quits being a doctor soon thereafter and gets a tattoo of Lucifer on his right arm as a reminder of his past crimes.\nAlthough Yu returns to Japan, he spends his days drinking. After a night of drunken brawls, he wakes up in a clinic run by Dr. Minatono. This shady looking clinic takes in all patients, even those without insurance or can't even pay but still maintains state of the art equipments. It turns out Dr. Minatono deals with clients, such as the mob, who are unable to go to regular hospitals due to legal reasons and in exchange receives exorbitant amounts of money to help keep the clinic up and running. At first, Yu rejects the job offer from Dr Minatono, but situations keep coming up that keep him busy in the surgery room."},{"name":" Kotodama","avatar":"https://mangadex.org/covers/a16b1641-6ce8-4d57-9d6d-c9dcc083b100/e6b92afd-1e59-4cb7-b548-6f3791716107.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Psychological,Romance,Sports,Philosophical,Drama,School Life,Slice of Life,Tragedy"],"nutshell":"(from ebookjapan):\nA gem of a ballet manga following \"The Dancing Princess Terpsichore\"!\nAs 16-year-old Sumi aspires to become a ballerina, she is lost as she tries to figure out how to overcome her \"weak in the performance\" mentality..."},{"name":" Touhou - Meisou Jukkaichi (Doujinshi)","avatar":"https://mangadex.org/covers/a16c9c97-d02e-474e-a618-b19442763958/cc388811-719b-47e6-b4e2-1ac1043b224d.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":[""],"nutshell":"La hitoria de Youmu Konpaku probando su valor como la sirviente de Yuyuko Saigyouji."},{"name":" Cousin","avatar":"https://mangadex.org/covers/a16d2b4c-2f2a-4b48-84ff-1e4904cbf7fd/6bdfe4cc-5e07-49a4-b024-18ec794c2fda.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"18 year old Tsubomi has a bit of a weight complex. After graduation from high school, she takes up a part-time job at a video rental store where she is introduced to another male employee, 19 year old Shiro, whose shifts always seem to coincide with hers. Shiro casually mentions that she reminds him of someone familiar. A few days later, while on duty, she bumps into a customer in one of the aisles. He leaves, but not without dropping his membership card, and Tsubomi finds out that his name is Nasukawa, and that he is an acquaintance of Shiro's. Meanwhile, after a song for a commercial comes on, Shiro realizes that Tsubomi reminds him of a famous model in a commercial (her \"eyes\", at least), who turns out to be none other than Tsubomi's cousin…?!"},{"name":" Fairy Cube","avatar":"https://mangadex.org/covers/a16fa106-a60c-4a3f-8558-e6f83fcbb726/d32caade-b00e-493d-869f-29101f977384.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Drama,Fantasy,Supernatural,Mystery,Tragedy"],"nutshell":"Ian and Rin used to just see spirits. Now Ian is one. Using the Fairy Cube, Ian must figure out how to stop the lizard-spirit Tokage from taking over his life and destroying any chance he has of resurrection.\nVolume 3 contains an unrelated short story:\n\nPsycho Knocker\nAshina Tomo is your average school girl who somehow constantly has terrible images of a train accident. One day, on her crush’s birthday, her best friend brings her to an isolated print club machine which is rumored to allow prayers to come true. What would happen when your prayers come true, but not the way you want them to be? By a cursed print club machine nonetheless."},{"name":" Departing for Onnakubi Station at 5 AM","avatar":"https://mangadex.org/covers/a1701872-b0e4-43ae-ae55-1af4dc1a64df/2f8d3249-fe2f-4fc1-b653-f1cd86408d95.png.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Historical,Monsters,Psychological,Crime,Survival,Mafia,Office Workers,Philosophical,Drama,Horror,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nOnna-no-kubi village...\nthe name comes from the fact that a long time ago, a wrongdoing woman was beheaded by the daimyo and her head was kept on a street in the village for a month....\nIn the Onna-no-kubi village, murders occur one after another between the rival Nitobe family and the Kukijo family.\nKazuya, the eldest son of the Nitobe family and a newspaper reporter, returns to his hometown to solve the mystery of the murders!"},{"name":" Hero the Maximum","avatar":"https://mangadex.org/covers/a172180b-a9b8-4df7-8570-f81eb1e0e9bd/e1ef16a6-b324-4783-aa2d-5315ecaf8629.png.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Action,Long Strip,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"‘I want to become number one.’ It didn’t matter what category he became number 1 in, but incompetent South Korean highschooler ‘Han Gangchi,’ wanted solely to be the best in something. He stumbles upon an astounding talent in him and… That was the ‘hero’s’ power? In a peaceful time where evil and good are indistinguishable, he and the other heroes begin their merciless purge of the villains!"},{"name":" Debby the Corsifa is Emulous (Oneshot)","avatar":"https://mangadex.org/covers/a1741d0d-3692-4c1e-aaa5-530213cab2b0/2aa13cce-4eac-4b7a-8042-30da6d3cac00.jpg.256.jpg","country":"Japanese","stat":"8.38","status":"Completed","tags":["Oneshot,Traditional Games,Demons,Comedy"],"nutshell":"In the deep depths of Hell lives a bloodthirsty demon known as \"Debby the Corsifa.\" She loves a good fight, but not a single entity in Hell can match her in combat. Bored, she decides to blow off steam by wiping out the human race! However, after arriving on Earth, Debby meets an equally bored human named Rokurou Sugo just as he audibly wishes for someone to play games with.\nDebby immediately challenges Rokurou to a fight that he cannot imagine winning, let alone live through. Panicking for his life, Rokurou dares her to a game of \"Old Maid\" as a better—and safer—way to kill time. Despite appearances, Debby proves herself to be an airhead who is only meant for fights! Still, no matter how many times she loses, Debby refuses to give up until she beats Rokurou in a game."},{"name":" Oyama! Kikunosuke","avatar":"https://mangadex.org/covers/a17edc53-15c5-43d9-a7e0-5a31f3131473/22f5f5a9-544c-42d0-9a4f-ff56e7687210.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,Harem,School Life,Slice of Life"],"nutshell":"The main character, Kikunosuke Fujii, arrives at the prestigious girls' high school \"Kurogami Gakuen\" under the guise of studying the female form, and gets into trouble one after another in this school comedy."},{"name":" I Started Crying After my Daughter Discovered my Crossdressing","avatar":"https://mangadex.org/covers/a1850921-d8ea-4124-ab8e-108ef6d7a126/64c20fe8-7b13-4cf8-9577-53818ddba9c3.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Oneshot,Crossdressing,Web Comic,Slice of Life"],"nutshell":"It’s about a father who cries after his daughter catches him crossdressing"},{"name":" 30-sai, Shojo OL","avatar":"https://mangadex.org/covers/a1901cd5-2a5c-47fc-9d28-9165c869c1a9/aa54fd5d-b39f-4a6a-b61d-04a5f7eb0ca1.jpg.256.jpg","country":"Japanese","stat":"7.32","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"Hinako, a 30-year-old virgin, has always had relationship problems. Due to her dirt phobia, she punches any guy who touches her. Desperate to find someone to love and help her graduate from being a virgin, she takes her much younger co-worker Kai up on his offer to date his friend Machida. Will she finally be free from her virginity streak and find someone to love her despite her phobia?"},{"name":" Angel Gunfighter","avatar":"https://mangadex.org/covers/a1905002-93bf-42fc-8fc2-74d3031e1368/d98117be-e940-45cc-9e2c-cc889521c774.png.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Thriller,Historical,Action,Psychological,Romance,Comedy,Crime,Adventure,Drama,Police"],"nutshell":"The rogue cop Ham Egg is plotting to take over a small town on the border region between New Mexico and Arizona. Only one thing stands in his way: a Native American sharpshooter known as \"Monster\". Aiding Monster are two other young sharpshooters, Anna and Jim, who combat Ham Egg and his gang to end corruption and liberate the town.\nCover image shown is from the Osamu Tezuka Complete Works. This version of Angel Gunfighter was published after Tezuka's passing.\n\nVolume 324 of the Osamu Tezuka Complete Works"},{"name":" My Bride is His Wife","avatar":"https://mangadex.org/covers/a19a1d68-da63-4420-a99f-80b8c2eb0651/74abe20d-b547-4b5f-8e81-81f1694b4cd1.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Romance,Drama,Slice of Life"],"nutshell":"Shimatani Shousuke, an editor for a publishing company in Tokyo and Yamauchi Shinichirou, a graduate of one of Japan's top universities and bank employee, have been best friends all life long. After both of them proposed to the same girl, to keep their friendship intact, all three of them decide to get married.\nWill this decision bring them closer together, or end up with one of them being left behind?"},{"name":" For once story","avatar":"https://mangadex.org/covers/a19c8cc1-3b28-45ef-8756-c43deb3da481/1a65bb24-f4d8-4d1d-a504-210e460a1e0b.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Oneshot,Comedy,Supernatural"],"nutshell":"Adults–they just don't get the pressures of being babies! Thoughts on growing up from the Kindergarten of Evil students."},{"name":" J. Boy: Second Season","avatar":"https://mangadex.org/covers/a19f3d3a-fe5e-49ff-8335-529ea3fa7388/d18a5796-0416-4ada-8fc7-2a0c9f1e9926.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Psychological,Sports,Mafia,Drama,Mystery"],"nutshell":""},{"name":" Ikemen Dansou Reiya ni Koishiteru!!","avatar":"https://mangadex.org/covers/a1a12a65-ff2d-4745-8b1c-d25664b27a84/7f3fe26e-c9ea-4093-8c7b-2eb2703761d2.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Ongoing","tags":["Romance,Comedy,Crossdressing"],"nutshell":"Assistant cameraman Osaka Kippei is one day invited to a cosplay event by his coworker where he meets the most handsome man he has ever seen: Ichinose Makoto. And through twists and turns they become friends.\nIn reality, however, Kippei is mistakenly thinking Makoto is man and Makoto, trying to avoid disappointing Kippei and losing him, is doing her best to act like a man for him. But what are these conflicting feelings they feel!? The mistaken love comedy between Kippei who thinks she's a man and Makoto the handsome crossplayer starts!!"},{"name":" Ascribe to Heaven","avatar":"https://mangadex.org/covers/a1aac928-7a29-41f3-b497-2c7a1f4f7ef3/6dba167f-c5bd-4227-8018-6ab4d9af837e.png.256.jpg","country":"Japanese","stat":"7.97","status":"Hiatus","tags":["Romance"],"nutshell":"Minnie’s the only human living on an alien planet and because of that she’s rejected by almost all the other inhabitants. Then one day something falls outside of her house and it happens to be… a human prince?!"},{"name":" Bokutachi wa Shitte Shimatta","avatar":"https://mangadex.org/covers/a1ae6f90-55c5-4715-98a2-f6d7bf6e0bd2/78c363be-86ab-4689-8648-57b9e650f823.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Kaji Kotori is a shy girl and was always bad at making new friends, especially with guys. Since the start of high school she has been made fun of by Kaji Yukito who’s the centre of attention of the class. Rumours are that he was a delinquent during middle school but he doesn’t look like one. Here comes the life of Kotori and how she adapts to love."},{"name":" Voice Radio: Boku no Suki na Personality","avatar":"https://mangadex.org/covers/a1b0a67f-1a45-4b2a-9cc9-1cb97504b331/c96550f3-0356-4589-b782-a406314be79c.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Romance,Comedy,Slice of Life"],"nutshell":""},{"name":" Shin Yami Kariudo","avatar":"https://mangadex.org/covers/a1b155de-de3c-4875-aec4-9c344a6f7f2d/3ec1fd4f-da65-494c-b61a-bf776d65db58.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Drama,School Life,Horror"],"nutshell":"An agent of revenge, the dark hunter (Yamikari Udo), to dispel evil that cannot be judged. In the present age when their existence became an urban legend, there was one girl who slaughtered evil as a dark hunter. A blood-stained requiem (story) of a girl who plays with the sinner's sacrifice approaches the light and darkness of the human world!"},{"name":" Momo no Majutsushi","avatar":"https://mangadex.org/covers/a1b2cf89-d1fe-45a5-9722-c56d31b7a847/244cbf4e-a483-42ef-b58d-bbde1a8df63a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Harem,School Life,Fantasy"],"nutshell":"A boy picks up a magic book in the library and the funny situations happen …"},{"name":" Ice Cream","avatar":"https://mangadex.org/covers/a1b34412-0119-42a5-bdf5-4d0e239b7f01/0ca2007c-ee2e-442a-af69-277617238227.jpg.256.jpg","country":"Japanese","stat":"7.57","status":"Completed","tags":["Oneshot,Romance,Philosophical,Web Comic,Slice of Life"],"nutshell":""},{"name":" Hero in White Coat","avatar":"https://mangadex.org/covers/a1c58fbc-d805-4964-99fb-12b8fd07ec53/cd3362ab-7b39-4da2-a3fc-1a5de3b923d9.jpg.256.jpg","country":"Japanese","stat":"7.46","status":"Ongoing","tags":["Monsters,Action,Adventure,Magic,Isekai,Fantasy,Adaptation"],"nutshell":"Tenchi Kaito is a rare genius scientist. When he wakes up one day, he has been transferred to another world. Kaito obtains a rare magic called \"Creation\" that allows him to create things he once saw. With the help of a female mercenary, Kaito lives with her, earns money by using his creation magic, and spends his days in peace and fun, but he gets caught up in various disturbances. …Using his unparalleled brain and creative magic, he lays waste to his enemies! Other than athleticism and a good sense of naming, this is an otherworldly fantasy due to a natural disaster that's perfect!"},{"name":" Love Live! - Good Bye Melanconico (Doujinshi)","avatar":"https://mangadex.org/covers/a1c9f510-0345-4154-8419-37850272a78d/0f11abae-4b81-45ef-b538-aa0abe30cc96.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Ongoing","tags":["Oneshot,Girls' Love,Music"],"nutshell":"Pairing: Nishikino Maki x Yazawa Nico"},{"name":" Sweetheart V5: The Boss Is Too Kind!","avatar":"https://mangadex.org/covers/a1ce5a9b-d451-47d9-9fdf-2d5530997d88/4966979a-de78-4157-9b31-65901477f889.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Ongoing","tags":["Historical,Action,Long Strip,Romance,Comedy,Reverse Harem,Isekai,Drama,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Jing Yiren was a proud and talented 14-year-old princess. One night, she was transmigrated, and she became the 19-year-old wife of the Lu Conglomeration's President.\nThis sudden change would test every fiber of her being!\nFor his part, Lu Ming now has to deal with a wife who is wholly confused by her new station in life.\nIn the face of such problems, he can only get through to her with his actions\nNote: This is a Reverse Isekai."}]