[{"name":" My Pre-Wedding","avatar":"https://mangadex.org/covers/cd779f4f-8131-4cec-8629-f2fccbf1735a/bb9d375b-c46b-45f0-80f1-eb259278884d.jpg.256.jpg","country":"Indonesian","stat":"8.01","status":"Completed","tags":["Long Strip,Romance,Comedy,Full Color"],"nutshell":"An unexpected marriage proposal from a manager that has been only \"watching\" from afar.\nOfficial Indonesian release:\nVolume 1: M&C Gramedia\nVolume 2: M&C Gramedia"},{"name":" The Founder","avatar":"https://mangadex.org/covers/cd79e505-ca47-4423-9ce8-8bd973095afe/5b41c10e-e21d-4fb3-ad7c-4ff8dcaaa86e.jpg.256.jpg","country":"Korean","stat":"8.09","status":"Ongoing","tags":["Action,Long Strip,Crime,Drama,Web Comic,Full Color"],"nutshell":"In the 1970s, a secret operation was operated due to excessive loyality to His Excellency and this became the basis for the establishment of Korea’s first hit-and-run company in the 1980s, when the government changed. The ace agent of the craft squad survives desperately and becomes the CEO of a killer company and leads the company…"},{"name":" Afterschool War Activities","avatar":"https://mangadex.org/covers/cd79eb55-86db-48a8-9e65-f136cd9c69cf/2e8b7742-ab75-4daf-b8cb-2a075d2fc401.jpg.256.jpg","country":"Korean","stat":"8.53","status":"Completed","tags":["Sci-Fi,Action,Psychological,Long Strip,Military,Drama,School Life,Horror,Aliens,Tragedy"],"nutshell":"Strange things are appearing from the sky, and the world is slowly dying. In Korea, there aren't enough military men to fight these enemies off, and high-school and college students have no choice but to join the military and help the others survive - at the risk of their own lives."},{"name":" Neko to Watashi to Deutschland","avatar":"https://mangadex.org/covers/cd7f696b-be1a-4219-9399-ed01b5509f7a/19b04920-5eb0-4802-8f6e-acea28fc489e.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Animals,Web Comic,Slice of Life"],"nutshell":""},{"name":" Falling For My Former Wife","avatar":"https://mangadex.org/covers/cd8142f3-cd6c-45aa-9dfa-2d19bca7a6e3/5e956174-70b6-4a3b-b21f-e52ae15a9ef8.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Long Strip,Romance,Drama,Web Comic,Full Color"],"nutshell":"Lu Nanyin is married to Gu Xiaocheng as a business alliance to save her family's company. However, actress Yu Weilan is the one that Xiaocheng loves, and she always schemes against Nanyin. With a devious mistress and a husband who doesn't love her, will Nanyin have a peaceful life?"},{"name":" I Want to See a Naked Girl in Real Life","avatar":"https://mangadex.org/covers/cd8197af-e771-46de-82a0-5e70f977e6a1/a5a3b64c-4c92-40a4-938c-f04979161c47.jpg.256.jpg","country":"Japanese","stat":"8.26","status":"Completed","tags":["Oneshot,Romance,Comedy,Anthology,School Life"],"nutshell":"Wanting to see a naked girl in person, Tsuda Kouta attends a nude model sketching session where he was awakened to the arts.\nThere, he also meets our heroine who speaks in Kansai dialect and a pure, sugar-sweet love begins to unfold.\nFive other short stories included!"},{"name":" I Have No Health","avatar":"https://mangadex.org/covers/cd899926-20df-4f4b-b400-3b9917cf2882/e8e3cf79-0fd8-421a-aeb3-f42dd5a025f5.jpg.256.jpg","country":"Korean","stat":"8.22","status":"Ongoing","tags":["Long Strip,Romance,Magic,Isekai,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"I’ve gone into the body of ‘Ninaina’, the weakest character, who was fated to die once winter came!\nWith such with weak stamina that it’s hard to even take walks, eat, or just stand, let alone exercise, I have such a tragic life that I even have to endure assassination attempts from my grandfather…\n“I will definitely recover my health!”\n“Kaiser” who comes to Ninaina’s side with a cold gaze. Receiving the order that he has to keep Ninaina alive, he comes to her side and protects her.\n“You will not die. For now.”"},{"name":" Beast Complex","avatar":"https://mangadex.org/covers/cd9b65e3-b9e2-4d8b-b9dd-0bc8be59f312/4240be84-b9be-4fb9-a910-bd7104698e43.jpg.256.jpg","country":"Japanese","stat":"8.54","status":"Completed","tags":["Psychological,Animals,Romance,Comedy,Drama,School Life,Horror,Fantasy,Slice of Life,Mystery"],"nutshell":"A collection of short stories that involve anthropomorphic animals and their troubles with coexisting with different species. Itagaki Paru's debut manga."},{"name":" A Black Company's Employee Became a Cat, a Life-changing Story.","avatar":"https://mangadex.org/covers/cd9b7a1d-1315-4e74-822f-a780bb4d3c65/2d8cab47-c67b-41b3-ad4f-ef98b6ff6790.jpg.256.jpg","country":"Japanese","stat":"8.61","status":"Ongoing","tags":["Animals,Comedy,Office Workers,4-Koma,Full Color"],"nutshell":"A manga that depicts the life-changing story of the employees working in a heartless corporation after they've all turned into…cats? o_O Nya-lyfe is really full of ups and downs, and it's impossible to prepare for it nya? Well, this is my story…"},{"name":" Kyouran Kazoku Nikki","avatar":"https://mangadex.org/covers/cda25787-5154-4a96-ba3c-4e7a4e6a9385/eeec12d5-a94a-49be-a1ab-9d01d95916bf.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Sci-Fi,Action,Romance,Comedy"],"nutshell":"A thousand years ago, Enka, the god of destruction, died leaving a prophecy that its \"child\" would one day destroy the world. In order to prevent this, \"Operation Cozy Family\" is implemented in which the children who are potentially prophesied as the \"Child of Enka\" are forced to live together. This impromptu family contains all children, human and otherwise, as well as an official of the bureau and a self-proclaimed goddess who act as the parents of the household. The goal of \"Operation Cozy Family\" is to discern who the prophecy applies to, as well as to teach them all about the love of family in hopes of convincing the \"Child of Enka\" not to destroy the world. But with all families, there's bound to be mishaps and adventure - especially when the fate of the world is at hand!"},{"name":" Aru Hi, Majo ga Sekai wo Horoboshita","avatar":"https://mangadex.org/covers/cdaec8c8-cd76-4e43-b323-3925bf1e7cba/50995d77-062f-4b18-95ab-d11da212805d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Adventure,Drama,Fantasy"],"nutshell":"妹だけが私の光なの――。妹のいない世界など滅んでしまえばいい。その願いを魔女は引きうけた――…。表題作の他、話題となった「僕とカラクリ」などの連作を収録した珠玉の短編集!!"},{"name":" Hito wa Bat de Nagurareru to Shinu","avatar":"https://mangadex.org/covers/cdb1f9d7-5f1e-4cc5-9fed-3ec2033f24ca/f1615b53-33d4-49e6-a957-03976aec2d75.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Oneshot,Award Winning,Zombies,Drama,School Life,Tragedy"],"nutshell":"Honorable Mention in the 107th Newcomer's Manga Awards."},{"name":" Have a taste ms.kim","avatar":"https://mangadex.org/covers/cdb39eb6-2078-4e64-a266-0530d3c07d55/11a1ea77-968d-49f6-bd9a-da98b4fa008f.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Ongoing","tags":["Psychological,Romance,Office Workers,Drama,Adaptation"],"nutshell":"\" Faixa.\" Um rosto que foi apagado da minha memória. Aquele Yoo Seungjae. Depois de nossa separação infeliz, tudo recomeça entre ele, o diretor administrativo da empresa, e eu, uma gerente adjunta. E quando esse incidente ocorreu após 7 anos de separação, aquele homem considerou isso como uma 'dívida' dela, e ele começou a ameaçar Seoyeon. \"Você mesmo disse daquela vez que certamente pagaria de volta, não é, sunbae? Você disse que não queria dever nem mesmo a vida do seu irmão mais novo.\" \"Sinto muito, Seungjae.\" \".....\" \"Eu não fiz tais ameaças infantis para ouvir seu pedido de desculpas. Você deveria pelo menos tentar oferecer seu corpo como pagamento ou algo assim.\" \"Se você diz... então eu vou.\" \"Desculpe?\" Tive uma intuição no momento em que nos conhecemos: \"Eu"},{"name":" TV Anime Secret Production Stories ~Osamu Tezuka and the Youth Who Made Anime~","avatar":"https://mangadex.org/covers/cdba0819-e50d-4a4e-a164-c30ae0d62385/56a469b4-564e-4d04-8162-8e519a4174a3.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sci-Fi,Historical,Psychological,Comedy,Mecha,Adventure,Office Workers,Philosophical,Drama,Aliens,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nThe thoughts and feelings of the people on the frontlines of the early days of TV anime are depicted in this controversial work by Masaru Miyazaki of \"Black Jack Secret Production Stories ~From Osamu Tezuka's Workplace~\"."},{"name":" A Pleasure Killing Princess","avatar":"https://mangadex.org/covers/cdbf073e-28f9-44d3-b133-a3eb69aa8163/40740289-3681-4151-8d77-f5b230a3da91.jpg.256.jpg","country":"Japanese","stat":"7.40","status":"Ongoing","tags":["Thriller,Action,Psychological,Romance,Crime,Drama"],"nutshell":"When I was tapping her cheating sex scene, she laughed and killed the other man. ──── Kana-san, an older busty beauty, was finally made by me as a junk person. I don't know how old I am or where I am from, but I'm such a kind person who goes out with me. I was satisfied with that alone. One day, I was worried about Kana-san, who wouldn't let me have sex, and eavesdropped on her. However, I will soon regret it. I may be killed if I have sex too. However, I really like Kana-san…\nA college student, estranged from his friends and family, hooks up with his older female co-worker. Despite dating for 6 months she still says he's too young to have sex with her. Concerned that she's cheating on him, he uses a hacked app to spy on her through her phone, and what he sees he never expected."},{"name":" We Met in Ueno","avatar":"https://mangadex.org/covers/cdc0d8ad-7049-4f87-8e44-ca82a956c51c/f6ba882a-d972-42fd-95e7-b087eb8be43b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.10","status":"Completed","tags":["Romance,Boys' Love,School Life,Slice of Life"],"nutshell":"The meeting in Ueno between Lin Ge and Hiroki Asano began with a misunderstanding, but the two gradually built up their friendship despite language and cultural differences. This is a cute and funny story of a Chinese boy and a Japanese boy!"},{"name":" Delicious Seasons","avatar":"https://mangadex.org/covers/cdc4fc09-d071-4826-af96-9c04d32c659b/8bc686c8-d53f-44e0-87dd-12f5336d3c80.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Completed","tags":["Comedy,School Life"],"nutshell":"Liang Qiu, a boyish-looking girl who just moved to the city, finds herself in a situation in which she has to help her classmate Lei Yi Xin by taking care of his meals while his mother is out of the country. Lei Yi Xin has the reputation of being a very hasty and cold person. Liang Qiu's friend, LuLu, warned her about that, and told her to be careful! How will their relationship work?\nFrom Tokyopop: Xiao Chiu dreams of becoming a great Chinese chef, always has the urge to cook food when she's in the kitchen, and cuts vegetables whenever she has a knife in her hands. Her passion for cooking was rewarded when she found a well-paying job - to be Lei's personal chef for a month. But Lei is arrogant, smokes, has a bad temper… and is very picky about food. He has a sensitive stomach and will throw up if something he ate does not agree with him. He also will not eat anything that doesn't suit his taste. What a hard-to-satisfy guy Lei just happens to be her classmate, too Poor Xiao Chiu Even worse, after one month, having spent day and night together, they develop tangled feelings towards each other Xiao Chiu feels confused. In seeing the one-month deadline approaching, she decides to run away. But, if she does not cook for him, Lei may get sick again… Xiao Chiu, what are you going to do?"},{"name":" Me and My Professor","avatar":"https://mangadex.org/covers/cdcab540-6d0b-404f-8072-1f7d44ef9f56/cbd15387-e4d6-43d0-a6b1-f8d0659382cd.jpg.256.jpg","country":"Chinese (Traditional)","stat":"7.58","status":"Ongoing","tags":["Long Strip,Romance,Drama,School Life,Web Comic,Full Color"],"nutshell":"Yali Han must live with the handsome professor because of her financial problems. At first all was well, but one day an unexpected thing happened…"},{"name":" Meguru Mirai","avatar":"https://mangadex.org/covers/cdce6cdf-6817-49a8-842c-7a8d7f9b6463/9f27dcbf-7fb8-4e6d-9073-649171d0f70b.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Drama,Mystery,Tragedy"],"nutshell":"Mirai, a man who does not show his emotions, lives happily with his innocent and cheerful wife Meguru, but he has a \"cursed disease\" that he keeps secret even from his wife.\nThen one day, Mirai receives an important call from the police concerning his wife...!"},{"name":" Please Be My First Boyfriend!","avatar":"https://mangadex.org/covers/cdd15fb7-665b-4ffd-8a93-686b17de46a1/78175e93-85a4-4e87-8783-122fb0d04d38.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Office Workers,Web Comic,Full Color"],"nutshell":"CEO, Baek Yujun is a chaebol with a very handsome face that others often admire. Unfortunately, Yujun has no experience in dating.\nOne day he has a fateful encounter with Han Heewon and Yujun falls in love, at first sight, but gets bluntly rejected when he tries to approach Heewon. Still, Yujun doesn’t give up!\nHeewon has often been hurt in past relationships and has decided never to date again. Instead, he focuses on running a hair salon with his manager. However, while they were having trouble running the salon, Yujun helps them and slowly Heewon opens his heart to Yujun.\n\n\nOriginal Webtoon <Naver>\nOriginal Webtoon <kakao>\nOriginal Webtoon <Mr.Blue>\nOriginal Webtoon <RidiBooks>\nOriginal Webtoon <Bomtoon>"},{"name":" Back to the Highteen","avatar":"https://mangadex.org/covers/cdd4c44e-976a-43fd-9418-98a7b254bad8/eaf198aa-c9de-48f8-9d99-770f30c382ec.jpg.256.jpg","country":"Korean","stat":"8.15","status":"Completed","tags":["Long Strip,Romance,Comedy,Drama,School Life,Web Comic,Full Color"],"nutshell":"Bo-Young is 28 years old and still struggling to finish college because she can't afford the tuition. After being unceremoniously dumped by the boyfriend she had supported over the years, Bo-Young gets the chance to get herself out of her stagnant life when she accepts a position to pose as a high school student for a year. All she has to do is avoid getting caught."},{"name":" Final Fantasy - The F (Doujinshi)","avatar":"https://mangadex.org/covers/cdd744dc-1bf8-4d5a-871b-7740ae50933c/bd10999f-1b1f-49e4-b75a-a6aca9fbfb9f.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Action,Drama"],"nutshell":"A collection of six different books published between 1999 and 2010 by Shirow Miwa, author of Dogs, based on Final Fantasy 7, 8, and 9. (No crossover content. All drama, all awesome.)\n\n\nFinal Fantasy VII – Agharta\nThe final battle as at hand. As Meteor crashes down upon the planet, Cloud is forced to confront his false memories and the question of his own existence in a brutal mental attack even while Avalanche struggles to stay alive in a losing battle against Safer Sephiroth. (Features all of Avalanche vs Sephiroth, plus the Turks.)\n\n\nFinal Fantasy VIII – Fragile I\nOn the way back from a mission, Squall sneaks off alone to settle the score with a face from the past.\n\n\nFinal Fantasy VIII – Fragile II\nKiller fight scenes, depressive anti-anti-heroes, and a heroine that somehow makes spectating into an art form in the conclusion to Fragile.\n\n\nFinal Fantasy VII – Asche zu Asche\nSet prior to the events of Final Fantasy VII. Sephiroth and Tseng have a lengthy heart-to-heart about the war in Wutai, not-so-covert operations, and Hojo’s psychopathic tendencies. (Features Sephiroth, Tseng, and Hojo.)\n\n\nFinal Fantasy IX – A Story\nAfter the Iifa tree unceremoniously dumps Kuja into a heap after the events of the game, he wanders his way to the Black Mage village where granting the request of an old enemy nearing the end of his days might just save the black remains of his soul from spending an eternity in hell. After all, who doesn’t want to leave something of themselves behind when they’re gone?\n\n\nThe F – Epilogue"},{"name":" Weird Guy","avatar":"https://mangadex.org/covers/cdd98ca9-4720-4b4d-9e8d-7aa6ca387b29/c99abcea-a3ca-4649-970b-44e90850d8bb.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Completed","tags":["Reincarnation,Long Strip,Romance,Comedy,Fantasy,Web Comic,Slice of Life,Full Color"],"nutshell":"'Divine' appeared with a shooting star in front of'Soi' who lost his family and lives harshly.\nHe doesn't leave Soi's side with a nonsense saying that he wants to go back with himself to balance the stars…\nA cohabitation romance between'Taurus God Soi' who lost memory and became a human being and'Scorpio God Divinity' who came to the human world to pick up Soi?!\n(Google Translate)\n\nOriginal Webtoon (kakao)\nOriginal Webtoon (Bomtoon)"},{"name":" The Menu of Yuki Usagi","avatar":"https://mangadex.org/covers/cdd9b88f-eb0c-4fbd-9912-018b7f765e46/95a556cb-6299-4c33-94d8-1f62cd8c2c3e.png.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Drama,Slice of Life,Cooking"],"nutshell":"College student Aoi collapsed due to anemia, but she was saved by a young man named Daiki, who is also the shopkeeper of a small restaurant called “Yuki Usagi”.\nDue to some circumstances, Aoi became unable to eat meals. Nonetheless, her heart is drawn to how Daiki cooks dishes and eats them.\nThis is the manga version of the highly popular novel from Orange Bunko."},{"name":" Gensou Suikoden I - Eve (Doujinshi)","avatar":"https://mangadex.org/covers/cddb276f-c525-4633-bb6c-a376d492ef81/9dca350a-778d-49b7-bdee-da9d67b8e051.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":[""],"nutshell":"A short and beautiful doujinshi by the renowned Migi. A past where Ted and Sierra meet…"},{"name":" Tried Watching the Cursed Video","avatar":"https://mangadex.org/covers/cdded836-5be4-425b-9c7f-2b98663ca80f/79474df4-3e15-4b6e-9380-2288d8728362.png.256.jpg","country":"Japanese","stat":"8.22","status":"Completed","tags":["Oneshot,Thriller,Ghosts,Comedy,Web Comic,Supernatural"],"nutshell":"Samara versão manga japonês"},{"name":" Katsute Mahou Shoujo to Aku wa Tekitai Shiteita","avatar":"https://mangadex.org/covers/cde5b132-fa09-4306-89e1-12d3662c234e/831ca207-da56-422d-a576-6dee14cb46c1.jpg.256.jpg","country":"Japanese","stat":"8.37","status":"Cancelled","tags":["Romance,Comedy,4-Koma,Fantasy"],"nutshell":"\"This is the first, and probably final, loose hostile relation.\"\nThe Day To Day Life of Magical Girl and The Right Hand-Man of an Evil Empire.\nThis manga is discontinued, since the mangaka passed away."},{"name":" Amai Jouken","avatar":"https://mangadex.org/covers/cdea3ca9-2cb4-44da-a423-e8dd9c37940e/f3de12df-90d3-413b-a267-d0624499a9d0.jpg.256.jpg","country":"Japanese","stat":"7.56","status":"Completed","tags":["Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"Sonobe Munekazu, a sexy and cool French restaurant boss, suddenly appeared in front of Hisaya and took him home after saving him from his violent ex-lover. Hisaya started working at the restaurant while living together with boss. Love sparks flew and jealousy arose when the boss's friend, Nagamori Kyou, appeared. Was there a real reason for the boss to pick up a total stranger?"},{"name":" Shingeki no Kyojin - Sekai no Owari wa Kimi to (Doujinshi)","avatar":"https://mangadex.org/covers/cded91ca-552a-45ed-a172-7180ed1fceba/f0eab550-1aa2-453a-8635-0aeef9471860.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Boys' Love"],"nutshell":"Pairing: Erwin x Levi"},{"name":" Onee Joou to Shirayuki Hime","avatar":"https://mangadex.org/covers/cdef0118-62b1-4fba-9520-b7abca316845/643391dc-a977-47e2-933e-4f40046b56f4.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Romance,Comedy,Fantasy"],"nutshell":"Once upon a time, a beautiful king (or queen?) asked his mirror: \"Magic mirror in my hand, who is the fairest in the land?\"\nAt first, he is mesmerized by Snow White's image, BUT to his greatest displeasure, his face wasn't reflected in the mirror. Snow White needs to disappear !\nPTBR:\nEra uma vez, um lindo rei (ou rainha?) que perguntou ao espelho: \"Espelho, espelho meu, existe alguém mais belo do que eu?\". No começo ele fica hipnotizado com a imagem da Branca de Neve, MAS, para seu grande desprazer, seu rosto não se reflete no espelho. A Branca de Neve precisa desaparecer!"},{"name":" Only Rika","avatar":"https://mangadex.org/covers/cdf796a3-7c2b-45d7-b226-10bd67302a83/fb0a0078-a769-4ffb-8969-eba9a8c73846.jpg.256.jpg","country":"English","stat":"6.77","status":"Ongoing","tags":["Genderswap,Comedy,User Created,Slice of Life"],"nutshell":"Rika is a beautiful and very mysterious woman but she is actually a robot controlled by a man, Rika has a cheerful character and does a lot of fun things, all that Rika does is actions that man really wants to do as someone else. Only Rika tells the daily life of Rika who enjoyed her day but was always exposed to problems with her friends."},{"name":" Gal Nin","avatar":"https://mangadex.org/covers/cdfb9709-5580-484e-8d30-3e7b71cc92f5/db5d001a-25d7-48a9-9ee9-860b87aec972.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Action,Ninja,Comedy,Gyaru"],"nutshell":"A newcomer for the seasoned ninja... A flashy gal!"}]