[{"name":" Unsung Cinderella","avatar":"https://mangadex.org/covers/fa9d1d39-14b1-4b64-9b66-358b329a1a14/5d0a64b2-bddd-41da-b788-e4e2c1e174e2.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Drama,Medical,Slice of Life"],"nutshell":"Aoi Midori, 26, works as a 2nd-year pharmacist at a general hospital. Even if she can't be relied on like a doctor and she can't be as close as a nurse, she runs around the hospital in order to protect the patient's \"normal day-to-day\"!"},{"name":" Miagareba, Koi","avatar":"https://mangadex.org/covers/fa9f0584-873a-46e9-a866-d6f41253f301/177bf20c-ba39-449d-a38b-272cb7ea8e63.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,School Life"],"nutshell":"Hi! My name is Nagi and I'm in my first year of high school! Both my parents are busy with work and my brother who's in uni is rarely home. So, I'm usually alone. For birthdays, it is the family custom to have karaage but on the night of my 16th birthday, not only did I make the karaage by myself, but I also ate it alone. That's when my brother's friend Shuu-san brought my drunken brother home. He's not only a gentleman, but he was also even worried about me having to be alone at home!"},{"name":" For You, I Will Follow Obediently","avatar":"https://mangadex.org/covers/faa50f98-e741-4b71-bdf5-56957d66ea71/5d41619a-b070-45d6-b529-1ba51ed19568.png.256.jpg","country":"Chinese (Simplified)","stat":"7.26","status":"Completed","tags":["Sci-Fi,Official Colored,Long Strip,Romance,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"Xia Yu Xiang was born in a family devoted to raising butlers and was trained from a young age to dedicate his life to protecting his master. Finally, Xia Yu Xiang is presented with an opportunity to make use of his skills when he is recruited by the Zong Zheng family to be a butler. Zong Zheng Tong is a young, petite, genius girl with cold, distant blue eyes, and a stern, rigid personality. How will Xia Yu Xiang react to his new master?"},{"name":" The Happiness Street in District Zero","avatar":"https://mangadex.org/covers/faa97f2a-7d7f-413a-87aa-b2a21412f347/e61718a9-87bc-498b-8ada-9729183db8e0.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Drama,Slice of Life"],"nutshell":"My name is Komori, and I'm working in Soul Management section which responsible for sending the soul to the new life. It seems like a very peaceful job at a glance, but there are actually too many troublesome selfish requests from the souls! \"The Happiness Street in District Zero\" is a reincarnation fantasy that will make you laugh and cry!"},{"name":" Tonari No Ie No Akuma","avatar":"https://mangadex.org/covers/faad393f-9e63-4f93-a8dc-f7c86e3c441a/444491b6-b7b4-44b9-b28e-ceb3749fc3d2.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Comedy"],"nutshell":""},{"name":" Fights Break Sphere – The Legend of Yao Lao","avatar":"https://mangadex.org/covers/fab178fc-7735-4406-8e46-7588a58eb5e8/085c41a9-b667-4e84-b8ba-aa59fc189d91.png.256.jpg","country":"Chinese (Simplified)","stat":"7.55","status":"Ongoing","tags":["Action,Martial Arts,Adventure,Fantasy,Tragedy"],"nutshell":"A prequel to Fights Break Sphere (Battle Through the Heavens, BTTH) detailing the life of Yao Chen. Written and released by the original author of BTTH as an actual physical novel in 2014.\nThere are no spoilers to the main story, the books depicts Yao Lao growing up, how he acquired his flame and there is a small cameo from Xiao Yan’s mother."},{"name":" Accidental Love","avatar":"https://mangadex.org/covers/fabb26c5-6fcb-4e5c-aee5-aedb16484b89/298db4b6-2edf-44be-b025-4a0003e2aff8.png.256.jpg","country":"Chinese (Simplified)","stat":"7.85","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Zhe Bai drown his sorrows at a bar after his boyfriend of 4 years dumped him. He mistakenly flirts with a young president who turns out to be his ex-boyfriend's brother. From a misunderstanding begins a new romantic tale between a sweet dummy and a stoic boss"},{"name":" Fan - White Daisy (Doujinshi)","avatar":"https://mangadex.org/covers/fabc6705-df04-4dcc-96b0-6f93136b1974/320b4f8d-4bf5-446a-9a21-2ce5ef58fd5b.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Boys' Love"],"nutshell":""},{"name":" Umineko no Naku Koro ni Episode X - ROKKENJIMA of Higurashi crying","avatar":"https://mangadex.org/covers/fabcc8f2-49d5-48ab-b7e0-d6d29cbc78c3/4e78e834-184f-45bc-a652-b5978465864a.jpg.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Psychological,Drama,Horror,Fantasy,Supernatural,Mystery"],"nutshell":"Ushiromiya Battler was on his way to Rokkenjima in the Izu Islands to attend the annual family conference, a day later than his relatives because of his school schedule. Battler, who is not interested in the conference, is looking forward to meeting his close relatives. When he arrives on the island, the first people he encounters are people who are not supposed to be there..."},{"name":" I Love You, as a Friend","avatar":"https://mangadex.org/covers/fac0d1c0-bfe9-4668-ac36-0ed1c47eb423/fb97c242-b51b-4d7e-859f-8bb52880346a.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Slice of Life,Gyaru"],"nutshell":"When escaping from the angry girlfriend of a boy she just finished blowing, Sanako enters a random classroom and meets Yuito, a serious and handsome boy who she immediately falls in love with and proceeds to get aroused by. Taking to heart the school rule that forbids students from forming romantic relationships, the overly serious Yuito refuses her confession. So what is she to do? Naturally, sexually harass him with the excuse that it's simply just a little skinship between friends until he gives in."},{"name":" Princess Hanaka","avatar":"https://mangadex.org/covers/fac18a45-3603-45a4-8759-b14ffceddaf6/58c669a7-70bc-4135-a830-bb39c7a48332.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Fantasy,Supernatural"],"nutshell":"Hanaka has never been able to stay at a specific place for long because of her grandma’s crystal ball. After hearing the news that they’ll be packing their bags again, she cried herself to sleep. That night, she heard a sweet harmony and dreamed of sleeping in a flower bed. The next day, when she was on her way to say goodbye to her friend, a trio appeared and identified her as “Princess Hanaka.” They demanded for the Laga Star which she hasn’t a clue about. At the same time, a guy with silver hair and aquamarine eyes appeared confessing his love for her."},{"name":" Kouboku no Keibu","avatar":"https://mangadex.org/covers/fac3276a-b2b3-4806-9318-40efc6114f15/22b2a4e9-b261-44aa-8e5a-7fa1da5651c2.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Psychological,Drama"],"nutshell":"A text message would be sent out to people whose lives were in danger, guiding them to safety. This mysterious system called itself the \"Police Inspector\". One day, three youngsters—who had been saved by the Police Inspector in the past—receive another text. This time, it is the Police Inspector who needs help. Now, Natsumi, Shogo, and Teru work for the mysterious texter, who gives them clues as they track down a criminal. But who or what is this mysterious texter… and can they really trust it?"},{"name":" I Am Reborn As The Sword God","avatar":"https://mangadex.org/covers/fac40369-3528-4f11-98f1-34beefb72bce/6f8b104c-8bc6-4f8b-a527-912ffca5a513.png.256.jpg","country":"Korean","stat":"7.95","status":"Ongoing","tags":["Action,Long Strip,Martial Arts,Adventure,Isekai,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"I achieved my cozy life of a seventh-grade civil servant by through a lot of hardships and nights of blacking out, so I was looking forward to the weekends where I could relax and have fun, but that night…\nIs this Baek Rijin, the main character of the novel ?\nWhen I returned to my senses, I discovered I was in the novel I was reading. Did a seventh-grade civil servant like me became the spoiled young master of the great Jaegal family?! A side character, who has received excessive investments and love since he was young, and now going through a stormy period of his life… The spoiled young master of the Jaegal Family, whom the Blood Demon Cult would annihilate ten years later!\n\n\nOfficial Simplified Chinese Translation"},{"name":" Touhou - Aijou Takusan Tsumekomimashita! (Doujinshi)","avatar":"https://mangadex.org/covers/faca2cec-c107-4a7d-a065-9edfe203c904/ff665a82-cec6-4535-9d13-605bad6f44d5.png.256.jpg","country":"Japanese","stat":"8.26","status":"Completed","tags":[""],"nutshell":"Part of Touhou series."},{"name":" Ue o Muite Arukou!","avatar":"https://mangadex.org/covers/fad63280-8218-4f7e-bbd0-d7e2d1a3e79a/6eaa3b00-e67a-4854-8898-0f5d28eabf7a.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance"],"nutshell":"The story is about a girl who has constantly fighting with an orange-haired boy since the first day of high school. One day she meets Shintaro, her first love. Suddenly the orange-haired boy confesses his love to the girl. Shintaro mistakes them for a couple and thus ruins the girl's chances of expressing her love for Shintaro."},{"name":" Juliet wo Ute","avatar":"https://mangadex.org/covers/fadac190-1f79-4c01-98a7-774ccc81f01b/ceb9ee9c-0419-4964-875f-8ad4955fc9c5.png.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"Juri is the unwavering Number One host at the host club, “Velvet Kiss.” He's manly and handsome, but always has a poker face. Number Two host, Akatsuki, is aiming for the top spot and asks Juri how to earn it. Despite expecting to be rejected, Juri invites him over to his place. But when it’s just the two of them overlooking the beautiful night sky, Akatsuki finds himself being pulled in by Juri’s charm…"},{"name":" Wonderland","avatar":"https://mangadex.org/covers/fae13676-c7fb-47a7-9b55-23b30375449b/a18a487f-8a7e-4fbd-a75c-7033f8f33e42.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Comedy,Adventure,Drama,Horror,Mystery"],"nutshell":"Humanity wakes up to find that they've all shrunk. Can they survive amidst the hazards that Nature entails?\nThis is the story of young Alice and her protective dog Poco in this new world."},{"name":" Wild Wind","avatar":"https://mangadex.org/covers/fae4dd22-01fb-4496-9018-4bd70f412ac9/0a8ee417-dfc9-4735-ae36-07deb6855bd6.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Action,Boys' Love,Adventure,Drama,Fantasy"],"nutshell":"Long ago in a distant land, when the heavens ruled the earth, the two of them met by a trick of destiny…\nCalled the \"Wise man of the Woods\" and given much respect by the villagers, the messenger of heaven, Olgrius, is searching for the origin of the incessant outbreak of storms. Then a villager, speaking riddles of an attacking beast, appears.\nThe being Olgrius sees when he returns to the scene of the crime is a savage beast fallen from heaven. But the beast differs from the rumors—he touches Olgrius gently, and protects him from danger…!?"},{"name":" Saboten no Himitsu","avatar":"https://mangadex.org/covers/fae75de0-0503-4f10-97fb-2aa5be509f2e/bd429735-af34-439a-aafd-95ecca4f3597.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Miku Yamada has a longtime crush on classmate Kyohei Fujioka. But no matter how many times she tries to show him how she feels, clueless Kyohei just doesn't get it. Frustrated, Miku gives up on him, only to have him start calling her \"Cactus\" for being prickly when he's around. Will Kyohei ever figure out Cactus's secret?\n\nIncludes other stories:\n\nOkosama Brat\nTaishi stays at Rie's house because his parents work overtime. Rie thought that he was actually her real brother! Now, Taishi says that she's \"idiotic now and then\". People think of Taishi as cool and mature, but Rie knows that he's just a brat inside…\nSono Saki no Sweet\nHidaka Mao was confessed to by her crush Chihiro-kun in junior high, but as soon as they started going out, she became unable to communicate with him. She is still confused about her feelings, but will this year's Valentine's day bring them together again!?\n————————————————\nItalian/Italiano:\nMiku è segretamente innamorata del suo compagno di classe Fujioka ma ogni volta che vuole dichiararsi, quest'ultimo cambia discorso o non crede alle parole di Miku. Cosa farà la nostra protagonista? Un divertente e interessante shoujo tutto da scoprire ^^"},{"name":" Last Wish","avatar":"https://mangadex.org/covers/fae8811d-320a-4cbe-bbc6-8adcf9db2a1e/42e076da-44d6-46ae-9112-cb2232fde939.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Fantasy"],"nutshell":"Friends, studies, part-time work… daily life is full of troubles but sometimes a miracle can happen."},{"name":" Konjiki no Gash Bell!! (YADAKA Suzuo)","avatar":"https://mangadex.org/covers/faea4519-68b5-4d09-95a0-794060a738c0/cc04ac2f-d31e-48a7-83b3-3eb496e97c87.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Comedy"],"nutshell":"A spin-off of the main Konjiki no Gash series. Serialized in Coro Coro Comics."},{"name":" Wake Wakannai Kimi ga Suki","avatar":"https://mangadex.org/covers/faed2188-9327-432b-9a7f-aca17c7bde58/e0a9b415-374b-4fed-83f6-e7febf1df843.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Ongoing","tags":["Romance,Comedy,School Life"],"nutshell":""},{"name":" Kappa/In a Grove","avatar":"https://mangadex.org/covers/faf4640c-7859-4e3a-ade0-cbdb6d046237/febd7dc7-2fc9-4a81-adee-429a04a07b0b.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Monsters,Action,Demons,Psychological,Ghosts,Animals,Comedy,Anthology,Survival,Adventure,Magic,Military,Drama,Fantasy,Slice of Life,Supernatural,Mystery,Adaptation,Tragedy"],"nutshell":"(from ebookjapan):\nKappa, which appear in Japan's oldest history book, Nihon Shoki (The Chronicles of Japan) , and are depicted by leading ukiyoe artists such as Hokusai, have left legends all over Japan. The kappa appeared to a young man who was at a loss deep in the mountains when his battery ran out on the way to Kamikochi.\nThe young man is taken to the world of kappa. However, he finds himself in a world where kappa and otters are engaged in a battle...\nThis collection contains two manga adaptations of Ryunosuke Akutagawa's masterpieces \"Kappa\" and \"In a Grove\"."},{"name":" Inverse God Doctor","avatar":"https://mangadex.org/covers/faf9e508-56cf-4898-b847-3f2b3fc32cb7/c136225e-05ce-4057-a9e8-28178b0349f9.png.256.jpg","country":"Chinese (Simplified)","stat":"8.04","status":"Completed","tags":["Thriller,Action,Long Strip,Martial Arts,Harem,Wuxia,Medical,Fantasy,Full Color"],"nutshell":"This is a different kind of magician; he rejuvenated his hand, and some people wrote his name on the longevity card and offered it day and night. He was scolded by others, and some people wished to peel him and cramp, cursing day and night. He captured Ji Shihu on the left and crossed the bitter sea with a golden needle in his hand. He held a killing sword on the right and gave it to the guillotine."},{"name":" Yajuu wa Hageshiku Ubau","avatar":"https://mangadex.org/covers/fb06ee6b-fe42-45a0-b59d-f0c74c42d70a/470e3e86-1c78-4210-87ca-3a3b8ec0d8e3.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Ongoing","tags":["Romance,Comedy"],"nutshell":"A secretary called \"The virgin Iron\" that work at a trading company, Arisa Nagamine. Meet the legendary goods buyer who came back from the European office, Akagi \"The Beast\"."},{"name":" Lineage of the Black Lily","avatar":"https://mangadex.org/covers/fb08432f-7650-42d2-b4cc-05ff0003cf06/39f0500b-7426-4e5c-937d-66108c43231e.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Psychological,Ghosts,Survival,Drama,Horror,Slice of Life,Supernatural,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nHer kind and loving mother committed suicide⁉\nAkiko, who cannot believe her mother's suicide, remembers that her mother had been acting strangely one week before her death.\nIt was because an alpine plant, black lily, was blooming in the garden. At her mother's funeral, a woman who had known her for more than 20 years appeared and left Yasukiko with the mysterious words:\n\"Be careful with the last Black Lily of the Hiryu family....\""},{"name":" Immortal Ridge","avatar":"https://mangadex.org/covers/fb094fad-39e1-495c-b2cb-d202389d430c/746cf2a8-eb90-4c0a-9ac0-59f1cca293ce.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Action,Psychological,Romance,Drama,School Life,Horror,Mystery,Tragedy"],"nutshell":"Hiroki Wakabayashi is an ordinary high school student who is in love with Kaori, a cute beautiful woman older than him. Their relationship progresses gently and lightly. Meanwhile, cases of serious bullying are taking place at Hiroki's high school. They are called \"Suicide play\", where the bullied child is driven to suicide. But in this world is the world of immortality! In this world without death, the bullied child cannot die. In this world, when people die, they are revived, unable to escape from bullying.\nYes, in the first part 'Hound' we have been following the story from the Police Force's point of view. Now, in the new series 'Ridge' will be telling the story from the vectors' perspective!"},{"name":" Sales Department Cupid","avatar":"https://mangadex.org/covers/fb0974dd-b7f2-4418-92af-2f553d296b80/71ac2c0e-d617-4e0e-b167-d00b950e5924.png.256.jpg","country":"Korean","stat":"8.17","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Boys' Love,Office Workers,Fantasy,Web Comic,Slice of Life,Supernatural,Full Color"],"nutshell":"Since childhood, 'Taejun' has the ability to see a person's unique aura whenever they come in contact with him. With this ability, he was able to link up people who have the same aura color and became known as the 'Sales Department Cupid' in the company he's working in.\nHowever, a newcomer named Hongyeon who has a rainbow-colored aura, suddenly started to get closer with him...\nCan Taejun handle this extraordinary guy?"},{"name":" Shissou Sengen","avatar":"https://mangadex.org/covers/fb0f33ca-5b0e-4915-b1b5-ad03482714a5/4519dc85-00be-47cf-b842-8d24c1fa921f.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Psychological,Comedy,Office Workers,Drama,Slice of Life"],"nutshell":"Ayumi Sakamoto, a 24-year-old office worker. She is serious, quiet, and simply spends her days working. Just working, eating then sleeping, with nothing to do on her days off; nothing new, just those repeating days. However after a reunion with an old classmate, she makes a decision. A manga about a woman who doesn't have a single fun thing in her life."},{"name":" I Became a Villainess in a Deadly Novel","avatar":"https://mangadex.org/covers/fb12640c-b5b8-4a45-b285-26cc2c589f85/87025773-d0f2-4930-8f35-0251da88879e.jpg.256.jpg","country":"Korean","stat":"8.18","status":"Ongoing","tags":["Time Travel,Monsters,Demons,Long Strip,Romance,Adventure,Isekai,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"I became a villainess in the novel I was reading. But this novel... Was a novel with an anticlimactic conclusion where the empire suddenly collapsed just before the ending! To hell with the original story! I have to try and survive first. Thus, I was just trying to flee to the neighboring country, but then… “I’ve waited for 100 years just to meet you.” The man who had hidden his identity as the Demon King and was the driving force behind the invasion. Grand Duke Arvis grabbed me with a gaze filled with intense emotions. “If I lose you… I’d probably start by wiping out this continent that took you away from me.” …Just why?"},{"name":" M to N no Shouzou","avatar":"https://mangadex.org/covers/fb169aae-6ab3-4f79-8e52-1b2d7623a08b/3bcc082a-5939-4615-876b-fbcf7cf3a342.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Mitsuru is beautiful, graceful and admired by many people, but she has a weird problem—a single, violent movement against her can get her begging sweetly for more! Her nickname M, also stands for masochistic.\nNatsuhiko, is a guy who found out Mitsuru's secret on their first day of senior high school. Even so, he has an equally bad problem—the mere glimpse of his reflection can send him into a flying fit about how beautiful he is! He is nicknamed as N for narcissistic.\nThey both hope to minimize their chances of being exposed because of their weird behaviors."},{"name":" Cutlass","avatar":"https://mangadex.org/covers/fb16d810-25bf-422e-bbee-abb90c3ea4ee/4340d8cf-68ad-44d3-a759-06feade3352b.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,Boys' Love,Adventure,Fantasy"],"nutshell":"Tsubasa has always been a little weird and detached, but when he gets dragged into a different world to rescue his supposedly lost mother, his brother Tokimaru knows that there is something more to his background. There they meet up with a mysterious character Shroud, captain of a pirate's ship, and he becomes an aid in their adventures."}]