[{"name":" I was Playing with Handcuffs and Lost the Key.","avatar":"https://mangadex.org/covers/2119aa41-c0db-4866-9e61-b9f21b322b40/8329264a-f88c-47c3-9d35-99c24e1eedf4.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Ongoing","tags":["Comedy,Web Comic,Full Color"],"nutshell":"I was just playing for a while… and the key… I dropped it into the drain."},{"name":" Tatoeba Konna Koi no Hanashi","avatar":"https://mangadex.org/covers/1a8ac62b-c801-4283-9cd5-fa71ffabaf80/d2ba35bd-85eb-44ab-b692-1ce317347c87.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"Akira never had a real romantic relationship, and he has told himself since high school that he must not fall in love with straight guys. One day, someone comments on his cooking blog, \"Is your skill at cooking good because you're a homo?\"\nReal love between a heterosexual man and a gay man unfolds after their rocky first communication. The true story reveals the couple's tribulations and transformations of heart."},{"name":" Umineko no Naku Koro ni Episode 4: Alliance of the Golden Witch","avatar":"https://mangadex.org/covers/2e5cbfe5-bd49-4a26-b425-1854e2e117b1/e36230d6-9a8b-4441-9ed3-2e1330ca28b4.jpg.256.jpg","country":"Japanese","stat":"8.37","status":"Completed","tags":["Psychological,Romance,Drama,Horror,Fantasy,Supernatural,Mystery"],"nutshell":"Twelve years after her loved ones were brutally murdered at the annual family meeting, Ange Ushiromiya, now eighteen, is the sole heir of the Ushiromiya family. Ostracized by her peers, Ange seeks companionship in the pages of a diary left behind by her cousin, Maria. The diary offers a precious glimpse of Maria's world--her struggles at school, her friendship with stuffed--lion Sakutarou, and her fascination with magic. It's as if the diary contains the last remnants of Ange's dear cousin...and an opportunity for Ange to discover the magic within herself... [Yen Press]"},{"name":" Yukionna to Kani wo Kuu","avatar":"https://mangadex.org/covers/b7b52147-4636-4d43-ae9b-28a67d376cfb/7bae91f5-f39c-443b-8122-6062d3fd0012.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Psychological,Romance,Adventure,Drama"],"nutshell":"A certain summer day, as the cicadas sing loudly. A man with no money and no place to belong tries to end his life, however is unable to take the last step. While wavering between life and death, he sees a gourmet food program on television, and realising he's never once eaten crab in his life decides that \"For my last day on this Earth, I'll eat crab\". Settings his sights on the wife who lives in a high-class neighbourhood that he happened across in a library, he forces his way into her home. And thus, he demands money from her, however… things go in an unexpected direction."},{"name":" Online - The Comic","avatar":"https://mangadex.org/covers/b3b05fe3-2684-406f-9c32-f3b32ce49cf7/4dda561f-6dc5-4bc7-948c-a8a5e05ce7b3.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Ongoing","tags":["Psychological,Romance,Video Games,Drama,Horror,Supernatural"],"nutshell":"Mai Yashiro (22) was an average office worker until the day a video game console arrived in her mailbox. The game she is forced to play, \"Nightmare,\" is a dangerous game in which one risks both the lives of the ones they love and their own body!! If you refuse to play, those dear to you die. If you lose battles in the game, parts of your body (your arms or legs, your voice, etc.) cease functioning. The horror of this game spreads throughout society in a flash, and, to fight it, Mai's company creates a \"Nightmare\" Strategy Team. After being assigned to this team, Mai and her dependable comrades boldly rise up against this hellish game. Adapted from the super-popular novel which has received over 40,000,000 hits online!!"},{"name":" Prince Azumahiko","avatar":"https://mangadex.org/covers/ab92839d-6292-44e2-a24d-619c54a875d2/300e53c5-c922-42cd-b3f7-587c833e1788.png.256.jpg","country":"English","stat":"7.96","status":"Ongoing","tags":["User Created,Fantasy,Web Comic"],"nutshell":"An experimental web manga and intellectual property, alternate version and semi-NSFW version of Prince Akihiko. Prince Azumahiko's journey with his sword princess and gf, princess Akoreaeve-Achan to become a respected prince and great classical pianist in futuristic Aippon empire at 27th century. He wants to achieve all of that, meanwhile at the same time, the empire and world threatened from other unimaginable dark force empires.\nNote 1: Experimental web manga and intellectual property.\nNote 2: There could be a change of artisst in the future, so expect different art style in the future episode.\nNote 3: Not aimed for professional.\nNote 4: Maybe kinda shipost as well.\nNote 5: So don't hope too much on this series / intellectual property.\nNote 6: Final URL.\nNote 7: Thank you and maybe sorry as well."},{"name":" Ishuzoku Reviewers","avatar":"https://mangadex.org/covers/1b2fddf9-1385-4f3c-b37a-cf86a9428b1a/072f79ef-d65a-4981-89e9-c537e9084ad4.jpg.256.jpg","country":"Japanese","stat":"8.36","status":"Ongoing","tags":["Monsters,Comedy,Adventure,Magic,Fantasy,Monster Girls,Slice of Life"],"nutshell":"In our world, the human race constantly debates about several important issues, such as: which girl is the best girl? How good is something as fapping material? Which fetish is the sexiest? And why your Waifu is the best while everyone else has shit taste. Accompany these great warriors as they present us with different girls, different opinions, different boners, and show us that the fantasy world may not be all that different from ours, as they analyze and meticulously review the most important thing of all: what they should put their **** in.\nThis manga has no explicit images, although it has some pretty strong language..."},{"name":" Gan-Kon","avatar":"https://mangadex.org/covers/c8ecb6cd-56f2-4b9f-9378-2141dafc10ec/0ca6a243-b951-4641-ad52-aef0e36f5d63.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Action,Romance,Comedy,Drama,School Life,Supernatural"],"nutshell":"Tagamori Shinta is a student who routinely confesses with complete sincerity to any girls that he likes, failing every time with good reason. One day, after another failed attempt, he stumbles upon a strange shrine and ends up making the most important wish of his entire life. A romantic comedy packed with action on a celestial scale."},{"name":" I Belong to House Castiello","avatar":"https://mangadex.org/covers/16851fef-456a-4efe-ae95-5ac51aa0506a/f2087ed3-25e2-4b62-8caf-0ffdb18631f7.jpg.256.jpg","country":"Korean","stat":"8.28","status":"Completed","tags":["Reincarnation,Historical,Long Strip,Romance,Magic,Isekai,Fantasy,Web Comic,Slice of Life,Adaptation,Full Color"],"nutshell":"\"Pink Eyes,\" a young girl, has lived a life filled with battery and abuse by her mother, but she has two unexpected factors that may play a role in her life: first, she has gained memories of her previous life as Seo Young, a 23 year-old Korean woman, and second, she is a nobleman's illegitimate daughter.\nOne day, her prostitute mother takes her to the empire's sole Duke and claims that the girl is his child to gain alimony from him. Although he seems to not believe her, he nevertheless buys \"Pink Eyes\" for 20,000 gold. With that, her new life as \"Estelle\" starts.\nBut what truly awaits her? And is she really a child of this house?\n\nOfficial Translations:\n\nChinese / 汉语\nFrench / Français\nIndonesian / bahasa Indonesia\nJapanese / 日本語\nThai / ภาษาไทย"},{"name":" Mayonaka no Occult Koumuin","avatar":"https://mangadex.org/covers/d566f291-3861-4383-a53b-8af8b9925e5a/3af0e8b6-14cf-4449-b738-d5af9e616455.jpg.256.jpg","country":"Japanese","stat":"8.32","status":"Completed","tags":["Demons,Fantasy,Supernatural,Mystery"],"nutshell":"Arata Miyako is a new government worker assigned to the Shinjuku Ward Office's \"Nighttime Regional Relations\" department. Each of Tokyo's 23 wards has one such department, which were established to solve paranormal and occult-related events. Arata can understand non-human speech that no one else understands, and he encounters a youkai at Shinjuku Gyoen park that calls him Abe no Seimei — the name of a historical Japanese occultist and diviner."},{"name":" By Spring","avatar":"https://mangadex.org/covers/92039649-edd0-4b4a-b8c6-e53a4946e4ca/c7aff78b-0ea4-4410-973d-3bb9a3ff40b9.jpg.256.jpg","country":"Japanese","stat":"7.49","status":"Completed","tags":["Romance,Drama,School Life,Slice of Life"],"nutshell":"Souta, a penniless, phoneless, destitute middle schooler, met a high school girl with a stray cat underneath a bridge…\nThe girl laughed at his minuscule remaining change, and made a surprising proposal with \"For this 24 yen of yours, I'll let you buy me,\" and then…!?"},{"name":" The Villain's Savior","avatar":"https://mangadex.org/covers/e6e1d655-3b62-4989-9fbc-f6f6e4fd0ea7/c3147cac-55b6-43c0-8ab6-6f159e489a15.jpg.256.jpg","country":"Korean","stat":"8.18","status":"Completed","tags":["Long Strip,Romance,Magic,Isekai,Drama,Fantasy,Web Comic,Adaptation,Full Color,Tragedy"],"nutshell":"Set on a path to tragedy and misfortune from a young age, Aseph Randell is doomed to die a villain. That is, until the mysterious Elzay Tiathe appears in his life with a promise: \"I can save you.\" After having vivid visions of him for so long, can Elzay untangle the twisted fate tied to Aseph… or will they both be dragged down together?\n\nOriginal Webtoon\nOfficial Translations:\n\nEnglish\nChinese (Simplified) / 汉语\nChinese (Traditional) / 漢語\nFrench / Français\nIndonesian / Bahasa Indonesia\nJapanese / 日本語\nThai / ภาษาไทย\nVietnamese / Tiếng Việt: Comicola, Pops"},{"name":" Bonkotsu Shinpei No Monster Life","avatar":"https://mangadex.org/covers/b3bdcdbb-d920-4f59-bdc1-cf9240fc1c56/08540cee-2f69-4ab2-b04b-eec4696fc0d8.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Ongoing","tags":["Monsters,Action,Comedy,Magic,Fantasy,Supernatural,Adaptation"],"nutshell":"The protagonist is an ordinary soldier from an empire at war who gets used as a guinea pig for genetic engineering experiments, turned into a monster and put into cryosleep.\n200 years later he wakes up in a sword and sorcery world. The empire is gone and he has to survive alone in the body of a monster whom everybody wants to kill on sight. Meanwhile he encounters various pretty ladies (and elves) in need of rescue.\nOriginal JP Web Novel"},{"name":" Dungeon Athlete","avatar":"https://mangadex.org/covers/e624f464-86e2-4e2e-b50f-536b40ef781d/52eeea00-3e37-4480-802f-c4af26117a4a.jpg.256.jpg","country":"Korean","stat":"8.13","status":"Ongoing","tags":["Reincarnation,Monsters,Action,Long Strip,Comedy,Adventure,Isekai,Fantasy,Full Color"],"nutshell":"Humanity's greatest gym rat Hansol, lost consciousness during a deadlift. When he opened his eyes, he arrived at a different world. Monsters appeared in front of him, and all that he could see was protein...? \"I'll flip this world by working out!\""},{"name":" Elite Kyousoukyoku","avatar":"https://mangadex.org/covers/77c036fc-9c1e-4e73-b76f-470bb1f41ab6/0294151d-b989-4f8d-a60d-18e5941b0265.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":""},{"name":" Wanting to Force Open","avatar":"https://mangadex.org/covers/ca9ff795-4b5c-4617-a851-4985f3dff51a/c1a28df0-fd90-4980-ab25-addf579f2cb9.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Comedy,Boys' Love,Web Comic,Slice of Life"],"nutshell":"BL… Probably BL."},{"name":" Hold Up!","avatar":"https://mangadex.org/covers/751195f0-e1c2-4a8f-b289-2b7f340c4642/67cfdb88-8d7f-4886-9629-305a279a6be5.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Romance,Comedy,Slice of Life"],"nutshell":""},{"name":" Maji da yo!!","avatar":"https://mangadex.org/covers/5fa2a33e-c69a-42cf-a1d5-0af334004a04/b70e4fb7-e54c-4ec3-b347-d6d01ceaceef.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Adventure,Slice of Life"],"nutshell":"Noriko Hanaoka, the daughter of one of Japan's leading Hanaoka Sangyo Groups, is an energetic girl who loves rock. However, due to her father's strange stubbornness, she competes with Kazune, the daughter of the Saionji family who has been her rival for 20 years, in terms of elegance and beauty. Her result is a crushing defeat and she surrenders her luxury mansion and falls into her poor tenement life. Still undeterred, Noriko takes action to revive the Hanaoka Group! I'm aiming for her ancestor's hidden treasure, but..."},{"name":" Uketsukejo ni Kokuhaku Shitakute Guild ni Kayoitsumetara Eiyu ni Natteta","avatar":"https://mangadex.org/covers/136dd3fe-3e21-4fc9-b737-5bf382b9682a/5d559073-da5a-47f1-973e-9c6ebefae919.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Ongoing","tags":["Romance,Comedy,Fantasy,Adaptation"],"nutshell":"Jade, an adventurer who fell in love with the guild receptionist. \"I want to talk to her...!\" and Jade, who continued to go to the guild with all her heart, was someday called a \"hero.\" Super hero and cool receptionist stir up, too deep love comedy!"},{"name":" Flower of Worship","avatar":"https://mangadex.org/covers/59f21f31-689e-4b16-a916-418bd6abd654/a9616ac1-69c4-4105-8073-400574bd5279.png.256.jpg","country":"Korean","stat":"7.94","status":"Ongoing","tags":["Historical,Long Strip,Romance,Drama,Fantasy,Villainess"],"nutshell":"Hastred's lord, crusader Cecilia Sirian. Revealing the suspicion of his father's sudden death, he decides to protect the knights and family... she meets Eden, the crown prince whom he thought only drowned five years ago. A love story between Crown Prince Eden who wants to regain the throne and Cecilia who wants to protect the family."},{"name":" One Punch-Man - Gaiden: Tatsumaki no Koto (Doujinshi)","avatar":"https://mangadex.org/covers/fc102424-d94b-4a1b-98bc-d5062cd768d6/a61a4239-df19-4973-b116-c0b4a964b1c4.jpg.256.jpg","country":"Japanese","stat":"8.33","status":"Completed","tags":["Action,Comedy,Supernatural"],"nutshell":""},{"name":" The Secret of the Partner Next to You","avatar":"https://mangadex.org/covers/ad9ac663-2d34-48cf-a458-a03f5370bf47/8579469a-ee38-4fe6-a062-59a6cf75b1ca.jpg.256.jpg","country":"Korean","stat":"8.35","status":"Ongoing","tags":["Long Strip,Romance,Comedy,School Life,Delinquents,Web Comic,Mystery,Full Color"],"nutshell":"Yang Kiryong is an ordinary high school boy who has a classmate named Yoo Jae-Kyung, who is somewhat clumsy and clueless. Both have a very good friendship, but without any kind of love attraction. Until one day, by chance, Kiryong discovered the deepest secret of his friend and because of this his heart began to beat, will it be beats of fear or love?"},{"name":" Sonna Me de Mitekure","avatar":"https://mangadex.org/covers/dc8cc704-7f8e-4ccb-942a-f390c2871302/578825cb-6712-4316-9a65-e64396e8c0f0.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Romance,Comedy,Boys' Love,School Life"],"nutshell":"Mikado – a narcissistic, spoiled, school-idol type rich boy – falls in love at first sight with an awkward, plain-looking scholarship student who's completely immune to his charms."},{"name":" Home Cabaret ~Operation: Making a Cabaret Club at Home so Nii-chan Can Get Used to Girls~","avatar":"https://mangadex.org/covers/68daa7ca-809f-4d32-a4fd-f2d2911fec34/257e8cdb-9170-4f56-a688-8db150f783c2.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Ongoing","tags":["Romance,Comedy,Incest,Office Workers,Slice of Life"],"nutshell":"Minato Anjo, 24 years old, is good at his work and people have high expectations for him. At this rate, climbing the corporate ladder will be smooth sailing! …or so it seems. Minato actually has a huge problem! He can’t talk to girls at all, even to the point of affecting his work. It was only when his senpai from work invited him out to a cabaret club that his life began to change! Thus begins the story of the soy boy’s journey into the next-gen cabaret club!"},{"name":" I’m Going Out with the Beautiful Black-Haired (Unemployed) Takashina-san","avatar":"https://mangadex.org/covers/852d0bae-389a-4f6b-882a-979c31e9f3d7/6e0a8c1d-35ae-435a-80cc-2b23d44fd3ea.jpg.256.jpg","country":"Japanese","stat":"7.63","status":"Ongoing","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"Hinode, a university student in Kyoto with some leisure time from not going to class, meets a mysterious woman on campus. However, this woman named Takashina is not a student, but a NEET. After noticing that he has some free time on his hands, Takashina asks Hinode “If it’s okay with you, why don’t you go out with me?”"},{"name":" Wagging the Tail","avatar":"https://mangadex.org/covers/0011545f-6560-481e-a53a-972690fb3695/2b686bc7-5654-495e-bce7-05977f997b4f.jpg.256.jpg","country":"Korean","stat":"8.09","status":"Completed","tags":["Animals,Long Strip,Boys' Love,School Life,Web Comic,Full Color"],"nutshell":"Korean Wolf Kang Doha is quite popular in school. One day, he bumps into the fox, Yeojoon, who's been spending his days in school as a loner. Doha finds him irritating, but he couldn't stop seeking him out. Is this… perhaps… love? (Random Fujoshis Scans)"},{"name":" Soshite Boku wa Koi wo Shiru","avatar":"https://mangadex.org/covers/d1fc6d11-b696-4d3e-a39e-1f00abd979d5/72ec468d-e103-4f34-82f1-396d721f1f50.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Romance,Boys' Love,Cooking"],"nutshell":"After losing his life as a soccer player to an accident, Hinata Shogo works at a patisserie run by his benefactor and long-time crush, Hanagiri Akira. Unable to convey his feelings, he thinks that being by the side of calm and gentle Akira is enough – until one day, he witnesses Akira fighting on the streets in the middle of the night like a completely different person. After his true character is revealed, Akira attempts to avoid Shogo. “I want to know the things I don’t know about you!” “I don’t want things to remain the same!” With these revelations, Shogo pushes Akira down…?! “What should I do, Akira-san? I want to make love to you no matter what.” A story about a determined love, featuring a hot-blooded, pure-hearted young man X ex-gangster patissier. Includes an extra chapter showcasing Akira’s gap-moe*!!"},{"name":" Asahina Koharu no Mousou Biyori","avatar":"https://mangadex.org/covers/7faaa5d9-e1a7-4b1b-b411-53bf73689aff/14ec5bda-76f4-4862-9246-cd06ec186458.png.256.jpg","country":"Japanese","stat":"7.53","status":"Completed","tags":["Oneshot,Comedy,School Life"],"nutshell":"It's about an odd girl doing odd things."},{"name":" Girls und Panzer - Middleschool Miho and Erika (Doujinshi)","avatar":"https://mangadex.org/covers/a5e45e6e-8b0f-43e9-a1bc-60664b5fea29/ab639683-c942-4fc8-b4ac-3cf58c3935df.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Comedy,School Life"],"nutshell":"Miho x Erika"},{"name":" Cheeky Red Riding Hood","avatar":"https://mangadex.org/covers/c1de2614-af02-40d4-ad13-e3fe9b735a1b/9002cb49-cf1c-483c-8e75-2e512a61f8f6.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Oneshot,Monsters,Animals,Comedy,4-Koma,Fantasy,Web Comic,Adaptation"],"nutshell":""},{"name":" The Romcom Where the Childhood Friend Won't Lose!","avatar":"https://mangadex.org/covers/eb59be75-4286-47b2-98ab-3166ffc3cb2b/f3802b0b-cb4d-4fec-ad4e-b48d331481e9.jpg.256.jpg","country":"Japanese","stat":"6.58","status":"Ongoing","tags":["Romance,Comedy,Harem,Drama,School Life,Adaptation"],"nutshell":"My childhood friend Shida Kuroha seems to have feelings for me. She lives next door, and is small and cute. With an outgoing character, she’s the caring Onee-san type, this being one of her greatest strengths.\n…But, I already have my first love, the beautiful idol of our school, and the award-winning author high school girl, Kachi Shirokusa! Thinking about it rationally, I should have no chances with her, but, while walking home from school, she only talks to me, with a smile even! I might actually have a chance, don’t you think?!\nOr so I thought, but then I heard that Shirokusa already has a boyfriend, and my life took a turn for the worse. I want to die. Why is it not me?! Even though she was my first love…As I was drowning in despair and depression, Kuroha whispered.\n—If it’s that tough for you, then how about we get revenge? The best revenge ever, that is~"},{"name":" Best Friends","avatar":"https://mangadex.org/covers/2077da84-c995-4804-8264-99bf3a3561d5/4063a183-37f7-4078-9171-711f39136194.jpg.256.jpg","country":"Korean","stat":"8.51","status":"Completed","tags":["Long Strip,Romance,Girls' Love,Drama,Web Comic,Full Color"],"nutshell":"The superior alpha Minju fell in love with the inferior omega Hayoon. Although Minju made a loving confession to her, she has always felt a little distant because of their differences. Hayoon also knows that Minju would get bored of her as soon as she got what she wanted, so she can’t completely trust her heart…“Instead of being abandoned, why don't I just leave you first?”"}]