[{"name":" Hajimete no","avatar":"https://mangadex.org/covers/59ec18bd-effe-4293-ad91-8b605f775d82/57ded5e7-0003-4a96-80c3-7a6e704573ea.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Romance,Boys' Love,School Life"],"nutshell":"This manga follows three sets of high school students."},{"name":" Boss Battle","avatar":"https://mangadex.org/covers/59efdb98-4c3c-491c-91d8-ed0e0a69b522/309086f5-1740-4a6f-a92a-c4a2ad647bed.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.22","status":"Completed","tags":["Oneshot,Action,Comedy,Fantasy,Web Comic"],"nutshell":"A story about :\n||\nan omnipotent final boss who shitting his pants while battling against heroes\n||\nWarning : Contains diarrhea.\nTranslator : B3GG - posted here"},{"name":" Urban Legend Professor Uramon","avatar":"https://mangadex.org/covers/59f00952-2667-4679-aac2-82a38dacf4d1/9ac8527c-46bb-47dc-89b2-1e5d6d0468c8.png.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Sci-Fi,Monsters,Demons,Horror,Supernatural"],"nutshell":"Uramon is an elementary school teacher dedicated to keeping his students out of trouble, which is a tough job when they're drawn to rumors of the occult and the taboo. Not just the same old ghost stories!"},{"name":" Shadow Skill: Black Wing","avatar":"https://mangadex.org/covers/59f056ab-9aa6-4ebb-ba9f-bde7c53ce8b5/9d1ebdc1-08bb-4e38-b3bb-d266026dfafc.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Martial Arts,Adventure,Magic,Fantasy"],"nutshell":"Collects chapters from the manga's Comic Gamma run (part 2)."},{"name":" Happiness-kun","avatar":"https://mangadex.org/covers/59f7f27d-4907-4fec-8a88-35434ae36c09/2f77868a-1cd4-4adf-88a3-a82e24af4b75.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Animals,Comedy,Anthology,Adventure,4-Koma,Drama,School Life,Slice of Life,Tragedy"],"nutshell":"(from ebookjapan):\nHappiness-kun, a boy who works hard to keep his baby ombudsman. It vividly depicts his humorous life in 4Koma. The title story is included in three versions: the \"Weekly Shonen Magazine\" version, the \"Kosei Shinbun\" version, and a Yamadaya version published in an unknown magazine. The book also includes \"Mei Tantei Q Hei,\" a short story that challenges readers to solve a mystery, \"Manga Yosei,\" which was popular in \"Shonen Gaho\" magazine, and a rare manga spread from \"Manga Ou\" magazine."},{"name":" Nomura 24-ji","avatar":"https://mangadex.org/covers/59f9bf9d-bd28-4537-89a7-9c90410a0f77/8057e846-1530-43ef-b39c-1adcda86f3c2.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["4-Koma,Slice of Life"],"nutshell":"Living as a single 35 year old debtor with three beautiful sisters including a high school girl and an elementary school girl, is that even a possibility?"},{"name":" Change 2!!","avatar":"https://mangadex.org/covers/59fc296e-b562-4eeb-8650-a08465bc689e/350b4951-eb1e-45aa-977b-77ef167824d6.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Action,Romance,School Life"],"nutshell":"Kisaragi Maki is the heiress of a yakuza group. She only dreams about being a normal high school student, and becoming an ordinary bride. However, when she sees blood, she changes completely and becomes violent. Will she be able to keep living an ordinary life?"},{"name":" Humors of the Magus","avatar":"https://mangadex.org/covers/59fc9e21-26b1-4038-830b-2f2e56ee14ec/63fe8019-55fa-4163-8c4a-14826bc7b1b7.png.256.jpg","country":"English","stat":"8.07","status":"Ongoing","tags":["Historical,Action,Survival,Adventure,User Created,Magic,Horror,Fantasy,Web Comic"],"nutshell":"In this historically inspired world, health, technology, and powers are all tied to the four body humors: blood, bile, black bile, and phlegm. Descendants with cursed humors have control over the elemental power within their body fluids. These are the Magus, revered, feared, and forced to live in the shadows of the developing world. They and humanity struggle against each other, and the creatures that hunt to consume their humors.\nIn the town of Deltador, a quiet traveler arrives, absent of any caravan for protection from the beasts outside the gates. A young girl seeks escape from the monotony of the town. Their paths cross and fate is changed; nothing will ever be the same again."},{"name":" Long Night Come","avatar":"https://mangadex.org/covers/5a0292d8-b7b5-4bf3-9df6-f5914878222a/589c66d5-364c-49b7-bfbf-febfb800b467.jpg.256.jpg","country":"Chinese (Traditional)","stat":"8.46","status":"Ongoing","tags":["Action,Long Strip,Romance,Girls' Love,Web Comic,Full Color"],"nutshell":"Suivez l'histoire de Violet la voleuse et de Eric Randolph la policière.\nAuthor's Pixiv\nAuthor's Twitter"},{"name":" Hamaya-kun!!","avatar":"https://mangadex.org/covers/5a0ce448-b0d5-4043-bb1d-651d10899032/0c10642a-f515-4a33-9a0c-2e01e284215b.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Long Strip,Romance,School Life,Fantasy,Supernatural,Mystery"],"nutshell":"Hamaya-kun shoots evil!\nA little love and a little horror!"},{"name":" Kamvret Lyfe","avatar":"https://mangadex.org/covers/5a0dc515-b4bb-4ef4-af41-bd022b440c6a/0764f3de-5cde-4a65-967a-769d78d90864.jpg.256.jpg","country":"Indonesian","stat":"7.93","status":"Ongoing","tags":["Official Colored,Long Strip,Comedy,Web Comic,Slice of Life,Full Color"],"nutshell":"Eka and Pus have a love-hate relationship. They aren’t just an owner and a cat, but they’re a duo that can’t be separated. Eka didn’t expect to lose to Pus, a naughty and nosy cat. Their days are filled with silly and chaotic events."},{"name":" The Original","avatar":"https://mangadex.org/covers/5a0e6eb4-a86c-4904-aa61-ce4fb5a3f1e1/4c19cefc-d9cc-430b-8225-533681abc490.png.256.jpg","country":"Chinese (Simplified)","stat":"8.01","status":"Completed","tags":["Sci-Fi,Action,Horror,Tragedy"],"nutshell":"A young man was kidnapped when he was trying to run away from home. He woke up in a strange lab facing a battle of his life…"},{"name":" Her Imaginary Friends","avatar":"https://mangadex.org/covers/5a0fa4ea-edb5-4fd9-bbda-4cedd991b3dc/a68742e9-0486-4de3-9068-7859dcf22483.png.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Oneshot"],"nutshell":""},{"name":" Joker no Kuni no Alice - Love Is Blue (Doujinshi)","avatar":"https://mangadex.org/covers/5a1bc50e-5ecf-4967-ba47-42f866247e59/7a5bb3db-3453-4778-8cf7-ce4f4733de1b.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Romance,Anthology"],"nutshell":"Pairing: Nightmare x Alice\nThis is an anthology of Joker no Kuni no Alice stories by the author, Kumadori."},{"name":" Himananode Okujou ni Imasu","avatar":"https://mangadex.org/covers/5a245620-51e2-4c7e-812e-363908bae482/ff88ab4b-60ed-45b6-9f81-2a199bcb7f0d.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Boys' Love"],"nutshell":"They used to spend their free time on the roof. But when one of them starts to be a bit popular among girls, the other one can't support that situation. Will their friendship survive?!"},{"name":" Harattemasen yo?","avatar":"https://mangadex.org/covers/5a278924-88f7-4db5-9854-e211ac652c52/aad89bed-34f0-4fd5-a950-d79799483e59.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Comedy,School Life"],"nutshell":""},{"name":" Junjou Minimum","avatar":"https://mangadex.org/covers/5a27cbaa-0471-440e-8a65-4633a85354f7/c12f9bfe-6016-491c-8f68-2f3f899f726d.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Boys' Love"],"nutshell":"A one-volume series that kicks off as a side-story from Junjou Romantica, featuring the characters from Romantica and Egoist. The first part flashes back to the younger days of Akihiko Usami and Kamijou Hiroki, while the second part is a cute story about the younger Misaki and his brother Takahiro."},{"name":" Torokeru hodo ni kamaretai","avatar":"https://mangadex.org/covers/5a28c243-772c-4cd4-9052-8ccfbd4d1e7a/35005ba5-3b1e-4d4e-93e6-ff3905fff9e1.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Boys' Love"],"nutshell":"From Renta!:\nIt's been six years since Takeshi (alpha) and Yoshihisa (omega) have been dating. Even though they have a sweet life together, it doesn't look like the serious Takeshi wants to become a pair with Yoshihisa. \"Maybe he doesn't bite me because we're not a 'destiny pair.'\" Yoshihisa is so worried about Takeshi's \"destiny pair\" that he forgets to take his heat suppressant pills and becomes consumed with a very strong heat. The heat is so uncontrollable, the two forget to use contraception and make meltingly passionate love… An omegaverse love story controlled by destiny! Also included is a story about an office worker and a genius D.J."},{"name":" Return","avatar":"https://mangadex.org/covers/5a2da084-5c0b-4e8c-8b9b-2fd2032c791e/788b8f04-a1d1-4b21-94f4-ec17c7ca7acd.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Ongoing","tags":["Romance,Comedy,School Life"],"nutshell":"This mildly innocent oneshot depicts the story of 2 different high-school girls, Yuzuki and Akane, as they crash into each other at the school's corridor and wake up in the infirmary with amnesia. As a result, both of their current love relationships take an unexpected turn…\n*Also includes three other stories:\n\n\nBaribari Lovers!!! -\nA bittersweet high-school story depicting the follow-up between a cute but naive girl and a bad-boy delinquent who tramples with her innocent heart. You sway along with the main female–even when her heart breaks… You may have a undying urge to punch that gangster >.<\n\n\nKoimitsu\n\n\n2U"},{"name":" The Moon in Eden","avatar":"https://mangadex.org/covers/5a303bc2-75ff-45bc-b7fe-b83d13c2d29a/492f754a-0ed0-4679-8fbb-15ab2132b189.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Romance"],"nutshell":"From Fairyfly:\nLaura Li, a high school student who grew up in a prosperous family where little warmth and love exist, always manages to carry a bright smile to hide her loneliness. Eric Zhao, a young man who grew up in a problematic family, has spent time in a juvenile prison when he was younger. Since then, he has put up invisible walls around him, forbidding anyone to come near him. When these two encounter in the big city, are they able to use their pure feelings to purify each other’s heart?"},{"name":" Kero Kero Chime","avatar":"https://mangadex.org/covers/5a318852-931a-4431-9c0b-362e5822ad5e/52d63a6b-1cca-4da3-8d8b-f423cae86b98.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,Adventure,Fantasy"],"nutshell":"Mimori is the princess of the frog kingdom, a fantastical place populated by the human frog tribe and, well … frogs. One day a young boy named Aoi shows up on the borders of the kingdom, claiming that Mimori's elder brother Makaeru cast a spell on him that causes him to transform into a frog when splashed with water. Together, Mimori and Aoi set out on a journey to find a spell to cure him. (And things only get weirder from here on out.)"},{"name":" Seishun Otome Banchou!","avatar":"https://mangadex.org/covers/5a364816-69c9-45d5-8bd3-80562099294c/b09c940d-8227-4779-94e1-842702dc4a60.jpg.256.jpg","country":"Japanese","stat":"8.22","status":"Completed","tags":["Action,Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"Hirata Mihane has a scary face and isn't ladylike at all. In fact, she lets her temper get the better of her and often lets out small bursts of violent behaviour—even though she doesn't mean to. Because of this, the entire school calls her a \"Satsujinki\" (murderous monster). Even so, she's in love with the kind and popular Touma-kun, who doesn't mind the way she looks and is always nice to her. But… will Touma ever see her as a love interest?"},{"name":" Mahou Shoujo Lyrical Nanoha - Atataka na Basho (Doujinshi)","avatar":"https://mangadex.org/covers/5a3d5a95-0cad-4fb2-bddb-97de5317585b/6ceca562-7da9-48e2-b34c-fcdb317d92af.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Girls' Love"],"nutshell":""},{"name":" Hachinan tte, Sore wa Nai Deshou!","avatar":"https://mangadex.org/covers/5a46590b-14df-43f6-8450-5813cbf482e7/f720a689-e7d3-415d-b870-f3895cb6fb46.jpg.256.jpg","country":"Japanese","stat":"6.88","status":"Ongoing","tags":["Reincarnation,Action,Romance,Comedy,Adventure,Magic,Harem,Isekai,Drama,Fantasy,Adaptation"],"nutshell":"Ichinomiya Shingo, a young 25 years old, single, company worker, while thinking of tomorrow’s busy working day goes to sleep. However the moment he woke up, it was a room unknown to him.\nHe then learned that he was inside a 6 years-old boy and had taken over his mind.\nFurthermore he learned a lot from the memories of said boy: he was born as the youngest child (8th son and 10th child) of a poor noble family living in the back country. Having no administrative skill, he couldn’t do anything to manage the vast land his family has.\nFortunately, he was blessed with a very rare talent, talent of magic. Unfortunately, while his talent could bring prosperity to his family, in his situation it only brought disaster.\nYes, this is the story of the boy, Wendelin von Benno Baumeister, opening his own path in a harsh world."},{"name":" For Each Retweet, Two Straight Girls Who Don't Get Along Will Kiss for One Second - Their First Night","avatar":"https://mangadex.org/covers/5a605caa-c68f-47ba-adb4-364436ae3a40/be236595-3e5a-4d89-a9cb-b4b775a5fb33.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Completed","tags":["Romance,Girls' Love,Web Comic,Full Color,Gyaru"],"nutshell":"Two straight girls who don't get along will kiss 1 second for every 1 retweet.\nTheir First Night\n\nArtist's Pixiv"},{"name":" Toji no Tomo: Toji no Miko ~Kizamishi Issen no Tomoshibi~ Senden Manga","avatar":"https://mangadex.org/covers/5a60a6db-f49f-4029-acb7-c57f80673750/4a140580-4834-4986-9fb4-975bdf3c73cc.png.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["4-Koma"],"nutshell":""},{"name":" Hokenshitsu no Tsumuri-san","avatar":"https://mangadex.org/covers/5a630c5f-8557-40a2-8c06-a86fc83563f1/000bfaab-9b67-4273-8f37-876c75cde449.jpg.256.jpg","country":"Japanese","stat":"7.54","status":"Completed","tags":["Comedy,4-Koma,School Life,Slice of Life"],"nutshell":"Katakura Tsumuri is the school nurse who runs the high school’s infirmary… which is good, because she’s the one who needs to make use of it the most. Tsumuri has a weak constitution, and constantly tires herself out or faints from doing her day-to-day job. It doesn’t help that she’s also a space cadet and lazy at heart, so when she’s not asleep in the infirmary’s bed, she’s got it covered in snacks and games. Her younger brother, Kouta, is a student at the school and spends plenty of his free time assisting his sister and unwillingly rescuing her from the demands of adulthood. Their childhood friend and next-door neighbor, Mika, also stops by to visit and take some of Kouta’s burden. By the author of Waratte! Sotomura-san and set in the same school."},{"name":" Love Letter for my Love Then and Now","avatar":"https://mangadex.org/covers/5a63cba3-7f7b-4b6d-9a9c-10319ec42895/d81a8d7b-d8d5-4a27-82f9-aa5f71474894.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Ongoing","tags":["Romance,Comedy,Web Comic,Slice of Life"],"nutshell":"Kazuya Kawaguchi has always had a crush on Miki Toda since elementary school, but every time he tries to give her a love letter to confess his feelings, he ends up turning away in fear. Several years later, the two meet at an alumni homecoming. Much to his dismay, Kazuya discovers that Miki doesn't remember who he is, and so puts up an act to hide the fact that the revelation has affected him so.\nMeanwhile, Miki garners a vague recollection of Kazuya, and so begins feeling similarly dismayed at the fact that he seemingly doesn't remember who she is, either. But just when Miki thinks the night will end in sheer frustration, Kazuya builds the courage to ask her out on a date. And so begins the awkwardly cute love story of these two incidental lovers, where everything started with a stack of undelivered love letters well over a decade overdue."},{"name":" From Me To You","avatar":"https://mangadex.org/covers/5a66a183-b739-4562-8294-53af2ff9936f/cfb503b0-7e8d-428c-b806-7ff4d7de7709.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.92","status":"Completed","tags":["Oneshot,Long Strip,Comedy,Crime,Girls' Love,Drama,Web Comic,Full Color"],"nutshell":"A woman has called her son's lover to give her something. Is it money? Or maybe something else?"},{"name":" Onikirisama no Hakoirimusume","avatar":"https://mangadex.org/covers/5a6702d5-2ddb-411c-892b-1ac1af7e43a5/340aa498-2b28-429f-b109-c3d5a9b8ca38.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,Comedy,Supernatural"],"nutshell":"A boy opens a chest at his father's temple, and inside pops out a Hanyou, a half demon, half human girl who wishes for nothing more than to avenge the death of her mother, and herself by her father. It just so happens to be that the boy looks just like his ancestor, the one who killed the girl and mother."},{"name":" Tsureteke Tengoku","avatar":"https://mangadex.org/covers/5a6898ea-80ee-4274-9b5e-80ea2fddfabd/74b1ba17-a51e-4cb0-8638-9047f3708f1e.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Comedy,Boys' Love,School Life,Supernatural"],"nutshell":"High school student Fumiya possesses the ability to see things normal people can't: ghosts and spirits. Each time Fumiya sees one, he turns to the tall, handsome, and popular Shogo, the son of a temple priest, for help. After being rescued time after time by Shogo, Fumiya can't resist developing certain feelings toward his savior. Watch as ghosts and spirits work to drive these two together!"},{"name":" Amber","avatar":"https://mangadex.org/covers/5a691c66-3e67-424b-b361-a56ea71ee9bc/48503057-73c8-4dc0-a341-aca1880e0035.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"Mio Hasekura is a helpful high school girl who looks after her workaholic mother and others at her school, which has earned her the nickname \"Mom\" among her classmates. Mio is very fond of her late father who died when she was younger, and hopes to find a guy like him someday. On her way to school one day, she comes across a man collapsed on the side of the road who is very different from her father and Mio helps him out."}]