[{"name":" An Older Brother Who Wants to Be a Girl and a Younger Sister Who Wants to Be a Boy","avatar":"https://mangadex.org/covers/29f07a76-e8e0-4fea-83b2-68eba5d11aab/48575443-3215-4bff-b581-ad6e0be14081.jpg.256.jpg","country":"Japanese","stat":"7.40","status":"Completed","tags":["Oneshot,Crossdressing,Full Color"],"nutshell":""},{"name":" Odette","avatar":"https://mangadex.org/covers/29f35d94-b89d-4250-96c0-b961e2a8d2e5/38da4e75-aaa0-43ea-be94-555037109e6d.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Romance,Comedy,Slice of Life"],"nutshell":"A clumsy, but cheerful girl and her boyfriend (a cat?!)"},{"name":" Akuma to Ore","avatar":"https://mangadex.org/covers/29f6897f-0484-44f9-b975-dfbcc8c6b4ac/3d43eed2-c3e9-40cf-acea-16db15d1216a.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Comedy,Harem,School Life,Supernatural"],"nutshell":"Kentaro wakes up on top of a surgery table and he soon finds out how he got there. It turns out he has been chosen by the demoness, Chiffon to be an experiment for world domination. Kentaro will need to decide whether to take over the world with Chiffon or let her be taken… by tentacles?"},{"name":" Ao no Binetsu","avatar":"https://mangadex.org/covers/29fe27ff-8011-491c-96bb-8fd404e8ecd7/d10650f8-3d4d-42a0-8e18-fa881362bdbf.jpg.256.jpg","country":"Japanese","stat":"7.38","status":"Completed","tags":["Romance,Drama"],"nutshell":"The story sets place on a certain southern island. Kakeru, Mana’s brother-in-law, has been demanding her body for two years now. One day, Mana goes swimming in the ocean and meets Akihiro. Akihiro transfers into her class, and the two start going out. Although she is pulled in by Akihiro’s bright and kind personality, her frightening life that she spends with Kakeru ceases to change, and the secrecy makes her suffer. On the other side of the situation, Akihiro senses something isn’t right. Mana and Akihiro go to a summer festival, where Kakeru shows up with his childhood friend Ayano. Upon seeing Kakeru follow Mana, Ayano asks Akihiro, “Don’t you think that Kakeru likes Mana?” Akihiro pulls Kakeru away from Mana, and declares, “Mana is my girlfriend.” However, an angered Kakeru knocks Akihiro down, injures him, and before Akihiro’s eyes begins to hold Mana…"},{"name":" Obaachan wa Idol","avatar":"https://mangadex.org/covers/29ff7679-83c8-4c96-a66e-2b50f998569e/ff32b39e-22ec-42a2-9fcc-3342111c8df8.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Comedy,Drama,Supernatural"],"nutshell":"Yamada Momoka is your average 16 year old girl. Her family consists of herself, her dad who works at a TV station, and her mom. Apparently she also has a strict prune of a grandma, but who doesn’t? Except that the grandma, Yamada Tamaki, had an accident at the TV station where she got electrocuted and now looks like a 16 year old Yamato Nadeshiko. It isn’t easy for Momoka when her grandma arbitrarily decides to attend Momoka’s high school as a student as well. Tamaki isn’t just pretty, she’s also very cultured, well-mannered, and still maintains her old-fashioned streak from her 65 years of wisdom. It’s bad enough when Momoka starts being referred to as “Old Yamada” and her grandma (Tamaki) referred to as “New Yamada”, but it’s even worse when Momoka’s crush on a dashing young man starts to take an interest in Tamaki as well. Fight-o, Momoka! Protect your beloved grandma, Momoka! And don’t let her walk off with your boytoy, Momoka!\nIncluded one-shots:\nVolume 1: Keshin Panic, Ichigo Gyuunyuu na Yatsu\nVolume 2: Uchi no Hide\nVolume 3: Uraha Umi\nVolume 4: Kaeru to Hime no Dilemma, Daisuki!"},{"name":" Kugutsu Senki","avatar":"https://mangadex.org/covers/2a074c23-5162-4bdc-8632-c3b190160e1c/717d6c1b-3375-4c88-ac51-269f09b14d6b.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Ongoing","tags":["Action,Anthology,Fantasy"],"nutshell":"A large-scale anthology project that brings together up-and-coming artists who are at the forefront of the manga world. Set in nine different countries, the story of the fate of the king's vessels is about to begin."},{"name":" Itoshii, Hito","avatar":"https://mangadex.org/covers/2a18debc-386f-4db5-a1fb-0501fd8682a1/7941f9a3-b035-48e9-a8a0-6ea6b10f7bff.jpg.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Romance,Boys' Love,Drama"],"nutshell":"At night, once the clinic closes, he quietly visits alone. The doctor of Wada clinic – Motoki, waits sincerely in his consultation room for this special patient, maintaining a calm expression. Kashima, a brave man, is a member of the Kitora who throws himself into a lot of conflicts and fights. The truth is, he loves Mitake, and is surrounded by danger for his sake. Because of this, Motoki falls in love with Kashima’s actions. During the moments after the consultation, they become like hungry beasts. At first, a physical relationship was sufficient. But as time passes, the current relationship slowly became unsatisfying… Full of bursting feelings and passion – a story about unrequited love."},{"name":" Impatiens","avatar":"https://mangadex.org/covers/2a1a719a-4990-481b-8bfa-37e68bbcbc49/632fa564-1cc1-4c74-bd1d-2b17eff943e1.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Oneshot,Drama,School Life,Slice of Life"],"nutshell":"Two students leading troubled lives are pulled together by the flower bed at their school."},{"name":" Who Didn't Like It?","avatar":"https://mangadex.org/covers/2a1caf29-536c-4747-b4e5-0db62df61883/05012019-52ad-457e-93dc-dd00820ebce5.jpg.256.jpg","country":"Korean","stat":"7.94","status":"Completed","tags":["Long Strip,Romance,Boys' Love,Drama,Web Comic,Full Color"],"nutshell":"<Missing ENG Description>\n\n\nNote:\nPart of Bomtoon <Travel Short Stories Vacation Sex> and the 7th Story (Ch.21-23) on <Lezhin>"},{"name":" Flow","avatar":"https://mangadex.org/covers/2a1cd0b4-6139-4154-8968-6312a88e048d/1e3079de-1064-4ab1-870f-f8b8f5949047.jpg.256.jpg","country":"Korean","stat":"8.27","status":"Completed","tags":["Action,Long Strip,Drama,School Life,Supernatural,Full Color,Tragedy"],"nutshell":"In this world, every child is born under a god. Some gods are weaker than others. Some gods are stronger than others.\nChildren born under weaker gods become defunct in society, and cannot attend high school. Instead, they must get jobs after middle school. High school in this world is a place that trains students to use their stronger gods. They have one thing in common: They can grant wishes if the correct price is paid.\nLeerang turns back time a day, and pays dearly for it. To reverse his wish, he must attend high school and try to use the powers of his cat god once again."},{"name":" 메이 the 베이비","avatar":"https://mangadex.org/covers/2a26ef31-9c8f-4fdf-84e9-0521df1eb9ad/eeff8dbd-5fb5-4529-9361-c62f5b05f1a5.jpg.256.jpg","country":"Korean","stat":"8.00","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,Web Comic"],"nutshell":"Un alfa dominante y un omega dominante se encuentran un día por casualidad en la isla de Baenghyeong y pasan la noche juntos. Después de ese día, ocurre un gran cambio en los dos….\n¿Fue una coincidencia o el destino?"},{"name":" Story of a Girl Who Likes Fortune Telling","avatar":"https://mangadex.org/covers/2a27de90-80dc-4aef-9575-74c1629cc3a5/53ab14b6-03d3-457a-8c15-4f38c2dcc4fb.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Oneshot,Girls' Love,School Life,Slice of Life"],"nutshell":""},{"name":" Kimi e No ai Ga Tomannai!","avatar":"https://mangadex.org/covers/2a2d0744-9d50-49e0-bccd-d5c7fb510a24/468e8ad9-77ca-4545-93db-06be13a0c398.jpg.256.jpg","country":"Japanese","stat":"7.63","status":"Completed","tags":["Oneshot,Romance"],"nutshell":""},{"name":" Platinum Garden","avatar":"https://mangadex.org/covers/2a2f17ef-d29f-433c-9c4b-3727a54cd827/18abb1a8-1d0e-41be-ad03-2f390a8aea9d.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Supernatural"],"nutshell":"When Kazura Enomoto’s grandfather dies, he leaves her to the son of a rich family, Mizuki Magahara, as payment for his debts. After she goes to live with him, Kazura learns that she’s not going to be working off the debts as a servant—she’s going to be Mizuki’s fiancée! Unless Kazura can repay her debt, she’s got no choice but to learn to live with her new lot in life. But no sooner has Kazura begun to adjust to living with Mizuki and going to his snotty rich school than the dark secret of the Magahara family comes to light. The head of the family has the unique power to bring back the souls of the dead—and right now the head of the family is Mizuki!"},{"name":" Kakushigoto One Room","avatar":"https://mangadex.org/covers/2a350c5c-69b3-4d36-9252-04bace9e0025/e722bde0-1875-46e3-9f5b-2a94a297375a.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"An author who only finds inspiration after sex and the easygoing friend who's always willing to help alleviate his writer's block."},{"name":" Master","avatar":"https://mangadex.org/covers/2a35ee00-8675-4bae-8b6b-c70091a7003c/6af2d2cf-f0e9-4d7b-bcb4-22bc044a2919.png.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Boys' Love,Drama"],"nutshell":"Aoiyahi Yuuichi works for a hotel, but it's been bought by a new owner who plans on owning more than just the hotel…\n\n\nHeart Rate (pun on the word 'rate')\n\n\nMaster\n\n\n(from B-U)"},{"name":" Omega Complex","avatar":"https://mangadex.org/covers/2a367346-1617-4e4a-9ae5-44cd321ab7ab/4fc49e1e-0552-4737-abee-0c39d972bb36.jpg.256.jpg","country":"French","stat":"7.80","status":"Completed","tags":["Action,Comedy"],"nutshell":"Nevada, 1987.\n10 years after the end of the nuclear war, the country has been rebuilt. Nevertheless, thousands of civils are still irradiated. Fortunately the government developed a treatment : the G.H.O.S.T. (Gray-Human-Omegon-Synthetised-Treatment). By using it, a human being can slow down the effects of radiation on his body, but at the same time he begins to control them. That’s how men who are able to use G.H.O.S.T. to acquire incredible abilities are appearing. They are called Erynies.\nAt 23-years-old, Kama is a low-ranking bounty hunter who owns a slum in a shantytown where the irradiated people too poor to afford the G.H.O.S.T. are living. His main activity is to hunt Erynies. One day, he is asked to capture a young woman: Ananke, the leader of an extremist group which stole an H bomb in a military base. Its utilisation on the territory could mean the end of the fragile peace for the planet. But for 50 million dollars, Kama won’t be the only one looking for Ananke; he is going to go up against the greatest of bounty hunters."},{"name":" B Kyuu Gourmet Club","avatar":"https://mangadex.org/covers/2a3735d6-1406-4d62-90d8-0eb23f4912a0/09bb98c3-4ca9-448d-96eb-978326783159.png.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"This manga takes place a few years after the two lead males have graduated from high school. One of them came out in high school, and the other was a scary senpai who kind of took care of him. But several years later, they meet at the same office, where the kouhai has yet to come out of the closet..."},{"name":" Blade & Soul","avatar":"https://mangadex.org/covers/2a3981de-c8e5-465b-967b-8f18ba4571d8/579e699e-b74f-4998-9143-2d82b1d0b427.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Official Colored,Historical,Action,Adventure,Web Comic,Full Color"],"nutshell":"\"If you can't change the world, don't jump in head first.\" The girl who was abandoned by the world was ressurected, and became obedient to the demon emperor."},{"name":" Water Monkey","avatar":"https://mangadex.org/covers/2a3a4c05-ea3c-4c8b-94c5-b0a7addb7a10/487ccf97-d01f-418a-8311-05e9c8dcc78e.png.256.jpg","country":"Chinese (Simplified)","stat":"7.92","status":"Completed","tags":["Oneshot,Animals,Long Strip,Comedy,Web Comic,Full Color"],"nutshell":"There's a new animal in the wild. Many are calling it \"water monkey\"."},{"name":" Telepathy Shoujo","avatar":"https://mangadex.org/covers/2a3fff79-557b-4008-8fc3-c5abdde5573e/6d30cd20-ba9b-4431-8f8d-83d091fc6e4f.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Slice of Life,Supernatural,Mystery"],"nutshell":"Ran is a bright and energetic first year junior high school student who possesses supernatual abilities. Together with Midori (A troubled girl who posesses similar abilities) and her childhood friend Rui, the threesome are constantly embroiled in mysterious circumstances. Ran and Midori must learn to deal with their abilities and the prejudice and fear of those people who refuse to accept them because of it.\nWikipedia"},{"name":" Stand by me, Darling!","avatar":"https://mangadex.org/covers/2a4c6c90-6e2b-44bf-b954-4a7b6990ce4e/c013bc4c-e971-4eef-a14f-8323622ef9ce.jpg.256.jpg","country":"Korean","stat":"8.01","status":"Ongoing","tags":["Official Colored,Boys' Love,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Seo Jiwoon questioned the death of his sister who was in a car accident that happened with top celebrity actor Cha Taehyuk. While searching for Cha Taehyuk, he ends up being hit by a car and dies. However, he suddenly wakes up and realizes that he has returned to the first day he started working. When he wakes up, he encounters the very person he has been searching for. Isn’t “Cha Taehyuk” the person who was with my sister?!"},{"name":" Syakkin Daiou wa Maou o Taosu!","avatar":"https://mangadex.org/covers/2a4d3274-82f3-418e-abe7-658a205290f6/1fc00cec-2588-4d60-b9a8-18af19e592b6.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Ongoing","tags":["Romance,Comedy,Adventure,Isekai,Fantasy"],"nutshell":"Leo goes into an unknown place. Suddenly the demon beast attacked him. After defeating the demon beast, he became a hero! However, in order to get the money back, they will go in an effort to defeat the devil!"},{"name":" My Succubus Girlfriend (Second Version)","avatar":"https://mangadex.org/covers/2a4dee89-1c07-4de4-a476-06a5ae4feb72/074f7307-ee13-41bb-b5b2-cf2d5ddc9dea.png.256.jpg","country":"English","stat":"6.94","status":"Cancelled","tags":["Demons,Long Strip,Romance,Comedy,User Created,Web Comic,Full Color"],"nutshell":"Isaac is a scary-looking top student. Everyone is afraid of him, but in reality, he just wants friends and a fun school life. One day he is targeted by a succubus named Anastasia who attempts to steal his virgin soul.\nA reboot of the original version with a new artist."},{"name":" Shokyuu Majutsu Magic Arrow wo Kyokugen made Kitaetara","avatar":"https://mangadex.org/covers/2a4f2c2c-635b-4985-8686-6fbd1d69f024/c6248e0e-006f-439e-8a4f-0a64913c8824.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Ongoing","tags":["Action,Adventure,Fantasy,Adaptation"],"nutshell":"“Beginner magic magic arrow” The magic that many magicians learn first. Albert Luminous, who was born as the eldest son of a nobleman, had a difficult day compared to his younger brother who won the championship, but he could use magic arrow at a young age. I was able to do it. I believed in my talent and went to the magic school, but I could not practice any other magic. Alberto was abandoned by his disappointed parents, but he continued to cook magic arrows without giving up. It has been ten years since then. When she meets Rola, a white-haired girl who is about to take the entrance exam for the academy, the fate of Alberto, who has stopped, begins to move!"},{"name":" KiraKira☆PreCure A La Mode","avatar":"https://mangadex.org/covers/2a54c697-8c53-47f0-8ee6-03e66a673daf/4d63903d-a98b-416b-96dc-d6de8938871a.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Comedy,Adventure,Slice of Life,Cooking"],"nutshell":"14-year-old Ichika Usami loves sweets and wishes to become a patisserie. When she encounters fairy Pekorin, she is able to transform into Cure Whip to protect Kirakiraru, an energy that represents the feelings put into making a sweet, from the Kirakiraru Thieves. She is later joined by four other girls."},{"name":" Tetsunaki no Kirinji","avatar":"https://mangadex.org/covers/2a593312-0725-4f07-8072-3fe99a2d653d/b6cc7c2b-da82-4557-8cb5-1fcb6887befa.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Psychological,Sports,Video Games,Drama"],"nutshell":"Kiriya Rinji is 30 years old, divorced, and unemployed. His only talent is playing online mahjong. Needing a way to make money to pay for child support, he goes to the seedy Kabukichou district to play real mahjong for cash. Will his online skills translate to real-life winnings?"},{"name":" Get Chu ♥","avatar":"https://mangadex.org/covers/2a5bdd6f-c16c-43cc-a182-3bb1a586f037/5de2036c-a291-4257-b978-fed78d6e6f3a.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"Chitose is eager to fall in love, and she thinks she's found the perfect candidate in Yamato. Yamato is good-looking, considerate… and a little bit of a delinquent! Chitose discovers that Yamato takes money for kisses and dates! Chitose wants Yamato's lips for herself, but she has absolutely no intention of paying for them. Look out, Yamato, because Chitose – a refreshingly spirited heroine – is out to Get Chu!"},{"name":" Endeavor’s Cross","avatar":"https://mangadex.org/covers/2a5be63f-a85c-4626-bb54-435dab4167f7/a5dc4504-3776-40fc-a071-33229ada7232.jpg.256.jpg","country":"Korean","stat":"7.83","status":"Ongoing","tags":["Official Colored,Action,Long Strip,Adventure,Fantasy,Full Color"],"nutshell":"Climbing to the top of Heaven’s castle will prove a herculean task, for the one who can reach the summit shall be granted control of the world."},{"name":" Rain Man","avatar":"https://mangadex.org/covers/2a5d5bb8-32a2-4c8e-ad78-4007a189d50c/91190d4b-1125-4d9a-a04a-09c53e572501.png.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Psychological,Supernatural,Mystery"],"nutshell":"Amamiya Taki, an employee - albeit a reluctant one - of the Parapsychology Research Institute, is suddenly notified of the suicide of a twin brother he never even knew existed. This event sets into motion a shocking chain of occurrences, the first of which is the discovery that Taki has no brain.\nNote: Nominated for the Tezuka Osamu Cultural Prize in 2017."},{"name":" The Grave Robbers’ Chronicles Seven Dreams","avatar":"https://mangadex.org/covers/2a637f4b-56b1-4f8f-8c92-b925d97ab020/7099edc0-dd55-4ee6-b075-5083711a3496.png.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Official Colored,Long Strip,Full Color"],"nutshell":"If the story started when they were still young… Young Wu Xie encountered a mysterious girl and the similarly young Zhang Qiling. Why couldn't the mysterious girl’s perfume sachet be shown to others? What kind of secrets did it hold? Why have those that opened it died one by one? The mysterious girl also seemed to have something to do with the death of Zhang Qiling’s master! Would Wuxie uncover a generational nightmare, or an unspeakable sorrow?"},{"name":" Fudanshism - Fudanshi Shugi","avatar":"https://mangadex.org/covers/2a6692bb-3304-4c7f-ae94-09d79da611ed/3182dd1c-104c-4413-b60c-1dcd5e7b0964.png.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Comedy,Crossdressing,School Life,Slice of Life"],"nutshell":"Miyano Amata, known as the \"Perfect Prince\" for his intelligence, looks, and cool personality, is asked to substitute for his sister as an attendant at a doujinshi convention disguised as a loligothic girl. There he meets a girl from his class and they become friends, but he must crossdress in order to be with the girl while learning about the fujoshi fandom."}]