[{"name":" If I Should Compare It to the Sound of a Mosquito.","avatar":"https://mangadex.org/covers/b71a931d-2b98-4ff0-9fd4-e385e897f54e/42023f4d-9889-4b3a-a36b-6e33ad5d70ef.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Sci-Fi"],"nutshell":""},{"name":" Aru Hi Bijin ni Nattara","avatar":"https://mangadex.org/covers/b71d0862-c9fb-461c-b173-14104667e8fb/708db13c-83ab-454b-80f7-c2a7713a9784.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Romance,Drama"],"nutshell":"No one will call you ugly again! You'll become beautiful and score a fabulous love because this is a collection of super techniques to make you absolutely beautiful."},{"name":" Koiiro Devil","avatar":"https://mangadex.org/covers/b722c147-cccc-4661-80ed-0c45fad71b68/f7155331-ec29-457f-8a09-c826e034e1b2.jpg.256.jpg","country":"Japanese","stat":"7.33","status":"Completed","tags":["Demons,Romance,Drama,School Life,Supernatural"],"nutshell":"He's perverted, malicious, a devil that calls himself 'Ore-sama'. His true character is? The Demon King, Char, from a parallel world called Avalon, fell in love with the daughter of a shrine, Hashiba Rin. Both their hearts and bodies have been entrusted to each other, but a first love, Shou-chan, confesses to Rin?"},{"name":" Soiree","avatar":"https://mangadex.org/covers/b7240148-9d2d-42d5-986b-6c952d3c3165/97485011-3e06-4593-9b30-09a7efa1be2f.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot,Romance,Girls' Love"],"nutshell":"Sato and Hiyoko are doing homework together, but things escalated quickly."},{"name":" Sweet Konkrete","avatar":"https://mangadex.org/covers/b7259fc6-d372-49cc-87cc-42a985538cb5/ca47e8d2-9d4b-40b6-8cc0-82b5a052286f.jpg.256.jpg","country":"French","stat":"8.05","status":"Ongoing","tags":["Action,Adventure,Fantasy,Police,Mystery"],"nutshell":"A go-getter cop, a shrewd mercenary and an endearing kid will have to join forces where there is no law!\nIn the megalopolis of Azure Sky, to preserve appearances, the truth is sometimes suppressed.\nAsa, a young policewoman in love with justice, has her curiosity piqued when she discovers her late father's service weapon with a strange symbol engraved on the barrel...\nThroughout her research, Asa understands that to uncover the truth about the mystery surrounding her father's death, she will have to go to the Citadel: a mysterious ghetto where crime reigns and the laws of nature do not seem to apply."},{"name":" Super Danganronpa 2: Goodbye Despair Academy","avatar":"https://mangadex.org/covers/b7278172-1c27-4d1a-9f7f-a35a10776631/55131abd-22a0-4459-a261-d69b73999b8e.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Hiatus","tags":["Psychological,Drama,School Life,Mystery,Adaptation"],"nutshell":"Follows the game story."},{"name":" A Journey Through Past Lives - Tales of Fleeting Time","avatar":"https://mangadex.org/covers/b728955b-7497-4271-a342-971b3f73afc2/4bb4d64d-55e7-4b21-9474-2d0de25f6697.png.256.jpg","country":"Chinese (Simplified)","stat":"7.96","status":"Ongoing","tags":["Long Strip,Full Color"],"nutshell":"On a quest to solve her mother's mysterious disappearance, half-human Xiao Wan steps onto a time-travelling train and takes up the arduous task of helping people out with problems regarding their fate. She weaves her way through cities rich with history, crossing paths with the likes of a quick-witted, courageous Roman general and a reckless, possessive Babylonian king. Yet dilemma after dilemma of romance seems to come her way...\nIt is said that the fruits of labor from one's present life were yieded from seeds planted in one's past life. The train can only keep moving if the seeds of the past are sowed with purpose, and rid of tragedy. As the train approaches its final destination, will Xiao Wan be able to solve the final mystery?"},{"name":" Until the Dull Glistens in the Colour of the Rainbow","avatar":"https://mangadex.org/covers/b7400612-94f9-4daf-bb66-e84733d3fed4/36efe469-ba13-4cca-abc0-0ee52f73fe70.jpg.256.jpg","country":"Japanese","stat":"7.73","status":"Completed","tags":["Oneshot,Sports,School Life,Web Comic,Slice of Life"],"nutshell":""},{"name":" Saving the Beautiful Strong Tragic Second Male Lead","avatar":"https://mangadex.org/covers/b74a8e47-e5df-43ab-a0e8-72be5676ec8c/af6766db-5b6a-49dc-a65b-fe22a4278927.png.256.jpg","country":"Chinese (Simplified)","stat":"7.99","status":"Ongoing","tags":["Official Colored,Historical,Long Strip"],"nutshell":"Luo Han read a xianxia novel in which everyone sacrifices everything for love. Next thing she knew, she had been summoned into the book! Turns out she's the incarnation of the Way of Heaven in the book. Later in the book, the main characters start a war for love and almost destroy the world. In order to save herself, she must save the world. The best way would be to redeem the corrupted second male lead! But Luo Han was too late; Ling Qingxiao had already hit rock-bottom. In that case, she had no choice but to rescue him and nag at him every day to be good, avoid evil, focus on his career, and not fall in love no matter what."},{"name":" 5-nin no Ou","avatar":"https://mangadex.org/covers/b7501b4a-e7f0-4590-b994-ddf31a3c9bd0/95fcc5ab-6fd7-4e6d-853e-91ed8564c436.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Boys' Love,Drama,Fantasy,Shota,Supernatural"],"nutshell":"Chevron is a country ruled by the Five Kings, who were born from the blood of a God. Seiji, a young orphan, has a little sister named Hoshimi who was blessed with the power of the gods. In order to protect her, he decides to put his own life in danger before the cruel and proud Blue King. Later, by chance, he encountered the Red King named Gules, kind and sympathetic, for whom he begins to have feelings. But Seiji is owned by the Blue King and Azure feels insulted by this turn of events."},{"name":" Koi to Natsu Tsubaki","avatar":"https://mangadex.org/covers/b7526c77-d05a-4eb5-bfd2-482262dae249/f5017b19-f7b3-4db0-92db-c2bfacfa3a05.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Rinne, a huge fan of Buddhism, was searching for a \"monk-type,\" a boy as calm, intelligent and diligent as Lord Buddha himself, when she set her sights on a young, handsome monk-in-training, Yuuryou. She soon learns that this kid, out of his robes, is not her dream boy, but a shallow, irresponsible lady killer who goes by Yura. Is Rinne going to give up on her fantasy, or is there more to Yura than meets the eye?"},{"name":" The Trajectory of Venus","avatar":"https://mangadex.org/covers/b755bc52-a730-46f2-849d-f8a6dc1bd481/0ffb6c4d-c7b4-4d18-b58d-d4912063c7cc.jpg.256.jpg","country":"Korean","stat":"7.83","status":"Ongoing","tags":["Historical,Long Strip,Romance,Boys' Love,Web Comic,Full Color"],"nutshell":"Venus loses his memories after an accident and dreams the same dream every day. In his dreams, the same person appears. Two people who want something back. Do they meet by coincidence? Or is it inevitable?"},{"name":" Hinatama","avatar":"https://mangadex.org/covers/b7571aa2-8510-4264-a49e-acea047f5f54/de9a7066-e54f-4817-bd43-c369bc9248d1.jpg.256.jpg","country":"Japanese","stat":"8.14","status":"Completed","tags":["Comedy,School Life,Slice of Life"],"nutshell":"Amano Hinata, a high school boy, lives a quiet life in the country. One day, a light-haired transfer student, Kazama Ayato, arrives from Tokyo. In such a small town, it’s not long before Hinata runs into the laid-back, absent-minded Ayato, along with with his lively younger siblings: Hayato, Ikuto, and Chiyoko. It’s going to be quite a challenge for the Kazama family to assimilate into their new community out in the country!"},{"name":" Ore no Koibito no Hanbun wa Junjou de Dekite Iru","avatar":"https://mangadex.org/covers/b7591b41-c4b8-4903-b1de-ae8d10d6e996/70ecb4f0-fce2-4e35-a90c-88ee8125f442.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"This is the story of the relationship between college students, Yoshiyuki who is living with his Tsundere Lover, Yuzu.\nYoshiyuki wants to take it a step further with Yuzu, but due to Yuzu's naive personality, one simple kiss makes him look like a boiled octopus.\nWith dreams of days filled with naughty things, Yuzu makes a “certain promise” with Yoshiyuki, during their first month of dating."},{"name":" Dragon Ball After (Doujinshi)","avatar":"https://mangadex.org/covers/b75a0d42-ce8c-461e-8e00-3a4863511ec3/673f69dd-5320-40a6-a04e-ca2043e54d62.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Ongoing","tags":["Action,Comedy,Martial Arts,Adventure,Fantasy"],"nutshell":"In Age 788, the Dragon World is at peace, when a tremendous threat appears… the strongest Saiyan warrior, Kakarrot, has awakened! Son Goku, the hero who brought peace to Earth, attacks his own family and friends! His fated rival, Vegeta, tries to stop him in a battle of destiny! Will Vegeta be able to defeat Kakarrot…? And what will become of the Dragon World…?"},{"name":" Final Fantasy XII","avatar":"https://mangadex.org/covers/b75a4f26-c64e-4982-9ace-8d9b454eb174/03ce63a7-9924-4bdf-b5d7-28e83775b3fe.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Thriller,Sci-Fi,Monsters,Action,Psychological,Animals,Adventure,Video Games,Magic,Drama,Fantasy,Supernatural,Adaptation"],"nutshell":"This is the story of a world called Ivalice. It is a time when the existence of magick is still commonplace, and soaring airships cover the vast sky. Princess Ashe has vowed to restore her ruined country. Together with a few companions, she waits for an opportunity to strike back. A direct adaptation of the hit RPG!"},{"name":" Steins;Gate - Hiyoku Renri no Future Honey","avatar":"https://mangadex.org/covers/b7615db6-b6ae-48d4-9b84-7e307a6aa77b/1e2aedb0-326d-4a0e-92ae-e13f536ffeb5.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,Comedy"],"nutshell":"Spin-off of Steins;Gate, based on the Suzuha route of the Hiyoku Renri no Darling game."},{"name":" Shop of the Lamp","avatar":"https://mangadex.org/covers/b77305f3-3b86-4ec4-bc77-994ed02dd850/186cab45-b758-4d38-9dae-94df89333ea3.jpg.256.jpg","country":"Korean","stat":"7.95","status":"Completed","tags":["Official Colored,Ghosts,Long Strip,Web Comic,Supernatural,Full Color"],"nutshell":"At the end of a dark alley lies a store selling lights that is frequented by strange people. The owner of the store isn't at all surprised about their frequent visits, but he warns one of his regular customers – a girl who buys lightbulbs – to be careful of these people… What is it that has happened to them?"},{"name":" Checkpoint","avatar":"https://mangadex.org/covers/b7770b97-3aa6-4f9c-abff-b878ee24c971/00ac25ac-de16-4103-a599-a02ea890148e.png.256.jpg","country":"Korean","stat":"8.06","status":"Ongoing","tags":["Thriller,Time Travel,Psychological,Long Strip,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":"What if there was a save point in my life? A man that turns back the time several hundred times per day."},{"name":" Cinderella at 2 A.M","avatar":"https://mangadex.org/covers/b77bf164-ed75-4f41-a3bc-f12582965d67/136d7973-926b-460c-8a8b-070760cb3581.jpg.256.jpg","country":"Korean","stat":"8.02","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Office Workers,Drama,Web Comic,Slice of Life,Adaptation,Full Color"],"nutshell":"Ha Yoon-seo learned that Seo Joo-won, her lover for three years, is the youngest son of a rich family. Ha Yoon-seo receives money in exchange for breaking up with Joo-won. And although she did all things to make him break up with her, Joo-won didn't stop pursuing her and still tried to change Yoon Seo's mind…\nFrom the same artist of \"It's My First Love\""},{"name":" Fukuzatsu Sankaku Kankei","avatar":"https://mangadex.org/covers/b77daf27-ba3f-4f5e-91d0-cfd3f1e34aee/818430ac-0a50-48f3-9860-0db8c42baf50.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Boys' Love"],"nutshell":"Sinopsis: \"Te haré sentir bien como el otro día, así que hazme esa cara sexy de nuevo\"\nKanata, que está loco por las chicas lindas, y Sakaki, un chico guapísimo pero mal hablado, ¡Se convertirán en hermanastros si sus padres se llegan a casar!\nKanata se opone absolutamente a este matrimonio diciendo \"¡No quiero convertirme en hermano del chico que odio!\" pero luego se da cuenta del amor no correspondido de Sakaki por él—?"},{"name":" Hitori de Ikiru wa Mamanaranu","avatar":"https://mangadex.org/covers/b77e95eb-7d98-43b9-ac58-11f9a11b1023/0b01f81b-d6f1-4729-b205-f5b9ad188ab1.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Romance,Comedy,Slice of Life"],"nutshell":"Shuuko Maeda, 28, single, boyfriendless and ordinary at work, lives in a shared house with her unique friends. Eika Matsuki, a career woman who lives for work, Misaki Kawaseda, a singer who sings and talks about love, and Shio Momoyama, a laid-back person who freelances both at work and in her private life. They can overcome the daily fatigue and stress by drinking together.\n\"As long as you're having fun now, that's all that matters.\" Shuuko went about her daily life thinking that, but then realized that she was about to turn 30. The environment surrounding Shuuko and her friends gradually changes... Still they are nearing the \"Arasa\" age group...\n\"Is it okay for me to just live my life as it is?\"\n(Source: Overlap, translated)"},{"name":" Watatsu Umi no Juunin","avatar":"https://mangadex.org/covers/b7842c4e-fa32-40eb-9841-c5ac92fbf87d/36af4c11-9897-4497-92e1-0a7d58119675.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Drama,Supernatural"],"nutshell":"Not long after Kohei lost his parents, he saw a silhouette of a person who seems like trying to commit suicide by the sea. He immediately reached out and he's even more surprised when that person transformed before his eyes …"},{"name":" Yoru wa Mijikashi Arukeyo Otome","avatar":"https://mangadex.org/covers/b787c344-fef5-4853-a5c3-5321c25354b5/c4c460ab-1add-4aa7-b02e-8c93a44fc953.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy"],"nutshell":"A boy, who has never met a girl he wanted to date before, one day runs into a new girl that is entering his circle. He is instantly smitten with her, but he must find a way to get her to notice him. That's a little hard to do, since she's very active and social, has an amazing capacity for drinking alcohol, and quickly finds herself drawn into the wild hijinks of the people around her. Will a day ever come where he can get her attention?"},{"name":" Teihen na Bokura no Jijou","avatar":"https://mangadex.org/covers/b788a5ca-21ae-4043-b66e-0d1c92ade234/bf84c1c6-d3ae-4b6d-ac63-274eef1296f1.jpg.256.jpg","country":"Japanese","stat":"7.79","status":"Ongoing","tags":["Romance,Slice of Life"],"nutshell":"Ichika is a high school girl who works as the lead of an underground girl band, but one day she's suddenly forced out of this role.\nAt the same time, Nirai, a high school boy who has spent 377 800 yen on a VTuber idol is driven to despair over being treated as a mere pay object.\nWith this terrible history, at their very bottom, what will happen when those two meet?"},{"name":" Offering My Neck to You","avatar":"https://mangadex.org/covers/b78a2108-76fd-4f00-8da6-49a6717adab7/d4ad3275-7bff-4879-897c-45b76dd03abb.png.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Ongoing","tags":["Official Colored,Action,Long Strip,Boys' Love,Fantasy,Vampires,Web Comic,Full Color"],"nutshell":"Fang Luoan, a half-werewolf, was five years old when his father was killed. He was then adopted by vampire Fang Yanchen. Today, twelve years later, as Fang Luoan is about to reach adulthood, his werewolf attributes are beginning to emerge. His uncontrollable emotions and the abnormal power he has have caused a ton of terrible troubles. But what he never expected is that Fang Yanchen, whom he has been living with, is the foe that killed his father…"},{"name":" Ikusa no Ko","avatar":"https://mangadex.org/covers/b7902d2f-6b51-4598-8f20-5d388b9cb202/1b77058a-ad30-4ac1-801b-963f6a01b556.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Historical,Action,Samurai,Drama"],"nutshell":"The most feared / respected legendary warlord Oda Nobunaga, who disappeared from history just as he was about to unify Japan. He was born in war, raised for war, and grew into war. Nobunaga was a true \"Child of War\"! Tetsuo Hara draws the child character Kipposhi (Nobunaga's childhood name) who is destined to become the fearsome figure that dominates the Sengoku Period. The only manga that tells the story of Nobunaga's childhood days, this is a must-read for anyone interested in Japan and Samurai!"},{"name":" The World famous SEGA is No.1!","avatar":"https://mangadex.org/covers/b79221b1-4730-459c-99cd-db37eff40524/8e86ed21-a593-4ff8-a82a-82ef01b3adbb.png.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Comedy,Video Games"],"nutshell":"First serialized by SoftBank Creative in Sega Saturn Magazine, and later in Dreamcast Magazine, these comic strips follow a family of Anthropomorphized Sega consoles as they go about their lives and provide commentary on the game industry, going head-on against rival consoles like the N64 and PS2.\nThe family consists of:\nDreamcasko「ドリームキャス子」(A portmanteau of \"Dreamcast\" and \"girl\")\nMegadora-niisan「メガドラ兄さん」(A portmanteu of \"MegaDrive\" and \"brother\")\nSata-rou「サタ郎」(A portmanteau of \"Saturn\" and \"Son\")\nGear-man「ギア男」(based on the Game Gear)\nNaomi-neesan「ナオミ姉さん」(based on Sega's Naomi arcade hardware)"},{"name":" Touhou - Bakedanuki no Kirokuchou (Doujinshi)","avatar":"https://mangadex.org/covers/b7922942-d39d-47e3-80b4-c0507164b3af/cc9cb802-43f9-4180-85c9-a88e7e1de856.png.256.jpg","country":"Japanese","stat":"7.90","status":"Completed","tags":["Oneshot,Drama"],"nutshell":""},{"name":" 29-sai no Glass no Kutsu","avatar":"https://mangadex.org/covers/b79272f1-be66-4403-bb3d-c2f8d0a03602/f5f77074-6ee9-4002-a846-1d205478f642.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Romance"],"nutshell":"Six months from 30, Miki dreams of marriage as she watches romance dramas at her childhood friend Konosuke's house. Until one day Konosuke suddenly proposed to her! All her friends and family think it would be great for Miki to marry the rich and handsome Konosuke. So what's holding her back from taking that final step?"},{"name":" Magia Record Comic Anthology","avatar":"https://mangadex.org/covers/b79282e1-382b-4cac-a1b0-8e726c39019a/bf282e19-bf6a-41ee-8e82-e63b00340be1.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Ongoing","tags":["Action,Psychological,Anthology,Magical Girls,Drama"],"nutshell":"A collection of Magia Record side comics, written and illustrated by a variety of artists."},{"name":" The Tiger of Omertà","avatar":"https://mangadex.org/covers/b7943955-2708-4975-9bb2-ae1edac8af73/c359c4a5-3c5b-44c2-bee1-6a74961f6802.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Action,Comedy"],"nutshell":"GAG Comic from the creators of the Yo-Kai Watch Puni Puni mobile game"}]