[{"name":" Bengo!","avatar":"https://mangadex.org/covers/2970916f-3710-4344-a236-b67ccc50a965/3ecbb1f5-6c81-4c27-8343-38393846a640.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Drama"],"nutshell":"From OMFGG Scans:\nLong ago Bengo was a feminine, weak looking child who was bullied at school. Koudai was the first person to stand up for Bengo and eventually the two become good friends until they parted ways due to unfortunate circumstances. In the present, Koudai, a lawyer renowned for his continuous losing streak, is assigned to a sure loss case. While meeting his new wacky client, a familiar face appears… Two completely different lawyers that you will love!"},{"name":" Pink to Mameshiba","avatar":"https://mangadex.org/covers/29742229-9b01-436b-ab62-a84ebf8c6f26/5923478f-f654-4768-814b-9992287a22f5.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life"],"nutshell":"Ken is a super fan of the the idol group Planet – or to be precise, a hardcore idol otaku. One day, while pre-ordering the latest idol goods, he notices the salesperson to be a really flashy guy. But that guy turns out to be a student at the school where Ken works! \"Please keep quiet about my hobbies,\" begs the desperate Ken, and his devilish student agrees, but on one condition: \"From today on, be my dog.\""},{"name":" Holy Fire Brigade Dynasite 999.9","avatar":"https://mangadex.org/covers/297a234f-ebc1-48d2-8397-724fcf098012/87458236-e121-424f-9cee-74a85fcb0cdb.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Comedy,Mecha,Survival,Adventure,Military,Philosophical,Drama,Aliens,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nIn this near-future SF action work, Mellow, a beautiful woman committed to a new future for Earth, is portrayed by Leiji Matsumoto, well-known for \"Galaxy Express 999\" and considered a master of the SF manga world.\nMellow is sent from the planet Svan to restore the Earth, which has been affected by a mobile black hole, a cosmic ray shower, and danasite. Mellow lands on Nerima, Tokyo, where she meets Tetsuro Daiba and Dr. Moriki, and borrows the body of Dr. Moriki. Then the Trader Force, an armed group, appears and captures Mellow and Taiba...!"},{"name":" Mikansei Girl","avatar":"https://mangadex.org/covers/297da769-9a6f-4f32-8e8b-b0ad1c378de2/e365a272-3c84-454d-8bce-3b25c862f695.png.256.jpg","country":"Japanese","stat":"7.65","status":"Completed","tags":["Oneshot,Girls' Love,Drama,School Life"],"nutshell":"A collection of short stories:\n\nFlare\nSaitei Hime to Dame Ouji\nLolita Summer End Roll\nAme to Chapatsu to Salamander\nHinata no Wana\nKimi ga Sennen no Kazashi zo Miru\nWatashi ga Genshijin ni Nattara"},{"name":" Kantai Collection -KanColle- Everyone under the same sky (Doujinshi)","avatar":"https://mangadex.org/covers/297dc1d3-8087-4bf6-88f6-fcd6dd221011/972ceac4-6c98-4325-88c2-9977fbabc861.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Ongoing","tags":["Girls' Love,Tragedy"],"nutshell":"'The feeling after reading through these girls' pain is not something that can be healed no matter how long one stays in the dock.'<br />'The aircraft carriers are strong, noble, beautiful and lastly, sorrowful.'<br />'Those that melt into the blue are not solely wings.'<br />'Even so, someday the vapors will rise from the mountain will blow the clouds away to show you a perfect blue sky.'"},{"name":" Ketchup Mayonnaise","avatar":"https://mangadex.org/covers/297fb00d-0d23-4317-b5f0-9738bb4aee50/2522908e-038a-4efc-a8ec-06799b363954.png.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Ghosts,Romance,Comedy,Anthology,Drama,Slice of Life,Supernatural"],"nutshell":"Ketchup Mayonnaise\nAtsushi's bar-tending mom remarries to a rich, strait-laced (if not slightly old) salaryman. They move into their new house, and he can now sleep in a bed fit for a Prince! With the union, they've become one big happy family with him, his mom, his new step-dad, his step-dad's kids Peter and Kurara, and the ghost of his ex-wife….wait, what?!\n\n\nThe Spring of Water\nMaki should be on cloud nine—she's snagged the boyfriend of her dreams after finally confessing her love for him on the train platform, with a little help from her friend Fumika. They've even passed the half year mark in dating when everyone around them predicted they wouldn't last a month. Why is it then that she's starting to get the feeling that this was all a mistake?\n\n\nChocolate Ice Cream\nSakura's been in love with Niiya ever since she wound up in the same class as him back in elementary school. Niiya, however, doesn't seem to be as enthusiastic about her. So of course, when God gives her the chance to change her face to one he'd madly fall for, she readily agrees! Who does she become? And does she finally get her man after 14 years of unrequited love?"},{"name":" Romantic","avatar":"https://mangadex.org/covers/2980e8b3-0c4d-48a4-984f-0b3b643591d1/440d6432-1d60-49b3-bd74-224c6d017983.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Thriller,Romance,Boys' Love,Survival,Magic,Military,Fantasy,Supernatural"],"nutshell":"‘You’re so kind, Sensei… I’m not used to kindness like yours…\nSo… Sensei,\nlet me suck your dick.’\nMaeda Kaname, a former classroom teacher, travels to a war-torn country in order to meet a student to whom he’s been teaching Japanese online.\nAmongst the fighting and confusion he meets the leader of the anti-government guerrilla, John, and they end up helping each another.\nWhy is it that John, who has placed himself on the front lines, seems to age and rejuvenate every time Maeda looks at him?\nA story of life and death on the battlefield.\nHigashi Nishida’s ultimate love story."},{"name":" Persona 4 4Koma Kings","avatar":"https://mangadex.org/covers/298d6375-babf-47bf-8624-87e6eb84f10e/a4b40224-1d16-4a3a-b25b-8ea3ed40929d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Anthology,Video Games,4-Koma"],"nutshell":"Collection of 4koma comics based on the Persona 4 game, made by various artists."},{"name":" The Secret Life of a Certain Count's Lady","avatar":"https://mangadex.org/covers/298d7c11-98b5-4439-9c4c-5fc2699c86b7/3e92185d-a985-4698-9d1c-322b321cb6b5.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"“Lirian, the forces of evil are ravaging this world. We need a strong knight to destroy the spirit of evil that is approaching us. A righteous and strong knight! And the knight that’s you, Lirian.” Wow, that’s ridiculous. I just want to live a normal life. I have a dream to marry a handsome man. Then will enjoy life in a cottage like the house of a count. I never thought about doing justice or protecting world peace. But God chose me! Power? Sharp sword? Why give me? Why me! “Liri, would you like to come with me to the capital? Isn’t it better to go with a guy like me compared to going alone?”\n“Um…I was joking just now. It’s a bit…”\n“Hmm, that makes sense. I’m Aheros Arman, the 3rd prince of the Arman Empire.”\n“Wow, emperor, prince!”"},{"name":" Touhou - Inochi Nagakutomo koi Seyo Otome!! (Doujinshi)","avatar":"https://mangadex.org/covers/298e9af5-b4ac-44c8-b615-8f17eb053fb7/c8353941-58ff-4b77-9d90-e41df4239a28.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Action,Comedy,Girls' Love,Fantasy"],"nutshell":"Flandre is tired of being stuck in the basement. She wants to call over someone who has beaten her before. Marisa Kirisame"},{"name":" Kamio-san, Chikotsu de Itta no?","avatar":"https://mangadex.org/covers/2990abfd-dbc6-4a60-b363-b9494dd8de95/a1782dfe-a2ee-43eb-b5f4-e86b33605f79.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Boys' Love,Office Workers,Drama"],"nutshell":"\"Your erogenous zone is right here... Your 'pubic bone.'\" The switch to ecstasy is being throttled... I can't run away anymore...!"},{"name":" Seed","avatar":"https://mangadex.org/covers/299519b9-53bf-4abb-bee1-ea1c6960ff67/ec27892e-6e4e-46f7-b5cb-9a1b55ccbb64.jpg.256.jpg","country":"English","stat":"8.07","status":"Ongoing","tags":["Sci-Fi,Psychological,Comedy,Drama,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"Welcome to the future – where our world has become an exercise in contradictions. We are more connected than ever but alone. Healthier than ever but sick. Safer than ever but ultimately vulnerable. Seed is a story for these future times. Where the relationship between a girl and an AI system that begins simply, quickly complicates things for the entire world."},{"name":" Tsugi ni Attara Dakutte Kimeteta no de. Saikai Shita Hatsukoi no Kare ga Moujuuka Shitara...","avatar":"https://mangadex.org/covers/299b39ec-52f9-4f37-b772-d8d079a4529b/45c7fd95-cf24-404a-aa58-75e1ca35e047.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Romance"],"nutshell":"From Batoto Scans:\n\"This is our first reunion in 10 years, what do you think you're doing kissing me outta nowhere?!\"\nRiko looked forward to seeing Baba-kun, who she secretly admired, at the high school alumni association. It's the first time she's seen him in 10 years and he's just as attractive as he was when they went to school together. They weren't really close, she just marveled at him from outside his shop, while she waited impatiently for him to talk to her.\n\"If you don't have anything interesting to talk about...\", Riko said when Baba suddenly kissed her.\n\"Huh...what was that?...What😕\"\n\"A kiss. You are cute, so I kissed you.\"\nWhaat?! Was Baba-kun always this kind of person?!\nIn that moment her image of him completely changed, did he become a predator in those 10 years? How does a composed medical intern magically become like that because of a woman he likes?! 【Popular Boy】×【Quiet Girl】 Reunited and heart pounding ♪ A story about mutually unrequited love!"},{"name":" Assassin's Pride","avatar":"https://mangadex.org/covers/29a0218e-8aac-4f92-887f-5940cb86f136/13862849-cdee-4fb1-9512-ee6adf4509f5.jpg.256.jpg","country":"Japanese","stat":"7.88","status":"Completed","tags":["Action,Romance,Comedy,Magical Girls,Magic,Drama,School Life,Fantasy,Vampires,Supernatural,Mystery,Adaptation"],"nutshell":"In the world where only the aristocrats have the power to fight the monster – mana. A youth named Kufa is dispatched as a tutor to find Mareida's talent, a nuisance girl born in a duke's family. If she is not talented, assassinate her. That, is the dark side of his task."},{"name":" I'm the Male Lead's Female Friend","avatar":"https://mangadex.org/covers/29a480b7-573f-45cf-967a-9c68e95356ea/e2088fb2-2f16-4b79-9f4c-9c744ae28127.jpg.256.jpg","country":"Korean","stat":"8.02","status":"Completed","tags":["Long Strip,Romance,Isekai,Fantasy,Villainess,Web Comic,Adaptation,Full Color"],"nutshell":"I was poor and with no one looking out for me, I was struggling financially. Because of this, I had trouble adjusting to school as well.\nMy only hobby was reading a fantasy web novel <The Fake Lovers of the Academy> and imagining that I could become the main character of it. One day, after falling asleep and imagining this as usual… I woke up but instead of becoming the heroine, I'd become the villainess, Louise Sweeney, who meets a terrible ending.\n\"Since I know the original novel, if I just avoid falling in love at first sight with the male lead, I definitely won't have a tragic ending!\" Thinking this, Louise avoids the male lead.\nBut what's this…? Unlike the original novel, the male lead passionately confesses his love to Louise, and the heroine, who she believed to be kind, has it in for her…?!\nHow did this happen? Wasn't it supposed to all work out if I just avoided the male lead?!"},{"name":" Touhou - Making Udon With Sakuya's Leftover Bathwater Has Gotta Be Delicious (Doujinshi)","avatar":"https://mangadex.org/covers/29a53fdb-787d-4698-8bee-2eab33c7bd31/80f35bae-ca1c-4c5b-a1f3-f5d70fc745e9.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Oneshot,Romance,Comedy,Girls' Love,4-Koma,Drama"],"nutshell":"Randomly, Meiling proposes that she and Remilia should sneak into Sakuya while she’s taking a bath, and use her bathwater to boil their udon. Meanwhile, Flan begins to wonder about the “spice” loving someone puts into food and decides to ask Patchouli and Koakuma about it. Soon, the trouble from both of these scenarios make the girls wonder about love."},{"name":" Theme World","avatar":"https://mangadex.org/covers/29ace2a0-6990-426a-ad6d-22f45f8d7864/89509895-c798-4382-8d30-24ec738f9bb1.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.96","status":"Ongoing","tags":["Action,Romance,Comedy,Adventure,Fantasy"],"nutshell":"Aqi (ah-chee), a boy with god-like strength, finally gets fed up with his fellow villagers are constantly relying on him to help them. So he leaves on an adventure to save the world! (but from what, we have yet to find out…)\nAfter quickly getting lost in the nearby forest, he finds a girl named Misu about to be eaten by the dangerous wildlife of the forest! Using his inhuman strength he saves her, and after finding out she can cook, he decides to bring her along on his adventures!"},{"name":" When Shin Needs Cheese","avatar":"https://mangadex.org/covers/29b2a759-ab30-4e71-a149-3e853756ce75/0114f54d-f2b3-4628-9398-d8ee153a6871.jpg.256.jpg","country":"Korean","stat":"7.73","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Boys' Love,Drama,Fantasy,Web Comic,Full Color"],"nutshell":"They met beautiful and warm! A warm-hearted cohabitation begins with a pure boy \"Cheese\" who has the power of God but can not use it and a young man with a pain."},{"name":" Last Photo","avatar":"https://mangadex.org/covers/29b4dde9-11f2-4ecd-9f96-cb511d56928a/3a3440cd-3903-454d-b4f8-248eb124f17d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Anthology,Horror"],"nutshell":""},{"name":" Mujin","avatar":"https://mangadex.org/covers/29b6dfb0-5e43-42cc-b86b-6a755c0e1251/d7229454-6925-45ad-9001-400ba2c10403.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Historical,Action"],"nutshell":""},{"name":" Dansui!","avatar":"https://mangadex.org/covers/29bf265f-cf22-4be8-8bad-28b36f191d50/acf8291d-43b4-4c26-9083-f2f389cbb3a5.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Ongoing","tags":["Comedy,Sports,School Life,Slice of Life"],"nutshell":"Shuuhei, Harumi and Daiki start their second year of high school with an absolute goal: Getting at least two new members for their swimming club to keep its position as a club. This is the daily struggles and shenanigans of a high-school boys' swimming club!"},{"name":" Kindred Spirits on the Roof SIDE A: Another Yuritopia","avatar":"https://mangadex.org/covers/29c10ae9-282c-43ee-87e9-e0950c7407c2/634932c5-b858-4461-83fe-69c5327fd3a2.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,Girls' Love,Drama,School Life,Supernatural"],"nutshell":"A student at an all-girls school, Yuna, suddenly gains the ability to see ghosts, and meets the ghosts of two ill-fated lovers who are stuck in her school because they died without fulfilling their love. To help them, she needs to get girls who are on the verge of becoming couples to start dating. She needs to create a \"Yuritopia\" in her school.\nBased on the visual novel of the same name by Liar-soft."},{"name":" Getting Excited for My First Time Crossdressing","avatar":"https://mangadex.org/covers/29c3fa43-6637-4a06-8b8b-253dd0e4b417/765d0f66-6cdd-4fd7-8f62-da0dc7ac9c08.jpg.256.jpg","country":"Japanese","stat":"7.08","status":"Completed","tags":["Oneshot,Crossdressing,Full Color"],"nutshell":""},{"name":" Natural Pearl Pink","avatar":"https://mangadex.org/covers/29c5940d-66c2-452c-b4be-6f5d4c5a67f1/848ebe97-1db3-401b-b28c-a3402221cab2.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Slice of Life,Tragedy"],"nutshell":"We follow the bumpy and funny romance between bubbly Tamoko and the serious Kanji. With Kanji's father running an idol agency, and Tamoko being the daughter of their top-selling idol, Shinju, things get complicated. Tamako must hide the fact she is Shinju's daughter to save public face, and at the same time, she is determined to be Kanji's ideal wife (as was promised when they were little kids). It doesn't help that Tamako's pretty clumsy and poor of domestic chores, but no matter what comes down the road, she's not about to give up!"},{"name":" Akatsuki no Ageha","avatar":"https://mangadex.org/covers/29cd02a4-a429-439e-8356-fbb2abcac4dd/368a3be8-09ff-40b2-8fe7-56a4ea1c8424.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,Drama,Supernatural,Mystery"],"nutshell":"Once again, the police are baffled by the serial killings of several young women. Kudou, a detective, is referred to a young girl by a friend. But this girl isn't what she seems - Kudou saw her at the crime scene. Apparently she's a vampire!!"},{"name":" Sato Zakuri Tanpenshuu - Shoujo, Shoujo, Shoujo na no.","avatar":"https://mangadex.org/covers/29d25401-fec3-4ed2-83d7-4eecaa16c357/f6d0416b-a6b8-4ab7-a72f-1eed64a61967.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Romance,Anthology,School Life"],"nutshell":"A collection of one-shots.\n\n\nShoujo, Shoujo, Shoujo na no\nHirako Bell, a pretty middle schooler had moved to the country. She currently dislikes the country due to her love for the city life. She also aspires to be a model, and therefore applied with an agency. She had also made a certain friend. Will Bell pass the audition? What about her new friend?\n\n\nSolitary Girl\nA strange disease has forced most mankind to extinction, leaving only a recently awakened girl Kana, and a robot teddy bear. Kana remembers a certain boy during her slumber, so searches for him and anyone in general throughout the now empty world. Will she find anyone?\n\n\nUnder Heaven\nMiyata Chikami is a very popular girl at school that wishes to live a simple life. When she gets home, she is suddenly in debt situation, and one man had taken her to his place, as what her dad had arranged. He was a strange one, but she was quickly attached to him. Will Chikami ever have her simple debt free life, or will destiny run to another course?\n\n\nHalf is made out of love\nWataya Himari is currently dating the super popular Hosikawa Atari, her senpai. There's just one big problem: he is a sadist! Himari still wants to be lovey dovey with despite his nature, but one can only take so much. Can Himari ever be in a lovely relationship with her beloved senpai?\nThis story was released as a oneshot in the He Loves You anthology volume.\n\n\nOn The Bed\nMirai is a plain, and will always think that she would never have a boyfriend. Whereas, Kouki Koyomizu, a popular boy in her class stands out and is in a completely world to her. Due to certain circumstances, she ended up visiting his house and he kissed her? Just what is going on?"},{"name":" Saikyou Kenshi, Saiteihen Kishidan de Funsenchuu ~Orc wo Chinohate made Oitsumete Zettai ni Shimatsu suru dake no Kantan? Na Oshigoto desu~","avatar":"https://mangadex.org/covers/29dd6028-ac31-4554-8d0a-8dd5249a2382/dab7e53d-36f8-4780-a1e8-da99240e8029.png.256.jpg","country":"Japanese","stat":"8.04","status":"Ongoing","tags":["Monsters,Action,Comedy,Adventure,Fantasy"],"nutshell":"The \"Anti Foreign Dangerous Species Knights\" was formed to protect the people from dangerous monsters, however this is more of a black company and it's only a knight order in name only...!!\nOrcs that keep coming like pests no matter how many times they are taken down... salaries that don't increase at all... quirky co-workers... This is the story of the strongest swordman of a commoner background, who works hard everyday cutting orc's heads at the lowest knight order which is ridiculed as the \"Pig Hunters\"."},{"name":" Shikeisyu 042","avatar":"https://mangadex.org/covers/29de8101-c1fa-4cfe-9bba-0faf1d4b11fd/f318b635-96f3-461c-98a7-750e1fdcf52f.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Psychological,Drama,Slice of Life,Tragedy"],"nutshell":"Tajima Ryohei, aka Shikeisyu 042 is sentenced to death for murdering 7 men. However the government is planning on abolishing the death sentence for good. In order to accomplish this, Ryohei must prove that ex-criminals like him can live in society. During the 3 years he lives outside the prison, he will meet more than 1,000 people, clean restrooms, plant flowers and define the value of human life and kindness."},{"name":" JoJo's Bizarre Adventure - Clamp in Wonderland: JoJo's Bizarre Married Life (Doujinshi)","avatar":"https://mangadex.org/covers/29e808fb-84a6-40b6-acba-de92124aa921/46bb7102-ea47-4ed9-9ea4-ab66e9b0a74f.jpg.256.jpg","country":"Japanese","stat":"8.64","status":"Completed","tags":["Romance,Comedy,Boys' Love,Martial Arts,Magic,Drama,School Life,Fantasy,Delinquents,Shota,Slice of Life,Supernatural"],"nutshell":"Meet Jotaro Kujo and Noriyaki Kakyoin. Both high school students who have special powers called Stands, they traveled around the world to defeat the villainous DIO Brando and save Jotaro's mother Holy. But now… they're married?\nA doujin based on the Stardust Crusaders arc of the long running series JoJo's Bizarre Adventure. It's made by CLAMP, a group known for series like xxxHolic, Tsubasa: Reservoir Chronicle, and Cardcaptor Sakura. Because of its… content, it is considered a rite of passage for many a fledgling JoJo fan (alongside the infamous Duwang scans).\nContains spoilers to Part 3."},{"name":" Ore wo Mita shite, Shouri no Megami-sama - Dekiai Kareshi no Heavy-kyuu Ecchi","avatar":"https://mangadex.org/covers/29ea4e87-e9b4-42d5-9de6-2200228190b0/e6900fa9-3b36-4858-95d7-899248922e5a.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Sports"],"nutshell":"\"If you touch me, I'll fuck you to death…\"\nHis muscular body seeks me out like a beast, and he plays with me in embarrassing ways… I'm gonna cum, again…!"},{"name":" Senken Shounen Syndrome","avatar":"https://mangadex.org/covers/29ed16f3-2607-408f-8d51-cbe6d68eafcb/b6b7f415-98dc-4138-b53f-57fa406cbf77.jpg.256.jpg","country":"Japanese","stat":"8.30","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"Mizuki Sora's first compilation of one-shots. Includes 5 short stories:\n\n\nChinmoku Girl no Little Cry (Silent Girl's Little Cry) Kohane is a high school student who has bad pronunciation since she was young. She refuses to talk since she's been teased by others because of her accent, and chooses not to, rather than being laughed at. One day, when Kohane was going to the teacher's lounge, she meets a senpai who had wounds from a fight and gives him bandages since there was no nurse in the office. Igarashi (the senpai) confesses to Kohane and helps out for her English pronunciation contest. The story is about Kohane accepting herself and finding someone who accepts herself with her awkward accent.\n\n\nSenken Shounen Syndrome (Apprehensive Boy Syndrome)\n\n\nYankee Shoujo to Hinekure Danshi (Delinquent Girl and Contrary Boy)\n\n\nMiren Boy Miren Girl (Lingering Boy, Lingering Girl)\n\n\nTsuiraku JK to Haijin Kyoushi Bangaihen"},{"name":" Domino Kick","avatar":"https://mangadex.org/covers/29efb52e-71d9-4a1d-b18d-d3aa9a980d85/c46ce868-9ecf-457a-97da-448fbe0dd02d.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Ongoing","tags":["Comedy,Slice of Life"],"nutshell":"Sae, a young lady of a wealthy family, sometimes can't control herself and gets the urge to behave in a manner unbefitting of her upbringing. It's her butler's job to intervene.\nNote: This is the original Niconico Seiga version of the webmanga \"Domino Kick - Naraberareta Domino o Kick Shitara Dou Naru no Kashira?\" (I wonder what would happen if I kicked a line of dominoes) on Gangan Online. As opposed to the Gangan Online version, it doesn't have the subtitle and has a partially different set of chapters."}]