[{"name":" The Source Code Of Anima","avatar":"https://mangadex.org/covers/cf6d47e4-a413-4a41-b501-6626fc551ae7/ccb1b2f1-fa7d-4748-a299-abbb8e0fd4f9.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Sci-Fi,Long Strip,Web Comic,Full Color"],"nutshell":""},{"name":" Futsumashi na Yome desu ga.","avatar":"https://mangadex.org/covers/cf6dbf45-433d-4f49-a124-f9c7363c3f22/c88c5393-6224-4e83-b979-be1af967f12c.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,Comedy,Crossdressing,School Life,Supernatural"],"nutshell":"One day, Hirazono Satsuki, while walking home from work, finds a girl in a garbage dump. He ends up taking her home and she introduces herself as Riene, an exorcist. She is on a quest to find somebody who took care of her before, a girl named Satsuki. Could he be the same Satsuki?"},{"name":" Xyrin Empire","avatar":"https://mangadex.org/covers/cf6f5b90-5653-4ee3-88ff-472c85eae8cc/722284ab-2672-466e-a1b5-abd562f89ee5.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.05","status":"Ongoing","tags":["Sci-Fi,Action,Long Strip,Comedy,Magic,Military,Drama,School Life,Fantasy,Web Comic,Aliens,Supernatural,Adaptation,Full Color"],"nutshell":"The legendary tale of the Xyrin Empire is not about its struggles... or the tempest of another world or some cultivation myth. This is a super-serious, super-hard sci-fi manhua about saving the world.\nTake what I’m saying seriously...\nNot.\nOkay, this is just a funny story about a deceptive human emperor, bringing his bunch of slippery alien leaders to have fun saving the world every day.\nChen Jun is an unmotivated otaku who turns into the Emperor of an ancient intergalactic magic sci-fi empire. With the aura of a stay-at-home dad, he is nothing but a middle-aged man who adopts a group of lolis... and an army of freeloading aliens that came out of nowhere. Er, what?\nAhem. Really though, this is a super-serious story... a super-mega-ultra-serious sci-fi story.\nFor the Empire!"},{"name":" Pharaoh","avatar":"https://mangadex.org/covers/cf7431df-7015-4978-8823-a8c2dd798ecd/ba5c7e15-e99a-4c91-92e4-256c9e69fef2.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Historical,Comedy"],"nutshell":"Gag manga about the everyday life of an Egyptian pharaoh discovered at a dig site in modern Japan."},{"name":" Adult na Kaihatsu Shitsu","avatar":"https://mangadex.org/covers/cf7680f2-6ac6-400a-9c03-eb39d0974d81/020f0caa-82f5-4c92-8486-b8bb0db9ad68.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Oneshot,Psychological,Boys' Love"],"nutshell":"Yuuki's boyfriend Eiichi hits him, leeches off of him, and even whores him out to some of the worst people. But Yuuki still says that he loves Eiichi and refuses to leave him."},{"name":" The Time Between Dog and Wolf","avatar":"https://mangadex.org/covers/cf7ad3c1-c857-4ccc-9feb-d00431086430/036f75fc-d503-4766-99a6-92b5544030db.png.256.jpg","country":"Korean","stat":"8.46","status":"Ongoing","tags":["Long Strip,Boys' Love,Web Comic,Mystery,Full Color"],"nutshell":"\"Until I learned what this time meant… it had always been just a dark time for me.\"\nPainter Han Kiyo who had been living a life of poverty was commissioned by an anonymous person on social media to draw some pictures. However, he became a murder suspect because the paintings he did portrayed vivid murder scenes. On top of that, due to a staff’s error, Kiyo was sent to an alpha prison, instead of an omega one.\nRaw:\n\nRidibooks\nMrBlue\nBomtoon\nLezhin"},{"name":" Meikyuu Kingdom: Damu Tokushu Butai SAS no Ossan no Isekai Dungeon Survival Manual","avatar":"https://mangadex.org/covers/cf858cb2-5327-43e6-95e9-28e230c1efad/57991a1b-55c3-4941-91c7-ccc18754203d.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Ongoing","tags":["Sci-Fi,Action,Adventure,Isekai,Fantasy,Mystery,Adaptation"],"nutshell":"After being transported to another world, one man's mission is to rebuild a kingdom. He has a very particular set of skills and he's ready to face any obstacle because...who dares, wins! Monster, dungeon, and war stand no chance against the special forces!"},{"name":" Bad Guy and Cutie Police","avatar":"https://mangadex.org/covers/cf8b0ae2-69dd-4127-b64a-fccf68e7bf2c/5a8536cf-b445-4414-b369-92cc6b5b4507.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Ongoing","tags":["Oneshot,Psychological,Comedy,Drama"],"nutshell":"When the rookie and cute cop falls prey to this bad and perverted boy things will not work out for her."},{"name":" Yami Maid ga Shihai suru!","avatar":"https://mangadex.org/covers/cf8c6030-6190-4dd3-a5b5-aedbab086bea/905286aa-ada0-4186-b665-3b0306ee879e.jpg.256.jpg","country":"Japanese","stat":"8.26","status":"Ongoing","tags":["Demons,Comedy,Magic,Fantasy,Slice of Life"],"nutshell":"Natsume Hilbright, a girl who has just lost her mother.\nSurrounded by her loving father and friends, she misses celebrating her birthday without her mother.\nMeanwhile, she happens to meet Jupiter, a boy who claims to be the Prince of the Demon World, and a beautiful girl named Glance, who is said to be his maid."},{"name":" Master's Secret Baby","avatar":"https://mangadex.org/covers/cf8c6777-240a-4ef5-a958-9d1a3c93d838/1ff82f89-ff16-4174-8d07-b4222922e2fc.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.37","status":"Completed","tags":["Long Strip,Comedy,Drama,Web Comic,Full Color"],"nutshell":"A young Aryan wakes up in a hotel room and sees a man lying on top of her, but all she can remember is having a drink with her sister. Luckily she manages to escape from more terror, but still ends up broke. She passes out after giving birth, and when she wakes up her stepsister and stepmother can no longer be found in the hospital…\nFive years later, she moves to Ningguo as an exchange med student, and with her is her 5 year old son who walks into another kid with identical appearance."},{"name":" Mob Psycho 100 Anthology","avatar":"https://mangadex.org/covers/cf8e0d1d-f37d-4419-832b-69252c844ea9/5cd4569a-755c-446d-b120-60b8feb86449.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Ongoing","tags":["Action,Demons,Psychological,Comedy,Anthology,Adventure,4-Koma,Philosophical,Drama,School Life,Fantasy,Delinquents,Slice of Life,Supernatural,Mystery"],"nutshell":"A series of short stories set within the Mob Psycho 100 universe, all done by other authors."},{"name":" Doyou Wide Club e Youkoso","avatar":"https://mangadex.org/covers/cf91a0c4-b43d-4698-8b66-54a9820c24ef/0967c203-3ba2-4574-a980-c3abdbd7e20d.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Comedy,Mystery"],"nutshell":"Madam Misa dies mysteriously at the Saturday Night Club. Soon after her death, her young handsome and broke host Hideo opens a similar looking \"Host\" Club of his own. Where did the money come from? Did Hideo have something to do with Madam Misa's death?"},{"name":" Seasons' Cafe","avatar":"https://mangadex.org/covers/cf964ccd-1ece-4c45-8cdd-9823e69c9389/20721480-31d9-4eff-bba9-e5ff4f4d1124.jpg.256.jpg","country":"Korean","stat":"7.76","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Drama,Web Comic,Cooking,Full Color"],"nutshell":"On Jeju Island is a café called ‘Seasons’ Café’. While working at the cafe, a questionable series of events comes to Yoon Yeonghyun.\nEven though he’s too jaded to care about the café, a miracle happened and a savior appeared. Although, there’s just one problem… It’s the exact guy who Yeonghyun dumped and ran off on in the past…!\nBetween both the lack of customers and the breakup, will Yeonghyun be able to manage work and love?"},{"name":" Sakigake!! Otokojuku","avatar":"https://mangadex.org/covers/cfa01bb3-0ad1-45f1-9ec9-04c68f9bd9cb/478efde0-6803-46a1-b4d0-1f943c8d4f44.jpg.256.jpg","country":"Japanese","stat":"8.23","status":"Completed","tags":["Action,Comedy,Survival,Martial Arts,Adventure,Military,Drama,School Life,Delinquents,Slice of Life"],"nutshell":"Otokojuku - a private school for juvenile delinquents that were previously expelled from normal schools. At this school, Japanese chivalry is taught through feudal and military fundamentals. Similar to an action film, the classes are overwhelmed by violence. Only those who survive it become true men."},{"name":" Hello, Green Days","avatar":"https://mangadex.org/covers/cfa467b8-048b-40bb-92e6-41cbc467c7d7/a8f9dac6-bb93-4315-a950-ea34b07252d6.png.256.jpg","country":"Japanese","stat":"8.52","status":"Completed","tags":["Comedy,Boys' Love,Drama,School Life"],"nutshell":"Mikage, a graduate student in the Department of Botany, is shy and timid when it comes to love. One day, Mikage decides to become roommates with his financially challenged junior classmen, Nanahoshi. But, suddenly one spring day Mikage is confessed to by Nanahoshi – whose sweet personality differs from his scary appearance. For the first time in his life, Mikage is in a relationship, but he struggles to understand how to become a loving boyfriend."},{"name":" Scrap Circus","avatar":"https://mangadex.org/covers/cfa5e3bb-38ea-4443-96b8-10d7479e5fa6/6405c340-6062-4998-a432-e710b84f67cd.jpg.256.jpg","country":"Spanish (LATAM)","stat":"8.01","status":"Completed","tags":["Oneshot,Award Winning,Sci-Fi,Action"],"nutshell":"Secret agent from the government meets John Mills, a 12 years old boy who can create anything."},{"name":" Seaside Town Diary","avatar":"https://mangadex.org/covers/cfab99f3-4ac5-4ef9-b833-b126b958562e/f4cac4ac-63c7-4803-8256-ca671569f940.jpg.256.jpg","country":"Japanese","stat":"8.22","status":"Completed","tags":["Award Winning,Romance,Comedy,Drama,Slice of Life,Tragedy"],"nutshell":"A letter comes to the three Kohda sisters in Kamakura bringing the news of their father's death,\nwhich they hadn't seen since he divorced and left home 15 years ago.\nDespite feeling indifferent about their father, Yoshino, the middle of the three, and Chika, the youngest,\ngo to Yamagata to attend his funeral on oldest sister Sachi's request. There they meet Suzu, their young and reliable half sister.\n\n\nWon the 2013 Manga Taisho Award\nWon the Japan Media Arts Festival Awards Excellence Prize for Manga in 2007"},{"name":" Nagi no Asukara","avatar":"https://mangadex.org/covers/cfaba529-36a2-48d8-a9f1-8f6bf3de9324/79183052-2e53-4b0f-bf1c-9d0558089d2b.jpg.256.jpg","country":"Japanese","stat":"8.22","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Fantasy,Adaptation,Tragedy"],"nutshell":"A story between the Sea and the Earth. Childhood friends Hikari and Manaka, who live in the sea, together with their friends Kaname and Chisaki, are forced to attend school on land after their own undersea school is closed. But due to a special encounter, their lives gain a new twist.\nWikipedia\n\nArabic\nArmenian\nChinese (Classical)\nChinese (Traditional)\nEnglish\nFrench\nIndonesian\nItalian\nJapanese\nKorean\nPortuguese\nRussian\nSpanish\nThai\nTurkish"},{"name":" Nouryoku: Shujinkou Hosei","avatar":"https://mangadex.org/covers/cfacd649-d284-42b5-94ce-e351a2854726/b0b6e81b-8b7d-4e6d-a74a-31e72057dde1.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Ongoing","tags":["Thriller,Psychological,Romance,Comedy,Harem,School Life,Supernatural"],"nutshell":""},{"name":" Angolmois - Genkou Kassenki","avatar":"https://mangadex.org/covers/cfaeff4f-aae5-4793-91ea-61ca7b123df8/02631ba4-c168-4f28-a292-0a012535e9dd.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Historical,Action,Martial Arts,Samurai,Adventure,Military,Drama,Tragedy"],"nutshell":"In the 13th century, the Mongolian Empire rapidly expands across the globe. Later historians who studied the prophecies of Nostradamus would say that Mongolia was the birthplace of the \"Great King of Terror,\" Angolmois. And at last, the force of the Mongolian Empire would turn their attention toward Japan… 1274: The Bun'ei Invasion. The exiled samurai Jinzaburou Kuchii is in Kamakura when he finds himself face to face with this invasion.\nThis story is a fresh look at the great battle that rocked all of medieval Japan: the Mongol Invasion. It shows how the people of Tsushima panicked, struggled, and eventually rose up against the overwhelming forces of their enemy.\n\nLinks:\n\nAnime on ANN\n\nOfficial Korean"},{"name":" Seeing Double","avatar":"https://mangadex.org/covers/cfb5b3ac-537d-46cf-a095-eec971ebe3d4/734d9f9d-9b55-43b3-8139-0a4967dd13d7.jpg.256.jpg","country":"Korean","stat":"7.98","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,School Life,Web Comic,Full Color"],"nutshell":"Ohn can’t stand men, and he’s determined to stay away from them at all costs. Little does he know that the shy, soft-spoken Seo-woo is crushing on him hard. So hard, in fact, that he’s recruited his more confident twin brother, Jae-woo, to act as his double and approach Ohn. But as Jae-woo starts putting a little too much of his own heart into the act, the line between who’s courting Ohn gets blurred. Will the brothers break through Ohn’s hatred of men? And if so, which twin will be the one to win Ohn’s heart?"},{"name":" Ouchi e Kaerou: Neko Mimi Omegaverse","avatar":"https://mangadex.org/covers/cfb5b80e-33e3-4d26-9458-f8813fa92cb5/7a30f416-6f5b-4da9-9c7c-296963879059.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"Shiina and Aoi are a romantic Alpha and Omega couple who live happily together with their little son, Noel. Protected and sheltered by his parents, Noel is unaware that his family is different from any other until he one day accompanies Shiina to work and notices something strange. Why is it that he and Aoi are the only ones with cat ears?"},{"name":" Two Pawns","avatar":"https://mangadex.org/covers/cfb86244-00e6-45e7-8e97-7da989328edf/b6fb831a-c6e9-4ec0-864a-5c4cd53c749a.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot,Traditional Games,Romance,Drama,School Life,Slice of Life"],"nutshell":"Kaede Yukimura is a gorgeous girl who has been challenging every person in her class to a shogi bout. If you win against her, she will confess to you in front of the whole school. As more and more classmates lose against her, the reason behind her bet begins to slowly unravel…"},{"name":" Kimi no Tame ni Sekai wa Aru","avatar":"https://mangadex.org/covers/cfbdcddc-7013-494b-b2ef-aa7860f5ad60/eb5a1a57-bfc6-43ce-8c89-3e34693910e6.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Anthology,Office Workers,Girls' Love,Drama,School Life"],"nutshell":"A collection of oneshots.\n\nThe World Exists for You\nあらしが来たりて\nFriday Night Cinema\nSecret Closet\nCast a Spell\nJewel of You"},{"name":" Kowagari Kimi ni Kisu no Ame","avatar":"https://mangadex.org/covers/cfbffa29-03c4-489b-a7df-8ab170866b60/d283f79d-971a-42a1-9922-6cc834163185.jpg.256.jpg","country":"Japanese","stat":"8.19","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":"Kanato was approaching 30 with zero experience of love. Having met his younger partner Mirai unexpectedly, they pursue a long-distance relationship between Tokyo and Osaka. They try their best to use any spare time for secret trysts and , it’s blissful beyond his wildest hopes… but Kanato is keeping a secret from Mirai.\nAnd Mirai ,who treasures Kanato more than anyone else, sees sadness in his eyes. Although they’re supposed to be adults, they can’t help but get swept away… although they are supposed to be adults, they can be awkward too… An earnest love story between cute adults."},{"name":" Iincho.","avatar":"https://mangadex.org/covers/cfc26ec5-33bf-4532-b48a-6bac819c288d/6e8bfdde-eb92-4223-976a-eec93a863d4e.png.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Harem,School Life"],"nutshell":"The first year middle school Student Council Chairpersons (iincho) come from different elementary schools and different backgrounds. These six cute, glasses-wearing middle school girls often fight, but they have a common enemy in the sexual-harassing Student Council President. Will they be able to do their job without being distracted by infighting or thwarted by the controlling Student Council President?\nWikipedia"},{"name":" Mr. Dior","avatar":"https://mangadex.org/covers/cfc8c973-20cb-4db6-b5b6-95949a94ed92/fd007eb5-4810-4619-b9c1-a59888658fdc.png.256.jpg","country":"Chinese (Simplified)","stat":"7.74","status":"Ongoing","tags":["Official Colored,Long Strip,Boys' Love,Full Color"],"nutshell":"Seven years into their marriage, one of two CEOs gets into a car accident, and thus begins the real-life story of a handsome CEO and his nut job."},{"name":" Flying Planet","avatar":"https://mangadex.org/covers/cfc8ef97-74a9-4780-a9ff-18bc41e5a28d/985b5780-49ba-41df-ab3d-8cb07275066d.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Completed","tags":["Long Strip,Romance,Boys' Love,Drama,Web Comic,Full Color"],"nutshell":"Spanish: ¿Que trucos puede usar el perfecto rico de segunda generacion para recuperar el amor de su antiguo superior? Presencia este magico amor que es como los fuegos artificiales\nFrance:\n|| Comment un homme riche et parfait peut-il courir après son misérable premier amour ? L'histoire de cet amour féerique, comme un feu d'artifice ! Si chaque relation doit être entretenue, qu'est notre amour ? Le mien est un feu d'artifice. C'est court ? Non, c'est extraordinaire !\nEn tant qu'incroyable et riche jeune chef d'une grande famille, les femmes et le mariage sont pour lui de vulgaires jeux. Mais aussi infaillible soit-il, il a en fait été abandonné dans sa vie universitaire, par un garçon dont le père est mort jeune. En se rencontrant une nouvelle fois, il décide de ne pas le laisser une seconde fois. ||"},{"name":" Guilty Axe","avatar":"https://mangadex.org/covers/cfcb0576-e911-4ff9-a780-93f6666d7b64/4f4b5c38-6157-404c-b74d-2169ba028802.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Hiatus","tags":["Monsters,Action,Long Strip,Superhero,Martial Arts,Magic,Fantasy,Web Comic,Full Color"],"nutshell":"The moment you turn a blind eye on injustice, you will definitely become a miserable person”. A boy named Dantae died after trying to save his friend, and at the same time a monster called “Sin” appeared. An option was given to Dantae, who thought that he had died. Are you going to heaven or kill the sins and save other people. This is Dantae’s awful punishment action fantasy."},{"name":" Senpai Amasugiru H","avatar":"https://mangadex.org/covers/cfd1121d-dfcf-4f1c-9e26-52626f44e8e2/145fd94b-88ef-4c7f-8669-3a7584379443.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Anthology,Drama"],"nutshell":"This is a lovely manga anthology about love and sex, plus a bit of humor for female readers. It features all the stories of female characters falling love with her senior students. Includes six works from six authors:\n\n\nZakuro no Mi (w)o Abaite (Opening the Pomegranate Fruit) by SHINJO Mayu\nKotoko, a young lady with pride and posture was sold to the Tokuda family as the payment to her father's debt. She was ravished by Takahiro Tokuda, her newly engaged fiancee, who would become the ultimate heir to the noble Tokuda family and also would have complete controll over her. What will be the romance of these two?\n\n\nSexy Shiyouyo! (Let's Do Sexy!) by KOUSAKA Yuuka\n\n\nJunai Egoist (Pure Love Egoist) by AYUKAWA Mio\n\n\nNetsuai Byoutou (Love Fever Hospital Ward) by MURATA Yuka\n\n\nWagamama na Kuchibiru by KURUMATANI Haruko\nYuu gets a job acting in a commercial with popular idol star Kano Itsuki. When Yuu works up her courage to introduce herself, he kisses her! What does she do but punch him.\n\n\nDouble Face - Akogare no Senpaihen (Double Face - Senior Student Version) by UCHUUDA Kai"},{"name":" Hitoyo Hitoyoni Hitomigoro.","avatar":"https://mangadex.org/covers/cfd1a618-cb56-495e-a0aa-066c8c15c253/7e6cb478-28c3-4548-b1dc-87ad9c0d2ca3.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Animals,Romance,Comedy,Slice of Life"],"nutshell":"It would be so much easier if I could just be myself, but why can't I do that?\nA woman in her 30s who is perfect on the outside but messy on the inside.\nA young girl who falls in love.\nThe handsome boss who is crazy about love.\nA self-conscious female office worker who loves to improve herself.\nThe natural boy who can't get a sense of distance from people.\nPeeking into the love lives of these clumsy humans, the pets think: \"Human love is so fragile. Human love is so stubborn.\""},{"name":" Message","avatar":"https://mangadex.org/covers/cfdc5375-facb-477a-a229-d75a7d326064/e851efed-c2d0-43c5-8625-855ae1f684d8.png.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Oneshot,Psychological,Horror,Supernatural"],"nutshell":"Just as she’s about to be married to the “perfect husband”, a string of disturbing events starts to haunt Shiori’s life."}]