[{"name":" Dolls Music Staff","avatar":"https://mangadex.org/covers/c4eea31c-ed8c-4b2d-841b-8abf420b7579/d8a606a2-5ea6-4477-a169-e4c12b57d151.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Completed","tags":["Romance,Fantasy,Supernatural"],"nutshell":"Ke Lim got a doll with the same name as her for a present from her dad, who found it on a business trip in Germany. When she took her new doll to go play at the park, she meet and become fast (best) friend with a boy at the park because of the glass shoes. However, he later have to move away soon and he make a promise with her that he will come back and find her. She gave him one of the glass shoe tied with a ribbon from her doll with her name on it. so that he will not forget her. She came to the same park everyday after that to wait for him… Will he come back to see her again? Or may be he already…. And, why does Qiang Shu remind her so much of that boy? She must stop her attraction to Qiang Shu. Qiang Shu cannot be that boy since Qiang Shu is a GIRL!?\nSecond part of the Agreement of the Glass Shoe trilogy."},{"name":" Shintan Kairou","avatar":"https://mangadex.org/covers/c4f27c5f-c136-4f86-8aab-f865c32978fd/4105d8ba-dcf6-4a1c-8be7-7940bb340dc0.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Ongoing","tags":["Psychological,Boys' Love,Drama,School Life"],"nutshell":"He was a teacher who knew his student was gay and still desired his body.\nAfter running away from everything, he became a wanderer and took the name Mos-san.\nYanagida struggled with the pain of being in love with the same sex.\nHe committed attempted rape on a student when he was a teacher, and ran away from there.\nBefore he knew it he had become Mos, a pitiful demon who had thrown his past away, but had no choice but to keep on living.\nHe thought he'd lost everything but a single boy reached out his hand to him.\nSeven years have passed since the painful but passionate story of 'Smells Like Green Spirit.'"},{"name":" Kuro Genji Monogatari","avatar":"https://mangadex.org/covers/c5000a23-5337-4432-84bb-9453e4b6a98e/6626004d-310d-4ba8-be71-652b7272a154.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Romance,Drama,Tragedy"],"nutshell":"\"Casarte con una mujer de la que no estás enamorado. ¡¡Si eso es lo que significa vivir como rey, no es en nada diferente de estar muerto…!!\" Hikaru Genji es un príncipe cuya belleza es comparable solo con la de las flores. Durante su infancia, su madre murió y él fue apartado de la realeza. Nadie es capaz de comprender la soledad que moraba en su corazón. La señorita Fujitsubo, una dama de la corte muy parecida a su madre y quien fue su primer amor, era la esposa de su padre. Pero está claro que su matrimonio con la señorita Fujitsubo no podía durar toda la vida. Hikaru y Aoi, hija del ministro de la izquierda van a… ¿Realmente es Hikaru Genji simplemente un puro y hermoso joven de la nobleza? Una interpretación libre del clásico de la literatura japonesa 'Genji Monogatari'. Una historia llena de amoríos y conspiraciones.\nA retelling of Genji Monogatari. The young Hikaru no Kimi, who grows up to become Genji of Genji Monogatari is the illegitimate son of the king. He grows up unloved and yearning for his father's approval. One day he meets a beautiful young women under his favorite sakura tree and his heart is swayed by her. But their love is not meant to be…"},{"name":" One Night Lesson","avatar":"https://mangadex.org/covers/c5055be2-3467-43b0-8b4d-1d5047f15bf5/ad7a3637-fd20-4583-9d30-5138bfc8b567.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Comedy,Boys' Love,Drama,School Life"],"nutshell":"Takayoshi, a model, is currently employed by Kairi the photographer. Kairi's intense gaze makes Takayoshi flustered… why is he constantly looking at him like that?"},{"name":" The Last Step on the Way","avatar":"https://mangadex.org/covers/c50ac5df-eea5-42c7-9595-8f1bf622f203/e3e9d629-1b4e-40df-ae18-028a4237bedf.jpg.256.jpg","country":"Korean","stat":"8.15","status":"Completed","tags":["Romance,Boys' Love,Drama,School Life,Tragedy"],"nutshell":"“I wanted to tell you it’s okay now.”\nJoo Giran was torn apart by guilt after his grandmother passed away. He had a one-night stand with Baek Sunkyung after meeting him at a club but…\n“I wish it was just the two of us forever.”\nThey meet again as sunbae & hoobae in the same major at the start of the semester celebration. Giran is strangely attracted to and forms an odd camaraderie with Sunkyung, who strides toward him unabated. Sunkyung stays by his side through thick and thin, as if Giran was his final destination."},{"name":" Someday, We'll Get There","avatar":"https://mangadex.org/covers/c5124370-a1b0-4a39-851d-708fb1222d9f/7b549feb-60ff-46a6-894b-ebb1eb24f0a6.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Sports,Video Games,Slice of Life"],"nutshell":"Minoru's parents want to move to Las Vegas so her father can have a last shot at his fighting career. Minoru has recently started at high school and doesn't really feel like leaving Japan, although she doesn't have much reason to stay either. While feeling down about the choice, she follows a girl from her school into an arcade out of curiosity. Minoru ends up playing against the girl at a fighting game. The girl introduces herself as Shijou and explains that she's aiming to become a pro-gamer. Shijou recognizes that Minoru has talent and invites her to team up with her."},{"name":" Unbelievable Doctor","avatar":"https://mangadex.org/covers/c516709e-b25f-4b60-b1a4-ba78d6d13114/3c4c0000-b96c-4285-92fc-9a2505f71362.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Fantasy,Web Comic,Full Color"],"nutshell":""},{"name":" Touhou - Hello Hello I'm Here (Doujinshi)","avatar":"https://mangadex.org/covers/c51b68fa-39a2-4670-bd35-928268328a22/f1a9f43d-a8f3-4f84-a606-8cd977137ae1.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":""},{"name":" Thanatos no Shiori Renzoku Satsujinki to Bungaku Shoujo","avatar":"https://mangadex.org/covers/c51c7a26-a90c-4f36-873e-41b0e7543ff6/19dfe6ff-426d-4440-a867-000306461a03.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Drama,Web Comic,Mystery"],"nutshell":"The story of \"Thanatos's Bookmark Serial Killer and Literary Girl\" begins with a scene called \"Killer Barista\", in which a serial killer who routinely drinks coffee after killing his victims is the talk of the town. Aside from high school friends who are excited to say, \"It's a handsome murderer with a fashionable and sweet mask !!\", Choko Mizuno, a literary girl who is aiming to become a novelist, said, \"But I have no pride.\" If you kill a person and the purpose is robbery, it's thin as a murderer. \" However, one day, a contact was made between Choko and the killer barista ..."},{"name":" Yuugure no Machi","avatar":"https://mangadex.org/covers/c5217d95-00eb-42c4-b6f0-cd07359a903e/e55661da-4af5-4e7e-824d-1e9dce44e057.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"Asahi, who goes to a male soapland to collect on their debt, coincidentally meets Kanna, a former classmate. The owner of the shop had run off, leaving Kanna, who was employed as a live-in worker, suddenly without a job and a place to stay. Unable to abandon his former classmate, Asahi lets Kanna stay in his rundown apartment as a freeloader, however…"},{"name":" My Sister Is Out to Destroy the World","avatar":"https://mangadex.org/covers/c521d244-6514-47f6-b11b-e31844652b80/ef99a7f4-dcaf-4d21-aaff-cb0beaae9196.png.256.jpg","country":"Chinese (Simplified)","stat":"6.69","status":"Ongoing","tags":["Official Colored,Long Strip,Romance,Fantasy,Full Color"],"nutshell":"What do I do? I think my sister is plotting to destroy the world! Recently, my sweet and adorable sister suddenly became strangely irritable and violent. According to my investigations, not only has my sister become involved in a murder, she is also possessed by a witch from a thousand years ago! Now, my sister seems to be plotting to destroy the world! What’s worse, my sister is trying to pin the blame on me. She even told me that the food in prison is delicious and that there is good company in there! What am I supposed to do as an ordinary person?!"},{"name":" Bokura no Pink","avatar":"https://mangadex.org/covers/c523f589-3fd4-4b6a-bf2c-acd52a86df8e/7bef409d-9c79-40bb-95e4-562d62fdb440.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Momoko is a fan of Hero shows, like the Power Rangers. The boy she liked in Junior High says mean things about her obsession and breaks her heart. In High School, Momoko tries to reinvent herself, and throws away all her Hero souvenirs. But at school, she is asked to join a Hero Club with 3 tall, handsome members who dress up as Hero characters and patrol the school. They want her to be their Pink Ranger. Even though the other girls are jealous, Momoko is too scarred by her past to embrace her love of Hero stories, and she doesn't get along at all with the Red Ranger."},{"name":" Desert 9","avatar":"https://mangadex.org/covers/c526840a-c803-4a5b-8ea1-9e85fea9298a/c45323aa-5715-443a-b46c-da9345b61c6e.jpg.256.jpg","country":"Japanese","stat":"8.61","status":"Completed","tags":["Action,Adventure,Fantasy"],"nutshell":"Hyudra, living water that attacks moving humans. A thousand years ago, a large war had ravaged the land and turned most of the world into desert, driving humans to hunt Hyudra for water. In total, there exist eight deserts. The story focuses on Mao as he heads to the phantom ninth desert to find his father."},{"name":" Touhou - This Must Be a Beautiful Paradise (Doujinshi)","avatar":"https://mangadex.org/covers/c528d4da-2219-46c3-b9b0-52e27f14471d/ef22dd57-1799-4e34-909a-d45dd8f2ac67.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Psychological,Fantasy,Supernatural,Full Color"],"nutshell":"Bitter eye candy."},{"name":" A Date with a Billionaire","avatar":"https://mangadex.org/covers/c52a3859-024d-4dd4-abaa-9cfe81ceddde/3ebbc42a-0f7b-48e0-a495-12cc9ae6cd5a.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"\"You've been chosen to date a billionaire!\" Beth is startled to receive such a phone call. It appears her neighbor entered her in a competition without telling her! The prize is a date with Kane, a famous billionaire, but Beth is not interested and rejects this golden opportunity. The news reaches Kane and his heart is ignited– no woman could ever reject him, could she? His pride hurt, Kane vows to win over Beth's heart!"},{"name":" Kantai Collection -KanColle- Atashi no Mizugi o Dashinasai! (Doujinshi)","avatar":"https://mangadex.org/covers/c52a7231-87ef-4b73-acab-9d3421fb956b/81b661b2-f446-47ef-b614-72d6a8423440.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":""},{"name":" Silent Kiss","avatar":"https://mangadex.org/covers/c52ab0a0-b981-45c0-b474-6c1372aad854/4869d10b-3d42-496d-98df-5e39f54ec6b4.jpg.256.jpg","country":"Japanese","stat":"7.59","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"On the first day of high school, Haruka meets the boy of her dreams but, he was the kind of guy who wouldn't allow anyone to get close. The distance between them does not shrink, even though she wants to get close to him. As a matter of fact, he has a secret that he can't tell to anybody…!? Very painful dramatic love story!!"},{"name":" Kowairo Henge","avatar":"https://mangadex.org/covers/c52bc4a9-259b-42e8-9779-08b869dafad7/265c8aab-9abc-4c9b-bb94-3f8680dfbd63.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Historical,Romance,School Life"],"nutshell":"Torigoe can imitate anyones \"tone of voice.\" He, along with his accomplice Madara, accepted a request made by a woman. She wants them to imitate the voice that she hears every morning from the second floor of her house. A hidden secret and a faint memory awaits them. What could they be?\""},{"name":" The Story of Getting Dumped So Often That You Think \"Whatever, I'm fine with him\" and Genderswap Your Best Friend And Can't Undo It","avatar":"https://mangadex.org/covers/c52e6d0e-e354-4c4f-b608-ebb6297acfd5/83fdc06b-2b34-4f4f-9e21-0300627c6c9d.jpg.256.jpg","country":"Japanese","stat":"7.30","status":"Completed","tags":["Oneshot,Genderswap,Romance,Web Comic,Full Color"],"nutshell":"Creator-approved translations by Hachirumi Scans."},{"name":" Touhou - Wagamama Body no Shanghai Ningyou!! (Doujinshi)","avatar":"https://mangadex.org/covers/c52ed475-0934-4c26-a228-70f2c3b19b89/aca524fd-d403-4917-a6f2-aab42e683b9a.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":[""],"nutshell":"Part of Touhou series."},{"name":" Shards of Sin","avatar":"https://mangadex.org/covers/c535994e-18e7-4d3c-b12f-16961dc0a0f9/1c4ef8dd-2d12-4b04-abbc-d70566eae2ab.jpg.256.jpg","country":"Korean","stat":"7.92","status":"Completed","tags":["Thriller,Official Colored,Psychological,Long Strip,Drama,Web Comic,Mystery,Tragedy"],"nutshell":"Five different people are gathered in an abandoned hospital after getting a mysterious phone call, and the mastermind behind the curtains holds their families hostage. He orders them to figure out the one culprit who killed his brother… Or otherwise, they will all die."},{"name":" 1tou 7okuen ga atatta ore no 3kakan","avatar":"https://mangadex.org/covers/c5362cff-8446-44a7-bb7d-9db616bf3d10/afc6bacb-6320-4b3b-b6fe-803daba1adfb.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Ongoing","tags":["Romance,Comedy,Boys' Love,Drama"],"nutshell":"Эцуси Фукунага, простой офисный служащий, чувствует себя ущербным в сравнении с идеальным красавчиком, отличным работником и близким другом Реем Сугихарой. Купленный им под влиянием минутного порыва лотерейный билет, к его удивлению, оказывается выигрышным. Сорвав большой куш, Эцуси заявляет: «Я не хочу идти домой» – и предлагает Рею переночевать в любовном отеле. Однако он совершенно ничего не знает о тайной любви Рея."},{"name":" Shikabane-Gatana","avatar":"https://mangadex.org/covers/c53c8450-3381-4b88-be2b-3549bb02b3f7/a6a95da5-2860-4fa2-8154-7efd95ad783d.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Action,Survival,Zombies,Adventure"],"nutshell":"The \"battle action\" manga centers on Tsuranuki Tsutsuki, a middle school boy who lives a happy life despite slightly strange family circumstances. But when a great disaster strikes, strange zombie-like creatures kidnap his younger sister. To find the whereabouts of his younger sister, Tsutsuki heads to monster-infested Tokyo, and there has a chance encounter with a high school girl wielding a mysterious sword."},{"name":" Kurieta Lumikha","avatar":"https://mangadex.org/covers/c53fdfb2-46e0-4007-9950-6c01fe4c2115/ac902630-c468-4e62-bef9-1b2d9e4b2678.png.256.jpg","country":"English","stat":"7.52","status":"Ongoing","tags":["Reincarnation,User Created,Fantasy,Slice of Life,Supernatural"],"nutshell":"Bacon Abayan is a positive girl wanting to become a mangaka for her close friends at a young age, but when her life later turns upside down, she’s reborn in a mysterious world where she’s given a second chance to be a mangaka. This is the prologue of Kurieta Lumikha, where her origins as a mangaka began with a tale of friendship, in the country of Japan."},{"name":" Hell Samurai","avatar":"https://mangadex.org/covers/c5403fd0-3bc9-42a2-8ecd-c81fa8d51acc/148de600-2eff-4120-9f42-fb088ed91407.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Action,Ghosts,Samurai,Supernatural"],"nutshell":"Jump Giga 2021 Winter one-shot. Somei Nagiichirou is a \"Spirit Burial Reaper\"…that is, he cleanses evil spirits from the human world! When a particular evil spirit has been snatching up humans in Yudachi train station, it's up Nagiichirou to restore the peace!"},{"name":" Mayonaka no Circus","avatar":"https://mangadex.org/covers/c54c670f-8321-4416-8c73-9fe041047b76/a947862d-a6f6-4381-9b8f-227978757c25.png.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"Part of Gekiyaku Mitai na Koi. ~Warui Otoko to Wasurerarenai Jouji~ (劇薬みたいな恋。～悪い男と忘れられない情事～) anthology."},{"name":" Kokuhaku Kurabu","avatar":"https://mangadex.org/covers/c5544d05-cd93-4d84-8ed0-c0171c4549b8/e00ba312-9c49-42fe-8b3f-9314df409206.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Romance,Comedy,Drama,School Life"],"nutshell":"Story 1 - Confession Club\nUeda Yuki sees the boy she likes, Mashimo Arata, kissing a book that she borrowed from her senpai. Seeing the situation as it is, Yuki knows immediately that Arata likes Misato-senpai. Thus, in order to be able to talk to him freely, Yuki volunteers to become Arata's practice partner by forming a so-called 'Confession Club' to help Arata confess to Misato-senpai. Will Yuki be able to help Arata confess, or will she fall for him?\nStory 2 - Please Tell Me If You Love Me\nHinako is a quiet girl with a secret. She can't say the word ¨like¨. Because of that, Hinako has suffered when she confessed to a guy in middle school, everyone heard and laughed. And the problem is that now in high school, she likes the Principal's son, Kashiki. Wanting not to be laughed at, Hinako starts to practice how to say that word, but in the middle of the halfway someone hears her…?!\nStory 3 - Countdown\nMioko is a average girl, who suddenly starts to have troubles with school. When suddenly their parents go on a trip, wanting someone to help her with, they decide to leave her with the dog and… with her not-blood-related brother, Shiro. But Shiro wanted to live in the school dorms, so Mioko just has two days left to convince him in order to not leave her alone. That's when the countdown starts!!\nStory 4 - Heavenly Hallucinations\nKisa is dumped by her first boyfriend, Mori. Another boy, Shiba, confesses to Kisa–and he sounds just like Mori! Every time she tries to tell Shiba it's all a big mistake, his deep powerful voice makes her melt…\nStory 5 - His Glasses\nHaruki broke the scariest guy in school Onozuka Suu's glasses. He demands her to be his eyes for 5 weeks.\nStory 6 - Sleeping In The Woods\nHarumi is nicknamed as the Sleeping Princess, because of his cute face and sleepy personality (and… actions). One day, a girl from his class, Youko, asks him to… teach her how to sleep?! Can this princess, break the curse of his prince?\nStory 7- Mermaid By The Sea\nYosuke, is treated nicely and is popular because of his looks, but he has never liked someone seriously. One day, he sees a girl he thought was drowning. But… she was swiming?! Now it seems she caught his eye. Will this playboy find some love, or will he continue playing…?\nStory 8: The Confession Club\nAfter hearing they could realize your love, she absolutly went there!! But not all is sweet and mighty, they dont do anything for free. Minamida, one of them (and future instructor), is a non beliver of true love, so in order to not pay, her task is to change his mind!! Can Nana really make Minamida believe again in love? What will happen to hers?\nStory 9: Apple Cheek\nSince the first day they met, she doesn't get along with him. Masaomi, a total player, always makes fun of Rinko whose cheeks are naturally apple-red. Whenever Rinko sees him, for some reason, she gets irritated. What will she do when she founds out the meaning of her anger?\nExtra Story: Cat Smell"},{"name":" Yukibana no Tora","avatar":"https://mangadex.org/covers/c5571468-f6b2-4cc2-a54b-d89898017585/0578d7e7-e968-4322-876e-cd2946cd9c58.jpg.256.jpg","country":"Japanese","stat":"7.76","status":"Completed","tags":["Genderswap,Historical,Romance,Ninja,Comedy,Crossdressing,Military,Drama"],"nutshell":"The life of daimyo Uesugi Kenshin commanded authority and fear during the Sengoku period of Japanese history. In this retelling, the powerful lord is reimagined as a woman."},{"name":" Zero-1 Sentai","avatar":"https://mangadex.org/covers/c5591802-c690-4592-a38d-693c5090c9f1/5ef1f5dd-57bc-4073-9287-8cfa16c8c1d3.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Sci-Fi,Monsters,Action,Psychological,Comedy,Survival,Adventure,Military,Drama,Slice of Life,Tragedy"],"nutshell":"(from ebookjapan):\nIn just four years, he destroyed 13 naval ports, 6 naval vessels, 1 aircraft carrier, 1 battleship, and 25 submarines, and was known as the number zero one of the Imperial Japanese Navy. The legendary man died in May 1950, three months before the end of the war, in an attack by U.S. forces.\nAs time goes by, Akira, a young boy who admires his uncle Number Zero One, runs away from home to become a frogman, amidst the worry of his mother and older brother, and embarks on a thorny and perilous path..."},{"name":" We Best Love","avatar":"https://mangadex.org/covers/c562b553-22f6-49f8-b82f-6e9079483961/19a0d58e-e832-423a-a1f7-32f543a9c26c.png.256.jpg","country":"Chinese (Traditional)","stat":"7.92","status":"Completed","tags":["Romance,Boys' Love,Slice of Life,Adaptation"],"nutshell":"\"You who fell for me first, lost from the very beginning.\"\nAre you still unable to let go of \"No. 1 For You\" and \"Fighting Mr 2nd\"?!\nSupervised and authorised by the WBL production team, official comic with extras ~"},{"name":" Oni Hunting","avatar":"https://mangadex.org/covers/c564b7a6-6807-433a-bd0e-33c9330bda59/d48ee399-0c9c-48da-bf5d-6fe528ed9a8c.jpg.256.jpg","country":"Japanese","stat":"7.71","status":"Completed","tags":["Action,Horror,Supernatural"],"nutshell":"A short fast-paced horror manga about a woman who is attacked by an ogre and rescued by an ogre hunter, who informs her that she's been cursed and the ogre has been summoned to kill her.\nWill the ogre hunter be successful at removing the curse, banishing the ogre, and saving the woman?\nNote: although this is primarily a horror manga, there is a moderate amount of nudity and small amount of explicit sex."},{"name":" Suna no Meiro","avatar":"https://mangadex.org/covers/c56e6e5d-cb8c-4122-82e8-59092d889da6/70b8cf27-2f9b-4dc8-88f2-bb6834ce51b5.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Romance"],"nutshell":"Begging for Prince Tariq Shadad ibn Zachir's mercy is the last thing Faye wants to do. She hasn't seen Tariq for a whole year…since their ill-fated wedding. But as Faye's brother remains imprisoned in her husband's country of Jumar, she learns that only Tariq has the power to grant his freedom.\nFaye expects her meeting with the man she married to be difficult, but Tariq's ultimatum takes her breath away: become his mistress and her brother will be released. As her decision takes her to the Middle East, her bitter feelings for Tariq begin to change, and she becomes more than just a mistress to this powerful Sheikh."}]