[{"name":" The Legend of Heroes: Kuro no Kiseki ~Agnes' Style~","avatar":"https://mangadex.org/covers/d2a3518b-de20-403c-8715-002d408d5f07/100059dd-6855-490c-a3f7-49197b622694.png.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Comedy,Adventure,Office Workers,Drama,Fantasy,Web Comic,Slice of Life,Cooking,Adaptation"],"nutshell":"A slice-of-life Twitter manga spinoff of the Trails series's \"Kuro no Kiseki\" arc featuring the daily life of 16-year-old high school girl and arc heroine Agnes Claudel, and her days as an assistant to the 24-year-old Spriggan and arc protagonist Van Arkride, released on Dentsuma.\nPart of a promotional campaign for Nihon Falcom's 2022 release of \"The Legend of Heroes: Kuro no Kiseki II -CRIMSON SiN-\"."},{"name":" Fate/hollow ataraxia - Saber haet game system (Doujinshi)","avatar":"https://mangadex.org/covers/d2ac4b44-2a71-40d4-9335-6266e69ee330/fcf757aa-185d-4815-a1cb-813135db0c53.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Oneshot,Video Games,Slice of Life"],"nutshell":"This is what happens when you're allowed to publish your whatever-doodles via internet's digital magic. Weep for the culture."},{"name":" First Love - Anata ga Watashi o Sabishiku Saseru","avatar":"https://mangadex.org/covers/a6c499cd-50f0-4ca2-b0ff-405e26cd8762/909b30ef-2ef1-445f-afea-4cd42e668d10.png.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Drama,School Life"],"nutshell":"Azayoshi lives in an empty world, there is no hope or happiness, all she wants is a person who will never leave her side. Suddenly Ai steps into her dark world. To her he was her love. But what will happen when he discovers Azayoshi's past? Why is she keeping secrets from Ai?"},{"name":" Mobile Suit Gundam - MS Wars REBOOT","avatar":"https://mangadex.org/covers/a6c9ce9c-4106-4e36-9fe5-fa259187efe3/6648f71c-116c-46a0-af1e-26b8b492f452.png.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Mecha,Survival,Adventure,Military,Philosophical,Drama,Tragedy"],"nutshell":"Frederik Brown is a Mobile Suit trainee in one of Zeon's military schools, but always had a hard time keeping up with everyone. Ten months after training hard, he's thrust into actual combat for the first time together with Zeon's declaration of war. He becomes witness to the horrors and atrocities associated with war first hand as he fights to stay alive.\nA new work by realist Kazuhisa Kondo! A reboot of the famous Record of Mobile Suit Wars for the first time in almost twenty years!!\nNow, the whole story to the Earth Drop Operation is illustrated! What will the Zeon’s next move be?!"},{"name":" Yu-Gi-Oh! Go Rush!!","avatar":"https://mangadex.org/covers/a6d25f47-17e2-49d9-b690-296cb4cac8ed/97cc4c85-93f4-43c4-bff8-35f70841cfbe.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Ongoing","tags":["Traditional Games,Action,Comedy,Adventure,Aliens,Mystery"],"nutshell":""},{"name":" Harry Potter - Futatsu no Watashi (Doujinshi)","avatar":"https://mangadex.org/covers/a6d2cb3e-58cd-45fd-850a-ecd2926e9368/912d1359-e27d-4952-9089-77a47a6940bd.png.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Boys' Love"],"nutshell":"Pairing: Harry x Draco\nFrom Harry Potter Doujinshi Scanlations:\nHarry Potter is a Quidditch Star. One day, one of his teammate invites him to Knockturn Alley for its auction. Old habbit dies hard, Harry pulls his hood and steps into the dark alley."},{"name":" Kamisama to Tobenai Tsukai","avatar":"https://mangadex.org/covers/a6d5c4af-46ed-4138-969a-0f4abfc30e52/cc76860c-e1ad-4570-ad14-5500efdaf6a8.jpg.256.jpg","country":"Japanese","stat":"8.73","status":"Completed","tags":["Action,Romance,Boys' Love,Fantasy"],"nutshell":"Shin, born to a race of winged messengers, faces life as an outsider due to the tiny deformed wings on his back. Flightless, he endures ridicule and loneliness. His people tend to the needs of the Gods who reside in the same mountains, and unexpectedly, he is tasked with the care of the mysterious God residing on Mountain 32. A troubling future looms ahead as Gods and Messengers have begun to disappear without a trace. What dangers await Shin and his people, and the Gods they care for?"},{"name":" The Men Who Made Gundam","avatar":"https://mangadex.org/covers/a6dadd8b-209b-424f-87c8-c0284ef6f496/637f1fe9-e58e-46b3-9b29-76d3f68bc2c7.jpg.256.jpg","country":"Japanese","stat":"8.27","status":"Completed","tags":["Thriller,Sci-Fi,Action,Comedy,Mecha,Survival,Philosophical,Drama,Slice of Life"],"nutshell":"The famous Gundam series marked top rankings in popularity for a long time. What was the secret? How was Gundam born? What’s the story behind Gundam? For the first time ever, we take a step out of the actual Gundam plotline, and we turn the perspective towards the production of Gundam; how it became a major hit surpassing its predecessor, Japanese Battleship Yamato!\nThis story is fictional, but the names of the characters are real, including the voice actors and director.\nOfficial English"},{"name":" Mahoromatic","avatar":"https://mangadex.org/covers/a6db9b27-c0a9-4c4c-921f-9541c2122d70/49cf53df-01d7-4ec5-918e-6ff5e809aa6f.jpg.256.jpg","country":"Japanese","stat":"8.17","status":"Completed","tags":["Action,Romance,Comedy,Drama,School Life"],"nutshell":"Mahoro is a battle android created by Vesper to defend the Earth against alien invasions.\nHaving fought long and hard on behalf of Vesper, she only has 37 days left before she stops functioning. However, if they remove all her battle functions and equipment, Vesper can lengthen her life to 398 days. As thanks for her hard work, Vesper lets Mahoro choose how she would like to spend her remaining time.\nShe chooses to work as a maid for a boy named Suguru Misato."},{"name":" Genma Taisen (Ryu)","avatar":"https://mangadex.org/covers/a6dbd846-ebae-42db-891c-3df47deb0626/88787992-1d70-4927-8763-5a68aa178cd0.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Thriller,Sci-Fi,Time Travel,Action,Psychological,Animals,Romance,Comedy,Mecha,Survival,Adventure,Post-Apocalyptic,Magic,Military,Philosophical,Drama,Aliens,Supernatural,Tragedy"],"nutshell":"An additional part of Genma Taisen, serialized in Tokuma Shoten's Ryu (the predecessor to the modern Comic Ryu). Ryu was named after Ishinomori's Ryu trilogy, and this was done to commemorate its launch early on.\nVol 1-2 Subtitle: The Sound of the Eve of Myths\nVol 3 Subtitle: The Sound of the City of Skulls\n(from ebookjapan):\nFollowing the last part of \"Genma Taisen\", the work depicts a future world after the doom of the moon has fallen. ──── Humans living a primitive life...the \"hominids\" were ruled by the Ma. One day, one of the newborn human twins is taken to the Ma's castle and grows up as Roof, a Ma prince. Meanwhile, the remaining baby, Jin, awakens his supernatural powers when his mother is attacked and ......? The final manga version of the series, which has also been made into an TV anime series and is filled with Ishinomori's thoughts and feelings, was in Ryu!"},{"name":" Matazoro","avatar":"https://mangadex.org/covers/a6e1c05c-98ba-4cb9-b35e-530e45571d1f/9782141d-191c-49d9-95d3-765ba5c2bfaa.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Ongoing","tags":["Comedy,Girls' Love,4-Koma,School Life,Slice of Life"],"nutshell":"A teen disaster comedy about 3 girls who failed the grade.\nAfter spending nearly a year as a shut-in, Koto enters first year of high school for the second time.\nTogether with fellow repeating students Shiki (held back due to poor health) and Tomoe (held back due to excessive free-spiritedness), as well as the expectation-immune, habitually late grade retention reserve army cadet Kaede, her experience of school life is rather different from the norm, but delightful in its own way."},{"name":" Slow Damage","avatar":"https://mangadex.org/covers/a6e3e480-6863-40cd-ab77-102f963b04fa/1b673d36-c3bc-46b0-adfd-a0f033cc33a7.jpg.256.jpg","country":"Japanese","stat":"8.18","status":"Completed","tags":["Psychological,Boys' Love,Mafia,Post-Apocalyptic,Supernatural,Mystery,Adaptation"],"nutshell":"In near future Japan, protagonist Towa lives a self-indulgent lifestyle in the Special Administrative Distract of \"Shinkoumi,\" and has a hobby of \"painting human desires.\" Allowing their desires to be hurled onto him, he channels the experience through his brush. To him, it need not matter if he or the other party are gravely wounded in exchange for the fulfillment of their desire. Because the very act itself, is what brings the other party their \"happiness\"…\n(Based on a BL Visual Novel released February 25, 2021 under the same name.)\nVisual Novel's Website.\nSlow Damage's OP"},{"name":" Blue Petals","avatar":"https://mangadex.org/covers/a6e6a36c-4b1e-4f31-887b-6c1d5512ae46/3ddb830f-0b6c-4df9-a1d3-14af281120a9.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Psychological,Romance,Comedy,Anthology,Philosophical,Drama,School Life,Fantasy,Slice of Life,Tragedy"],"nutshell":"This is the second kashihon manga (rental manga) published by the mangaka under the name \"Akira Matsumoto\" in 1958, and his second debut work.\nIt contains three short stories that were published in the magazine \"Shojo\". A fantastic fantasy masterpiece full of suspense and fantasy that transcended the boundaries of shojo manga of the time.\nThe e-book version does not include the \"Blue Petal\" reading book (special supplement)."},{"name":" Acro Trip","avatar":"https://mangadex.org/covers/a6e82c3e-a6ce-4897-be53-a0044c5cd469/aba3fecd-1847-4f71-bf93-dae2ea7e903a.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Ongoing","tags":["Comedy"],"nutshell":"Machiko, who lives in Sakai City, Niigata Prefecture, is an otaku girl who is a big fan of the magical girl Berry Blossom who protects the city against the evil organisation Fossa Magna. However, nobody was worried about the battle of the two anymore because, Chroma, the wicked evil villain, was too sloppy.\nSo Machiko decided “I want to make my magical girl shine more…!” That desire (?) Leads a shy junior high school student to a strange evil path…"},{"name":" Kakumeiki Valvrave - Ryuusei no Valkyrie","avatar":"https://mangadex.org/covers/a6e9fbbb-f025-4296-b871-4810dd390faf/fa4a28ec-7425-49ff-b88a-58082a9cf3f7.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Action,Romance,Mecha,Drama,Supernatural"],"nutshell":"A side-story of Kakumeiki Valvrave centered on the school idol Saki Rukino, telling her story from both past and present points of view."},{"name":" Muteki no Mirai Daisakusen","avatar":"https://mangadex.org/covers/a6ea3d82-b2de-4295-a067-2aff6bd1f043/88ae2e98-da84-472f-9c98-72f571aa9fc6.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Sci-Fi,Romance,Comedy,School Life,Fantasy"],"nutshell":"\"Who wants to get holy marriage!\"\nIt is a new form of marriage to counter the declining birthrate. A new system that allows selected saints (*super rich) to create polyandry and polygamy families!! Akira Eiko starting to get interested in school prince Iida-kun for life but?.. Aiming for a holy marriage, a school romantic comedy in search of life!"},{"name":" Happy Ending Kuso Kurae","avatar":"https://mangadex.org/covers/a6ea765c-093f-4214-ab2c-be446f5e7396/c5a3ff01-8d90-4078-bc4b-a565b7fe77f5.jpg.256.jpg","country":"Japanese","stat":"7.31","status":"Completed","tags":["Romance,Comedy,Boys' Love"],"nutshell":"When Ume was five years old, he fell in love at first sight with his next-door neighbor, Hara-chan. 20 years have passed and Ume has found himself becoming a sex friend to his unrequited love. However, Hara-chan's actions and feelings towards Ume have slowly become even more confusing?"},{"name":" Princess School","avatar":"https://mangadex.org/covers/a6ed4a5c-9443-4fde-bfa3-1712d6542a8c/5586bcc8-4655-4fde-9982-791e85153736.jpg.256.jpg","country":"Japanese","stat":"7.78","status":"Completed","tags":["Oneshot,Romance,Comedy,School Life"],"nutshell":"Takaki loves ranking the popular and beautiful girls at his school. The one standing at the top is the foreign transfer student Emilia Shutrause, and being a student from Europe, she is extremely popular among the male students at Takaki’s high school. Although he was just a spectator of this school idol, that would change when one day he accidentally bumps into Emily (Emilia’s nickname) and he finds out her secret…"},{"name":" Nee, Darenimo Himitsu da yo","avatar":"https://mangadex.org/covers/a6ef3dc8-8825-4358-8b42-2a571bb0e5b4/f8397c67-14f9-4b6f-ba05-35b2a0737e6b.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Romance,Anthology,School Life"],"nutshell":"Nee, Dare ni mo Himitsu da yo\nThe super plain protagonist whose special skill is studying is asked to help a handsome but arrongant guy study. \"Let's do something more fun than studying.\" However, what was supposed to have been a heart-throbbing moment… ends up taking a weird turn?\n\n\nJoou-sama Melancholic\n\n\nMonolog Monochrome\n\n\nOuji-sama Urajijou\n\n\nAkuma ga Kitarite\nRuiji is secretly in love with Wakatsuki. But how can he declare his love when she's frightened to death every time she meets his eyes?"},{"name":" The King Of Soldiers Surrounded By Beauties","avatar":"https://mangadex.org/covers/a6f0d754-d58a-4671-8c0d-a5b85ded4e91/7932709c-b4d6-4385-90e5-ea261f1eb9b9.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Long Strip,Harem,Web Comic,Full Color"],"nutshell":"The once smashing battlefield killer opened a \"plain\" milk tea shop. The mysterious lady is on the stage, the wealthy and the ladies are making tea, and there is a royal princess chasing him and calling the master? The King of Soldiers among the beauties, such a day of welfare every day, is really boring!"},{"name":" Brothers Conflict Anthology - Perfect Pink","avatar":"https://mangadex.org/covers/a6f117cd-df1c-4930-9cd9-70f134fa1a88/f5586fd4-23ef-48a6-8f79-f654b9ac16b7.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,Anthology,Reverse Harem,Slice of Life"],"nutshell":"Various mangaka take part in this first Brothers Conflict Anthology of short stories involving the brothers in Brothers Conflict (see also \"Beloved Blue\" volume). Characters featured in \"Perfect Pink\" include Kaname, Hikaru, Tsubaki, Natsume, Louis, Subaru, and Wataru.\n\nSide Kaname : HIDOH Ren\nSide Hikaru : Tam\nSide Tsubaki : SAKAMOTO Sayo\nSide Natsume : AOI Fuyuko\nSide Louis : Carmilla\nSide Subaru : Mero\nSide Wataru : SOKA Haruhi\nAll Asahina Brothers : COTORINO Deathco\nEditorial\n\nN.B. Not to be confused with Brothers Conflict \"Passion Pink\".\nBased on the light novel series Brothers Conflict and its otome game (visual novel) and anime adaptations."},{"name":" Kitsune no Yomeiri (Satou Yuuko)","avatar":"https://mangadex.org/covers/a6f726f0-394f-4739-bab9-afa9df01cb61/e2399950-1942-4f8f-98b9-4079e09fc77b.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Fantasy"],"nutshell":"Rin and Len are older sister and younger brother, siblings in a samurai family that rules in the land of Musashi. They lived there happily with their uncle, the current clan leader. Len has started to feel guilty about Rin's wooing. Then, one day, they fnd out that there have been talks with the land of Owari about Len taking part in a political marriage. Rin is against losing the man she loves, while Len accepts reality. The name of the girl who holds their fates in her hand is… Miku. This is a comicalization of a popular Japanese rock-style song created by the popular singer OSTER project and the illustrations of the popular artist Chiho!"},{"name":" Midnightmare","avatar":"https://mangadex.org/covers/a6fab1b9-f59f-4860-ad81-b443c34abff0/3df8cd11-62fb-4674-abf6-6b8fb85e0dea.png.256.jpg","country":"Korean","stat":"7.95","status":"Ongoing","tags":["Long Strip,Boys' Love,Fantasy,Web Comic,Supernatural"],"nutshell":"Grey, a Night Hag that enters the dreams of humans to feed off of their souls, makes it part of his post-meal routine to visit the human, Ethan, a regular at the cafe that Grey works at. Though he puts Ethan to sleep and tucks him into bed every night, he has no desire to enter his dreams. However, when the Lamians appear before them, fate begins to take a foreboding turn…"},{"name":" Mission Impossible","avatar":"https://mangadex.org/covers/a70345aa-0757-40d1-b7d2-ffeb6a9e6448/281b50f8-4557-46b0-a4f2-7edf535d2044.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Comedy,4-Koma"],"nutshell":""},{"name":" Between Coincidence And Inevitability","avatar":"https://mangadex.org/covers/a704973b-2c74-4c12-8006-a8f635402e48/2b7f2fdc-403f-4f1b-bed5-2bcc5c95135e.png.256.jpg","country":"Korean","stat":"7.97","status":"Ongoing","tags":["Romance,Boys' Love,Web Comic"],"nutshell":""},{"name":" Rental Magica","avatar":"https://mangadex.org/covers/a70894bf-f084-451a-93e4-60cd6e109638/a770f9cb-38d4-4fe4-ad90-81786fd38596.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Action,Ghosts,Comedy,Magic,Harem,Drama,Supernatural,Adaptation"],"nutshell":"\"My inheritance is a company that rents out magic users…what!?\"\nThe extremely scared Iba Itsuki receives his inheritance left to him by his missing father: the Magic User Rental Company Astral. The magic users are rented out to customers to solve problems as requested.\nHow will Itsuki deal with the fate of being president when he's never studied mage-craft!?"},{"name":" Bara wo Karasu Te de Boku wo Dake","avatar":"https://mangadex.org/covers/a70f9f9f-d375-44bb-bfd8-10809ea4d50e/b2355d4b-7cd8-4c0e-bab1-58f9dbc11bc0.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Oneshot,Romance,Comedy,Vampires,Supernatural"],"nutshell":"Makoto Hourai is given to Alice Kamiya as an \"offering\" because of a long-established contract between the two families. He is there in order to assist Alice, who is actually a vampire. As an offering, Makoto is supposed to give Alice his blood, however, he is anemic. How does Alice manage to drink blood, if Makoto can't provide for her? How does Makoto feel about all this?"},{"name":" Song of the Sky Pacers","avatar":"https://mangadex.org/covers/a7120845-476e-4f54-9a95-f92cbd592176/62cf7f64-3d7d-4823-a17b-bf5c4aecc97d.png.256.jpg","country":"Chinese (Simplified)","stat":"8.26","status":"Ongoing","tags":["Historical,Martial Arts,Adventure,Magic,Wuxia,Drama,Fantasy,Full Color"],"nutshell":"(In a made-up dynasty) During the Chen dynasty, Consort Jing gave birth to a pair of fraternal twins under the rays of sunlight. The prince was born with a cinnabar mole between his eyebrows, while the princess was born with six fingers.\nFortune and misfortune appeared at the same time, causing the twins to experience entirely different fates as they were forced to leave their family. The heavenly tribulation is approaching, will the two twins who were separated from birth ever get to be reunited? What methods would they use to fight against their destinies?\n\nNote: This is the page-style version of Song of the Sky Pacers"},{"name":" DEEP","avatar":"https://mangadex.org/covers/a71b80a7-d172-4169-96cc-176e7763876e/aec0c2dc-9df5-4351-a9c6-abe54ae2cbd3.png.256.jpg","country":"Korean","stat":"8.02","status":"Completed","tags":["Action,Long Strip,Drama,Horror,Web Comic,Supernatural,Mystery,Full Color"],"nutshell":""},{"name":" Aquaman","avatar":"https://mangadex.org/covers/a72579d6-5db8-4518-bb8f-9992dd0cc49c/a8d98245-ad50-4578-b6a7-c015c53312dd.jpg.256.jpg","country":"Korean","stat":"8.15","status":"Completed","tags":["Long Strip,Romance,Drama,Web Comic,Slice of Life,Full Color"],"nutshell":"Jump into the life of twenty-something Naru as he navigates through the confusing world of modern dating. He’s faced with familiar moments we’ve all been through such as “should I add that smiley face at the end of the text?” or “why haven’t they responded to my text?” But the added challenge for Naru? He’s never dated, doesn’t use a cellphone and most importantly someone’s out there to sabotage his dating life!"},{"name":" Kami Ato ni Kiss","avatar":"https://mangadex.org/covers/a72597c8-c140-4d23-a811-bef61aeffc8b/fd3c04af-1063-4b39-ae1e-d68379a43b39.jpg.256.jpg","country":"Japanese","stat":"7.64","status":"Completed","tags":["Romance,Boys' Love,Office Workers"],"nutshell":"Life is going well for Hidaka. He has good interpersonal relationships, has a nice face and is entrusted with a big project. His life is set on easy mode, hiding behind a facade of his prince-like appearance. That is until one day, Tachibana, a handsome and elite junior joins the company and finds out about Hidaka’s true nature! With a devious smile, Tachibana successfully lures Hidaka in with drinks and they end up in bed?! “Can we keep seeing each other if we’re fuck buddies?”\nA bite mark is the proof of submission?\nCunning Elite S Junior x Charlatan Beauty Salary Man"},{"name":" This Uncle Likes Cute Things","avatar":"https://mangadex.org/covers/a72acc6e-2510-43c3-92e4-695c215fdd76/f8dc5744-7fbe-4903-affd-bcbbe6ce47d1.jpg.256.jpg","country":"Japanese","stat":"8.76","status":"Ongoing","tags":["Comedy,Office Workers,Slice of Life"],"nutshell":"Handsome and hardworking manager Oji has a secret. He is obsessed with \"cute characters\"! But… he can't exactly tell his subordinates that—(><)! A comedy centered around this \"uncle's secret,\" which depicts the daily struggles of how he gets by in the world with his love of cute things. Where will manager Oji go tomorrow?!"}]