[{"name":" Dekiai Sex Method Elite Kare wa Amasugi Seijuu, Tokidoki Uzai","avatar":"https://mangadex.org/covers/75a4819f-67b3-4fd0-8eb6-a38b4699f138/6c2cb203-cefd-4d8a-8525-b79da9e50ff0.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Ongoing","tags":["Romance"],"nutshell":"Chiyoko Fujikawa, the eldest daughter, is a woman of principle. Whenever asked to take care of a family member or a client at work, she always puts the other person’s feelings before her own and ends up losing money.\nOne day, she was asked by her family to go on a blind date to find a partner to marry. The one who showed up was Ichijou, the “righteous man” she met on the way…?! She often fights with Ichijou, who is too frank and rude.\nShe unconsciously gets mad and says many things to him, but for some reason… she likes it?"},{"name":" Kare wa Tsumetai Furi o Shite","avatar":"https://mangadex.org/covers/75a4be53-dc7c-4308-875c-18089e0758eb/9af10596-beb7-4dc5-bdd8-be5c55d9b78c.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Romance,School Life"],"nutshell":"Story 1 - Kare wa Tsumetai Furi o Shite (He Who Pretends to be Cold) - Chapters 1-3\nWishing to become a shining girl and be in a romantic love. Kaho starts a part time job in a family restaurant to save up her allowance. Due to the tension from a new job, she accidentally injures her co-worker Arata, a handsome college student. To this result, the two are teamed up on the same shifts. Kaho is timid towards Arata's cold attitude, but realizes he has some soft sides and…?!\nSweet & Painful first love story.\nStory 2 - Sawacha Dame! (Don't Touch Me!) - Chapter 4\nMomo hates boys, the idea of being touched by them disgusts her. One day, the reason for her hatred and trauma returns.\nStory 3 - 17cm Saki no Kata Omoi (The Unrequited Love Beyond 17cm) - Chapter 5\nSarishima has always loved Sho, despite the fact that Sho is always being mocked for being short.\nStory 4 - Tsumetaku Shinai De (Don't Be Cold) - Chapter 6\nMaki Kurumi wants to grow up catch up to her childhood friend, Sou-chan, who just happens to be her teacher.\n[PL] Zbiór 4 historii:\n\n\nKare wa Tsumetai Furi o Shite – Kaho właśnie zaczyna swoją pierwszą pracę w restauracji. Przez jej zdenerwowanie przypadkowo rani kolegę z pracy – Shina – bardzo przystojnego studenta. Przez to musi pracować z nim na zmianie, ale… Shin też ma swoją dobrą stronę?!\n\n\nNie dotykaj mnie! – Momo nienawidzi, gdy chłopcy ją dotykają. Pewnego dnia chłopiec, który stworzył tę traumę powraca!\n\n\n17cm Saki no Kata Omoi – Czy dziewczyna może zakochać się w o 17 cm niższym chłopaku?!\n\n\nTsumetaku Shinai De – Maki chce szybko dorosnąć, żeby dogonić swojego przyjaciela z dzieciństwa, który jest jej nauczycielem!"},{"name":" Skullgirls Webtoon","avatar":"https://mangadex.org/covers/75ad5daf-873e-43c9-a39e-3e4d373b897e/5cf2b56f-f911-4d4a-9a7e-c0a8f6afcd4f.jpg.256.jpg","country":"English","stat":"8.07","status":"Ongoing","tags":["Official Colored,Monsters,Action,Demons,Ghosts,Comedy,Mafia,Adventure,Video Games,Magic,Military,Monster Girls,Web Comic,Supernatural,Mystery,Adaptation"],"nutshell":"Parasoul, the princess of the Canopy Kingdom follows a trail of misery and murder throughout the city of New Meridian to uncover the crimes of the Medici family. But the threats to New Meridian begin to multiply as her findings bring her closer to a greater enemy. One foretold to return every 7 years…"},{"name":" Tales of Xillia - Sweet Trap (Doujinshi)","avatar":"https://mangadex.org/covers/75ad8b3f-0d34-4b1a-8aa4-5432915929a4/871a07e4-38bd-4699-864a-ba34d4645ca6.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Oneshot,Romance,Drama"],"nutshell":"A Tales of Xillia pixiv doujinshi. In a mysterious place, Alvin encounters a beautiful woman with gorgeous eyes, and is drowned in the scent of flowers as he kisses her. Is she a spirit? No? Then who is she?"},{"name":" Yume no Naka de Kimi wo Sagashite","avatar":"https://mangadex.org/covers/75b49f78-bb1e-481a-93ec-7f8a8331e8f2/1d9f43f8-3635-4711-87ca-6a2cb8a603c6.jpg.256.jpg","country":"Japanese","stat":"7.53","status":"Cancelled","tags":["Girls' Love,Drama,School Life"],"nutshell":"Yume Hanayama is an ordinary school girl who longs for love. An ordinary school girl who loves making hair accessories and chocolate chip cookies. Except for one thing, \"I can not forgive liking anyone.\" After several years, Yume reunites with her childhood friend, Yukino, who supports her dream. Three people's past, secrets, twisted and and stagnated… a story about distorted love and \"a girl who can not like anyone.\""},{"name":" We have no female managers","avatar":"https://mangadex.org/covers/75bcfe2c-9911-43cc-90a5-e9a8ea3009d4/fc4a4ce4-7bc9-44dc-8685-8b95c4d49aff.jpg.256.jpg","country":"Japanese","stat":"7.52","status":"Completed","tags":["Oneshot,Award Winning,Comedy,Sports"],"nutshell":"The runner-up of the 10th \"One-Point Breakthrough Manga\" Award! A high school girl suddenly appears in the batter's box! The puzzled pitcher has a history with the high school girl...? Prepare yourself to be shot through with the \"cuteness\" of the new age!"},{"name":" Houkago no Salome","avatar":"https://mangadex.org/covers/75c0c88b-256a-4486-b25c-ad4239f7b88f/f42a2cea-4c43-4895-935f-d8aa603f2feb.jpg.256.jpg","country":"Japanese","stat":"8.47","status":"Completed","tags":["Psychological,Romance,Drama,School Life"],"nutshell":"\"Can you help me paint after school?\" asks my classmate Naomi. Our feet carry us to the art storage room that no one goes to. I quietly become her assistant in producing artworks. Naomi suddenly arrived at an Osaka art high school. The pride of the gifted, hardworking Renji gets torn to shreds by her ominous talent. Renji bluffs \"I can come up with something like that too.\" But, he gradually finds himself enthralled by her talent. He writhes in-between his self-consciousness and inferiority complex. Is she his rival or is she…?!\nThey produce eccentric, sensual works after school.\nA striking story of art and youth released by a brilliant newcomer."},{"name":" Pumpkin and Mayonnaise","avatar":"https://mangadex.org/covers/75cdfb1f-6327-475a-8090-0680a525bc60/4a1c3dc6-0f63-4714-b8f0-1c58d54b0814.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Psychological,Romance,Drama,Slice of Life"],"nutshell":"Miho and Sei are living together. She works at a boutique while he tries to make it as a musician. Even though Miho still can’t forget about Hagio, her ex-lover, she is happy in her relationship with Sei. However, all is not well for the young couple. Struggling to make ends meet, Miho decides to take a second job as bar hostess. As she becomes increasingly desperate for money, Miho eventually gives in to one of her client’s sexual advances. When Sei finds out about this he begins to distance himself from her. Things are getting even more complicated for Miho when Hagio suddenly reappears in her life."},{"name":" THE iDOLM@STER - Until your color up/// (Doujinshi)","avatar":"https://mangadex.org/covers/75ce1711-8af5-4620-bef7-e86d54ba41ee/5d10ef35-cc2e-4bfe-bcc1-304b2c18c338.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Oneshot"],"nutshell":""},{"name":" Aigan Kitty","avatar":"https://mangadex.org/covers/75cf0193-252f-4187-a5dc-f88d4a143dff/b87a695b-74ab-4739-8d0c-d1419cb54611.jpg.256.jpg","country":"Japanese","stat":"7.83","status":"Completed","tags":["Romance,Boys' Love,Fantasy"],"nutshell":"This story takes place 20 years after the events in Love Neko. Asakura, who invented Nekoko for his teacher Eiji when he was in high school, now owns a company that makes love machines. When he tries to make one to resemble Eiji, his old crush, it all goes wrong and this new love machine is programmed as a \"clumsy-type\".\nAsakura is mad that he made a machine so clumsy and considers him useless. Therefore, Asakura decides to give the clumsy love machine to his younger brother Minami. Asakura never named the machine, except once he called him Eiji, so Minami decides to keep that name for him. Minami has a more caring and loving approach towards the clumsy little guy and their relationship blossoms.\nMeanwhile, Asakura gets stuck with another love machine that didn't sell out and no one wanted. His co-workers told him to try and get to know a love machine and maybe he would like them more…"},{"name":" Akagami no Shirayukihime - Obiyuki (Doujinshi)","avatar":"https://mangadex.org/covers/75d157e9-018c-489b-bdf1-829be4a7f253/660e4bc0-47f4-4dca-8f17-37809352cb86.png.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Romance,Comedy"],"nutshell":"A doujin of Akagami no Shirayukihime featuring Shirayuki and Obi as a pairing. One-shot of two chapters.\nNoruma's (野村) Pixiv Link:\n\nNoruma (野村) (The artist's Pixiv link)"},{"name":" Melty Moment","avatar":"https://mangadex.org/covers/75d1875c-4a6e-411c-944d-cf0e154439f3/6af182c9-bce7-4d64-85f3-e5b5e04a39e4.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Harem,School Life,Slice of Life"],"nutshell":"Any moment in the routine of daily life can be a step closer to love. Follow Takeru as he becomes closer with the school girls around him. What kind of girl will he fall in love with?\nBased on the eroge (visual novel) of the same name that was developed and published by HOOKSOFT."},{"name":" Crisis Girls","avatar":"https://mangadex.org/covers/75d27726-094a-499e-b7a6-664557532885/4779a6b2-cbcd-4676-9217-3e562d133337.png.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Sci-Fi,Comedy"],"nutshell":"The story takes place in a special city where monsters gather and super-cute \"Crisis Girls\" keep the peace. Crisis Girl Kaede can defeat enemies alongside her zombie puppets, but she just wants to play and act like a kid."},{"name":" Lonely to Organdy","avatar":"https://mangadex.org/covers/75dc120a-ef70-443c-b859-e8f1b576fef9/371e3df3-6b2a-4e2f-bc5e-5c54eea75954.jpg.256.jpg","country":"Japanese","stat":"8.35","status":"Completed","tags":["Boys' Love,Slice of Life,Supernatural,Tragedy"],"nutshell":"The meeting of Haruto, who dreams of being a singer-songwriter, with Akira – sparked by a traffic accident."},{"name":" Piñata","avatar":"https://mangadex.org/covers/75dd89fd-cfd8-4063-a55c-2ab9bc798e39/abf033fc-e292-45ff-a2b4-64e6aaa89d32.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Long Strip,Drama,Web Comic,Full Color"],"nutshell":"\"네겐 좋은 것만 가득할 거야.\" 애정 어린 기억과는 모순된 삶을 사는 드류, 그리고 그런 드류를 걱정하는 친구 미켈의 이야기."},{"name":" Otaku Plays Basketball","avatar":"https://mangadex.org/covers/75e084b9-71b8-4f8e-b5b4-a7e203bc2c2e/a4ed1ca0-a73d-4ac1-b0c3-056e3ce66343.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.95","status":"Ongoing","tags":["Action,Long Strip,Sports,Web Comic,Slice of Life"],"nutshell":"Zhou Dahua was amazing as a student. He was handsome, superbly skilled and seemingly had a good life. But he lost the spotlight after graduation. In a blink of an eye, Zhou Dahua became a loser who was nearly 30 years old, someone who was living like a salted fish, and just waiting to die. On a cold night after a major betrayal, he realized that his life was completely different from how he imagined it 10 years ago. He was a complete failure without any goals and a future. Just when when he was frustrated beyond belief, a student who happened to be a loyal fan appeared and invited him to participate in the \"Treasure Island Community Cup 3V3 Basketball Competition\". Soon after, a team consisting of shrimp soldiers and crabs officially joined the tournament!"},{"name":" I Thought an Adventure of Swords and Sorcery Would Be Waiting When I Reincarnated, and Yet...","avatar":"https://mangadex.org/covers/75e0faaa-4dab-4aa6-8908-9553fa11fc07/c094a260-16ce-4f18-af6f-b31a244173f9.png.256.jpg","country":"Japanese","stat":"8.51","status":"Completed","tags":["Oneshot,Reincarnation,Comedy,Adventure,Isekai,Fantasy"],"nutshell":"A new oneshot from Kaneda Yousuke, the author of Kishuku Gakkou no Juliet!"},{"name":" Futsuriai na Chocolate","avatar":"https://mangadex.org/covers/75e12fe0-e691-4669-912b-4037069aaed5/8b244a7a-f81b-45bc-ab7e-bbbe2fe8e410.jpg.256.jpg","country":"Japanese","stat":"7.92","status":"Completed","tags":["Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"A collection of stories:\n1-2) Futsuriai na Chocolate & Aimai na Candy\nLately, a guy has been coming around to talk a lot to straight-laced library employee, Fukagawa. Oosawa is the manager of some very popular nightclubs and lives in a completely different world from Fukagawa. But no matter how Fukagawa acts coldly, Oosawa doesn't lose hope and every time he's touched, contrary to his demeanor, his heart stirs…\nThe bittersweet romance of an obstinate heart gently coming apart.\n3-4) Nakayoshi\n5-6) Yama no Mukou Sora no Mukou\n7-10) Moe Bara Special & Ore to Tora no Mikkakan\nExtra) Shinya Konbini nite"},{"name":" Kaitou Drugers! - Junjou Koi Dorobou","avatar":"https://mangadex.org/covers/75e356bc-b9c7-44c1-8df7-d125a9d18f51/cd45bfe4-d9b4-4a04-8c65-d027649cf745.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Comedy,Boys' Love,Fantasy"],"nutshell":"A boy at a mysterious school has been splashed with a 'reducing potion' and he's searching for a way to cure himself."},{"name":" Who Are You Creator?","avatar":"https://mangadex.org/covers/75e43ebb-7cd2-4a86-91c3-5bfa891972e9/9a794c79-ea2f-4093-91dd-6adadfc78815.jpg.256.jpg","country":"Korean","stat":"8.09","status":"Ongoing","tags":["Long Strip,Romance,Boys' Love,Web Comic,Full Color"],"nutshell":"Lee Yuu is an aspiring actor who put aside the pursuit of a stable public servant career in order to become an actor…! Facing a dead end, a youtuber named Lee Hoo appears in front of him, suggesting he tries… “gay acting”?! What started as an acting business relationship, as time passes could this become… love?"},{"name":" South Park - Wonderwall (Doujinshi)","avatar":"https://mangadex.org/covers/75e86635-57c8-45ff-b4c4-81b98be06d20/b92c0314-9f16-4c03-8650-4b5f02f7a801.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Boys' Love,Slice of Life"],"nutshell":"Pairing: Eric x Kyle"},{"name":" K-ON! - The Ritsu Ritsu Ritsu Ritsu Ritsu x Mio book (Doujinshi)","avatar":"https://mangadex.org/covers/75ebe370-711e-40ed-b448-a478c18fb335/139ac5fd-5554-47d2-9e10-d50fe148889a.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Comedy,Girls' Love,School Life,Fantasy"],"nutshell":""},{"name":" I Kill Zombies in Wasteland","avatar":"https://mangadex.org/covers/75f0eea5-1b99-4f96-9f4b-2e6814bb9b8c/8771a690-1130-4a84-a21f-6acb57f22a9f.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.04","status":"Hiatus","tags":["Action,Long Strip,Comedy,Survival,Zombies,Adventure,Post-Apocalyptic,Supernatural,Full Color"],"nutshell":"“Eternal Night of Poison Rain” The event that ended Human Civilisation in a single day, humans escaped, and built a New City in the wilderness. The old city was covered in the sea of miasma, and it birthed new monsters—— The Scourge, commonly known as Zombies. In order to fight against them, humanity evolved and awakened superpowers. The main character, Wu Chan, to get rid of the dangers caused by the superpower’s side effects, he sets out on a dangerous journey into the hazardous Old City. But first, he needs to open a Waste Incineration Center…"},{"name":" Fire of Megiddo","avatar":"https://mangadex.org/covers/75f62ec7-f875-4be8-be9f-1f111bb740c0/7458f2d4-21c5-408b-9f78-18f326e8bc30.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Comedy,Survival,Adventure,Military,Drama,School Life,Horror,Slice of Life,Aliens,Supernatural,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nOne day, strange incidents began to occur one after another around Hokuto Issei. One after another, people whom Hokuto found unfavorable began to disappear. And before he knew it, a birthmark of the Big Dipper appeared on Hokuto's face....\nWho are Kotoe, a glowing girl with an eerie secret, and the mysterious man, Cancer Shiratori, whom they met at the same time? And what is the key word \"Fire of Megiddo\"?\nThis is the story of a boy who was ordered by aliens to purge the earth!"},{"name":" A Story About Something Humans Forget, but Cats Remember","avatar":"https://mangadex.org/covers/75feefdd-cc86-45f1-addd-1d8ba72eec15/e90e89d7-15cb-4a01-b871-806f9b483969.jpg.256.jpg","country":"Japanese","stat":"8.25","status":"Completed","tags":["Oneshot,Sci-Fi,Psychological,Animals,Web Comic,Slice of Life,Full Color"],"nutshell":""},{"name":" I Will Not Be a Girl","avatar":"https://mangadex.org/covers/75ffe3fb-4d6a-4a74-b95f-63ec6d7381a1/db46999d-e694-440f-ae8d-ccc1ed09c761.jpg.256.jpg","country":"Japanese","stat":"7.54","status":"Ongoing","tags":["Genderswap,Comedy,School Life,Web Comic,Slice of Life"],"nutshell":"Takeru Saito is an ordinary high school boy with a powerful secret: with a flick of his wrist, he can magically change another person’s gender.\nWanting to become the top dog of his class, Takeru quickly turns the most popular of the guys in his class into girls. He expected confusion, but instead he got…"},{"name":" Hohoemi Ouji to Shinderera","avatar":"https://mangadex.org/covers/76024a28-e3da-47b5-927d-2da6e760304e/9323f2cd-ecd4-4ffc-82b2-4ca190cef9d1.png.256.jpg","country":"Japanese","stat":"7.81","status":"Ongoing","tags":["Romance,Comedy,Boys' Love"],"nutshell":"Akira, an ordinary high school boy, suddenly became step-brothers with Souichi Mikawa, a very popular actor, due to the marriage of their parents. Akira was hoping to have a real older brother, but instead he was suddenly forced to play the role of lover…?!"},{"name":" Kimi ga Suki Toka Arienai","avatar":"https://mangadex.org/covers/760be47f-12d0-476d-bed3-f1a9384d33c3/babae9db-25d6-41fc-b56d-c7080c2fe021.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Kana, who has zero experience with love and can't even talk to a boy, loves to read about it in her favorite manga, which according to her friends is completely unrealistic. Annoyed by their cynicism, Kana declares that she will finally get herself a boyfriend and prove them wrong. Suddenly, a handsome transfer student arrives. Is this love at first sight? Does she have a chance with this popular boy? Why does he seem to know so much about her?"},{"name":" Touhou GO","avatar":"https://mangadex.org/covers/761c0410-78e7-4e52-a579-13ebf8201feb/da32ab97-75af-4b0d-a78f-1adae9c10835.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Comedy,Video Games,Web Comic"],"nutshell":"Hakurei Shrine is suddenly overrun with people after the popular GPS game Pokémon Go leads people to Reimu's home. Reimu, Marisa and other Gensokyo residents try out the game and learn about it."},{"name":" Namae no nai Kaibutsu - Kumo to Shoujo to Ryoki Satsujin","avatar":"https://mangadex.org/covers/7622667c-6922-4003-9fc1-ded7a0598292/f632f613-88a1-4a19-929d-69aa67821d0b.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Thriller,Sci-Fi,Monsters,Action,Animals,Romance,Survival,Drama,Horror,Monster Girls,Web Comic,Supernatural,Mystery,Adaptation"],"nutshell":"Midnight. Awakened by the echoing sound in my room, I was met with a frightening pair of \"legs.\" Since then, as if wishing to merely make its presence known, it remained in my room without letting itself be seen. In the same way it was spreading its encircling net, little by little it encroached on my life until at last it appeared before me. Its true form was that of an exceedingly beautiful \"nameless monster.\" Desperate resistance was futile as the monster dropped its hand towards me. I could not escape or resist. Hiding it from my skeptical lover and friends, thus opened the curtain to our strange life together. Quietly, the senses I had as a human were dying as my normal life continued to collapse. The moment I knew what was awaiting me, I was presented with an important decision.\nAt the same time the monster first appeared before me, the public was disturbed by a string of bizarre murders. It was then that I began to wonder whether they and my beautiful yet eerie roommate were connected."},{"name":" My Goal Is to Live a Long, Healthy Life as a Golden Spoon (Promo)","avatar":"https://mangadex.org/covers/762429b2-5210-4121-ad5a-833c9635e9f5/ad7e1b23-a635-4685-a640-1413945c327b.jpg.256.jpg","country":"Korean","stat":"7.68","status":"Completed","tags":["Oneshot,Long Strip,Romance,Isekai,Adaptation,Full Color"],"nutshell":"“I was born with a gold spoon in my mouth but I’m being murdered miserably? I’ll survive thoroughly and live a long life!”\nI’ve been reincarnated as the younger sister of my favorite’s novel character who is destined to be poisoned by her step-mother at the age of seventeen. My brother is on an adventure with the heroine so I have to survive by myself. Should we start with survival plans? First, be sure to behave myself around my step-mother and step-sister. Secondly, become close with children of influential families. Third, is… umh… getting married?\nTo escape the fate of a miserable death, I, Adriana, begin to approach the Prince of the Empire, the suspicious Master, and the suspicious Demon!"},{"name":" Paper Memories","avatar":"https://mangadex.org/covers/762a85fd-c2e3-4cfc-97b3-9a95a3a8f150/7f3bccef-5114-4544-bd28-b23ddb8f3b5d.png.256.jpg","country":"English","stat":"8.02","status":"Completed","tags":["Romance,Comedy,Adventure,Drama,Music"],"nutshell":"Comic stories collection from To the Moon & Finding Paradise, illustrated by puré, co-written with Kan Gao."}]