[{"name":" Misshitsu no Rakuen","avatar":"https://mangadex.org/covers/57dc5469-6002-4264-98ee-609a7fd6431c/a4eb2ecd-405b-4f9b-a12b-50a2b79554cd.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Ongoing","tags":["Psychological,Drama,School Life"],"nutshell":"From Shoujo-Sense\nNothing in Sakiko's life seems to be going right. Frustrated with her job and nursing a broken heart, she embarks on an ocean cruise, hoping the change of mood will turn things around for her. Never does she expect her vacation to end with the ship capsizing, stranding the surviving passengers on an island. When a young man saves her life, she finds herself drawn to him, but soon discovers he may be harboring a dark secret…"},{"name":" Bunshin","avatar":"https://mangadex.org/covers/57dcf3dd-eca4-4e9c-843e-f834604a73a2/9210d0a4-6681-4d33-8475-08906bdc2fcc.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Anthology,School Life,Horror"],"nutshell":""},{"name":" My Roommate’s a Zombie","avatar":"https://mangadex.org/covers/57e0cfce-9fb7-466a-a492-5e01664f5500/379f630c-e293-498d-9e53-0b234e7a795e.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Sci-Fi,Long Strip,Boys' Love,School Life,Fantasy,Web Comic,Full Color"],"nutshell":"As roommates and best friends who grew up together, Elijah and Ivan know everything about each other and their funny little quirks. Ivan cooks delicious food for Elijah (beef stew and crab are his favorites!) and Elijah loves teasing Ivan and getting spoiled as an adorable little angel (<– self-proclaimed title). When Ivan returns after a rainforest expedition a little… changed (he uh… eats brains now), they've gotta learn to adjust to a different life. So what if he's a Zombie, big deal!"},{"name":" Break Shot","avatar":"https://mangadex.org/covers/57e15797-c22f-45ae-a0a5-dc18b527623f/4bdc0395-1e44-437d-8e90-bc69f07274cc.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Sports"],"nutshell":"A boy named Oda Nobusuke is very infatuated with billiards. Problems arise when a new student body president, Mako, suddenly decided to cut the funding for his billiards club. Unhappy with that, Oda wants to convince Mako that his billiards club is worthy of the funding. He decided to challenge a two-time former national billiards champion. Will Oda be able to defend his club?\n\nOfficial Release:\n\nIndonesian release by Elex Media"},{"name":" Touhou - Overnight Sensation (Doujinshi)","avatar":"https://mangadex.org/covers/57e25732-ce68-4565-91fe-1eca0f86542e/bf38ce9a-8343-4a38-81b7-959b94c108a6.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":"Reimu and Sanae are enjoying a cake together in Human village. the author’s words: “Some soft yuri, just as usual. Please, enjoy it while drinking something like mellow chocolate.”"},{"name":" You’re Learning Mahjong Now!!","avatar":"https://mangadex.org/covers/57e5f8a4-8cc6-4864-bc80-8bff778cf288/97382233-8c74-476e-9ca8-93fb021bb62d.jpg.256.jpg","country":"English","stat":"7.29","status":"Ongoing","tags":["Traditional Games,Comedy,User Created,Web Comic,Slice of Life,Full Color"],"nutshell":"Luciano, a complete idiot, tried to make some money playing mahjong despite not knowing how the game worked at all. Of course, Luciano lost a lot of money because of this (don’t make bad decisions guys). He was going to ask his dad to help him get the money back, but his friend/mentor, Ru, stopped him from doing it and told Luciano to fight for himself. This led to Luciano asking Ru, his dad, and some other guy who’s just there to be the fourth player and to be hot, how to play riichi mahjong.\nAnd you get to learn it too, and/or criticize how Luciano was taught how to play it (constructive criticism would be greatly appreciated)\nThis is mainly for my friends/family who are new to riichi mahjong, so I don’t implode from having to teach people over and over again."},{"name":" Maid Maiden","avatar":"https://mangadex.org/covers/57e75f0a-9a41-44c0-960c-7e159425cd3a/ec5260d4-66c4-4a00-850d-7af169c5d11b.jpg.256.jpg","country":"Malay","stat":"7.97","status":"Ongoing","tags":["Romance,School Life"],"nutshell":"When Alivia Wender was younger, she was saved by a boy and wants to thank him but cannot remember his face. Her only clues are a scar on his hand and a prestigious school badge. She promised herself that she would enter the school to meet her 'prince' again. Just when her application was accepted, her family went bankrupt and can't afford her education fees! Feeling dejected, she visited the school, snuck in through a tree and managed to get enrolled…?\nWill Alivia ever find her 'prince'?\nThis comic is serialized in Gempak Starz comic magazine from Malaysia."},{"name":" Fox-Masked Guardian Spirit","avatar":"https://mangadex.org/covers/57eb8cb4-795e-4a62-9ee0-a62e8bc2baf5/9932ecdb-41fa-473a-8a71-8ee5a5cb2a21.png.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Oneshot,Reincarnation,Fantasy,Web Comic,Supernatural,Tragedy"],"nutshell":"All children belong to god until they turn seven.\n\"Until the day you turn seven and become a child of the humans, I will protect you.\"\nThe first collaboration story of the mangaka pair, AidaIro, under their former pen names as Tokuna Nozomi and Aida Hano."},{"name":" Kaihatsu BL (Anthology)","avatar":"https://mangadex.org/covers/57ef4cc6-82f3-4373-89d4-01386c9d4d7e/824e430b-ef8c-484e-ac55-03ff2b291e58.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Anthology,Boys' Love"],"nutshell":"A collection of stories.\n\n清川君と亀岡君 - Sari\nむつちりちゃんと初デート♥ - MADARA Mada\n小説家に恋したら - ASAI Nishi\n\nはじめてのオメガバース講座\n\nWhat a wonderful world - KOIWAZURAI Shibito\n俺の嫌いなつがい様 - KIRISHIKI Tokico\nあまいめまい - Wakachiko\n心と体 - Tokimeki Daisakkai\nネバーランド:エンド - Tadano"},{"name":" Tiger & Bunny - Banken Hiroimashita (Doujinshi)","avatar":"https://mangadex.org/covers/57ef5d2a-1132-4262-9528-b3a2acee7a75/d9fe4389-968d-4d7f-9bfb-571987fb94b9.png.256.jpg","country":"Japanese","stat":"7.84","status":"Completed","tags":["Boys' Love"],"nutshell":"Pairing: Barnaby x Kotetsu, Ebi x Kotetsu, Barnaby x Ebi x Kotetsu"},{"name":" Rockman-chan","avatar":"https://mangadex.org/covers/57f31274-8b36-4f31-8d97-ac1b79f5e409/ba792ee0-54c5-4613-874a-fdfae5f1f05f.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Sci-Fi,Action,Comedy,Mecha,Adventure,Video Games,Web Comic,Slice of Life,Adaptation"],"nutshell":"The pure and innocent Rockman is ready to crush his enemies with the Rock Buster, in spite of Dr. Right's unreasonable demands! He'll never lose a battle against Dr. Wily and his subordinates! Even if Rush is a real dog..."},{"name":" Kamunagara","avatar":"https://mangadex.org/covers/57f3f72b-b52f-48cb-85b8-a137fde326d6/1bd8e1f9-bffb-4659-a2e6-6ca341b7888e.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Action,Romance,Adventure,Horror,Supernatural"],"nutshell":"Kugaya is a teenager who lives with his aunt, Sakuri.\nThe kendo coach at his high school, Narugami, has been after him to join the kendo team; but when he meets the new girl, Takemi, his life takes a supernatural turn and he is thrust into an epic battle with the demonic \"Intruders\".\nReincarnation… buried memories… the Holy Sword… \"Himuka\"… and the Clan of the Swordsmen… it's all too much for a high school student to bear!"},{"name":" Bad End Mokuzen no Heroine ni Tensei shita Watashi, Konse de wa Renai suru Tsumori ga Cheat na Ani ga Hanashite kuremasen!?","avatar":"https://mangadex.org/covers/57f64981-c341-4c8a-9994-7723d688a2f7/b786f3ff-f704-4418-9613-2a12530bbb98.png.256.jpg","country":"Japanese","stat":"8.14","status":"Ongoing","tags":["Adaptation"],"nutshell":""},{"name":" Red Blood Red Legacy","avatar":"https://mangadex.org/covers/57f7b8a8-2d36-47af-9db0-22ab21b70baa/ecdacdff-ebfb-48d0-9b7b-43d615717d03.jpg.256.jpg","country":"Japanese","stat":"6.51","status":"Completed","tags":["Action,Romance,Adventure,Drama,Vampires,Supernatural"],"nutshell":"Itsuki and Hayato, two brothers who grew up in a village nestled deep in the mountains, set out to hunt down a wolf that has been attacking the livestock of the village.\nItsuki is about to go in for the kill when a gigantic beast appears out of nowhere, snatching up the wolf in its jaws and sucking the life out of it.\nThe beast that stared Itsuki down was a gargantuan, blood-sucking vampire deer…\nWill the two brothers be able to return to the village alive ?!\nFind out in this blood-filled action-packed story by extraordinary mangaka Kaishaku !"},{"name":" Toaru Kagaku no Railgun - Railgun no Suki na Hito? (Doujinshi)","avatar":"https://mangadex.org/covers/58007c4a-ee9f-4c7d-9648-265f1300fe51/afb6834f-98e3-45fa-8a49-e37de0c69ec0.jpg.256.jpg","country":"Japanese","stat":"8.22","status":"Completed","tags":[""],"nutshell":"Kamijou is once again forced by a certain Electromaster to pretend as her boyfriend."},{"name":" Ikutsu ni Nattemo Kawaii Ko","avatar":"https://mangadex.org/covers/580354d8-6579-46f6-b22c-38ab3b9e21ea/832bdaa2-1673-409c-a0d1-375feabddd8d.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"From Batoto Scans :\n\"How can I not spoil you...!\"\nTired of city life, former office lady Mizuho returns to the countryside, and as part of her rehabilitation, she starts working for her father's friend, Sugahara Taisei. As she spends her days peacefully working with Taisei, whom she has known since she was a child, she slowly regains her cheerfulness. Taisei's offered her nothing but unconditional kindness ever since she came back.\nBut as it turns out, the special feelings behind that kindness don't belong to just an \"old friend.\""},{"name":" Yakushi","avatar":"https://mangadex.org/covers/5805f47b-2382-44c7-8fe3-3ec393848d9f/bc474e3b-5e8b-42fb-b19f-74eb2348de47.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Fantasy"],"nutshell":"Rurikou Azuma is a pacifist high school student who, due to the mysterious god Yakushi, survived a near-death wound. In exchange, however, Azuma transforms into Yakushi and takes on the task of defeating man's natural enemy, the demon-haunted..."},{"name":" 1/4 x 1/2 ®","avatar":"https://mangadex.org/covers/5806d1eb-faee-4a32-8841-085fdf139b97/0b91605c-f742-4227-92be-5737fe25706f.jpg.256.jpg","country":"Japanese","stat":"8.11","status":"Completed","tags":["Psychological,Comedy,Drama,Fantasy,Supernatural"],"nutshell":"The lead is a spirit medium, although unfortunately he's not the best. His medium house has lasted for generations, but he only has a quarter of their ability - the only spirits he can call are animals, and while his touch can feel the spirits, he can't even hear them. For that, he needs help from his feline sidekick, although he can only be called half a cat, as he has the past life memories of a dog. Together they aid the animals they encounter, helping them find perspective by exploring their pasts."},{"name":" Kimi ga Kimi de Aru Tameni","avatar":"https://mangadex.org/covers/58078160-597e-4fd2-bb2b-c8051bfd9825/1e7118c0-dbcc-48ac-8ff9-cf5b50cc2a35.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Psychological,Supernatural,Mystery,Tragedy"],"nutshell":"What will happen when a human has extra power? What will happen when that power is used to fulfill all of his will?\nMasami, who often looks like an innocent little boy, apparently has the power that he uses as a killer weapon. He even dares to hurt his own mother in order to reach his goal. What will Shogo do as his best friend?"},{"name":" Xingxing Bian De Ni","avatar":"https://mangadex.org/covers/58106de5-b0f1-4f1d-9206-554d3ba60d72/5a41c253-b060-4f23-b17b-9216a8e1db61.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.97","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Adventure,Full Color"],"nutshell":"في القرن الحادي والعشرين، عبرت الدكتورة الأمريكية عايدة طبيبة طوارئ، خلال مهمتها جاء انفجار ودخلت إلى مكان وزمان متوازيين إلى عالم من الجبال والبحار، و هي قارة منذ العصور القديمة تتداول فيها عن اسطورة تقول عن اشخاص يرتدون الابيض و ياتون من السماء ومن قبيل الصدفة ، اعتبرت عايدة كارثة أسطورية ، وقامت جميع الأطراف بمطاردتها ، وفي هذا الوقت ، ظهر أمامها لإنقاذها فتى فمن يكون ؟"},{"name":" Kimusume Renai Kinshirei","avatar":"https://mangadex.org/covers/5810e1d0-6051-4daf-ae36-2b625a5af1d2/6072d696-3634-4e2c-90fa-017008be4115.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Historical,Romance,Monster Girls,Supernatural"],"nutshell":"Hachiro and Karen has been friends since they were children… During the day she is a sweet and timid young girl but every night Karen turns into a demon (oni) and tries to go out and eat someone. Yet when she wakes Karen remembers nothing of the night before. Hachiro has made it his mission to keep her from becoming a murderer. Furthermore were she ever to fall in love she will fully turn into a demon. Even if that means he has has to act rough and mean towards the girl he loves to keep her from falling for him. Its a strange situation."},{"name":" Confession Survival","avatar":"https://mangadex.org/covers/5811f2ea-ee30-4958-bb1d-e92cb83365bd/123d198c-c256-4e89-827a-23ca29ba0268.jpg.256.jpg","country":"Korean","stat":"8.07","status":"Ongoing","tags":["Ghosts,Long Strip,Romance,School Life,Web Comic,Supernatural,Full Color"],"nutshell":"The exorcist fell in love with me, a ghost...?!\nA survival love story of a ghost who resorted to a false confession to survive from the exorcist."},{"name":" Renai Kaidan Sayoko-san","avatar":"https://mangadex.org/covers/581210e5-e6eb-44ef-aaf8-bc3273013fb9/a5a0e659-7676-4743-af39-9f93a91586c2.jpg.256.jpg","country":"Japanese","stat":"8.30","status":"Completed","tags":["Ghosts,Romance,Comedy,Drama,Slice of Life,Supernatural"],"nutshell":"Sayoko is an incredibly kind, but solitary, young kimono-clad lady who has certain supernatural abilities. She can see ghosts, and she frees them from their places of death by agreeing to let them haunt her instead. As a result, everywhere she goes, she is followed by an army of well-meaning spirits that only she can see. Her weirdness tends to throw any normal people who would have otherwise possibly become her friends.\nInaba is a poor college student who accidentally ran over her with his bicycle."},{"name":" Moony - Oukaryou Trilogy","avatar":"https://mangadex.org/covers/581386fe-af21-43d5-91de-e24f2c672e87/7dbcaad0-9e56-4aa8-a320-1a93e5f9f28c.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Boys' Love,Drama,School Life,Supernatural"],"nutshell":"1-2.) Moony\nIt all starts when Yuusuke Satou is forced to spend spring holidays at the dormitory along with Moriya. Then, one night Yuusuke discovers that Moriya has troubles seeing at night and while he takes care of Moriya he eventually falls in love with him, but he is worried that Moriya might not return his feelings and will hate him…\n3.) Frozen\nJun Suwa notices another college student - Nozomu - who seems lonely, but possesses a beautiful profile. The two happen to attend the same party where Jun has a little too much to drink. Nozomu offers to take Jun home with him, then the night turns into a complicated romance.\n4.) The Spring Moon in a Night of Cherry Blossoms\nOne restless spring night, Mamoru wanders the grounds of his dorm admiring the cherry blossoms when he happens upon Jun's room with an open window. He unintentionally peeps in on Jun and another man being intimate. Jun even spots Mamoru and Mamoru makes a hasty retreat. Why can't he get the images of the two men out of his head?\n5.) Moon Flower\nAbe finally gets a hold of a corner room in his dorm, but strange rumors of it being haunted by a long haired ghost surrounds it. Abe is undeterred, not believing in such things. Then one night, a figure appears outside his window - could the rumors be true?\n6.) Extra - Waiting for the Evening Moon\nJun Suwa has just had his heart broken when the enamored Mamoru pays him a visit to cheer him up."},{"name":" Kimi to Iru Shima","avatar":"https://mangadex.org/covers/58170bdf-e360-4ac3-b8c2-77b9d93f562a/8ed58cba-4c43-412f-b2fa-b2bf4bbdcae4.png.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Boys' Love,Slice of Life"],"nutshell":"Takayuki comes back to the tiny island when he turns 18 to visit. While he's there, he's staying with his childhood friend, Rui, but the only problem is that shy Takayuki has been in love with him for as long as he can remember!"},{"name":" Yoru no Hanabira","avatar":"https://mangadex.org/covers/581a033c-3a75-4b1a-8e71-562e88e07605/d3fc8a41-b961-4a51-ba1f-0d1b1438cb17.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,School Life"],"nutshell":"Collection of 7 oneshots:\n\n\nYoru no Hanabira\nHost love.\n\n\nKaika Zenya\nBack story about the host of the first chapter and how he met his guardian (no romance story)\n\n\nJunjou Escape\nActors in love.\n\n\nKimi ni Furu Yuki\nArt student in love with his sempai.\n\n\nKoi Suru Yajuu\n\n\nKamu Otoko\n\n\nHaru wo Aisuru Hito"},{"name":" Futarime no Ouji-sama","avatar":"https://mangadex.org/covers/581c48b1-e096-4fea-a70d-d14bda592b28/a00e6ee0-1f50-48ef-8062-8f91979a87a7.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life"],"nutshell":"Koharu is in love with her venture IT company's president Ayato. She's on bad terms with his beloved cousin, the genius programmer Yuiya, though, because she's convinced Yuiya is trying to get in her way. However, when he helps her with an important presentation, she starts seeing him in a different light…"},{"name":" The Spider Thread","avatar":"https://mangadex.org/covers/581c7c03-5863-402c-a148-6d075575f43c/4923b362-adc8-4cb1-afb8-20370ccd13d0.jpg.256.jpg","country":"English","stat":"7.84","status":"Completed","tags":["Oneshot,Fantasy"],"nutshell":"Published in Imagine #3, August 1987"},{"name":" Anta Nante Okotowari!","avatar":"https://mangadex.org/covers/582b73d9-790b-49cc-896d-33a6ccb9bbd9/0154ad0f-11fa-4e92-bb26-9a7dd94f0626.png.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Romance,Comedy,Reverse Harem,Drama,School Life"],"nutshell":"Yui has a deep love for her \"older brother\" (they're not actually siblings, but are related), and she is devastated when he gets married. While at the wedding, Yui meets a sobbing boy, Kaoru. It turns out that his cousin (that he was in love with) is the one Yui's brother is marrying.\nWhen Yui moves into a boy's dorm so she can seek out new love, she finds that the head of the dorm is none other than Kaoru!"},{"name":" SF Fancy Free","avatar":"https://mangadex.org/covers/582dae05-106a-43c5-97f9-a20ccb12aa4e/1835e75e-5e5a-496e-a831-b7dc0b5e2abb.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Sci-Fi,Psychological,Animals,Romance,Comedy,Survival,Drama,Slice of Life,Supernatural,Mystery"],"nutshell":"A collection of SF one-shots by Tezuka from different magazines.\n\nVolume 80 of the Osamu Tezuka Complete Works"},{"name":" Egawa to Nishimoto","avatar":"https://mangadex.org/covers/583178c5-fac9-4c0b-a123-b1c72f4f4a50/0bfac7d0-504c-4f93-8bc0-2d3edec0a27b.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Sports"],"nutshell":"In 1981, it was Suguru Egawa who won the fierce battle for the most winning pitchers.\nHowever, the Sawamura Award, which is considered to be the highest honor for a starting pitcher,\nNishimoto wins the award instead of Egawa.\nAs a result of the unexpected result, a delicate air flows within the team...\nThen came the Japan Series.  Dispel such a delicate atmosphere\nBoth of them unfold dramatic pitching!\nWatch out for the moment when the legend of the strongest rivals of the glorious giants ends!!!"},{"name":" 990k Ex-Life Hunter","avatar":"https://mangadex.org/covers/58397d46-5c8b-4f3b-af2b-6157d0ac9b5a/671a28fa-1fb7-43ac-832d-46a7628225a8.jpg.256.jpg","country":"Korean","stat":"7.52","status":"Ongoing","tags":["Action,Long Strip,Martial Arts,Adventure,Magic,Drama,Fantasy,Web Comic,Supernatural,Adaptation,Full Color,Tragedy"],"nutshell":"As an F-Rank hunter, Kang Hyeonjun struggles to make a living in a world where dungeons exist and monsters are real. But after repeatedly failing to pull his weight in raids and being chewed out by fellow party members, his self-esteem hits rock bottom. To make matters worse, his girlfriend, who has climbed the ranks during their time together, dumps him on their one-year anniversary. When Hyeonjun returns home that night in a drunken haze, he finds himself walking into a dreamscape instead of his humble studio. There, a man claiming to be one of his past lives offers to make him stronger. But as the saying goes, if there's no pain, there's no gain. Will Hyeonjun be able to endure multiple trials and finally obtain the strength he so desperately desires?\n\n\nOriginal Webtoon <Webtoon kakao>\n\n\n\n\nOfficial Traditional Chinese Translation\n\n\nOfficial Japanese Translation\n\n\nOfficial German Translation\n\n\nOfficial French Translation"}]