[{"name":" Dokaben - Dokaben Part 1","avatar":"https://mangadex.org/covers/c9684ff2-709a-4135-9a88-f47f206f7e05/e726448c-d28f-49bc-9b05-616c42a75a92.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Comedy,Sports,Drama,School Life,Delinquents,Slice of Life"],"nutshell":"(from MangaUpdates): Tarou \"Dokaben\" Yamada, who was a judoka while at junior high, enters Meikun High School and is talked into joining the baseball club. He displays his superb athletic abilities in baseball and becomes well-known as a hard hitter. He and his unique teammates establish Meikun a solid position as No.1 in the High School Baseball Championship games."},{"name":" Mobile Suit Gundam SEED","avatar":"https://mangadex.org/covers/c96d8568-1e55-4a44-97c4-253b3d4417ad/ff8969a3-9095-4280-ba69-7fff58159032.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Thriller,Sci-Fi,Action,Psychological,Romance,Mecha,Survival,Adventure,Military,Philosophical,Drama,Adaptation,Tragedy"],"nutshell":"In the world of the Cosmic Era, war rages between the genetically enhanced humans known as Coordinator and those who remain unmodified, the Naturals, who dominate the Earth Alliance. Struggling to catch up with the Coordinator's superior technology, the Alliance secretly develops its own Gundam mobile suits. But through a twist of fate, a young Coordinator, Kira Yamato, becomes the pilot of the Alliance's prototype … and is forced to fight his own people in order to protect his friends."},{"name":" Greed Packet Unlimited","avatar":"https://mangadex.org/covers/c976381b-e51c-42b4-8411-6d802c583ab0/0201747c-651d-4dc6-af14-4d2af43d7dd8.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Hiatus","tags":["Genderswap,Action,Comedy,Fantasy,Supernatural"],"nutshell":"Casio and his little sister Nokia both work as bounty hunters who use magic packets that they download through their mobile phones and cast with the built-in camera to defeat mysterious apparitions called phantasms. The bounties for these phantasms are quite high, but the enormous fees for the magic packets they download and the property damage they create has reduced them to a homeless status living off cup ramen. This all changes when they meet a foolish albeit wealthy, young woman called Sony who didn't bother to properly research Casio and Nokia's true nature before becoming their sponsor."},{"name":" The Beast in the Tower","avatar":"https://mangadex.org/covers/c978bfa2-19b8-450a-a692-10b821d9644c/cbb6be46-cbc3-4ec6-9018-0d38a6bc90ae.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.99","status":"Ongoing","tags":["Animals,Long Strip,Romance,Boys' Love,Web Comic,Full Color"],"nutshell":"Leah, a rural teacher went to the imperial capital to find his father who went missing for many years. Under the introduction of the headmaster, he applied for the position of the Royal teacher and successfully passed the examination to become Prince Porter’s tutor. To his surprise Prince Porter is a savage Orc imprisoned in the tower, and he didn't even know human language. Leah , who wanted to escape in order to save his life, was locked in the tower and taught the prince the corresponding lessons according to the articles and instructions sent in through the door."},{"name":" Mobile Suit Gundam Thunderbolt","avatar":"https://mangadex.org/covers/c978f893-c764-42f4-9b04-fbf162e4d67a/1bbe7e63-3c18-4c2c-a7f6-169d6392d163.png.256.jpg","country":"Japanese","stat":"8.28","status":"Ongoing","tags":["Thriller,Sci-Fi,Action,Psychological,Romance,Comedy,Mecha,Survival,Adventure,Military,Philosophical,Drama,Music,Tragedy"],"nutshell":"The Universal Century began with mankind moving its burgeoning population into outer space. The cluster of colonies furthest from the Earth, Side 3, proclaimed themselves the Principality of Zeon and launched a war of independence against the Earth Federation. Now, it is nearly one year since the war broke out - Universal Century 0079. Federation troops and Zeon forces carry out a fierce battle in the \"Thunderbolt Sector\" in Side 4 \"Mua\". The \"Thunderbolt Sector\" is a shoal zone composed of the debris of destroyed space colonies, named for the electrical discharges from the metal debris. Mobile Suit pilot Io Flemming is among the Federation soldiers who are dispatched to the area, where Zeon sniper Daryl Lorenz awaits them on the battlefield.\nOfficial English"},{"name":" Minori no Te","avatar":"https://mangadex.org/covers/c97c6a87-ef76-4cbf-aae0-953cec217f01/fc35871a-393c-4353-843f-c5846aeaef59.jpg.256.jpg","country":"Japanese","stat":"7.72","status":"Completed","tags":["Comedy,Boys' Love,Drama"],"nutshell":"The chiropractors, oasis, is no place for ordinary customers. It caters for all sorts from hotshot, crime syndicate leaders to nationally popular celebrities. Even those socially depicted as assertive are no match to the touch of Dr. Minori Shigehumi's magic fingers. Overflowing with affection, Dr. Minori's technique leads their heated bodies to a greater level of satisfaction…"},{"name":" Punch!","avatar":"https://mangadex.org/covers/c97d8626-8ae1-472c-bef7-d963555c02fd/3b287b07-439b-4593-9f95-f5283bffb218.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Romance,Comedy,Sports,Drama,Slice of Life"],"nutshell":"Her mother was a wrestling champion, her father a lightweight world boxing champion, her grandfather the first Japanese to become the world champion of Muay Thai kick boxing–but high school girl Elle doesn't want to fight! She just wants a normal life, but is it possible with such a violent family history?"},{"name":" Love Your Enemies","avatar":"https://mangadex.org/covers/c9837a61-a9e5-4aeb-b8ce-fc9de9fd5f1b/4a79517f-a357-4d09-badd-9c9df84de3b8.jpg.256.jpg","country":"Korean","stat":"8.34","status":"Completed","tags":["Long Strip,Romance,Drama,School Life,Web Comic,Full Color"],"nutshell":"Having mastered the art of lying her way through life, Yeonhee Bae has vowed to leave her past behind and make a fresh start for herself by going to college at 24. But when she runs into someone who knows a secret from her past that could completely ruin her reputation, her hopes for a perfect life suddenly start to crumble. Amidst college gossip, crushes, and jealousy, can the two set aside their differences and embrace each other for who they really are?\n\nOfficial English Translation\nOfficial Simplified Chinese Translation\nOfficial Traditional Chinese Translation\nOfficial Indonesian Translation"},{"name":" Mahou Shoujo Madoka★Magica - Crybaby Devil (Doujinshi)","avatar":"https://mangadex.org/covers/c98793b3-e539-41c5-9f43-83eee83330b8/96d84c73-87cb-4886-a93f-299b27d7241d.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Girls' Love,Drama"],"nutshell":"Homura x Madoka"},{"name":" K-ON! Story Anthology Comic","avatar":"https://mangadex.org/covers/c98e66b6-1957-4f5e-bb38-3a023e96c6b0/67acd78f-9723-4b1a-91bf-eebd996ef6a9.jpg.256.jpg","country":"Japanese","stat":"8.21","status":"Completed","tags":["Comedy,Anthology,School Life,Slice of Life"],"nutshell":"An anthology comic of K-On! by various mangaka.\n\nVolume 1\nCover: Ushiki Yoshitaka\nBack cover: Hashimoto Shin\nCover 4-koma & manga: Afro\nTitle page illustration: Harikamo\nColor illustrations: Chiba Sadoru, saitom\nChapters:\n\nHow To Bake A Cake by Hamayumiba Sou\nJobs! by Unohana Tsukasa\nBand Maintenance! by Yamato Hina\nMutual Love by Shimotsuki Kinusa\nThe Afterschool Never Ends by Sato Yoshimi\nNight Snacking Club! by Sasamori Tomoe\nDJ Yui-chan by Ooi Masakazu\nShort Story 1 by Hashimoto Shin\nShort Story 2 by Afro\nThe Soul Of A Mere One Course by Kounosu Satori\nAlien! by Toire Komoru\nK-ON! Of The Dead 2 -The University- by Tsurubuchi Kenji\nLunch Time! by Mitsuya Kazutomo\nRainbow-Colored Bath Time! by Toto Nemigi\n\n\nVolume 2\nCover: CUTEG\nBack cover: Gochou\nCover 4-koma & manga: Nishiuri Warito\nTitle page illustration: Hota.\nColor illustrations: Anmi, Katayama Sesshuu\nChapters:\n\nKiss First! by Yuugen\nComplete Transformation by Hanokage\nMessing with Okuda-san by Sakayama Shinta\nI will Be The One To Look After Ojou-sama! by Tsukigami Luna\nA Perfect Day For Snuggling by Ichika Hana\nLovely Girly Jun by Shinozuka Atsuto\nTrembling Girls! by Mayuge\nMy Fresh Leaf Girls by CUTEG\nOh Wow, How Weird: Voila, Cat-Eared Maid by Mizutama\nFresh Leaflets by Komusou\nKaraoke! by Katochin\nLight and Fluffy Hair by Imu Sanjo\nClub President Azu-nyan Runs! by Mizutaki\nHome Sweet Home by Hami\nIt's a Training Camp at the Hot Springs, Light Music Club! by Tanaka Kouji\nMessage by Hatopopoko"},{"name":" Dino Crisis","avatar":"https://mangadex.org/covers/c9907241-770f-4764-82d0-f0b15f46709e/fc9caae5-4aa5-4eaa-b949-f87a31cc8b26.jpg.256.jpg","country":"Chinese (Traditional)","stat":"7.94","status":"Completed","tags":["Thriller,Time Travel,Action,Animals,Survival,Military,Drama,Horror,Adaptation,Full Color,Tragedy"],"nutshell":"Dino Crisis (恐龍危機) was a six-part manhua series. A loose adaptation of the first Dino Crisis game, it was published by the Hong Kong-based \"Jade Dynasty\" (玉皇朝)."},{"name":" Wisteria-Colored Sky Apartment","avatar":"https://mangadex.org/covers/c994ae64-8cf9-45fd-8375-43b4d8e218b0/fabc59ff-dd7c-4161-b9dd-c35169a298fa.jpg.256.jpg","country":"Japanese","stat":"7.74","status":"Completed","tags":["Oneshot,Psychological,Romance,Philosophical,Drama,Slice of Life"],"nutshell":"A young woman gazes wistfully off of her balcony, gazing at the beautiful view. She enjoys drinking beer on her days off, and has noticed someone growing flowers in an empty space on the first floor. One day, she receives mail that does not belong to her; and after happening a second time, she returns it to its owner. And that's when she meets a special man…"},{"name":" Uchi no Deshi ga Itsu no Manika Jinrui Saikyou ni Natte-ite, Nan no Sainou Monai Shishou no Ore ga, Sore wo Koeru Uchuu Saikyou ni Go Nintei Sareteiru Kudan ni Tsuite","avatar":"https://mangadex.org/covers/c996b6ee-d950-4b71-b27e-32ff909e7361/e6eaa651-b595-4ea9-8a9a-47367f81fd3c.jpg.256.jpg","country":"Japanese","stat":"7.80","status":"Ongoing","tags":["Action,Romance,Comedy,Adventure,Fantasy,Adaptation"],"nutshell":"Takumi was banished from the party and lived alone in the mountains. Leia, who claims to be a disciple of Alice, a girl who once protected and cared for him, came to him..\nShe has become a disciple of Takumi, who is rumored to be the strongest in the universe..\nSince then, a dragon, a great sage, and a goblin king have visited Takumi, who has no talent, and is suspected to be a demon king !?"},{"name":" Haru to Kyuuketsuki","avatar":"https://mangadex.org/covers/c999d3d2-486f-4178-ba2b-a30487faa82b/4c4d1801-3ce2-4cb3-bacd-8f7f4d187a48.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Completed","tags":["Romance,Boys' Love,Vampires,Supernatural"],"nutshell":"Haru, a rookie manga artist, stops at a mysterious coffee shop one day. The shop, which opens only at night, was run by a vampire – and its regular customer is a wolfman! Haru begins visiting the coffee shop to listen to stories from the owner, which he uses as reference material for his manga."},{"name":" Hana to Usagi","avatar":"https://mangadex.org/covers/c9a23ea6-4f32-48ee-9b25-c7dadda57575/915a8d1a-6bfa-4e66-8542-43815ea006d1.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Comedy,Boys' Love,Slice of Life"],"nutshell":"1-3: Hana to Usagi (Flower And Bunny)\nAizawa Mamoru-san in room 411 is always wearing a rabbit-head… The courier company's good customer is a shy rabbit-man with a withdrawal syndrome. Why is he wearing something like that in the first place? Is he a pervert? Everyday, he receives deliveries, but you can't see his face and he's mute: there's nothing scarier than this.\nBut one day, still wearing the rabbit-head, he grabbed tightly onto my arm, \"T-thank you, I'll see you again tomorrow…\" Saying it in such an embarrassed way – my heart beats so fast.\n4: That Smile Once Again\nFujimura is a talented pianist who refuses to perform in the school's culture festival, despite the student council president's – Segawa – attempts to convince him daily. Why won't Fujimura perform? And why does Segawa keep on pestering him?\n5: Greatest Common Denominator\nTatchan and Shouhei are in a relationship. Shouhei wants to ramp it up to the next level, but Tatchan seems hesitant. Is this love just one-sided?"},{"name":" Shadow Beauty","avatar":"https://mangadex.org/covers/c9a24596-e4a0-41e6-bad8-7fa342d63d31/21144730-900e-4693-872d-425007d89e7d.jpg.256.jpg","country":"Korean","stat":"8.10","status":"Ongoing","tags":["Psychological,Romance,Drama,School Life,Web Comic"],"nutshell":""},{"name":" Senryuu Shoujo","avatar":"https://mangadex.org/covers/c9a68c3d-cb2f-4d86-aff5-14eb3218d493/5440e5d1-78c1-4d61-9c44-329c3b8c75e1.jpg.256.jpg","country":"Japanese","stat":"8.88","status":"Completed","tags":["Romance,Comedy,4-Koma,School Life,Slice of Life"],"nutshell":"Yukishiro Nanako is a cute, cheerful high school girl with one peculiar trait: instead of verbal communication, she writes senryu (a type of haiku) poems to relay her thoughts. Together with ex-delinquent Busujima Eiji, they are budding freshmen of the school's Literature Club.\nEven though Nanako doesn't talk, with the power of senryu, the adorable pair has no problem enjoying their fun school-life through the tune of 5-7-5 syllables."},{"name":" Under the Oak Tree","avatar":"https://mangadex.org/covers/c9a891f6-9f4b-487d-8b62-7abb0e3f59c8/4a7c8983-4c4c-4e62-ab44-4d045b842fb8.jpg.256.jpg","country":"Korean","stat":"8.94","status":"Ongoing","tags":["Long Strip,Romance,Drama,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"The daughter of a duke, the stuttering Maximilian, married a knight of lowly status at her father’s coercion. After their first night, her husband departed for an expedition without another word. He came back three years later, this time as a famous knight in the whole continent. How will Maximilian face him on his return?\n\"The more I think of you, the more lonely and lonely I become. I don't know why I can't quit even though it's so painful.\"\n\nA flawless love story of the flawed. Stuttering lady Maximilian is forced into a marriage with Sir Riftan, but he leaves on a campaign after their wedding night. Three years later, he triumphantly returns, ready to cherish her. As life with her husband finally begins, she only has one question — does she deserve this love and happiness?\n\nNote: Although the novel is R19, the webtoon is R15.\n\nOriginal Webtoon\nOfficial Translations:\n\nEnglish\nChinese (Simplified) / 汉语\n\nOfficial English Novel Translations: Kindle (S1/R19), Webnovel (R18)"},{"name":" WEE!!!","avatar":"https://mangadex.org/covers/c9a8ffb7-682f-40e2-87fe-9537e8f425ea/73eff5cf-f2f4-42de-b02b-3d38a6340740.jpg.256.jpg","country":"Indonesian","stat":"8.07","status":"Ongoing","tags":["Long Strip,Comedy,School Life,Web Comic,Slice of Life"],"nutshell":"When you miss school and meeting friends, follow along on Amu's daily school life! Together along with her friends that does weird and stupid things, they together go through high school filled with likes, sorrow, feelings and love!"},{"name":" Moments of Loneliness","avatar":"https://mangadex.org/covers/c9ab8130-046b-4f23-a399-8999fcf312dc/2ce29f0c-fc9b-4152-a908-93b0aa7e4df3.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Oneshot,Romance"],"nutshell":"An eight-page full-color one-shot by Moto Hagio about loving somebody."},{"name":" One Piece - Historic Grammar (Doujinshi)","avatar":"https://mangadex.org/covers/c9ab9a2a-415e-47d8-bc03-0268ee46a57e/52640554-b032-4caf-a317-2473a96388a2.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,Slice of Life"],"nutshell":"A doujinshi featuring short stories of Baroque Works characters. Prominently featured is the relationship between Mr. 3 and Miss Golden Week."},{"name":" Kurenai Sanshiro","avatar":"https://mangadex.org/covers/c9aec79b-b02b-4866-b9f4-67c14fe5c68e/1e723e1d-2884-4a3f-8519-f7b8675ffec1.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Sports,Martial Arts,Adventure"],"nutshell":"The series stars a teenage martial artist named Sanshiro, trained in the Kurenai School of Jiujitsu and centers around his search for his father's killer. Accompanying Sanshiro is an orphaned boy named Kenbo and his pet dog Boke. Sanshiro's only clue to his father's murderer is a glass eye left on the scene of the crime, suggesting that his father's murderer was one-eyed. Thus many of the villains Sanshiro fought during the course of the series were one-eyed or had one eye concealed with an eye-patch."},{"name":" River's Edge","avatar":"https://mangadex.org/covers/c9b39de1-4376-46f2-b8af-4ecae305bdc3/255303be-e1b1-43f5-ae83-34853953bd80.jpg.256.jpg","country":"Japanese","stat":"8.24","status":"Completed","tags":["Drama,School Life,Slice of Life"],"nutshell":"Haruna Wakakusa and Yamada become friends after she saves him several times from her boyfriend's constant bullying. Through him she gets to know Kozue Yoshikawa, a fellow student who also models professionally. The three emotionally stunted teens' lives briefly yet intensely intertwine for one semester before splintering from the aftereffects of one disastrous night. For both Wakakusa and Yamada, their emotional awakening fosters an unlikely friendship between the two battered souls."},{"name":" Whose Baby Is It?","avatar":"https://mangadex.org/covers/c9c2be43-03e6-4aab-b8e1-8e1b060845aa/3c4e2bb5-6d19-4ca7-a908-2cea9b70dba9.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.77","status":"Ongoing","tags":["Long Strip,Comedy,Boys' Love,Drama,Fantasy,Web Comic,Slice of Life,Supernatural,Full Color"],"nutshell":"A fortune teller says that I was born with bad luck… Who is she trying to fool? My son is a biracial baby with super powers, who can use dreams to predict the future! But then a tyrannical CEO comes out from god-knows-where and says he's my little treasure's dad?! What is this, a TV drama?"},{"name":" Young Bad Education","avatar":"https://mangadex.org/covers/c9d96958-c895-43c0-88e4-46c58fe95b1f/777c2264-81f5-4fbb-8fa3-874b1cd11dac.jpg.256.jpg","country":"Japanese","stat":"8.46","status":"Completed","tags":["Romance,Boys' Love,School Life"],"nutshell":"Locked out of his home one day, Mizusawa runs across Takatsu, his homeroom teacher, drunk on a bench. In a stupor, Takatsu confesses he has been watching Mizusawa for three years and kisses him. Mizusawa had no interest in 37-year-old Takatsu…until that day. With a smirk on his face, Mizusawa begins teasing Takatsu about the incident, much to Takatsu's horror. But, when Takatsu starts attending marriage interviews, Mizusawa realizes he wants his homeroom teacher."},{"name":" Happy Together","avatar":"https://mangadex.org/covers/c9e0657a-f533-4b9d-832b-ce2eb8d7f494/f46ccc7f-8b23-498a-b92f-f76a0fd73d6b.jpg.256.jpg","country":"English","stat":"8.00","status":"Cancelled","tags":["Long Strip,Romance,Comedy,Boys' Love,Slice of Life"],"nutshell":"A webtoon about the life of a gay couple."},{"name":" Yume Nara Doko Made Yurusaremasuka","avatar":"https://mangadex.org/covers/c9e81bbf-be6d-44c5-920b-7fd4686cb1c3/81bce0de-d9b1-4a47-ac9f-f3404b6470b7.jpg.256.jpg","country":"Japanese","stat":"8.47","status":"Completed","tags":["Romance,Comedy,Boys' Love,Office Workers,Police"],"nutshell":"“I’ve killed someone, please arrest me!”\n…is what he said as he rushed into the police station, but it was all just a dream. 27-year-old Kaga Mitsuki has just done something unspeakably embarrassing. Later, Kaga goes to the police station to apologize and is greeted by Seto Kenya, a young police officer who is kind and has great taste. Moreover, Seto tells Kaga, “If you have another nightmare and feel anxious, please come see me!” and they become closer and closer friends… At this rate, Kaga won't be able to resist falling for Seto! From then on, Kaga’s nightmares turn into erotic dreams of Seto…\nAn erotic and heart-wrenching romantic comedy BL featuring a young, dog-like police officer and a corporate slave!"},{"name":" Love Nikki: Nikki's Dress up Diary","avatar":"https://mangadex.org/covers/c9e825de-d245-4c8c-b351-970326805b4a/1da7e9ce-5e3a-4472-a141-ba68d3f86d2a.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Comedy,Adventure,Video Games,Isekai,Fantasy,Adaptation"],"nutshell":"In order to change the destiny of Miraland, Nikki was summoned to Miraland by Queen Nanari! In the journey as a stylist, Nikki met many companions and was constantly approaching the end of his destiny."},{"name":" Luminous","avatar":"https://mangadex.org/covers/c9ed8b00-67f2-4f49-b7e8-fe5ef20d79f0/e625b225-42c1-487c-9bf6-630ff496ef6a.jpg.256.jpg","country":"Indonesian","stat":"7.93","status":"Ongoing","tags":["Long Strip,Romance,Comedy,Drama,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"Magic, miracles, Alissa doesn’t have time for that superficial nonsense. An honor roll student and serial high school heartbreaker, Alissa learned from her family that if it’s not logical it has no place in her life. When she meets an eccentric boy named Matt who performs magic tricks that might be real, she questions everything including her heart."},{"name":" Uchi no Pochi no Iu Koto ni wa","avatar":"https://mangadex.org/covers/c9ef0e96-963b-438d-9835-d83c9b2af211/3fe1d9c3-13b6-4657-897e-cd4c2d83c2a5.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Romance,Supernatural"],"nutshell":"Pochi always helps Takatsuki Kaori whenever she is in trouble. Actually Pochi's real name is Inui Haruka, the third son of if Inui family who have served Takatsuki's family as a loyal guard since a long time ago.\nIt is a story about a master and her \"dog\"."},{"name":" Karasu Otoko ni Kiotsukete","avatar":"https://mangadex.org/covers/c9f0cc6b-5657-4dbc-9f70-79ae81272fc2/e5fbadea-d12a-4f87-a818-263a1386ece2.jpg.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Animals,Romance,Comedy,Boys' Love,Supernatural"],"nutshell":"Shiratori, a civil servant in charge of controlling the city's crow population, was approached in the park by a handsome but suspicious-looking guy named Kuroo. As Kuroo had no address and was unemployed, Shiratori was wary of him,  but somehow found himself unable to dislike him. One day, he finds out that Kuroo is actually a crow…?! ONE-SHOT"},{"name":" Love Live! - Yasashii Ane to Aneomoi no Imouto-tachi to Amaenbou no Imouto-chan (Doujinshi)","avatar":"https://mangadex.org/covers/c9f78edc-ceca-4507-b337-126d8343b7d1/d024ed0d-3569-4fab-9a6b-cfbe4fd31a91.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Oneshot,Slice of Life"],"nutshell":""}]