[{"name":" Sugarcoated Black Dragon","avatar":"https://mangadex.org/covers/11b9e7bc-4e2c-4440-9a18-41bebf9a8317/64a47875-fb70-41f9-b346-a101f1d9c5dd.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.01","status":"Completed","tags":["Historical,Long Strip,Romance,Drama,Fantasy,Full Color"],"nutshell":""},{"name":" Asshou","avatar":"https://mangadex.org/covers/11bd12ed-38a9-448d-81d6-8c6264f9c14b/446cccfb-513b-415c-9dcd-22624c64cd57.jpg.256.jpg","country":"Japanese","stat":"6.22","status":"Completed","tags":["Thriller,Psychological,Romance,Crime,Drama,Web Comic,Slice of Life,Mystery"],"nutshell":"Yoshida-san is beautiful. Yoshida-san is popular. Yoshida-san is a little weird. Yoshida-san… I like her. A shocking love suspense story about the twisted sexuality and love of college students."},{"name":" Hikaru to Hikari","avatar":"https://mangadex.org/covers/11becd5d-693d-4983-9b81-05dd4a933e24/85a177eb-0afe-440d-9f99-a2531b30f4dc.jpg.256.jpg","country":"Japanese","stat":"7.54","status":"Completed","tags":["Comedy,Boys' Love,Crossdressing,Slice of Life"],"nutshell":"Hikaru is coaxed into cross-dressing by his next door neighbor Aya, who gets him to participate in a girls-only singing contest as \"Hikari\"."},{"name":" Dolque!","avatar":"https://mangadex.org/covers/11bf8581-0aff-4ad1-a3d6-99cbc1e2e5eb/05d89f9d-c085-43cc-8010-07d40bb33b20.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Action,Comedy,Adventure,Fantasy"],"nutshell":""},{"name":" Kuzukago Mountain","avatar":"https://mangadex.org/covers/11c217a5-128c-44a0-96b2-3e592c76931e/f327e9f6-ea5c-4125-b14b-6395f3146c7d.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Oneshot,Survival,Philosophical,Drama"],"nutshell":"On a mountain formed by trash thrown away by the people below, a young girl adept with repairing almost anything discovers an ambulance. Not only an ambulance, but there's someone inside… missing an arm? Who is this mysterious person? Why are they there and who threw them away? Find out in this one-shot, Kuzukago Mountain!"},{"name":" A3!","avatar":"https://mangadex.org/covers/11c61a59-449a-434d-8ae7-0b08fae3257e/f2c3643c-1aa5-4db5-8e46-61e014c27a63.png.256.jpg","country":"Japanese","stat":"8.04","status":"Completed","tags":["Drama,Slice of Life"],"nutshell":"A letter brought Tachibana Izumi to Veludo City, a city of Theater. She faced condition where Mankai Company, an agency her father loved so much, would be demolished by yakuza due to their huge debt. But seeing Izumi's stubbornness, he gave chance and even extreme challenge to Izumi and Mankai."},{"name":" Kingdom Hearts - Poppies (Doujinshi)","avatar":"https://mangadex.org/covers/11dea306-dcdb-4b32-8503-1e48a614224a/4ae68b1b-a7cf-4b8f-91f7-b2945c1d99cb.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Completed","tags":["Boys' Love,School Life"],"nutshell":"Riku reveals his true feelings for Sora, telling him that he loves him. Sora feels confused over his situation, and on top of that he has been experiencing headaches and he's been hearing someone calling his name…\nWho is it? And what does he want to tell him? How should he think about Riku's feelings?"},{"name":" Touhou - The Name  of The Unwithering Flower Is... (Doujinshi)","avatar":"https://mangadex.org/covers/11e06342-09f1-4810-9e7e-ef1e33ceb6a6/529cd0d1-48dc-4ca3-a345-9ba4b020079c.jpg.256.jpg","country":"Japanese","stat":"7.64","status":"Completed","tags":["Oneshot,Girls' Love"],"nutshell":"Remilia x Sakuya"},{"name":" Nasu","avatar":"https://mangadex.org/covers/11e9176c-3c4e-4418-8cf9-ff95cbd45ab6/fcdb981f-71da-4049-96fb-5bc68517a6b8.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Comedy,Drama,Slice of Life"],"nutshell":"Short stories all related through a common medium: Eggplant.\nNasu is a collection of stories, focusing on a returning series of characters, such as Takama, a farmer, and a young girl named Aya Takashi, who begins the series abandoned by her father and residing in Tokyo with her two younger siblings, and as the manga progresses to its second volume, leaves the city to reside in the countryside with her relatives, near Takama's farm. Apart from the chapters concerning Takama and Aya, other stories are also featured, such as one telling the chronicles of samurai in the Edo period hunting forbidden eggplant (nasu), another set atop a futuristic Mount Fuji, another tale concerning a truck driver, and also Summer in Andalusia, the story concerning the professional Spanish bicyclist Pepe Benengeli, from which the film was adapted."},{"name":" Touhou - Atsui Natsu no Suzumikata (Doujinshi)","avatar":"https://mangadex.org/covers/11ea0f52-e3fc-4e63-b9b0-a9caa69f9210/6852b867-8de0-47a5-b8bb-da4d8a918562.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Completed","tags":["Oneshot,Comedy"],"nutshell":""},{"name":" Aku no Boss to Neko","avatar":"https://mangadex.org/covers/11ea4d25-20b3-45ef-8909-b5905b121b9b/823f7aea-570e-40db-b070-fe9d3ffc55fa.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Action,Animals,Comedy"],"nutshell":"The leader of a criminal organization plays with cats while bossing around his henchmen and dodging assassins."},{"name":" Little Little","avatar":"https://mangadex.org/covers/11ee5877-68b5-4046-9cc1-c1dee78f40d3/d08e988d-32af-4734-a104-ea2562243bf0.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Comedy,Drama,Fantasy,Slice of Life"],"nutshell":"This is a simple dialogue-less little story about a young girl and an inquisitive little foxy friend."},{"name":" Lodoss Tousenki - Deedlit Monogatari","avatar":"https://mangadex.org/covers/11f561e7-bd75-4dee-b6b1-df1363f32e8e/ee7bf894-b84e-4efb-bda2-fc6abf6ec577.jpg.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Action,Romance,Adventure,Fantasy"],"nutshell":"Parn, the hotheaded young fighter and the main character of the ''Record of Lodoss War'', always rushed into actions for the good of Lodoss and pure justice. Therefore, he always took away all the focus from the more passive main character and yet his partner, Deedlit the Elf. As in the name, ''Deedlit's Tale'', this is totally contributed to this beloved character. Artworks were done by Setsuko Yoneyama. This Manga adapts the novel of the same name into a two book Manga sequence. While reading this Manga, readers will find themselves feeling the heart of a young girl (one hundred and seventy years old is considered to be young for a high elf) and witnessing the romantic story of these two great heroes."},{"name":" Shinobeba Koi","avatar":"https://mangadex.org/covers/11f57125-225f-4b31-9a26-106e9892d20d/a26c5bbd-7dbd-43b1-a01e-facb3f0f5f0c.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":["Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"\"I was drawn to the gaze of the man who rode ahead of everyone.\"\nToranosuke, sixteen, is tired of the monotony of everyday life. He takes a walk one night and is beckoned over by the charismatic leader of the town's motorcycle gang. Riding behind Tetsuya is his pride and joy. But in a gang with the implicit rule of \"no favorites\", after being doted on by Tetsuya, Toranosuke finds trouble brewing between himself and some members of the gang."},{"name":" An Interstellar Voyage Fit for a Baron","avatar":"https://mangadex.org/covers/11f737ba-afd7-49ff-aa10-037c71e662df/4c09f4c0-6d54-48cb-9005-ab574eb1fbf2.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Ongoing","tags":["Comedy,Adventure,Slice of Life"],"nutshell":"Possessed of aristocratic blood but bereft of money, the impoverished Baron Miharco travels the galaxy in search of the woman of his dreams, attended by his robot valet Lampachika.\nThis is the ballad of his itinerant travels, and of the adventures that await him!"},{"name":" Hakuryu - LEGEND","avatar":"https://mangadex.org/covers/11fa6c37-1e53-445e-8d8e-aa06dc7c384d/a795daf3-b1ce-4e4d-bc67-79f110f9ed0b.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Action,Drama"],"nutshell":"The stage is the Tokyo district of Roppongi and the players are the various Yakuza gangs. One much smaller gang is audaciously trying to carve out territory for itself. That gang's boss relies heavily on his second in command, the notoriously shrewd and powerful young man with the nickname Hakuryu. With Hakuryu's guidance, their small gang of 40 members may be able to stand up to others with even 200 times their numbers. The gang geography of Roppongi is hotly contested, and it will take strength and strategy to get by in that dangerous world!"},{"name":" Botanic Romance","avatar":"https://mangadex.org/covers/11fbe0ac-2028-47b4-8eec-9a69c8537b09/513e7e92-5ca9-4ba7-a849-32099c408941.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.93","status":"Completed","tags":["Long Strip,Comedy,Boys' Love,Web Comic,Slice of Life,Full Color"],"nutshell":"In a world where humans gain plant characteristics (botanomorphism), our cactus-infected protagonist, Zhu WuLiang, is faced with a dilemma. He'll lose hair whenever he gets shy! Now, enter Hao Xiaofeng, WuLiang's tumbleweed-infected crush, whose carefree lifestyle involves getting blown away by the wind on a daily basis… Surely, it's more than enough to wreck WuLiang's mundane life!\nShy cactus x Happy-go-lucky tumbleweed!\nOur main couple's shenanigans are packed with tons of sweetness, sure to give you a severe case of toothache! Stay tuned!"},{"name":" Tamayura Kitsune","avatar":"https://mangadex.org/covers/11fcb544-98f2-4635-b181-7824408a16b4/8235f687-4c62-47be-ab8a-6ee71a89c3a5.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Romance,Drama,School Life,Slice of Life,Supernatural"],"nutshell":"As a child Wataru and his grandmother used to pay visits to a shrine in their neighbourhood. While they prayed for each other's happiness, he encountered a snow-white fox named Yuki. Many years later, a sad occasion leads Wataru to pay another visit to the same shrine, but the Yuki who greets him there isn't quite the same one he remembers…"},{"name":" TS Osananajimi to Shinyu","avatar":"https://mangadex.org/covers/11fd08f6-4048-4783-83e2-b507d39e28cf/8f4f0cc6-607e-4e89-99ff-03171ee43aa7.png.256.jpg","country":"Japanese","stat":"8.03","status":"Ongoing","tags":["Genderswap,Romance"],"nutshell":"The story of a childhood friend, who is now a woman, and their best friend."},{"name":" Bakusou!! Love Attack","avatar":"https://mangadex.org/covers/120103e3-7ef9-4652-bfa0-44cceae14d81/9b3bc773-578a-4f66-bbf7-1b5d946a8881.jpg.256.jpg","country":"Japanese","stat":"8.02","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"While Hoshigaoka High School undergoes remodeling, Minami Wakana and her classmates have to study at Sasara High School. On her first day going to Sasara, Wakana meets Keisho on the train and it’s love at first sight. But it turns out Sasara is a school full of gangsters and Keisho is the one who calls all the shots…!!\nAlso included are:\n\n\nGokudou Renai Jingi (Black Road's Love)\n\n\nSakasemasu!! Koi no Hana (Let the Flower of Love Bloom)"},{"name":" Dragon Ball - DB Super EX (Doujinshi)","avatar":"https://mangadex.org/covers/12046c6a-aa0a-456f-8015-6e7ed574ff2c/032e7479-5e08-4aea-bd3d-4a6b8131a22f.png.256.jpg","country":"Japanese","stat":"7.93","status":"Ongoing","tags":["Action,Martial Arts"],"nutshell":"A series set shortly after the Universe 6 and 7 inter-universe tournament between Beerus and Champa. Frost's brother Bleed has learned of his defeat, and by extension the existence of the Dragon Balls. Now that Universe 6's Earth has been revived, Bleed has charted a course for it in order to obtain their Dragon Balls for himself. Will Goku and Vegeta be able to defeat this formidable new foe?"},{"name":" Otome no Iroha!","avatar":"https://mangadex.org/covers/1206375c-9cbf-4455-b933-456b1141aa4a/04e7d60b-944a-419c-9f4e-950f6ecf2068.jpg.256.jpg","country":"Japanese","stat":"7.52","status":"Completed","tags":["Genderswap,Comedy,School Life"],"nutshell":"Iroha, a masculine girl, and Hifumi, a feminine boy, are siblings who have transferred to a different middle school and moved to their grandparents house. However, after the first night, much to their surprise… they've switched genders. The two are left feeling \"delighted\"…"},{"name":" Rockabye Dear","avatar":"https://mangadex.org/covers/120e0401-f340-49cc-bde8-540ceca0f79f/efbbcf64-6d66-44ca-ac5f-b470afd88c61.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Completed","tags":["Romance,Boys' Love"],"nutshell":""},{"name":" Prism Baby","avatar":"https://mangadex.org/covers/12106f2c-fc8e-4939-8157-61dbefb21762/2e18d400-c7a7-4677-8b10-b5fa10860e8c.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Because of a past heartbreaking experience, Yuki closed off her heart. Not until her classmates dragged her and forced her to attend a group date with the guys from another school. There she met crybaby, Tsuyoshi. The next day, the next thing she knows is that she is being chased by Tsuyoshi saying that he wants her to listen to his depressing love story! But surrounded by the younger crybaby Tsuyoshi and hot classmate Keito, she can’t remain uninvolved with love!"},{"name":" The Sect Headmaster is Only Eight","avatar":"https://mangadex.org/covers/121125de-ed0c-44ab-8fde-72bd233ca766/aaac102d-52e0-447b-ac2a-97fc2cbd50d4.png.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Action,Comedy,Survival,Martial Arts,Fantasy"],"nutshell":"Feng Chiyin is an eight year-old who suddenly became a sect leader after his grandfather passed away. Due to his young age, the sect doesn't believe his capabilities, forcing them to leave. With only two subordinates left on his side, Chiyin must show the martial arts world his strength"},{"name":" TS Majo Rie x Norun","avatar":"https://mangadex.org/covers/1214682f-a442-4f40-98ff-6e15b7101e5b/982f83ca-24fd-449d-909c-4192e0d00d75.png.256.jpg","country":"Japanese","stat":"8.09","status":"Completed","tags":["Comedy,Girls' Love,School Life"],"nutshell":""},{"name":" Pride Complex","avatar":"https://mangadex.org/covers/1214cdf2-7140-43d8-987c-b4ca340999fe/ce05f08b-5356-4ade-b02c-c4ba6507d0db.png.256.jpg","country":"Korean","stat":"7.62","status":"Completed","tags":["Long Strip,Romance,Comedy,Drama,School Life,Web Comic,Slice of Life,Full Color"],"nutshell":"Park Chang-hyun had to move and move again because of his father's business. For the first time in 8 years, he's returned to the village where he grew up young. On his first day of high school, a certain beautiful young girl catches his eyes. Her name is Yang Surh Hee. She currently reigns as the school's idol but in the past they both went to the same school. Before his transfer he had a big fight with Surh-hee but their reunion went smoothly and he returns home… to find Yang Surh Hee!?!?!? \"Yang Surh Hee is my house maid?!\" \"If you tell this to the school I won't forgive you, Park Chang Hyun!\""},{"name":" C6H10O - Distress Signal","avatar":"https://mangadex.org/covers/12184894-cb52-4413-9770-b0c7ba8e890e/817b2bdd-1d2c-4559-a3ff-f7c77339774b.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.90","status":"Ongoing","tags":["Award Winning,Long Strip,Romance,Boys' Love,Drama,Web Comic,Slice of Life,Full Color"],"nutshell":""},{"name":" Aya no Kisetsu","avatar":"https://mangadex.org/covers/1219453e-97c9-4060-8cb8-d921c8e8d337/03d0e041-075c-4e96-a620-2a618fe5b00c.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Slice of Life"],"nutshell":"Aya Kisaragi is a culinary consultant in the Food Project society. She has to help restaurants, with a young man called Komai Ippei."},{"name":" Higurashi no Naku Koro ni Kizuna","avatar":"https://mangadex.org/covers/121d9ed5-96ff-4fcf-aa26-bc559b0bbbc7/b42818bf-3c31-4351-b24a-dcfe917fcc53.png.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Psychological,Drama,Horror,Supernatural,Mystery"],"nutshell":"An answer to Onisarashi-hen adaptated from the DS-only Kageboushi-hen arc, through the eyes of the policewoman Tomoe Minai.\n[Vol.1]\nTomoe Minai, a detective working at the Kakiuchi Police Department,learns about the superstitions in Hinamizawa, where Natsumi Kimiyoshi has recently moved from. When the two meet, the curtain rises on a new story!\nThe original Nintendo DS game \"Higurashi No Naku Koro Ni Kizuna\" is now available in manga!\n[Vol.2]\nTomoe Minai and Natsumi Kimiyoshi meet by chance in town.\nTheir destinies are linked through \"Oyashiro-sama's Curse\"!\nThe adaptation of the original DS game \"Higurashi no Naku Koro ni Kizuna\" is finallly complete!"},{"name":" Sore ga Kanojo no Seigi nara","avatar":"https://mangadex.org/covers/12215c4d-c539-4d47-84f0-df2cc2b96f78/1d385a4b-7835-4d68-962e-d2e31a26b29a.jpg.256.jpg","country":"Japanese","stat":"7.58","status":"Completed","tags":["Romance,Comedy,Harem,School Life"],"nutshell":"After his happy-go-lucky lovestruck parents suddenly decide to go on an amorous traveling adventure, Yuki is shuffled off to live with one of his dad's old friends. He knows very little about his new living circumstances, save that his dad's friend is an author with three children.\nSomething seems a little off about the girl who's sent to meet him, the fidgety and overly anxious Aya, but he doesn't fully understand what's going on until he arrives at the house. Yuki, who has had very little to do with women thus far in his life, is now set to live in a house with four of them. The head of the house is actually an author of erotic novels, and she habitually forces her three daughters into embarrassing sexual situations. How will Yuki cope with his new life?"},{"name":" Psychometrer","avatar":"https://mangadex.org/covers/122330aa-9663-498b-b146-4313cde474ac/03875ac3-abf6-43cc-be1b-803b30fbe6c6.jpg.256.jpg","country":"Japanese","stat":"8.06","status":"Hiatus","tags":["Sci-Fi,Action,Comedy,Drama,Mystery"],"nutshell":"Asuma Eiji has the gift of psychometric power, meaning he can touch people or objects and see their history in images and words. Most of the time, Eiji is just a delinquent high school kid who hangs out with his friends and neglects his schoolwork. However, his psychic abilities have brought him to the attention of police inspector Shima Ryoko, who often calls him in to help out with difficult cases."}]