[{"name":" Tulong Mountain","avatar":"https://mangadex.org/covers/3674519a-eb19-401e-8e4b-db0eec5d65db/b7516f29-aee9-41a1-8207-23a700ae70c9.png.256.jpg","country":"Korean","stat":"8.07","status":"Completed","tags":["Historical,Action,Long Strip,Comedy,Martial Arts,Adventure,Drama,Fantasy,Web Comic,Supernatural,Full Color"],"nutshell":"Iryong can become a dragon after thousands of years of cultivation in the mortal world, replacing the gods to govern the heaven and the earth. But now it has been reduced to livestock that can be slaughtered and used in medicine. The Quan family clan has cultivated and slaughtered Iryong for generations. The youngest daughter, Quan Sanfu, accidentally met a wild Iryong in the woods, and thus started a tale of hostility between races..."},{"name":" Haru wo Daiteita","avatar":"https://mangadex.org/covers/3682c8c9-334c-41dd-80ab-606ef8050d60/bca07a9e-d647-44c9-baa1-e701133ae3aa.jpg.256.jpg","country":"Japanese","stat":"8.24","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama,Slice of Life"],"nutshell":"Iwaki Kyousuke and Katou Yoji are two hugely popular adult film stars looking for a way out of the industry. Their chance arrives when they're both invited to audition for a new erotic film. Imagine their surprise when the director decides the only way for him to choose who will get the coveted lead role is for them to perform one of the film's love scenes on the spot—with each other! Things get even crazier when Katou decides to take drastic measures to ensure he can continue seeing Iwaki after film production wraps. How will Iwaki respond to Katou's impulsive act?"},{"name":" Moon Edge","avatar":"https://mangadex.org/covers/368516b3-4226-45cb-bdf2-312ddcfec518/3619583d-a4b3-46b3-8896-60d8f50dc882.jpg.256.jpg","country":"Japanese","stat":"8.00","status":"Completed","tags":["Sci-Fi,Action,Mystery"],"nutshell":"In a ruined city, Takeru comes across a suicidal young girl named Konoha. She's deathless, and she's being used as a guinea pig by a cruel organization. Seeing no meaning to her life, she fled her captors to seek a way to end it. Takeru has a lot in common with Konoha– he's also deathless. He's made a life for himself, though, locating people by contract. After he rescues her from her pursuers, he convinces her to continue living. Maybe she'll be able to find a purpose, as she and Takeru face the future together."},{"name":" A Junior Trying to Sleep With His Senior","avatar":"https://mangadex.org/covers/368606f2-63bf-404b-8ef3-d1e170d648c9/745f7f33-4fc5-4817-b786-7075bf54faf2.jpg.256.jpg","country":"Japanese","stat":"7.03","status":"Completed","tags":["Oneshot,Comedy,Web Comic"],"nutshell":""},{"name":" Mr. Fu's Favorite","avatar":"https://mangadex.org/covers/368bb4e3-9e94-4792-888c-9f02e23d28e5/6b32db0b-fd77-4345-8fbc-a07aff1c291a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.72","status":"Completed","tags":["Long Strip,Romance,Drama,Web Comic"],"nutshell":"Shen Wei Lan died for deeply loving Fu Su Mian in her last life. Now she born again and swore that she would stay far away from him! But why?! She racks her brains to stay far away from him, but he who hates her in the last life becomes strongly possessive! He claims arbitrarily, \"You are mine forever! You have no where to go!\""},{"name":" Otome Senshi Lovely 5!","avatar":"https://mangadex.org/covers/368c75f8-e513-418e-b5f0-4fd55aa049a5/82f55038-a5d4-41b1-8a2e-21de156e8810.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Comedy,Girls' Love,School Life"],"nutshell":"Ogdoas Private Academy…\nUnder the new, young headmistress, freedom, independence and self-fulfillment are the motto of this mission school. However, among the nuns there those who are concerned about order and morals within the school and who oppose the head-mistress's ideas.\nAnd without anyone knowing, right now, at this school… a battle between good and evil is about to take place!\nA continuation to Shion and Nashida-sensei's story called \"Teacher's Pet\" can be found in here."},{"name":" Love Live! - A piano playing cat (Doujinshi)","avatar":"https://mangadex.org/covers/369903b9-6fec-4cfe-89c4-19dd2d1152b0/5a0b5e54-e039-4319-8bd7-7fae2de74006.jpg.256.jpg","country":"Japanese","stat":"8.12","status":"Completed","tags":["Romance,Girls' Love"],"nutshell":"In which animal people exist but they're really pretty much just people with animal ears yet they're still considered below humans so it's kinda racist and also borderline slavery but it's cute so it's ok.\n{ Nico x Maki }"},{"name":" Melty Blood","avatar":"https://mangadex.org/covers/36999805-52e9-451f-94de-ca50e8e7e873/d3149811-5b17-4256-8cde-94b31e99e8ca.jpg.256.jpg","country":"Japanese","stat":"7.77","status":"Completed","tags":["Action,Romance,Comedy,Magic,Fantasy,Vampires,Supernatural,Adaptation"],"nutshell":"Based on the Doujin Fighting game, Melty Blood, made by the Doujin group, Watanabe Seisakujyo (now known as French Bread). This story is one of two side-story sequels occurring approximately a year after the 'good-ending' story of Arcueid from the original Type-Moon game, Tsukihime.\nOne year has passed since the 'Serial Vampire Homicide case' was solved by the deaths of Nero (Nrvnqsr) Chaos and Roa/SHIKI Tohno. But now the rumors of serial murders are happening again. And so, once again, Shiki Tohno patrols the city to find this phantom killer. On patrol he meets–and fights–a mysterious woman named Sion Eltnam Atlasia; member of the church group 'Alchemist of Atlas', who seek to cure vampirism. But to do so she needs data from Arcueid, the last True Ancestor, to help her in her research. But this won't be easy: Ciel is also patrolling the city looking for the rumored killer, while Akiha has been acting strangely the past few days. Also, Arcueid hasn't been seen for awhile–could she be the killer…?"},{"name":" Chie-sensei wa Mienai","avatar":"https://mangadex.org/covers/36a8548c-64ba-409b-9419-e45b6f125b69/a778f48b-befd-4d32-a8e1-db19747c37db.jpg.256.jpg","country":"Japanese","stat":"7.93","status":"Completed","tags":["Oneshot,Ghosts,Crime,School Life,Horror,Supernatural"],"nutshell":"Chie-sensei works at a certain kindergarten. She enjoys taking care of her class, but one thing is bothering her: her kindergarteners see something that she herself cannot..."},{"name":" Old Swordsman and Kid","avatar":"https://mangadex.org/covers/36b436a6-081f-4d7c-8ad3-9cbdd3b7704d/9666fa97-1b68-456f-b09d-659d4971fd58.png.256.jpg","country":"Japanese","stat":"8.46","status":"Completed","tags":["Oneshot,Comedy,Mecha,Web Comic,Slice of Life"],"nutshell":""},{"name":" Six Sex","avatar":"https://mangadex.org/covers/36b9a209-41c2-4a05-a100-62e8d80f750e/a86ac65a-7555-489f-8595-87ed29e9fbea.jpg.256.jpg","country":"Japanese","stat":"7.81","status":"Completed","tags":["Boys' Love,Drama"],"nutshell":"Saotome group's heir Chihiro was abducted by the Russian mafia and for two years he was \"trained\" in a prostitution ring. After his two bodyguards were finally able to rescue him, Chihiro came back to Japan and took over his dead father's place as the head of the Saotome group. Trouble is however brewing underneath the calm…"},{"name":" Tonight's Menu: Magical Beasts!","avatar":"https://mangadex.org/covers/36b9f44c-8be1-4f08-9de0-65e22c837a98/3fd0b949-c983-48ce-a5ad-821c50f2661b.png.256.jpg","country":"Chinese (Simplified)","stat":"8.05","status":"Completed","tags":["Long Strip,Comedy,Adventure,Fantasy,Cooking"],"nutshell":"Food is the best thing in the world. It can let someone feel indescribably wonderful~ The genius Mo Bai once thought that he stood at the peak of the culinary world. However, since his encounter with that person…it opened up a door to a whole new world for him!"},{"name":" Tama Hiyori","avatar":"https://mangadex.org/covers/36c22396-788b-418b-a18f-7c04f1d59dae/8a8d7941-2be9-401a-9615-24166e6e5261.jpg.256.jpg","country":"Japanese","stat":"7.23","status":"Completed","tags":["Romance,Comedy,Harem,School Life"],"nutshell":"As a boy, Taishi saved a tiny chick (as in an actual bird) that was being bullied by its brothers and sisters. And now it’s grown up into a hot girl who wants to cater to his every whim! Did we mention she lays eggs, too?"},{"name":" Dorei Yuugi Didi","avatar":"https://mangadex.org/covers/36c7cc1d-96cf-4e70-93e5-b36b1f9da72c/53859500-f9bf-47e7-96eb-27885a747aad.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Thriller,Action,Video Games,Drama,Horror,Mystery"],"nutshell":"The clash of the strongest vs. the strongest slaves, the future when the bell rang for an invitation to a further hell—Roku, a young man who leads a boring life, is challenged to a little game by Ebe, a millionaire he met at his part-time job. Unaware that this has opened a door to a disgusting world of corruption... a new slave game heads towards another dimension! Play with people, with life, with everything in the world filled with depravity!"},{"name":" External Fairy","avatar":"https://mangadex.org/covers/36c7f138-6144-43d3-8630-2e8bd8983fd9/1d2aabce-9f77-4748-9b51-f3b823e91f51.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.05","status":"Completed","tags":["Action,Martial Arts,Adventure,Fantasy"],"nutshell":"The strongest spirit in the world of cultivation, not to play the fire and gunpowder, and then… the catastrophe is coming."},{"name":" Jiro Tsunoda Masterpiece Selection - Song of Women, The Sad Woman Dances","avatar":"https://mangadex.org/covers/36ce5490-3ae4-49c1-a1a1-c5305c4f283d/59a54ec1-dbb7-42fe-bbb0-68a64d6edb3f.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Thriller,Psychological,Romance,Anthology,Crime,Sports,Office Workers,Philosophical,Drama,Slice of Life,Mystery,Tragedy"],"nutshell":"(from ebookjapan):\nRosita Hill, a flamenco dancer from Shinjuku, was a woman who devoted her entire life to flamenco. Day after day, night after night, flamenco was the only thing on her mind and in her heart.\nPeople around her felt a certain danger. And it became a reality. This is a unique work that philosophically depicts what happens to people who are cornered and driven, using a flamenco dancer as its subject.\nIn addition, Jiro Tsunoda depicts women wandering in the city of love. This is the fourth in a series of masterpieces that showcases a side of the manga artist that is not limited to occult manga."},{"name":" Touhou - Kanjou no Hitorijime (Doujinshi)","avatar":"https://mangadex.org/covers/36cf299a-0e82-4ac2-a5c1-f83cefe9d05c/498a1d3a-058d-4773-86a3-742ecd94f868.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Oneshot"],"nutshell":"A Seiga x Yoshika doujinshi."},{"name":" Happy Yarou Wedding","avatar":"https://mangadex.org/covers/36d7e500-a965-41f3-b0c5-5d3865f644e6/683f8c00-3c7e-4e36-97a8-b2d648ec04d5.jpg.256.jpg","country":"Japanese","stat":"7.87","status":"Completed","tags":["Romance,Comedy,Boys' Love,Drama"],"nutshell":"\"I'm Tsuzaki Yuuhi. For some reason, I am working as housekeeper for Professor Toudou Akira… even though he has a son, I… am in love?!\""},{"name":" Nagisa - Kohno Bessochi Short Stories","avatar":"https://mangadex.org/covers/36daa147-900c-4fe2-9cc6-a46872762675/d9881bb5-2bb2-46e4-9a15-75dc58f84e0f.jpg.256.jpg","country":"Japanese","stat":"7.96","status":"Completed","tags":["Sci-Fi,Anthology,Drama,Fantasy"],"nutshell":"Collection of works published by the author in Omocoro and doujinshi.\n\nSmart Assistant\nNama Mizu\nShun/Jun\n4-9+1) Nagisa"},{"name":" Hakumen Yasha","avatar":"https://mangadex.org/covers/36db2ffc-2f1b-4703-9d84-33bfe5f3cd8f/77a0c6ba-3567-4767-9868-8fb42b361efc.png.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Historical,Action,Samurai,Drama,Full Color"],"nutshell":"Tsuge's debut work based on the Shourui Awaremi no Rei, an edict which existed in the early days of the Edo period during the reign of shogun Tokugawa Tsunayoshi. It depicts the exploits of a mysterious messenger, Hakumen Yasha, who saves people suffering due to the evil law."},{"name":" Wing","avatar":"https://mangadex.org/covers/36dced03-42b2-4a93-b276-d70f8f12fa1b/e0a5c8d1-bfa6-4b42-b4aa-77b419852611.jpg.256.jpg","country":"Korean","stat":"7.97","status":"Completed","tags":["Romance,Adventure,School Life,Fantasy"],"nutshell":"An energetic, cheery high school girl named Garam was having a peaceful(?) school life until she runs into a cute boy name Lime. Trouble started as Lime and his best friend, Yuyi moves to her school and monsters start showing up and she's the only one around who can see it. What's more, Lime happens to be a prince from another world who came to this world to find his missing bride who he doesn't even know the face of. As time passes, Lime starts to feel weird around Garam…\n…And Garam feels the same except that it wasn't toward Lime but to Yuyi…\nIt starts as a normal school life story, but it turns to a fantasy from the late middle."},{"name":" Project Dummy","avatar":"https://mangadex.org/covers/36df8695-a176-4c8a-8259-e355822b0cea/7782dfc4-e1dc-4987-a9bc-b9d751f85d64.png.256.jpg","country":"Korean","stat":"7.98","status":"Completed","tags":["Sci-Fi,Action,Long Strip,Comedy,Adventure,Military,School Life,Fantasy,Web Comic,Full Color"],"nutshell":"In a world at war, the mechanical war is intensifying due to the denuclearization treaty. The Norman Republic begins a secret project. A dummy of new mechanics development project for war."},{"name":" Peerless Martial Spirit (Reboot)","avatar":"https://mangadex.org/covers/36e01733-448f-4f06-b5e4-8acba673825c/2dde2671-f1d6-4bc2-9999-16c1c7e5253a.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.98","status":"Ongoing","tags":["Historical,Action,Romance,Adventure,Drama,Fantasy,Supernatural,Full Color"],"nutshell":"The Dragon Pulse Continent (or “Longmai” Continent) is home to millions of clans, countless sects and martial artists. Strong people have the ability to manoeuvre the land, whilst the weak can only crawl like ants. A young man, Chen Feng, with a core like iron, was unable to cultivate and was treated by cold eyes. But then he found the divine Dragon’s Blood and a mysterious ancient cauldron, and from then on he rose against the odds and emerged into the eyes of the world! Beautiful demon foxes, cold and highly empresses, demon clan princesses and divine clan princesses will all be in my arms. I will cultivate the supreme inheritance, condense the strongest martial soul, embrace all beauties, and stand proudly high up above the clouds."},{"name":" The Story of My Youth ","avatar":"https://mangadex.org/covers/36e0e538-d01d-4fc8-b254-d9d2cc328ff1/e719f37c-e7a8-4301-a57f-fd7ff3753f43.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Completed","tags":["Oneshot,Romance,Sports,School Life,Web Comic,Slice of Life"],"nutshell":"Once your chance is lost, you'll never get it back.\nAuthor's Twitter: https://twitter.com/SHIROMANTA1020\nAuthor's Pixiv: https://www.pixiv.net/en/users/10509347"},{"name":" Sis - Himitsu no Koikogokoro","avatar":"https://mangadex.org/covers/36e4abc6-af49-43ee-a668-57d46d2895f4/d6ecacff-fd04-46db-951a-b56545de7959.jpg.256.jpg","country":"Japanese","stat":"7.86","status":"Completed","tags":["Romance,Anthology,Girls' Love"],"nutshell":"Anthology of oneshots published in Sis - Secret Love's Kobunsha magazine.\nChapters:\n\nKagefumioni (かげふみおに) by Izumiya Otoha\nMagic of the Kiss (Kisu no Mahou, キスの魔法) by Usaki Hitomi\nFukigen na Fotojenikku (フキゲンなフォトジェニック) by Natsume\nIn Sickness (Yameru Toki mo, やめるときも) by Shii Hirome\nAkanesasu Murasaki no Yuki (あかねさす紫のゆき) by Chitose Asahi\nInappropriate Girlfriend (Futekisetsu na Kanojo, 不適切な彼女) by Enari Ichiko\nBroken Doll by Kazuki Ryou\n*Megane Yuru Fuwa Sonna Konna (メガネトユルフワノソンナコンナ) by Iwami Shouko\n\nColumns:\n\nMorishima Akiko\nHakadama Mera\nMinakami Kaori\nAkiduki Wataru"},{"name":" You Boys Love These Sorts of Things, Right?","avatar":"https://mangadex.org/covers/36e53361-8995-4f76-9117-a24c3ca08931/f097869d-9fe2-4325-b98e-fa2af7ffd9b8.jpg.256.jpg","country":"Japanese","stat":"8.43","status":"Completed","tags":["Oneshot,Romance,Comedy,Web Comic"],"nutshell":""},{"name":" Lolicon Phoenix","avatar":"https://mangadex.org/covers/36e8d256-21e2-451d-8b04-5888c7e4ee6c/d6561446-9863-4e62-b0e4-0eedc55f5cd3.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Loli,Comedy"],"nutshell":"Times continue to grow worse as criminals go after little girls. The police are always too late or keep losing their target. Who will protect the happiness of little girls?! A half-naked, bird mask wearing, NEET, lolicon will. An ally of justice! A phoenix that will protect the little girls from perverts, molesters and degenerates that lurk the neighborhood!"},{"name":" Majo to Hatsukoi","avatar":"https://mangadex.org/covers/36ee2d10-46da-4ca1-b9e2-c0fd6c951af1/65dd1801-4859-49e9-b3c2-d3ce6b64f1f0.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Romance,Comedy,School Life,Fantasy"],"nutshell":"Seira Murahoshi, a 16-year-old girl, can see the auras of people. Because of that, everyone calls her a witch. One day, as she is walking to school with her only best friend, Mika, she meets a boy shining with a golden aura who rudely asks her if she is the \"Witch of Himesaki\", even after he breaks her sunglasses!"},{"name":" Tennis no Oujisama - Slide (Doujinshi)","avatar":"https://mangadex.org/covers/36eeac92-5ba2-4db3-89d5-a0d947d96ce3/c8539089-7dee-4cbf-b7fa-b835f43e17b7.jpg.256.jpg","country":"Japanese","stat":"7.97","status":"Completed","tags":["Boys' Love"],"nutshell":"Pairing: Fuji x Tezuka"},{"name":" One King, Nine Attackers, Twelve Wives","avatar":"https://mangadex.org/covers/36f229b7-11e0-4767-8d65-f620f1786079/f9263cf8-4785-4de8-8311-dc64d34eb0e2.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.73","status":"Ongoing","tags":["Ghosts,Comedy,Boys' Love,Fantasy"],"nutshell":"When a new emperor takes office, a ghost takes a wife; this has been the age-old principle. But nowadays the court is monogamous, and with 9 ghosts for 12 wives, there are too many potential wife candidates. Not to mention the ghosts who do not want to ascend to be palace masters, this is why all the past ghostly brides have fought for their husbands.\nThis year's new emperor is even more so misguided with his drunken behaviour. With one thing leading to another, the new emperor accidentally drinks too much and finds that all the ghostly brides were written as men. This might just be a million years worth of bad luck…"},{"name":" Kyoaku Gakuen","avatar":"https://mangadex.org/covers/370aa750-474f-4832-a877-147fe71890bb/a488a67d-c0cb-4283-ae71-dd2e0e92c5a8.jpg.256.jpg","country":"Japanese","stat":"8.16","status":"Ongoing","tags":["Comedy,School Life"],"nutshell":"Shadow hand that spreads depravity around the world, we call them archvillains! Global crisis, religious conflict, territorial dispute, suppression of information, ero-manga regulations… They are at the root of every major social problem(probably)! This is a story about a dreadful institution, \"School of Supreme Evil\" that raises archvillains and a secret police investigator who infiltrated it."},{"name":" Orange x Dreamin' Sun","avatar":"https://mangadex.org/covers/370d916c-6938-43bd-84da-1a3c5b031df6/ab4d6d76-b233-4628-8c0b-ea23e0abb084.jpg.256.jpg","country":"Japanese","stat":"8.15","status":"Completed","tags":["Romance,Comedy,School Life,Slice of Life"],"nutshell":"A series of 10 episodes from the Orange x Dreamin' Sun crossover that Takano-sensei published on her social media accounts.\nTwitter (JP): @manga_ichigo_t\nTwitter (EN): @ichigo_takano\nInstagram (JP): @ichigotakano111"}]