[{"name":" The metaverse is made out of magic","avatar":"https://mangadex.org/covers/69c202cb-d6df-465e-af2a-451ed1ccf992/a155b7cd-a9f0-41b4-8068-47c4d6e85e4e.jpg.256.jpg","country":"English","stat":"7.34","status":"Completed","tags":["Oneshot,Sci-Fi,Action,Romance,Adventure,Virtual Reality,Fantasy"],"nutshell":"A guy is kicked forced to go out of the metaverse into the ruined world, where he quickly learns about magic and the truth of the metaverse. If you like fate, a certain magical index or shakugan no shana and your willing to put up with bad art, you'll like this oneshot."},{"name":" Sweet 16","avatar":"https://mangadex.org/covers/69c40065-df1d-46ec-a2e4-c2c43df66947/57c39aeb-eafa-4d32-85da-35d0c8e10803.jpg.256.jpg","country":"Japanese","stat":"8.01","status":"Completed","tags":["Romance,Comedy,School Life"],"nutshell":"Collection of oneshots\n\n\nSweet 16\nKataoka Nanami had made a promise with her childhood friend Eiji that once she celebrates her sweet sixteen, they are to marry. However, nowadays Eiji only seems to be interested in surfing and has forgotten all about the promise. Will Nanami be able to revive her childhood promise?\n\n\nKira Kira Frozen\nNakazato An has always loved ice skating since she was young and dreams about becoming a professional. But when it comes to being accepted into a school in America and leaving her boyfriend Ya-chan behind, how will An be able to handle this situation?\n\n\nHarumachi Platform\nIt's spring, which means a new school, new semester, and new challenges for high school student Riko Kurosawa, who is not looking forward to this troublesome period of time. That is, until one day, a boy hands her a \"magical\" train ticket, and suddenly, Riko's mornings are a lot brighter. And at the center of it all is the boy who shares her train rides…\n\n\nItoshii Anata e\nChiharu writes letters to her sensei, Akiyama, who never returns her feelings. But after one day when Akiyama tells her he has a beloved, he accepts her letter…?\n\n\nTotteoki no Uta\nHYBRID is a newly formed band that hit the charts really high because of their lead singer, Aki. Yuri's been friends with Aki since they were kids, and, obviously, she's grown feelings for him. With Aki's band hitting it high, and getting really popular, is Yuri REALLY happy about all this?"},{"name":" Lovely Bokhee-ssi","avatar":"https://mangadex.org/covers/69c8f5c9-f95b-41df-bb5b-343400bedf38/a188f8da-24a7-4b10-9b40-956858d6fd38.jpg.256.jpg","country":"Korean","stat":"7.55","status":"Completed","tags":["Long Strip,Romance,Comedy,Drama,Web Comic,Full Color"],"nutshell":"Will this love come true some day? Exiting their awkward one-sided loves.\n\nOriginal Webtoon (kakao)"},{"name":" Shinyuu no Mikami-kun","avatar":"https://mangadex.org/covers/69d34251-7901-4677-a11b-2670d3ebfa51/afd0935b-3a20-47c9-98a2-d8845b4b9e74.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Oneshot,Romance,School Life"],"nutshell":"Introvert Umi Youko has just entered high school, and has been having trouble in making friends. There is one person though, whom she is very close to - Mikami-kun. But Youko slowly starts to feel that she's simply troubling Mikami-kun too much by always relying on him, so what happens when she tries to ask someone else to lunch instead…?"},{"name":" Yoroizuka-san wo Baburasetai","avatar":"https://mangadex.org/covers/69d9d31d-a435-4f5d-8fbb-3ab93fab16f9/c5a0e811-598f-474f-b1d0-91cdc13770f3.jpg.256.jpg","country":"Japanese","stat":"8.13","status":"Ongoing","tags":["Romance,Comedy,Office Workers,Girls' Love"],"nutshell":"Kurumi is a shy and easily embarrassed high school girl with a strong imagination. Her girlfriend is a cool, iron-faced office worker, Ms. Yoroizuka, who doesn't show much emotion. In order to get the older woman to indulge in her, Kurumi tries all sorts of things to spoil Ms. Yoroizuka, but...?"},{"name":" Tora to Ookami","avatar":"https://mangadex.org/covers/69de29f9-d88c-45c4-91b3-33943a66db63/c41ff163-4b71-412a-bfed-3bf671bf61f9.jpg.256.jpg","country":"Japanese","stat":"8.07","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Cooking"],"nutshell":"Mii is a BL (Boys Love) fanatic who helps her grandmother run a family restaurant. Her monotonous life is turned around when two beautiful college boys come to eat! One is the kind Tora, and the other is the snotty Ookami, who refuses to eat the restaurant's food. More than boy troubles, Mii needs to save the restaurant from corporate big-shots who want to renovate the area! And what role will the boys play in this?!"},{"name":" First Rate Master","avatar":"https://mangadex.org/covers/69de8c01-d627-4e28-9691-40effef12006/a3de95f5-c53c-457c-9618-e2be7eb7af4f.png.256.jpg","country":"Chinese (Simplified)","stat":"6.90","status":"Hiatus","tags":["Action,Long Strip,Comedy,Martial Arts,Adventure,Web Comic,Full Color"],"nutshell":"He has no special skills, but he mastered kung fu. The martial arts master, Duan Yun, came to a city, and then beat up rich people and punishes gangsters. He also gives his affection to a high quality girl, a hot feisty cop, and cold business woman…\nSeason 1: 94 chapters\nSeason 2: TBC"},{"name":" Woof Wolf","avatar":"https://mangadex.org/covers/69e4c4f4-7700-4cdd-bcd6-d08eb927fad5/c11af773-ec40-45aa-a620-1879377efd3f.png.256.jpg","country":"Korean","stat":"8.16","status":"Ongoing","tags":["Long Strip,Comedy,Boys' Love,Fantasy,Web Comic,Full Color"],"nutshell":"The bite may be worse than the bark in the case of Minwoo. What happens when fellow student Jaemin stumbles upon his secret?\nWinning Contest Entry on Bomtoon~ Has now been serialized!\n(Rose Squad Scans)\n—\nAt the gathering of the new semester, Minwoo quickly escaped the party as soon as he heard the news that the full moon had risen.\nBut at the same time, Jaemin who’d come out for a smoke, sees a big dog appearing from an alley where he’d previously heard Minwoo’s voice..!\n(mongmongie club)"},{"name":" Wasureyuki","avatar":"https://mangadex.org/covers/69e7f0e4-b43a-410f-b8a3-e36f69510ad4/84bb6a88-72ac-4da9-a14c-e55695da4e07.jpg.256.jpg","country":"Japanese","stat":"8.10","status":"Completed","tags":["Oneshot,Drama,School Life"],"nutshell":"Tomo has always been stuck with the dependent Miyako ever since she was born. For half of his life, he had been forced to look out for her due to her clumsiness and unreliability. Simply put, he 'hates' her. But there is something that completely prevents him from telling her his real feelings. When she is about to move to the United States, will he be able to love and let go, all before it's too late? A lovely, touching story about a boy and the one most important to him."},{"name":" Masaki no Pan","avatar":"https://mangadex.org/covers/69ed0239-89da-47ab-9188-4d69b5257c08/c4a83271-77e1-4787-9ced-6705f675660c.jpg.256.jpg","country":"Japanese","stat":"8.08","status":"Completed","tags":["Romance,Comedy,Drama,Slice of Life,Cooking"],"nutshell":"Having lost his confidence as a bread-maker, Masaki works making bread in a bakery and boarding house run by a pair of sisters in Otaru, Hokkaido. Seeing the smiles on the people eating the bread, he grows to maturity one step at a time as a maker of breads. [Translation from the back cover of the first volume]"},{"name":" On Doorstep","avatar":"https://mangadex.org/covers/69f09195-6e2a-474e-bb22-a064dcb9ad34/f254970e-1b7e-4874-98c1-197dcf3b4d1e.jpg.256.jpg","country":"Japanese","stat":"8.55","status":"Completed","tags":["Romance,Boys' Love,Drama,Slice of Life"],"nutshell":"Pickpocket Jimmy is captured by the middle-aged Reese at the scene of the crime. In revenge, Jimmy breaks into Reese’s home when he is out, but he finds out that Reese is an ex-cop who furthermore is suffering from PTSD. Curious about this adult man with his complicated past, the closer he gets to him, the more rapidly his feelings change to love…\nIn addition to the passion-filled extras for the title story, there is a one-shot of a prideful performing arts agent x a washed-up middle-aged actor, “Lucky Bill.” This is a volume full of the real lives of adult men."},{"name":" Love Live! - 24 hours (Doujinshi)","avatar":"https://mangadex.org/covers/69fec495-fe56-43fb-9580-4b4f182eed6f/f8a84d66-63c9-4c83-b85b-00a41909529c.jpg.256.jpg","country":"Japanese","stat":"7.94","status":"Completed","tags":["Slice of Life"],"nutshell":"In which we see 24 hours of NozoEli's idyllic lifestyle.\nHappy birthday Elichika!\n{ Nozomi x Eli }\n Artist’s Pixiv\n Artist’s Twitter"},{"name":" Graffiti","avatar":"https://mangadex.org/covers/6a03c18c-f205-4d35-b0f6-f8e41a9ce7ef/ca225e6c-2dd5-43aa-9ffb-704013fa026a.jpg.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":["Oneshot"],"nutshell":"この間見た夢が星新一みたいでよかったので漫画にしました"},{"name":" Terra Formars Gaiden - Rain Hard","avatar":"https://mangadex.org/covers/6a06b758-cf79-44f2-9a94-722e3575b7a7/147df43a-be29-4656-bf46-c52bea626fbf.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Action,Drama"],"nutshell":""},{"name":" Scum's Wish","avatar":"https://mangadex.org/covers/6a06b979-0ada-44f2-b1ae-fceb70180af4/f4fef822-f9f8-4181-8b18-db5a5ccc27ce.png.256.jpg","country":"Japanese","stat":"7.43","status":"Completed","tags":["Romance,Comedy,Drama,School Life,Slice of Life"],"nutshell":"17-year-old Awaya Mugi and Yasuraoka Hanabi appear to be the ideal couple. They are both pretty popular, and they seem to suit each other well. However, outsiders don't know of the secret they share. Both Mugi and Hanabi have hopeless crushes on someone else, and they are only dating each other to soothe their loneliness. Mugi is in love with Minagawa Akane, a young teacher who used to be his home tutor. Hanabi is also in love with a teacher, a young man who has been a family friend since she was little. In each other, they find a place where they can grieve for the ones they cannot have, and they share a loneliness-driven physical intimacy. Will things stay like this for them forever?"},{"name":" Pretty Rhythm Rainbow Live - The one who loves Naru the most is... (Doujinshi)","avatar":"https://mangadex.org/covers/6a0ccf67-f930-4aa2-b095-c60dc4cd2451/e4dad70c-028a-41a4-8545-4bd80b384519.jpg.256.jpg","country":"Japanese","stat":"8.03","status":"Completed","tags":["Comedy"],"nutshell":"In which Bell and Hiro face off to win Naru's love.\n{ Hiro x Naru x Bell }\n Artist’s Pixiv\n Artist’s Twitter\n Alternate Twitter"},{"name":" Build King","avatar":"https://mangadex.org/covers/6a0d3c6e-a5d4-4f61-ae5c-fcff2a789145/c91d2cd5-2a4c-4438-aa0a-d6d3800a13cd.jpg.256.jpg","country":"Japanese","stat":"7.14","status":"Completed","tags":["Action,Adventure,Fantasy"],"nutshell":"Tonkachi and Renge live on mysterious Hammer Island, a place where no human should be able to survive. The two are carpenters who build houses for the island's inhabitants, but what are their special powers? And what are their dreams? Construction soon begins on this megabuild of a battle fantasy story!"},{"name":" Kyuuketsuki-san, Konyanoukazu wa Nandesu ka?","avatar":"https://mangadex.org/covers/6a103e0b-dd50-4f43-bd17-b36a36cfd2a8/8b38b187-1a5a-47ff-8082-b501a8a115dc.jpg.256.jpg","country":"Japanese","stat":"7.95","status":"Ongoing","tags":["Comedy,Girls' Love,Vampires"],"nutshell":"Story about, A Vampire, Yuri-shipper, and Side Dish for Dinner\nAuthor's Twitter"},{"name":" Brave","avatar":"https://mangadex.org/covers/6a111495-7ca1-4667-aac1-d9f515a90b87/b89db5ef-bfd9-4a4b-a019-20042a096ac4.jpg.256.jpg","country":"Chinese (Simplified)","stat":"8.02","status":"Ongoing","tags":["Action,Comedy,Adventure,Supernatural"],"nutshell":""},{"name":" Cross Roads","avatar":"https://mangadex.org/covers/6a1a511d-fe61-47e4-9a73-7fce0ca9fd6a/5d12db1e-03e6-429f-b7b4-f4892c3d3633.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Official Colored,Anthology,Office Workers,Slice of Life"],"nutshell":"A long-selling work serialized in a weekly comic magazine from 1990 to 1993. The first of a collection of 122 short stories that depicts the sadness and joy of the owners of famous and rare cars from all over the world, sometimes comically and sometimes seriously."},{"name":" 765Pro's Kitchen","avatar":"https://mangadex.org/covers/6a1dbd7a-22ca-4360-b132-efec898bb4dd/8c20f1f5-1cf2-454c-8c34-26ad818c5c8b.png.256.jpg","country":"Japanese","stat":"7.97","status":"Ongoing","tags":["Comedy,Web Comic,Slice of Life,Cooking"],"nutshell":"A story about THE iDOLM@STER's 765 Production idols taking it easy with some cooking."},{"name":" Nagomi Club","avatar":"https://mangadex.org/covers/6a1f72e3-a2bf-4716-9724-a9c12a5489f6/58ec4abe-7ded-4424-a651-1f442a5f4c82.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Ongoing","tags":["Slice of Life"],"nutshell":"Slice-of-life short stories about the men who work in an unconventional host club, and their customers.\nThe backup stories include a variety of shorts and 4-koma comics, many with the same characters in other settings."},{"name":" Zoku Manga Mitaina Koi Shitai","avatar":"https://mangadex.org/covers/6a1f81e8-3a82-4080-83fe-ee5e921b847b/051170b0-4fea-4abb-bb03-b0fd2c3ac407.jpg.256.jpg","country":"Japanese","stat":"8.05","status":"Completed","tags":[""],"nutshell":""},{"name":" Town of Evening Calm, Country of Cherry Blossoms","avatar":"https://mangadex.org/covers/6a200bd7-8391-407a-8c3c-49e215abc5a8/ec85d795-dbb1-4677-9566-8fa36583482b.jpg.256.jpg","country":"Japanese","stat":"8.41","status":"Completed","tags":["Award Winning,Historical,Drama,Slice of Life,Tragedy"],"nutshell":"Part 1: Hiroshima, 1955. Ten years after the city was consumed by a scorching flash of light, a woman's soul is still deeply shaken by the earth-shattering explosion that devastated her home and changed her life forever. A family from Hiroshima struggles to come to terms with their survival of the atomic bombing of their city. The protagonist is Minami Hirano, about 20 years of age.\nPart 2: Set some decades later, the niece of Minami Hirano is bewildered by her father's mysterious disappearances. She and a friend follow him to discover what he is doing.\nThe main theme of this historic manga concerns the question of what impact the war and the atomic bombing had on the most vulnerable. Fumiyo Kôno examines this question in her outstanding book - an award-winning, widely-discussed masterpiece.\n\n\nWon the Japan Media Arts Festival Grand Prize in 2004\nWon the Osamu Tezuka Creative Award in 2005"},{"name":" The Witch of 2-A","avatar":"https://mangadex.org/covers/6a2ce980-aa1e-4c93-bf88-a437af952d2f/dea624de-527d-40b7-b1b1-b25bfd9a7291.jpg.256.jpg","country":"Japanese","stat":"7.89","status":"Completed","tags":["Romance,Comedy,4-Koma,School Life,Fantasy"],"nutshell":"Fuka Nanase, a 14-year-old in the 8th grade, falls in love for the first time. But when her heart beats, she becomes a witch!?"},{"name":" Drag-On Dragoon - Utahime Five","avatar":"https://mangadex.org/covers/6a3181bb-27e0-464a-932b-5c32d59c91e5/812f7a2e-4021-4375-9f23-8e1433dd4aff.jpg.256.jpg","country":"Japanese","stat":"7.85","status":"Completed","tags":["Action,Adventure,Drama,Fantasy"],"nutshell":"Spinoff to Drag-on Dragoon 3 (localized as Drakengard). The story takes place when One and her sisters are children. They use their powers to try to be a band of wandering superheroes and their first case has the group help a mother search for her young daughter who went missing in Sand Country."},{"name":" Kaida-san's Ghost Stories","avatar":"https://mangadex.org/covers/6cc17472-1e96-455c-bf80-54c979f7002c/6c3793a4-424f-4b29-ae00-fbda6a20754d.png.256.jpg","country":"Japanese","stat":"7.98","status":"Completed","tags":[""],"nutshell":""},{"name":" A Sword's Evolution Begins From Killing","avatar":"https://mangadex.org/covers/6cc2e441-b61b-4178-b773-ce26da036f93/57f341b9-8095-4e5e-a6c0-a354e3c8dbb5.jpg.256.jpg","country":"Chinese (Simplified)","stat":"7.99","status":"Ongoing","tags":["Reincarnation,Monsters,Action,Long Strip,Martial Arts,Adventure,Drama,Fantasy,Supernatural,Full Color"],"nutshell":"Ye Fan was reborn as a strange sword with its own upgrade system. Ye Fan has been continuously upgraded through the killing experience of the sword masters of the past dynasties, and has become an evil sword that everyone in another world competes for. As soon as the evil sword was born, it would definitely set off a bloody storm, and Ye Fan also worked hard to get rid of the sword body and restore his human form as soon as possible…"},{"name":" Shingeki no Kyojin - Levi and Mikasa","avatar":"https://mangadex.org/covers/6cc6a02f-60de-4b1a-9789-f698da222495/c10bab97-216a-4380-90cc-d763ecd09f9b.jpg.256.jpg","country":"Japanese","stat":"7.82","status":"Ongoing","tags":["Romance,Survival,Military,Philosophical,Drama"],"nutshell":"Pairing: Levi x Mikasa\nЦикл історій про стосунки капітана Лівая та Мікаси від ebgr (pixiv ID 574765)."},{"name":" Pansy of Light","avatar":"https://mangadex.org/covers/6cc7f078-88c1-4748-b4b9-34db7472aa7c/23ce6b7d-504c-4656-b151-438094c369e8.jpg.256.jpg","country":"Japanese","stat":"7.99","status":"Completed","tags":["Historical,Romance,Drama"],"nutshell":"A zoologist, Mark, brought a child from Africa, a wild child who was raised by chimpanzees in the jungle and could say neither words nor her own name. Named Pansy, she is lovingly raised by Mark and his fiancée, Marlin, and gradually grows up to be a human girl as she spends time with Ed, a mysterious boy she meets in the garden. She promised Ed that she would be the best lady she could be, but she soon runs away from the school she entered... However, the old Earl of Hertford she meets on her escape is actually...."},{"name":" Death to the White Ferret!","avatar":"https://mangadex.org/covers/6cc84c31-3fa3-4d0c-83af-bb4b6a72f11b/ee67784d-253a-4489-bc4f-ea20de4da5ee.jpg.256.jpg","country":"Korean","stat":"8.01","status":"Ongoing","tags":["Long Strip,Romance,Fantasy,Web Comic,Adaptation,Full Color"],"nutshell":"\"I waited a thousand years. As a weasel.\"\nLeonie, the princess that destroyed a country, is given eternal punishment. Not as a human... but as a weasel! One day, after a thousand years of hiding in the forest, a boy who understands the words of a weasel appears! He even confessed to it being his first love! But Leonie, whose love cells had dried up...\n\"After a thousand years, I can finally die!\"\nI only intend to use this innocent boy! Chanjae, a hopeless devotee who fell in love with princess Leonie, a mage who became a weasel, as well as a figure he longed to meet from a history book he had read."},{"name":" Sayonara, Nanashi no Violin","avatar":"https://mangadex.org/covers/6cc960cd-b4ce-4ff0-9a0e-2cbad8c09a8d/a37e8a01-d83c-4b8c-86d0-279198d504b7.jpg.256.jpg","country":"Japanese","stat":"7.91","status":"Completed","tags":["Romance,Boys' Love,Fantasy,Supernatural,Music"],"nutshell":"In a world where objects with names become living creatures, a 2nd year college student named Sosuke breaks his violin. As a replacement, he ends up purchasing a 'named' violin that can transform into a human. The violin falls in love with Sosuke's playing, but no matter how much they practice, they can't get a decent sound! They'll have to figure out a solution to their problem..."}]